{"reviewerID": "A3UNITKTFPNT9W", "asin": "B000001OL6", "reviewerName": "J.F. Carroll \"the man from san dusky\"", "helpful": [2, 2], "reviewtext": "let's just get past all the bs, okay? they--as in maxell--should still be selling these. I record on them all the time and it's just so fng ridiculous that they could be discontinued, or be sold for fifty dollars. It's true, that no tape really sounds better than these, unless they were to start releasing metal tapes again, which is impossible in this market.I record lps onto these tapes, and listen to them in the car. It took me a long time to get the peaks right for recording, as in where I should average the peak decibels to record at. I eventually came to five plus, which means the bars never go above four decibels. I believe my peak levels are in line with the balance of sound, that while the directional booklet for my cassette player (a tck670 sony three-head) says record at plus three, letting it go a little bit above that but average at +3, means you're getting as much sound  without breaking your eardrums. They also say to record two decibels below the distortion point, and for me that's like 7+ on a lot of stuff[some records are louder or softer than others when it comes to decibels. For instance Prince sign O' the Times is very loud, and I record at around five+ or below, while the smiths queen is dead, the newly remastered version, is softer, and I record at a 7 recording level. Recording level is how much sound is filtered through the cassette player onto the recording medium, while the decibel count meter shows you how--scientifically that is--loud what you are recording really is].Now I'm not gonna' say it's always pretty, sometimes there's an album like let it bleed, where the lp was put together rather shoddily, and the acoustic tracks are subzero to the rockier tracks. In such cases I've tried to record each track at the peak individually, though I haven't really heard them enough yet to know if this works. I will say that listening to these on a car stereo, well, the car stereo is a lot more sensitive than floor-standers and a good sony receiver. You have to be accurate to get the best sounding tape, but the reward can be fantastic.You see, I used to listen to cds, like all through college, but then my ears started to turn negative to the extreme highs and mids. Plus, you never understand the music in your brain from a cd like you do on an lp. Basically I cannot barely stand to listen to digital unless I have extremely good speakers, and that's not often.So lps it is for me, but I wanted to hear them in my car, so began this whole trek to get the tapes to sound right. High bias is much more difficult to get right than normal bias, which if you listen through a good stereo, reveals all the definition of a rough sketch on paper. The high bias is pretty accurate, though someday I would wish to maybe improve the class of cassette player I have and see if I can't do even better? Oh well, right now I have a system and it works pretty well.And to think they're not putting cassette players into new cars anymore! I rather think the record industry would not be suffering now as it is, if it had kept true to fidelity and analogue, and most importantly vinyl, which cannot hardly be digitally downloaded without gutting the sound and a lot of work! It's what they get for years of $20 for new cds and the nightmare of sam goody. They wanted to profit by everyone buying their collections all over again, and look where it has got them! People listen to music--if at all--as a casual thing, where they never really listen and wouldn't spend a dime for the crap they do in fact hear. The labels killed their own business by choosing the cd over the lp.But at least I can find used lps for bargain prices now, eh?Or prohibitively expensive boxsets. ):", "overall": 4.0, "summary": "high bias tapes, who's got some more?", "unixReviewTime": 1328313600, "reviewTime": "02 4, 2012"}