{"reviewerID": "AD3EX5UG7UZPB", "asin": "B000001OL6", "reviewerName": "Marcos \"proletariat\"", "helpful": [5, 5], "reviewtext": "EDIT: Turns out there are a few companies out there that still make high end cassette tapes for recording. See the link from the commenter below, and also try musicians friend. Don't buy this aged overstock overpriced junk!We who still love the warm sound that only analog provides and are still die hard, DIY recorders using analog 4tracks are forced to pay ridiculous prices for OLD overstock hi-bias tapes from the 90s since the only brand name cassettes you can buy at a store like Walgreens is a 5 pack cheapo Maxell normal bias (even these are being hard to come by). This is the case with Amazon and eBay - all I can find are overpriced overstock still sealed high bias cassettes for five bucks each plus shipping - Neither TDK nor Maxell make Hi-Bias anymore so all we have is old leftover stock and these sellers exploit that fact. I'm not sure if the cassettes lose any of their quality after a certain amount of time (please comment if someone knows), but regardless, I don't recall paying these prices when they were new!I don't know if anyone manufactures new Hi-Bias tapes... if anyone knows, please comment... Anyway, this is very discouraging. A home made tape was a labor of love and a sound you cannot get from digital. I still am a die hard analog DIY recorder, and I use an 8 channel analog Tascam 4track, one of the best models of 4 tracks made, using Shure studio mics, and I often master to a CD burner, not a PC (depending on what I'm working with). The tracks only become mp3s when I rip the master CD into the computer. It has become increasingly harder to do this because of this. Now I use my 4track mostly to record solo recordings but I have used it to record full band demos and have been able to produce near professional quality recordings! Sublime's \"Robbin' in the Hood\" was recorded entirely on an analog 4track, as have others.Doubtful, but any sellers reading this? Your 10-15 year old overstock hi-bias tapes aren't gold, jerks.", "overall": 1.0, "summary": "Exploitative pricing", "unixReviewTime": 1325203200, "reviewTime": "12 30, 2011"}