{"reviewerID": "A2R6RA8FRBS608", "asin": "B000001OL6", "reviewerName": "Matthew G. Sherwin", "helpful": [31, 35], "reviewtext": "Maxell manufactures excellent \"Xlii high bias\" 90 minute cassette tapes for all purpose general recording. As long as you have the right kind of equipment, these tapes record the sounds of record albums, radio shows, CD-Rs, people talking and more. These tapes have 90 minutes worth of blank recording tapes on them so there are 45 blank minutes for recording on each side. Record lectures, music, conversations, piano playing and more--whatever you want! The tape playback will work well in any basic tape deck including the one in your car.The tapes are extremely well made in that they DO allow you hours upon hours of listening enjoyment because you can record over them many times; and they take up very little room so they're easy to carry around with you.If you pay the current Amazon price of $13.77 for the five-pack you spend roughly $2.75 per tape. Some people will find that to be too expensive while others will want these blank cassette tapes anyway, not minding having to pay the price.Unfortunately, these tapes still cannot produce 100% the same quality recording reproduction as a digitalized copy would give you. This means that if, hypothetically, you were to copy a CD-R onto another CD-R instead of a Maxell cassette tape, the quality of the sound on the CD-R copy would be at least somewhat sharper and clearer with less background noise than these Maxell cassette tapes will give you. Moreover, cassette tapes can break if not handled with care. They can also break if used a few too many times, too. Therefore, I recommend that any important recorded material should be copied onto another blank tape and then keep that second tape in a safe place to use as a backup. These shortcomings frustrate me and therefore I will have to take off one star to make this a four star review.The tapes have small pieces of plastic on the narrow top of each cassette which you can punch out easily so that accidental recording over an existing recording is impossible. If you do wish to record over an original recording then you can merely place a small amount of regular tape over the hole. The cassette tape is now ready to record a fresh recording. I also agree with the gentleman who suggests that you clean the heads of the tape deck before using these cassette tapes to maximize the quality of the recording.Overall, Maxell Xlii high bias cassette tapes makes a great choice when you want reliable cassette tapes to record music, the radio, people talking or anything you wish to record. I have used this brand for decades and I cannot think of any major complaints. I highly recommend Maxell normal bias 90 minute cassette tapes for you to use when you need to record something onto a tape.", "overall": 4.0, "summary": "fine high bias 90 minute cassette tape--with just a slight drawback or two", "unixReviewTime": 1209513600, "reviewTime": "04 30, 2008"}