{"reviewerID": "A4JHEO7H330AF", "asin": "B000001OL6", "reviewerName": "Tom Brody", "helpful": [4, 4], "reviewtext": "I have used Maxell XLII for over two decades.  I've used them on a Nakamichi 581 cassette deck, a Tandberg TCD320 cassette deck, and small hand-held recorders from Sony (with built-in microphone).I've used the Maxell XLII tapes for recording albums from vinyl, recording from compact discs, and recording live, e.g., parties, waterfalls, and my own electric-guitar playing using a Nakamichi microphone.When I first got my Nakamichi 581, I did a side-by-side test of an actual vinyl record, and my taped copy of the vinyl recording.  I was not able to tell the difference.  This demonstrates the high quality of the Maxell XLII tape.  The particular recording was a duet with Max Roach on drums and Anthony Braxton on saxophone.  This recording was an especial challenge to the tape's ability to record at higher frequencies.  The Maxell tape passed the test, so to speak.  Also, I recently listened to recordings that I made in the year 1980.  I have no reason to believe that the recordings on my Maxell tape have deteriorated.  This is another good thing about the Maxell XLII tape.I have nothing bad to say about the 90 minute Maxell XLII tape.But I do have bad things to say about tape recorders.  First of all, my Tandberg is a risky machine.  Perhaps, one time out of 100 times that I use the Tandberg, the tape gets tangled up.  I blame this on the Tandberg, not on the tape.  Another problem is that my Nakamichi 581 has been broken for many years, and I have not been able to find anybody who repairs this sort of machine.  The Nakamichi 581 was, and probably still is, the highest quality cassette deck known to mankind.  But I can't find anybody who can fix mine.  Again, this is not the fault of the tape.Finally, Sony had an excellent little hand-held cassette player/recorder, the TCM-454VK.  The sound quality of this machine is fine for recording nature sounds and children's music concerts.  However, I dropped this Sony machine, and it broke, and it is not manufactured anymore.  Instead, Sony does make a similar, newer model, but the sound quality of this Sony cassette recorder is garbage (please see my reviews of the newer Sony machine).  But this is not the fault of the tape. Sony TCM-200DV Standard Cassette Voice Recorder adds a high-pitched whining sound to your tapes.  A similar recorder, the Panasonic RQ-L31 Portable Cassette Recorder with Slide Microphone, adds a high-pitched chirping sound to your tapes.The following applies only to recording nature sounds, children's marching bands, and so on.  The following does not apply to making tape recordings from commercially available music on compact discs.Last year, I bought a digital voice recorder, the Olympus DS-40.  Please see my review of the Olympus DS-40.  The Olympus DS-40 is an absolute dream and a miracle  -- because of the very low background noise, because of the absence of clicking sounds when starting/stopping or when pausing/restarting recordings, because of the extreme length of recordability, and because of its extremely compact size.  Therefore, at least for amateur recordings of nature sounds, marching bands, and parties, cassette tapes and cassette recorders might no longer be medium of choice.", "overall": 5.0, "summary": "These tapes have been my friend from 1980 to 2009.", "unixReviewTime": 1263254400, "reviewTime": "01 12, 2010"}