{"reviewerID": "A2T049UQONS0OY", "asin": "B000001OM5", "reviewerName": "Larry VanDeSande", "helpful": [9, 11], "reviewtext": "I've used the maxell CD-340 cleaner in my car and home players (two of them -- one a recorder where I've cleaned its mirror too) for 10 years and they've never failed. These things don't do much; you stick it in, listen to some jingoism and a pleasing voice on the first track, then advance to the cleaning track and wait for 20 seconds while a continuous beep ensures you turn the volume way down. Afterward, your lens is clean. That's all there is to it.Why does the lens have to be cleaned? I can't answer that since I've never seen one. In the cassette era, I bought a clumsy plug-in electrical wand with a metal probe that I had to physically touch to my recording and playback heads (on reel-to-reel players too) to demagnitize them. Apparently all that tape going through left some kind of magnetic charge behind that would foul the signal at some point. It's questionable whether the gadget I owned ever actually worked, unlike this product, which works every time.There's no such issue with the digital CD lens cleaner. This disk has some encoded voice commands and about a dozen little brushes the protrude about 1/8 of an inch from the surface of the disk. I guess the disk spins and the brushes rub off the bad stuff from the CD lens. If there's another explanation, I'd like to hear it. It works every time.Unfortunately, the thing this product won't do is eliminate age from cranky car CD players. I've owned a couple GM models where the player had to be replaced and the player in my 2006 Chevy Malibu is becoming increasingly wearisome. It has a habit of failing to play disks that are thicker than the norm. You'd think there would be a standard in the digital industry but there is not. Sometime spinning my maxell CD-340 arrests this behavior but typically it does not. I usually have to burn myself a homemade disk on a maxell CD-R blank disk Maxell 32x CD-R For Music - 30 Spindle to get the recalcitrant player to spin the music.As for the cleaner, it works in spades every time. Buy with confidence for that purpose.", "overall": 5.0, "summary": "A CD cleaner but, unfortunately, not its savior", "unixReviewTime": 1277078400, "reviewTime": "06 21, 2010"}