{"reviewerID": "ABVYGB2TKBO8F", "asin": "B00000DM9W", "reviewerName": "J. Donaldson \"Cal-diver\"", "helpful": [0, 0], "reviewtext": "I purchased this radio from Amazon in May of 2003. It's now January 2005 and the radio is still on the first set of batteries. I use it at least a 1/2 hour a day and on weekends as much as 3-4 hours per day. Fantastic. It shows no sign of wear even though it has spent hundreds of hours in the shower, and has even been in light rain beside our spa.It gets great reception (no TV signals in our town), is easy to use, and sounds great.I highly recommend this radio.UPDATE Oct 28, 2010After 7 1/2 years of daily use my Sony shower radio finally quit. As many others have reported the plastic on the top cracked, water got into the Off button area and the radio would no longer work. However I just ordered another one.This radio has some very good qualities.Pros:1) Clear and loud sound2) Battery life is so long it is ridiculous. I don't think I used more than three sets of batteries in 7 years, and I use the radio every day.3) Good reception.4) Ease of use. I really appreciate an AM/FM radio with station presets.5) It is waterproof enough that I take it in the shower every day. I don't leave it there though because I use it on the bathroom counter while I shave too. Perhaps mine lasted longer than many others because it isn't in the damp shower area 24/7.6) I like the top buttons. They are easy to hit with one hand. If the buttons were on the side or front it might require two hands. My radio is never mounted high so I don't have the issue others complain about where they can't see the buttons. Even if I did have it high it is easy to feel where the buttons are as they all have a raised bump.Cons:1) $49 is a very high price to pay for an AM/FM radio.2) It does seem Sony could do some research and improve the plastic top so it would last longer.I was pleased to see this radio is still available for sale. I looked at a few others but nothing matched, in my opinion, this one.", "overall": 5.0, "summary": "Great radio - fills the promise", "unixReviewTime": 1105315200, "reviewTime": "01 10, 2005"}