{"reviewerID": "A3UFCX1AE4TKZE", "asin": "B00000DMA3", "reviewerName": "Ben", "helpful": [11, 11], "reviewtext": "I've been using these for over a year now.  Basically, in a quiet environment these sound pretty good.  They aren't as good as similarly-priced studio-class headsets, but you're paying for the noise cancelling.  The raw capability is pretty decent, and has acceptable detail in treble, vocal, and bass ranges.The noise cancelling works pretty well.  I've taken these on several intercontinental flights and they do a decent job of blocking out engine rumble and screaming kids.  They also do a decent job of blocking out adult human voices, which is nice in the office.However, I must have pretty big ears, and I've found that the foam cups aren't quite thick enough to adequately push the driver away from my outer ear.  After 2 or 3 hours of use my ears start to ache a bit.The cord is plenty long, and can be disconnected in the middle to link to an optional Sony wired remote control.  An adapter to convert the standard 1/8th inch stereo jack to the dual 1/8th inch jacks in many airplane seats is included.The thing that I don't like about this is that I find these uncomfortable when I try to lean my head against the window in an airplane and sleep.  I think that the MDR-NC11's might have been a better choice in that regard.They're also kind of bulky unless you have a large carry-on to keep them in.  I'm paranoid about putting these in the seat pocket in front of me, since the MDR-NC20's come with a soft bag instead of a rigid clamshell like the Bose headsets.  I haven't had any spills yet, but active travellers may wish to find a case that's more rigid.All in all, I'm pretty happy with these.  The natural audio sound and the noise cancelling are plenty sufficient for the price... I couldn't justify the $300 for Bose unless I needed the protective clamshell and had ears that fit perfectly into their earcups.", "overall": 4.0, "summary": "Good sound, Good Noise Cancelling, Good for airplanes.", "unixReviewTime": 1104796800, "reviewTime": "01 4, 2005"}