{"reviewerID": "A1N03V52IRZ5PR", "asin": "B00000DMA3", "reviewerName": "N. J. Simicich \"Gadget Geek\"", "helpful": [0, 0], "reviewtext": "I've owned these for years. I used to fly two round trips a week, and I wore these constantly, whether or not there was any reason to (in flight entertainment, a CD player).The first benefit is that the noise reduction made speech more audible. I could hear the person in the next seat better, and, in fact, I found that I could eavesdrop on people a row or two away, since the noise that would normally have masked their conversation was masked, but the speech came through.The loud, constant background sound in airplanes is very draining. I was more likely to be able to nap with these on, and I was more likely to be able to concentrate on reading with less background noise.Don't get a unit that simply insulates the sound - you might as well use earplugs or sealing earbuds. There is nothing wrong with that solution, it is just that the solution of generated countersound (exactly out of phase, exactly the right amount and frequency for the sound that is incoming), especially when the countersound is based on microphones that are right at the earphones - as far as I am concerned, nothing works as well.Microphones that are placed in an off-headphone device can't tell where the headphones are direction, or what in the environment might be changing the sound at the headphones. This effect is not as important at low frequencies, but it becomes more important at higher frequencies, so this unit can provide more coverage. The design is simply the best possible - microphones as close to the ear as possible is a huge design benefit.Well, being in a quiet environment works better, but that is not always available.When you are flying, especially if you fly a lot, small incremental increases in comfort really are worth it. These cost me less than a quarter per flight, have lasted years and are still going strong.Sound quality was fine. I could head spoken voice programming just fine, and, far as I was concerned, music was enjoyable. Airline provided programming was much better than the provided headphones.", "overall": 5.0, "summary": "The \"Get Smart\" Cone of Silence has finally been perfected.", "unixReviewTime": 1093305600, "reviewTime": "08 24, 2004"}