{"reviewerID": "A15U38AWJ3JDN5", "asin": "B00000IGBF", "helpful": [1, 1], "reviewtext": "I've had my Palm IIIx for over a year now, but I'm going to have to get another, because I dropped it. The Palm didn't fall far -- 3 feet or so -- but it is now useless. White lines cover the display, and the digitizer no  longer works reliably. I have tried opening up the case and re-seating the  circuit boards, which fixed most of the problems, but the digitizer is  permanently inaccurate. Even with re-calibration of the digitizer using  preferences, the location the Palm thinks I'm hitting with the stylus is  wrong, and this makes using the Palm impossible.I bought the slimline  leather case, but this clearly failed to protect the Palm in any way. Also,  the velcro has now come unstuck, so my Palm won't stay in the case.This  is a real shame, as my Palm IIIx is indispensable. I bought Intellisync  software to syncrhonize it to the calendaring software I have on my PC, and  I use it every day to navigate my schedule. Combined with the address book  for names and phone numbers, I have one place to work out what I'm supposed  to be doing and whom I'm doing it with.I don't use the other  applications much. I tried out the e-mail application, but it is way too  simplistic. I get over 200 e-mails a day, and I really need e-mail folders  with automatic filtering to manage that kind of volume. I use Eudora, and  the Palm e-mail application doesn't support its folders or filtering. I  can't even convince it to just download the messages left in my  &quot;in&quot; box after all the others have been filtered out.Being  able to upgrade the operating system on the IIIx turned out to be  important. Version 3.3 of PalmOS supports infra-red sync with a laptop.  This is a godsend when I'm travelling, and for syncing during long  meetings. Being able to upgrade easily from PalmOS 3.1 made it  possible.I have also downloaded a few games to while away long plane  trips -- PocketChess is my favourite. Very easy to play -- just drag 'n'  drop the pieces.I have looked at the Handspring Visor as a replacement,  but lack of upgradeabile OS is a key sticking point. Handspring devices are  stuck at Palm OS 3.1, and Handspring's code seems to have diverged at this  point with no hope of picking up any changes post-version 3.1. Long term,  this could turn into a real problem assuming Palm continues to improve  PalmOS. The Springboard expansion slot is a great idea, but there are so  few expansion cards available that its utility is a joke. Color cases  looked cool -- until I saw them in real life vs. a photo on the web. They  look kinda cheap &amp; nasty.So, I'll probably buy another Palm IIIx.  The IIIe isn't expandable, and I can't see how color is so useful that it  justifies the staggering price of the IIIc. The Palm V looks cool but I'm  even more worried about its fragility, and the Palm VII could be great if  it could actually surf the web, rather than use extraordinarily limited  &quot;web clippings&quot;.", "overall": 3.0, "summary": "Great product, but fragile", "unixReviewTime": 957484800, "reviewTime": "05 5, 2000"}