{"reviewerID": "ARXU3FESTWMJJ", "asin": "B00000IGBF", "reviewerName": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "helpful": [186, 188], "reviewtext": "The big questions these days is what organizer to get. I'll assume you are reading these reviews because you already know that the Palm OS beats CE any day. So the choice is a Palm Vx, a Palm V, a IIIx or a Visor. I can't recommend the Visor right now due to the horrible problems people are  having with Handspring...maybe in another year, but not now.The new Vx  is a good choice, lots of memory and the other advantages of the Palm V  like a better screen, and rechargeable battery. But the darn thing is still  overpriced. If money is no problem though, I'd probably go with the Vx.The V is good too, but only 2 meg of memory...yuck! Now, 2 meg of memory  is going to be enough for a lot of people. If all you want to do is the  basic appointment/phone book/to-do stuff, 2 meg is more than you'll ever  need. But that's it...you're stuck with 2 meg and can't upgrade (easily).  If you are interested in using your Palm to do internet stuff, grab  webpages with AvantGo, play games, read books, etc. you're going to find  yourself a bit squeezed by 2 meg. You can still do quite a bit, but it's a  bit more work to manage your space.Now, for less money you can get the  IIIx. You'll have twice as much memory, and the ability to upgrade. I  personally put on the TRG xtra xtra pro board which gave me 4 meg more of  RAM and 2 meg more Flash...it's like having an 11 meg Palm! Really great.  Of course, I bought this before the Palm Vx came out, today it's not quite  as good a deal to do.One other reason I like the Palm IIIx is that I  have a lot of add-ons that only work with it...the Palm Navigator  (compass), the Weatherguide, Landware's GoVox voice recorder, etc. I don't  believe these will fit a Palm V. Of course, it goes both ways....Palm's new  33.6 modem and the new wireless Omnisky modem only fit the Palm V.I do  believe the Palm V has a better screen, it doesn't seem to have the streaks  that a lot of the Palm IIIx's have. And there's no doubt it has a certain  &quot;coolness&quot; factor. Most of my friends at work went with the Palm  V. But they are fairly impressed with the space and the accessories I have  for my Palm IIIx.", "overall": 4.0, "summary": "A great choice but not perfect", "unixReviewTime": 946771200, "reviewTime": "01 2, 2000"}