{"reviewerID": "AHY2KG32696ES", "asin": "B00000J05A", "reviewerName": "SL", "helpful": [0, 0], "reviewtext": "I bought this player about a year and a half ago.  It worked great (for about 3 months).  It played all the DVDs and CDs.  Unfortunately, it cannot read VCDs or CD-R/RWs.  For most people that doesn't matter, I guess.  However, only after about 3 months of light usage, the player started to act-up.  Sometimes, it won't read the DVDs--the player indicated &quot;no disc&quot; in player.  I unplugged it and it worked after re-plugging it 1 minute later.  Then, it doesn't work again, and I repeated the same procedure of unplugging.  Finally, I sent the player back to RCA.  Since it was still under warranty, all I had to do was pay for shipping.  It came back after about a month.  It worked, and then I started to see the problem again within a couple of days. I was confused.  Why does it work sometimes but sometimes it fails to work?  So, I tested it out to see the prob. myself.  It appeared that the disc tray motor sounded weak, and being unable to read the disc, I thought, could be due to the fact that RCA had provided a weak motor part.  I was half right.  I removed the plug from the UPS/power supply and plugged it directly into the wall.  Ever since, the player was plugged directly into the wall, it shows no problem.  I think I may have found a solution (for now)--the difficulty in reading the disc, I concluded, was due to lack of power [believe it or not].  Well, if you have the same problem, try unplugging it and have a dedicated power supply for this player. It might work.Beside this, the machine is good.  It played every single DVDs I've ever rented or bought. I have this hooked up to my reciever through TosLink (optical cable).  The sound is excellent--good proportion of sound from center, satellite, rear and subwoofer.  It plays CD but it takes a second or 2 to skip to songs.  Basically, don't expect it to play it like a real cd player.  It sounded just as good though.  The picture quality is excellent.  Eventhough I don't have an HDTV, I could still clearly see the improvement over the VHS, or BETAMax tapes. I'm getting rid of it now because I want a new and better player that also plays VCDs.", "overall": 2.0, "summary": "good luck getting one that works perfectly", "unixReviewTime": 981504000, "reviewTime": "02 7, 2001"}