{"reviewerID": "A29G75YOG3SOW2", "asin": "B00000J061", "reviewerName": "Andrew Hildreth", "helpful": [11, 14], "reviewtext": "Being one of those people that likes to chase late-night AM signals, I was convinced that this was a radio I had to have. I was a bit disappointed in some areas, but still see it as something good. This radio is big. Period. Once loaded with \"D\" batteries, it can be used to tone those upper arms during long listening sessions. Quality control seems to vary from set to set, but a few things off the bat that I found were awry for my $50 were:1) Build quality. The switches and dials seemed on the flimsy side, with the chrome finish easy to rub off.2) Dial Markings. For claiming to be a \"DX Machine\", both AM and FM fequency marks are more for wishful thinking than accuracy. Best bet is to find your local stations and re-mark the dial with whiteout or tape and the actual frequency re-written by hand.3) Audio. For using a large woofer,tweeter, and separate bass and treble controls, the audio quality could be better than it is. It still sounds good, but should be better.On the plus side:1) AM reception is fantastic. By turning the radio to null signals, I was able to pick up a small local on 1040 AM near Rochester, NY, then turn it again to cleanly pick up another station on 1040 AM in Salt Lake City. The wide/narrow setting helps greatly in picking stations from the weeds2) FM reception is quite good. Picking up low-power locals and larger 75+ mile stations is no problem for this unit. I didn't realize there were so many FM's around until I purchased this radio3) AC power cord. Fits neatly in the back of the radio (albeit a bit cramped), and having its own power supply instead of an adaptor eliminates any humming while trying to find faint signals.Although not quite as good as its predecessor the SuperRadioII, it does what it is designed to do - allow good reception of AM and FM without any bells or whistles to get in the way.If you can find it discounted, then pick one up and listen away. Otherwise, there are better choices to be found in this price range.", "overall": 3.0, "summary": "A Good 5-Cent Cigar For Only 7 Cents", "unixReviewTime": 1129680000, "reviewTime": "10 19, 2005"}