{"reviewerID": "A2T70SN2VZHOR4", "asin": "B00000J061", "reviewerName": "Bill", "helpful": [17, 17], "reviewtext": "Most radios you can buy have pretty cabinets, nice paint, and will sound pretty good if you're tuned to a station whose radio beams are about strong enough to cook an egg.  They're designed to impress you in the big box store, where looks and the sound of the most powerful station in town are all you have to go on.  It isn't until you get them home that you find out how miserable they are in real-world performance, trying to pick up that weak station that's the only one carrying the game you want to hear.The GE Superadio is a whole 'nother deal.It's just an AM-FM radio, aggressively avoiding any other features whatsoever.  But it's the gold standard of the type.  When a radio geek wants to say whether some other set is good on FM and, especially, AM, s/he will compare it to the Superadio.To give you an idea how good it is; I live in a semi-remote area without any really strong AM stations.  Sitting side by side on my couch, a typical 'personal stereo' type radio picks up one AM station.  A cheap transistor radio picks up three.  The Superadio picks up 37.I recommend my friends get these as part of their blackout kits.  For one thing, it will run about two hours less than forever on its six D-cells.  For another, this set can pull in AM stations at least two, three hundred miles away, in daylight, any time.  If your blackout extends farther than this radio's range, you've got more important things to worry about.Incidently, it runs off AC also.  It switches to AC automatically when you plug it in, switches back to batteries automatically if AC isn't available.Sound quality is excellent.  It's mono, but it has a good and large speaker and enough audio power to drive it properly.  It also has separate treble and bass controls.I give it four stars instead of five for three reasons:1.  Some of them don't work.  The first one I bought didn't.2.  Stations are hard for me to tune toward the upper end of the AM band.  They're packed very tightly together there, and getting from one to another nearby is fiddly.3.  The \"wide\" bandwidth is useless to me.  There is no radio signal in my area strong enough for it.  I have to use the narrow setting, intended for weak and distant stations, for everything.Still, it's a heck of a radio for remote areas, for camping trips, or if you want to know how well a radio can work if somebody at the company gives a darn.", "overall": 4.0, "summary": "The Standard", "unixReviewTime": 1107993600, "reviewTime": "02 10, 2005"}