{"reviewerID": "AXCWZ8HUF332W", "asin": "B00000J061", "reviewerName": "Brett Buck", "helpful": [16, 16], "reviewtext": "I got this radio to pull in both remote stations, and to have better reception. I also wanted something battery-powered for emergency purposes in case of power failures/earthquakes, etc.First impression is that this is one big, ugly, heavy radio. That impression never goes away, because it is big, ugly, and heavy. The apparent workmanship, fit and finish, looks like it was put together in the dark,  by a developmentally-challeneged monkey, who had lost the instructions. It just looks, frankly, awful. Cheap plastic, poorly made (with all sorts of \"color swirls\"), with chrome paint. About like the interior of a mid-70's Chevy.It uses no fewer than 6 \"D\" cells. But the radio is so big you hardly notice. Most of the size comes from the 6\" diameter of the speaker and the enclosure behind it. It probably to about half a barrel of oil to make all the plastic. There's also a very crude perforated metal grate over the speakers. All the knobs and switch *seem* like they will fall of at any moment, and the tuning dial and linear indicator are similarly questionable. It has a handle, and while you can carry it around, it's a \"portable\" radio in the same sense that the original \"beige toaster\" 128k Macintosh was portable.As far as entertainment products go, this radio is the opposite end of the spectrum from the iPod \"Nano\".You might think that you will get some pretty great sound from a 6\" \"woofer\" and a about a 3/4\" \"tweeter. But no - the sound quality, overall, it not very good at all. It always sounds \"tinny\" and while it's plenty good enough for AM voice it's really not much better on FM.But, by golly, it does have absolutely terrific AM reception. Right away, all the\"problem\" stations I had before were perfectly clear. With a Terk loop antenna, I spent a few late nights trying to see how many of the 50kW \"clear channel\" stations I could get. With care in tuning the antenna and the radio, I got the Hartford, CT, station on the first try. Didn't last too long, but I got it. This from *Sunnyvale, California*. It's relatively easy to get stations in Wyoming and Nebraska on good nights. Seattle, LA, Salt Lake, no problem anytime, even with the internal antenna.The tuning indicator is nowhere close to accurate and in any case the markings are so crude that you can't reliably set the radio using the existing marks. I just put some paper correction tape on the scale and marked the frequencies with a pencil.One thing that I didn't see in the other reviews, or anywhere else except the instructions, is that the radio is capable of being set to use 20 kHz bandwidth instead of the usual 10, meaning you get a lot better sound than normal. The speakers stink, but the reception is better and the incoming information is less compressed. Of course you want narrow for long-distance listening but if you listen to nearby stations it helps quite a bit.The FM performance is nothing to write home about, hardly any different from any other radio you might buy. It has AFC to help control the drift, and it seems to work just fine. But it's a mono radio, and the speaker quality limits the sound quality. It's bad enough that it will wear you out if you listen to music for long. There are tone controls, but no amount of fiddling with the bass and treble will fix it. If you want a good-sounding FM Radio, get the Tivoli Model One. It's about 3x the price but the sound is about 10x better. It's clear to me that virtually all the price of the GE went into the AM receiver part, and the rest of it was compromised to meet the *very low* price.With the huge battery pack, I suspect it will run a very, very long time on one set. Of course, it can also use AC.Crudity aside, the radio works exactly as advertised, has brilliant AM reception, will probably run forever on a set of batteries, and is so inexpensive for the performance that you really can't go too wrong.p.s.  to clarify, my review is for the *GE* version, not the RCA version, which is still big, ugly, and poorly made - and also has terrible performance. The GE version works well, the RCA does not", "overall": 4.0, "summary": "Great AM reception, hard-to-believe worksmanship", "unixReviewTime": 1128124800, "reviewTime": "10 1, 2005"}