{"reviewerID": "A1D0KL9ZD7SU56", "asin": "B00000J061", "reviewerName": "D. J. Stone", "helpful": [9, 9], "reviewtext": "I've owned my GE superadio III for about 3 months now.  I'd heard a lot of (mostly) favorable things about this legendary series of radios, and had to get one.  I'm glad I did.  Here's what I think.....Strong points:1)  Great AM reception.  Even during the day it's not difficult to pick up stations up to a couple of hundred miles away.  At night, it can be several hundred miles.  This radio has an 8\" ferrite antenna, and when you hook up an external antenna like the C Crane Twin Ferrite, it really gets good.2)  Very good FM reception (although I must admit I mostly just listen to AM talk radio.)3)  Big 2-way speaker puts out nice, full sound.4)  Separate bass and treble controls.5)  Very long battery life (6 D-cells)6)  AC cord included (but not used most of the time.)7)  Great VALUE.  You could easily spend 2 or 3 times as much to get a radio that doesn't approach this performance.Not-so-strong points:1)  It's a big radio.  It won't fit in your pocket or briefcase, but it's no boombox either.2)  The analog tuning dial is not very accurate (as noted by many others.)3)  Build quality is about middle of the road.  (But still good for the price.)4)  No presets, no clock, no weather band, no SWI currently do not own a C Crane Radio Plus, which I find the Superadio III most often compared to, but it's also 1/3 the price.I own a lot of radios (more than 75 at last count).  I listen to this one almost every day (for at least part of the day), so I think that says something.If you're looking for a relatively inexpensive, but highly appreciated gift for a talk radio fan, this is it.  If you're looking for a cool radio for a young person, this probably ain't it.  If you're into talk radio, or you want to have some fun with AM DX-ing, then get one for yourself.", "overall": 4.0, "summary": "One of the best values in radios today", "unixReviewTime": 1118880000, "reviewTime": "06 16, 2005"}