{"reviewerID": "A3MI3QBXP5I7FA", "asin": "B00000J061", "reviewerName": "Ed Williams", "helpful": [32, 34], "reviewtext": "I purchased this item, then in afterthought read the reviews listed here.  So I was prepared for some rickety thing that had parts ready to fall off when you touched it, and a viewfinder that was as accurate as throwing a baseball at the tuner knob.  But the promise of awesome reception was all I needed to hear.First off, I work in a building which has a lot of electrical interference.  I needed something to get past that.  That was my only concern.  So it didn't much matter, as long as I could get past the interference.  Now that you know that, let me tell you about this thing.First of all it's not HUGE.  I'm 40 right now, so I've seen rickety bulky radio's that would kill if it hit you.  This is a nice unit, well sized for the speakers and antenna's in it.Second, it's very well built.  I tried to pull off the tuner knob to no effect.  Even the volume, treble and Bass buttons nicely placed on the unit can't be removed without some extra tool.  The switches are only two function switches, and are well built.  Granted it doesn't light up, and the tuner bar isn't a lit bar, but who cares, it's very well built.  I tried to squeeze the unit to see if I could make it crack, no, it's sturdy.Now, for the TUNING ability.  There is a WIDE and NARROW switch, which can either give you a very narrow tuning area, or a much WIDER tuning area.  A station I listen to at 740am appears on the WIDE area from 700 to about 750 on the dial.  However on the NARROW switch, it only comes in within a few millimeters of where 740 is.  That explains why people say the tuning was so bad, they had it set to wide.So all things said and done, how did it do against the interference?  Now basically I'm stuck in an area which is nothing short of several high tower power poles.  The improvement was marginal.  BUT to my surprise there are additional AM/FM jacks on the back that you can add an additional antenna or signal amplifiers to &lt;G>  I grabbed a power cord, wrapped it around the AM port, and between the improvement in tuning, signal grabbing, and the extra antennae, I'm getting very decent reception with only a small bit of hissing.This is a very nice radio, well worth every penny I spent on it.  Hope this review helps.Ed Williams, Colorado Springs, CO", "overall": 5.0, "summary": "Better than these folks are saying", "unixReviewTime": 1133395200, "reviewTime": "12 1, 2005"}