{"reviewerID": "A2BLITJITO97N5", "asin": "B00000J061", "reviewerName": "Ingalls", "helpful": [371, 384], "reviewtext": "If you love AM radio and are looking for a radio that has fantastic reception your choice comes down to two radios: the ccradio plus and the GE Superadio. These are the best radios on the market for fans of talk, sports, Art Bell, Phil Hendrie, etc. Which one should you buy? I have both (the GE for my office, ccradio for home) so here is my take on the two. Both have nearly equal AM reception. At night, you can easily pull in stations from hundreds of miles away (some say even over a thousand miles away but this depends on where you live). There the difference ends. The ccradio has a lot of features that I felt I wanted in a radio. It has a sleep timer, accurate digital tuning, automatic timer that turns your favorite show on at a predetermined time, scan buttons, lighted dial, power cord (not bulky adaptor), weather radio (with auto alert), memory buttons, tv audio of the network stations. The only flaw is that it has a grab indentation rather than a full handle. They are a family business and take GOOD care of their customers. The ccradio company LOVES radio and loves people who share their passion. Is it worth the [$$] for the extras? To me it is. The Ge Superadio has a rotary - and inaccurate - tuning dial. This will drive you crazy if you do a lot of channel switching. Some people tape graph paper to the radio and mark where they found the stations - it is that inaccurate. There is no timer, no alarm, no weather, no tv audio, no lit dial, etc. The sound is better on the GE Superadio, though. The GE SUperadio feels cheaply made and probably won't make it through many beach or camping excursions. The GE Superadio is enormously sized - it is the size of a small attache case or TV! If you only want to pull in one distant station and keep your dial set to that station, get the GE radio. That is all you need. It has great, almost legendary, reception without any bells or whistles. On the other hand, if you love radio, need the extras, change stations a lot, want something sturdily built that will last a lifetime, want to explore the large number of AM stations that are out there, go out and order the ccradio with slightly better reception (see their website to order). I am a radio person rather than a tv person. I have radio playing all day (as some people have tv going on all day). I sleep to radio (and need that sleep timer). I would rather listen to a talk show than watch a sit com. I would rather listen to Coast to coast, Phil Hendrie, and Rush than watch another rerun of Frasier or Friends. If you are like me, do yourself a favor and invest in the ccradio. You won't regret it. P.S., the FM reception will be better than you are used to, also.Bottom line: The GE superadio is low cost with no extras and big and bulky. The CCradio plus is expensive, has every extra you could want (except a decent handle), more sensitive but does nto sound as good as the GE for music.", "overall": 5.0, "summary": "Astounding AM reception", "unixReviewTime": 1071446400, "reviewTime": "12 15, 2003"}