{"reviewerID": "A6VPIOPMDJ8H7", "asin": "B00000J061", "reviewerName": "Joe Ekaitis \"gray-haired geek\"", "helpful": [46, 47], "reviewtext": "Some products seem to predict their own futures.  Corning Ware was introduced long before anyone even knew what a microwave oven was and it turned out to be the best cookware for the ubiquitous food zapper.Now, the GE 7-2887 Superadio III takes its place among such prescient products.  Your humble communications technician, seeking to hear another human voice  while on the job in a computer room, found the Superadio III remarkably  well suited to the computer room environment.I had previously brought a  Grundig Yacht Boy 400 and a Sony ICF-2010 to work to listen to an AM talk  radio station, only to find out that what makes them so good for world band  (shortwave) reception are the very things that meant disaster in the  computer room's EMI (electro-magnetic interference) rich atmosphere.  Being  digital receivers, their computer-like circuits eagerly plucked from the  air the squeals, drones and squawks of the network servers, PCs and PBX  system that occupy the room while adding their own synthesizer noise to the  weakened signal.  I pondered the possibilities for better reception.  I  could put the radio nearer an exterior wall, crank up the volume loud  enough to hear while seated at my desk, and be promptly thrown into the  parking lot, since others in the room don't really want to hear the same  station.  Through the interference on the Sony came a commercial for the  CCRadio by C. Crane, a tabletop receiver specially designed for long  distance reception of AM news and talk radio stations (Translation: The  speaker ain't so hot for music).  Pricey but perhaps worth it.I read a  few reviews of the CCRadio and another model kept popping up as the  undisputed CHAMP of Long Distance AM Radio Reception, the standard against  which other contenders are measured, the one, the only, ladies and  gentlemen, let's hear it for the GE 7-2887 Superadio III.  Wow, I thought,  how often I had seen them at WalMart and Kmart and how often I said to  myself, yeah, right, Superadio, ha ha.  Yet, here were some of the  toughest-to-please SOBs who ever twiddled a tuning knob using this radio as THE benchmark.  I was intrigued.A quick visit  to the usual suspects (Best Buy, WalMart, Kmart) proved fruitless  (&quot;Sorry, if it's not on the shelf, we're out. . .No, I don't know when  we'll have more&quot;).  In desperation, I came to Amazon.com, typed  &quot;superadio&quot; in the Search box and there it was in all its  &quot;usually ships in 24 hours&quot; glory, and for less than  the best street price.  2 UPS Second Day Air days later, it was waiting for  me at home.  I didn't unbox the radio until I was back at work the next  day.Even before digging into my Sausage McMuffin with Egg breakfast, I  unpacked the Superadio III, plugged it in and was, indeed, amazed.  The  interference no longer dominated the signal from Los Angeles radio station  KFI.  It was still there, but not as much as on the Sony and Grundig.  The  Superadio III's analog tuner is, by its nature, more immune to it.  Throwing the WIDE/NORMAL switch to the NORMAL position reduced much of the  interference.  Judicious tuning and adjustment of the separate bass and  treble controls brought forth the desired sound while further fading the  interference to a tolerable level.  Thanks to the 2-speaker sound system,  the Superadio III delivers more &quot;presence&quot;, allowing it to sound  louder even though the volume might be lower than on a radio with inferior  sound.At the minus end of the scale is the tuning scale itself.  The  aforementioned station at 640 kHz appears between the 650 and 700 markings  (675 kHz?).  If you do a lot of station hopping, keeping a station list  with each's position on the 1-to-10 &quot;log scale&quot; above the AM and  FM scales might be a good idea.  Made in China and imported by Thomson  Consumer Electronics, the Superadio III has a less-than-substantial feel to  its construction and controls.  Better-built radios DO come out of China  (can you say &quot;Grundig&quot;?) but they also cost accordingly.For  its price, the GE 7-2887 Superadio III Portable AM/FM Radio does just what  you buy it for and will probably continue to do so for many years to come  as more and more computer room hermits discover its ability to bring the  outside world inside.  They can block your access to Web radio, but they  can't stop you from listening.", "overall": 4.0, "summary": "Computer-room dwellers of the world, REJOICE!", "unixReviewTime": 959299200, "reviewTime": "05 26, 2000"}