{"reviewerID": "ARNWCLQZFQECA", "asin": "B00000J061", "reviewerName": "John Paquette", "helpful": [10, 11], "reviewtext": "It receives and plays mono radio (AM and FM) exceptionally well.  It sounds great, with surprisingly good bass.At 13\"x9\"x4\", it isn't small.  And it it isn't light either, with 6 D batteries in it.  But I'll bet this heft is what makes the bass sound so good.I bought it because I wanted a good, inexpensive, big, vertical-format portable radio (I'm tired of the huge footprint and squatting look of most boomboxes today).  I wish it had digital tuning, but it doesn't.  The analog dial might not be very accurate, but in my experience, analog tuning has *never* been accurate.  I've always had to tune by ear rather than eye.Features: Power switch (button) is separate from the volume control.  So you won't be wearing out the volume knob every time you turn it on.  Bass and Treble controls.  A mono headphone out (meant for stereo headphones -- you get the same signal in each ear).  Loud.  Easily fills a good-sized room with sound.  On AM, it has an optional \"wide\" mode which can give you really great sound on some AM stations, at the price of selectivity.  On FM it has optional automatic frequency control which grabs the nearest strong FM signal (you may wish to turn off AFC for weak FM signals near strong stations).  It has terminals for external FM and AM antennas.  It has a nice, 36\" long FM antenna, and a 20cm internal ferrite rod for AM.  It has a nice handle on top, the kind that bangs into the FM antenna if the antenna is extended, so be careful.  There's no light on the tuning dial.  Again, you must tune by ear.Heavy, however, doesn't necessarily mean hardy.  Everything is plastic on it except the antenna and the speaker grille.  Since it is heavy and somewhat tall, I fear the time when it first will fall over.  Best to treat this radio kindly -- I'm not sure how long the switches will last.  But for kindly indoor use, assuming you don't like to switch stations often, it's great.What you are paying for here, though, is the reception, which is excellent.  The Superadio III is not a tank.", "overall": 4.0, "summary": "It does one thing right.", "unixReviewTime": 1157241600, "reviewTime": "09 3, 2006"}