{"reviewerID": "A1X3DA7C61WZLQ", "asin": "B00000J061", "reviewerName": "Kris", "helpful": [19, 19], "reviewtext": "This is, by far, the best radio you can buy for AM/FM reception.  The AM reception is fantastic, with a super-large internal AM antenna that can be supplemented with an external antennal for hard-core 'DXing.  FM reception is so good you don't need the AFC function, but is only in monaural.  Tuning does not drift away from the frequency like so many other tuners.  There is also ample room inside the radio to add subcarrier circuits if you are into that sort of thing.The six D-cell batteries last for several months and are a boon for snow storms, power outages, and to tune in far-off stations without electrical interference.  The power supply is well shielded from noisy power sources.The sound is very rich with a huge range of bass and treble, which is perfect for attenuating static and whine.  The speaker is enormous and the radio features a high-quality tweeter.  The sound quality both on AC and batteries is super-powerful.The volume and bass/treble knobs on the front are a little too small for outdoor gloved use but that's the only complaint I have.  The antenna is easily replaced if damaged.  It seems to be impervious to light rain and splashes but is not water-resistant.I have several of these radios and have given them as gifts.  There appears to be some variance in quality between units, such as the maximum volume you can drive the speakers without distortion, but that appears to be due to changing suppliers of the large speaker.  Some people are bothered by the frequency display not closely tracking the frequency you're tuning, but I don't think anyone really looks at analog frequency gauges anyway.This is an excellent radio and is great when it is on sale.  The regular price is excessive, though, even for this level of quality.**EDIT**  In 2010, this radio is now known as the RCA Superadio III.  Model numbers include RCA 7-2887 and RCA RP7887.  I am listening to the original, reviewed item right now, and I'm glad to see the line is still being produced even if it is under the throwback RCA brand.", "overall": 5.0, "summary": "By far the best radio", "unixReviewTime": 1044489600, "reviewTime": "02 6, 2003"}