{"reviewerID": "A8TZ88OM8YOLW", "asin": "B00000J0D5", "reviewerName": "MartyHansen", "helpful": [21, 23], "reviewtext": "I've used the RCA RC930 Wireless Modem Jacks to create a poor man's wireless network in my home.  It works!  And I love it!  I can now sit in any chair of my house, surf the web, and print (across the room) to my wireless HP 995 Bluetooth printer.My system consists of two sets of RCA Wireless Modem Jacks (a sender and receiver unit in each set) -- one set for the upstairs and one set for the downstairs (which appear to be on separate circuits and are not connected); a 3Com Bluetooth PC card for my laptop; and a HP 995 Bluetooth printer.I now use my laptop in the following manner: first, I plug the RCA receiving unit into the wall outlet nearest where I want to sit; then I turn on the printer; and finally, I extend the little blue tooth-shaped antenna (how cute!) on the laptop's PC card -- and I'm all set to go!The RCA Modem Jack is good up to 56k, which is ok since I don't have internet cable or DSL service in my area.  But I'll gladly trade-off mobility for speed any day.  Here's why.My desktop computers (old and new) are in my upstairs bedrooms -- where I can't use them when my family is sleeping.  They are also far away from where my family spends most of its time -- and that's downstairs by the TV's.With the RCA wireless modem jacks, I can now access the internet --- while watching TV with my family; and I can surf the net long after everyone has gone to sleep -- when internet speeds are fastest.  The connection is fairly clean (free of static); and the transfer speed is nearly as fast as if I had accessed the phone jack directly.I've gotten very used to sitting in my favorite chair and surfing the net. When cable or DSL eventually come to my neighborhood, I guess I'll have to set up a wireless network in my home (for a lot more money) -- in order to maintain my mobility.Until then, I'll use the next best thing -- RCA's Wireless Modem Jacks.  They're great!", "overall": 5.0, "summary": "A Poor Man's Wireless Network -- That Works!", "unixReviewTime": 1016409600, "reviewTime": "03 18, 2002"}