{"reviewerID": "ANU1675O6DO5E", "asin": "B00000J0D8", "reviewerName": "George Costanza \"George Costanza\"", "helpful": [7, 7], "reviewtext": "I bought two and use them in different parts of the house to listen to my Sirius Satelite radio. I can walk around the house and listen to either Howard or the Rolling Stones channel through out, using one boom box.There are a few things to keep in mind if you want to get full use of these.* A) * Set the volume going into the transmiter higher. 2) Low volume in will cause popping and fading. Very low volume in will for some reason cause the transmitter to shut down. 2) Higher volume in will allow you to lower the preamp volume on the speakers and play with less distortion and lower noise level. When you increase the volume on the speakers, you are amplifying the NOISE as well as the music. Makes sense, right?B) The power cord is also part of the antenna, so its location and position can be adjusted to improve reception. I used little plastic wire ties to afix the cord to speaker stands. The cord runs straight down like a verticle antenna.C) The speaker is still a radio reciever and subject to interferrence. You can adjust the frequency on the transmitter and on the recievers (speakers). Fine tune them for the best reception in your location. This may take a few adjustsments. Remember, cellphones, WIFI etc can all interfere!I tried plugging the transmitter into my stereo's headset jack, but it didn't work well, because the output was too low. I'm going to cut the plugs off of the Y adapter or make an adapter with bare wires and try using them as the rear (effects) channel of my home theater.I love these speakers and use them everyday. They could be a little better, but I still love them! I'd give them 5 stars if they were a little louder, a little better tone wise and the reception range was a little better. You'd get 150' in an open feild or gymnasium, not my odd shaped house. But for the money, they are a great VALUE!My house is made concrete & steel and has metalic tinted glass all over, so wireless stuff doesn't work the greatest. With my windows closed & the tranmitter on my patio, I get about 30' with occaisional drift. Your house might be better. I'm going to buy another pair because I see that they are discontinued and these sound better than the newer ones. I'm also concerned that the new ones may have differnt frequencies, which is a good thing if you want to use more than one pair at a time, connected to different inputs.Better hurry up and buy now, before I get buy all!", "overall": 4.0, "summary": "Good enough that I want to buy a THIRD pair!", "unixReviewTime": 1140480000, "reviewTime": "02 21, 2006"}