{"reviewerID": "A1TAFEUKHIFV6L", "asin": "B00000J1GA", "reviewerName": "Amit Patel", "helpful": [0, 0], "reviewtext": "[December 2000]I really like these headphones.  I also tried the Sony RF950-RK, which is in a comparable price range.What I liked about Sony:  longer battery life (15 hr instead of 6 hr); there's a stand on which you can hang your headphones; there's an auto on-off feature that saves battery life.What I didn't like about Sony:  you have to take the batteries out and put them into a recharger unit (I was expecting to just hang the headphones on the stand and have them recharge, like the Palm Pilots do in their cradles); when I tilt my head forward (at my desk, since I use these at work), they slide off.What I like about Advent:  the sound is slightly better; the battery recharging is easy (plug it in and it recharges); they are more comfortable than the Sonys.What I didn't like about Advent:  there's no recharging stand; the tuning knob is in a really bad place (where you'd put your hands when you're putting the headphones on).I didn't really care about the range, because I'm really only using them in the same room.  One thing to be aware of: the Advent instruction manual (which nobody reads) says you should plug them into the LINE OUT and not the SPEAKER OUT port.  The line out has a much stronger signal (unless you turn up the volume on the sound source).  There's also an adjustment knob you're supposed to use to get the signal strength up to the right level.  Before I did these two things, I got a lot of noise.  After I read the instructions and set up a strong signal, I had almost no noise.Overall I really love them.  I can listen to music really loud without bothering my officemate, and they're comfortable enough to wear all day without trouble.[December 2003]I no longer use these headphones for day to day use.  After about six months, I got too annoyed with the sound fading in and out, the increasing amount of hiss, and the random loss of stereo signal.  I'm back to using regular wired headphones, this time spending only $18 on an Aiwa pair that I like.  I still use the Advent wireless headphones for occasional TV viewing (where sound quality is not so important), but I wouldn't recommend them.", "overall": 2.0, "summary": "Good headphones at first; didn't last long", "unixReviewTime": 976579200, "reviewTime": "12 12, 2000"}