{"reviewerID": "A204ETWOV23HO4", "asin": "B00000J1GA", "reviewerName": "David J. Huber \"Addicted to books!\"", "helpful": [9, 9], "reviewtext": "Not the highest fidelity you will ever hear in a headphone, but if you aren't in a recording studio, and are just listening to music while sitting at home or cleaning, or watching the TV and want headphones so as not to disturb the neighbors, these are perfect. They have more than enough range - I can even go well outside, and still hear the music just fine. They are not quite five stars, though, due to not being fully 'fi', so to speak, and for the annoying need to use another plug cord to recharge the batteries.As far as some other reviewers talking about complications with tuning, maybe I just lucked out, but I had these things tuned in about three seconds. I've also never lost a signal randomly, or had the tuning slowly go out of phase as some others complained.  I will say, though, that the tuning knob on the headphones is right next to the volume knob, and it's very easy to accidentally bump the tuning knob when adjusting the headphones, or when one wants to adjust the volume.  But this is a minor complaint (though I would like to see advent begin to put the tuning knob on the side opposite the volume, or in some other less easily accesible spot).The lows are good, the highs are good, and the ear cushions are very comfy, even for my large head, for extended periods.  The cushions I find to hold in heat from my ears and cause sweating (sorry if that's gross, but you need to know this stuff to be informed). I've always had that problem with all cushioned headphones since many, many ages ago, and so is not a problem with just these headphones, but the Advents cause it sooner than others I have owned - they make a very airtight seal around your ears.For the price, and for the built-in rechargable batteries, these are an excellent deal in my opinion, and I've enjoyed having them and using them, and have just ordered another pair so that my partner and I both can use them to watch movies with explosions and/or loud orchestral soundtracks late at night.", "overall": 4.0, "summary": "Pretty darn good", "unixReviewTime": 1012608000, "reviewTime": "02 2, 2002"}