{"reviewerID": "A6FIAB28IS79", "asin": "B00000J1UQ", "reviewerName": "Samuel Chell", "helpful": [16, 20], "reviewtext": "When, after moving a treadmill, I couldn't find the power cord, my first efforts were devoted to locating the manufacturer's website, phone number, mailing address, all the while wringing my hands in despair that my costly, indispensable machine had been rendered worthless due to the loss of a mere power cord, which certainly had to be custom-made to fit the opening designed for it by the makers of this aristocratic device (30 years ago I viewed all owners of treadmills as self-indulgent elitists).  But while waiting for a company representative to answer one of my phone calls, it suddenly occurred to me that my father had once purchased a power cord for an old TV set at a hardware store, and with no regard even toward the make of TV.So I looked on Amazon, instantly found something that looked promising (the description \"Universal\" was admittedly encouraging), and in two days both the treadmill and I were back up and running.  The pedestrian exchange (in both senses of the word) would no doubt have proven satisfying to anyone of any age, generation, class, ethnicity or gender, amounting to no less than the discovery of one's autonomy in a world of high-priced experts and \"gotcha\" specialists.  Moreover, how reassuring it is whenever one discovers and comes into possession of the knowledge that previously had no doubt belonged to everyone but your own isolated, \"out-of-the-loop,\" lonely self.  I hesitate to say whether the cord was more empowering to me or the treadmill.  But don't be shocked if the product delivers what it promises--twice over.[Since writing the above, I've discovered a company (Essential Sounds Products, Inc.) claiming its power cord is \"Amazing,\" \"Innovative,\" \"Revolutionary\"--that after using it to supply power to, for example, an amplifier, the cord's owner will settle for nothing less (\"One listen, and nothing else will do\").  This possibility sort of blows my tribute to the universality of the common power cord, but I remain to be sold on the new, revolutionary product.  If it converts my television set to \"Smell-o-vision\" (for those of you old enough to remember) or my kitchen toaster to a turbo-charged forge suitable for alchemy experiments, I'll be persuaded.  Return for updates.][Argh. The ESP (the acronym for the manufacturer) power cord begins at well over a hundred and the power strip at five hundred.  I smell exploitation of musicians (and gearheads) who, like athletes, are sometimes willing to try anything for that winning edge. Better to buy this Belkin and, if it bothers you, paint it some other color and put an exorbitant price tag on it so people will think it's one of those elitist A.C. cords.]", "overall": 5.0, "summary": "Power to the people", "unixReviewTime": 1251763200, "reviewTime": "09 1, 2009"}