{"reviewerID": "A23S2XCWFZM976", "asin": "0972683275", "reviewerName": "Sauce On Side", "helpful": [1, 1], "reviewtext": "This was needed to mount a 32\" LCD that weighs 27 lbs in my bedroom. I looked at another mount by the same company but it did not articulate so I was worried I wouldn't be able to achieve the viewing angles that I needed. So I found this one & went w/ it based on the high reviews. I could not be more pleased.1) PRICE - If you were to go to the big electronics store (BB) or the big box monster (WM) you would pay hundreds. I can't fathom those more expensive mounts doing anything that this one does not. Does it cook dinner for me? Why pay $100-$250 for a mount when you can get this one for $29.99 & oh, by the way have the confidence in 898 customer reviews averaging 4.5 stars at the time of this writing?2) FUNCTION - This mount is solid. It articulates to the left, to the right. It pans, it tilts. One small negative.....the plastic clips for routing wires are nearly useless. I took them off.3) WHATS IN THE BOX - Normally I would not comment on what an item comes with but in this case I was so impressed I felt it was worth mentioning. It comes w/ everything you need in neatly sealed and labeled plastic sleeves. It comes w/ lag bolts that everyone will use to mount to the wall stud. (mounting to a wall stud is required unless you are mounting to concrete) Then it has 9 different screw sets to mount the plate to the back of your TV. It has 2 washer sets for the mounting plate (based on if your TV has a flat or curved back). Then it has a spanner wrench for tightening the screw of the mounting plate. Then it also has 2 plastic anchors for mounting to a concrete wall. Last but not least are the VESA adaptors (which I did not need)4) WHAT YOU NEED THAT ISN'T INCLUDED -  Pencil / Level / Stud finder / Phillips screwdriver / Drill w/ a 7/32 drill bit / Socket wrench w/ a 13mm attachment.5) CONCLUSION - This is a no brainer. I have another 32\" that needs mounted. I think as soon as I click publish for this review I will be ordering another one. If you find yourself reading reviews on TV mounts and you have found this one your search is over, just click buy already.", "overall": 5.0, "summary": "Awesome TV mount", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}