{"reviewerID": "A243HY69GIAHFI", "asin": "B00000J3II", "reviewerName": "tropic_of_criticism", "helpful": [10, 11], "reviewtext": "This device has essentially been eclipsed by its own success.  Now the solution-of-choice only for older machines (more than 2 years), or for mobile professionals who want to make absolutely sure that they'll be able  to connect a ZIP drive to any PC they encounter, this most basic ZIP drive  should be avoided by most purchasers.Fact is, if you need to be mobile  with your ZIP, you should go the USB route these days.  Every new PC and  Macintosh comes with USB connectivity, and the difference in access speed  is great enough to justify the minimal extra cost.  This parallel port  machine is the very slowest ZIP drive available.  If  you download files of  any size (1M or more) you will notice the difference.You'll also notice  the difference between this model and an internal model.  Make sure that  you really need to be mobile with the drive itself before you choose an  external model.  As has been stated in other reviews, the ZIP-100 has  become something of a standard nowadays, and many machines come with a ZIP  drive pre-installed.Also, even though the price is attractive, think  carefully about choosing this model if you plan to do much printing.  Most  printers use the parallel port, and although you can hook up both a printer  and this drive to the same port, you can't use both simultaneously.  This  is disasterous if you attempt to print a file from the ZIP drive.  It can  be done, but it takes a lot longer than printing from other drives.  Also,  forget about accessing the ZIP drive if you've sent a print command.  Your  parallel ZIP drive will be unavilable for the duration of the print.Having said all this, I absolutely agree with other reviewers who praise  the ZIP-100 format.  It's got the broadest-based installation of any ZIP  format, so chances are you'll be able to port your data more successfully  with a ZIP-100 than any other format.  True, 100mb is starting to look like  small, but it's still an awful lot of room for almost everything but  full-motion, full-sound video.Still, I have to give this product fewer  stars than it would've deserved two years ago, simply because Iomega has  come out with better stuff in the interim.  For many users, it would be  wiser to buy an internal ZIP-100.  Or, better still, buy an external USB  ZIP-100 for current compatability, and leave the internal bay available for  future installation of a JAZ-2MB.  That way, you'll create a removable  media solution that handles both past and future needs.", "overall": 2.0, "summary": "Not the wisest choice for most users", "unixReviewTime": 959731200, "reviewTime": "05 31, 2000"}