{"reviewerID": "A23ZO1BVFFLGHO", "asin": "B00000J3II", "reviewerName": "Wayne Chung \"c4victor\"", "helpful": [8, 8], "reviewtext": "The Zip100 is a minimum necessity for today's larger and larger file formats - MPEG, MP3, and multiple images files can easily run up to 100MB.  I've used the Zip since its inception when it knocked old Syquest 88MB  drives out of business about 5 years ago.  The size and convenience is why  there is really only one choice for removable media with easy and immediate  read-write capability.There are definite pluses and minuses.  Some will  say get a CD-R(W) drive - but burning a CD is definitely not as immediate  as a Zip. The parallel port is a major bummer because of the thru-speed.  But those of you who are not major speed demons won't be disappointed  compared to a floppy.  The Zip drive allows daisy chaining so you can  connect/output to other peripherals.Iomega cut cost on the power  on/off (it's always on when plugged in).  But really the overall design is  very good - you can place it flat or vertical.  Even though the thick  parallel cord may tend to twist the main unit.There are a plethora of  other Iomega choices.  And I would really ask yourself if you are planning  on USB or SCSI - each are noticeably faster.  On the plus side, the 100MB  format is so common in print shops, university labs, and copy places that  you can't go wrong.  Plus the price of each disk is recognizably less than  the 250MB.  Seriously think about your file formats.  If you plan to do a  lot video - you'll need to go with a Jaz.  And you can get these  refurbished for about the same cost and hold 1Gig.  The only barrier to  entry is the SCSI necessity and the extra cost of disks.  Overall, the  Zip100 has been a major workhorse for me - back and forth between work and  home/Mac and PC MS98/NT.  It has performed flawlessly.", "overall": 5.0, "summary": "If it's simple and works - then it's not stupid", "unixReviewTime": 960422400, "reviewTime": "06 8, 2000"}