{"reviewerID": "A3W112102BC6BG", "asin": "B00000J3Q1", "reviewerName": "J. Lara", "helpful": [16, 16], "reviewtext": "This was the first case that i had for my Palm.  There is no doubt that it a good case and it looks really nice with the Vx. With the case on, it very little to the overall size of the palm. The silo design of the Vx which allows you to attach the case to the palm was ingenious. It a huge leap in case design compared to the velcro concept of may PDA's.As for this case it is made of high quality leather and it a loop/strap design that i also liked. Velcro and the button proved that after prolonged use, it tends to rip. The loop/strap design secures the case very well and it still looks very elegant.However like many leather products, they tend to warp and deform after a while. Just think of your wallet and how deformed that can get. If your going to be putting it in your pocket a lot, i suggest you go with the hard case. However if your going to be putting it in a bag or brief case, then this case will be fine.Although the case has slots for credit cards or business cards, realistically you wouldnt want to put more than two credit card and 3 business cards in it at one time. It does a lot to the bulkiness of the case. Personally I only carried 4 business cards in it at one time.Reatively speaking i wanted a case that was smaller then this one because it got a little too big for my pockets, whether it be the shirt or pant pocket. i found that not only was the hardcase by palm smaller and almost weighed as much, it also protected it just as well.Also the fact that the powerbutton was often times turn on when using the leather case convinced me to change to the hard case.Dont get me wrong. I really like this case. The hard case just fit my needs for a case a lot better then the slim leather case.The best thing i can suggest is to try both of them out before you actually buy it. A lot of stores will let you try on the case. Thats really the best way to determine which one will really work for you.I wonder if this will fit the m500 series... hmmm....", "overall": 4.0, "summary": "Excellent product but there are others out there!", "unixReviewTime": 985478400, "reviewTime": "03 25, 2001"}