{"reviewerID": "A8TZ88OM8YOLW", "asin": "B00000J3Q1", "reviewerName": "MartyHansen", "helpful": [13, 13], "reviewtext": "As a heavy user of my Palm (which I access dozens of times a day), the Palm Slim Leather Case is perfect for my needs.  I prefer it over other cases for the following reasons:The first is portablity.  I take my Palm everywhere with me (even to the little boy's room).  And with the case's slim size, my Palm fits easily into my front pants pocket.  (Carrying my Palm in my shirt pocket is also an option.  But since my company switched to business casual attire, I no longer wear dress shirts with pockets to work.  Hooray!)The second reason is convenience.  With the Palm rail system, the unit is held securely.  And when I need to sync, the case slides off cleanly (the rail system being a simpler and much more elegant solution than the pocket or Velcro holding methods of other products).The third reason is protection.  The rigid cover is slightly padded, and the loop closure is very secure.  (Before adopting this case, I once used another cover -- without a loop closure -- which failed to protect my Palm when I accidentally dropped it in the street while I waited on the curb for a cab.)  The loop closure is also easy to open, so access to my Palm is not restricted.My last reason for selecting this case is its ability to hold business cards.  I put my business cards (a whole slew of them) in the large inside pocket, and I put my kids' doctor and dentist appointment reminders in the multiple credit card slots, none of which I want to carry in my wallet (which is already filled with plenty of other stuff).  Since my Palm is always with me, I'm never without a business card, so I never miss an opportunity to have my name remembered by the many new customers or vendors I meet.(As a comparison, many of the hard cases are very stylish.  But since they can't carry business cards, they aren't really adequate for my needs.)For a great combination of style and function that's perfect for a heavy Palm user like me -- the Palm Slim Leather Case is ideal!", "overall": 5.0, "summary": "Great Features -- And It Holds Business Cards Too!", "unixReviewTime": 1000425600, "reviewTime": "09 14, 2001"}