{"reviewerID": "AM4ZQJ0IORVWG", "asin": "B00000J3Q1", "reviewerName": "Rob \"Revuman\"", "helpful": [43, 44], "reviewtext": "Unlike my other reviews which usually take up a page or so, this product is rather straight forward.  First and foremost I must say that this case sure beats the hell out of the hard case, which is also manufactured by  3Com, in both form and function.  Second it can hold credit cards and money  to be used as a second wallet, although it is not a great idea to use it as  a primary substitute.  And thirdly, the hard case is about ten dollars more  than the leather case and is not nearly as good.However, like all  things, it does have it's downsides.  It's biggest flaw, like with other  cases, is that it makes placing the Palm in the craddle (while still in the  case) a little more difficult.  You basically need to place the craddle up  on something (upside-down cup for example) and pull back both sides of the  case all the way and then you can recharge.  Secondly, the pockets are made  so stiff inside that it is very tricky to get both money or credit cards  into or out of the pockets, which is why you might want to stick to a  regular wallet.  And thirdly, if you place the cased palm in a tight space  like a bag or something, there is a chance that the edge of the case will  hit the power button and cause it to turn on.  This is not a big deal since  it will shut off automatically after a minute or so, however it can become  annoying when you haven't charged your palm in a while and you find that  your battery is dying for some strange reason.All in all, you can't do  much better than this case for only $19.95, and while there may be more  expensive cases on the market, they are all variations of this simple  design.  However, I would say that it would be nice it 3Com or Palm would  make a case like this that went all the way around the palm for protection  on all sides, since something can get caught between your palm and the case  and end up scratching the screen (which almost happened to me).Final  thoughts: nice leather, don't expect it to take the same beating as the  hard case, but unless you plan to go hiking with your palm, don't shovel  out the extra ten bucks for a shoddy hard case, get this nice leather one  instead.Revuman:  Stay Tuned for more Reviews...peace!", "overall": 4.0, "summary": "Nice case, OK wallet, better than the hard case", "unixReviewTime": 958262400, "reviewTime": "05 14, 2000"}