{"reviewerID": "A3MV1KKHX51FYT", "asin": "B00000J3Q7", "reviewerName": "Acute Observer", "helpful": [0, 0], "reviewtext": "IOMEGA ZIP 100 Portable USB DriveThis unit is identified by its translucent light blue rectangular box. It uses a separate power supply. The Model Number is ZIP100USB. It can operate either horizontally or vertically (like a floppy drive). A device that connects with a USB cable requires Windows 98 or later. You should use the software EJECT command to remove a ZIP disk in Windows 2000 because the disk caching system may have data that needs to be written out. The IOMEGA software should be installed in Windows 2000 instead of the built-in support.The \"User's Manual\" warns against using the Operating System to copy a disk. Use the Iomega \"Copy Machine\" program. Right click on the ZIP drive to select the Iomega \"Format\" function. Use \"Short Format\" to delete all data on an Iomega disk. The \"Long Format\" repairs a drive with errors, converts from another format, or removes all passwords. \"Write Protection\" protects against writing over data, a password can protect against both reading and writing files. You can also flag the ZIP drive as \"non-removable\" so it appears like a hard drive. The manual has the details.Computers have a limited number of IDE devices and drive bays so a separate storage device is practical. Replaceable 100 MB ZIP disks provided vast storage in the past but are no longer the latest in storage technology. But the 100 MB ZIP disk is almost as universal as the floppy disk when you have a parallel port drive for older systems. The ZIP disks reuse deleted space unlike a CD whose space is consumed when you replace files. Falling prices for CD discs solved that problem. A ZIP disk has no compatibility problems between different systems and computers. A CD written on one system may not be updated by a different system.To test the status of a used ZIP disk. 1) Right click on the drive, select `Properties'. 2) Select the Iomega tab (after support was installed). 3) Select `Diagnostics', then `Close' after the green light. 4) Select `More Info' on the `Disk Type' Note the `Disk Life Status' and the `Format Life Status'. Percentages lower than about 85% are not good. 5) A `Long Format' can improve the Life Status statistics.", "overall": 5.0, "summary": "Useful Data Storage and File Transfer", "unixReviewTime": 1253232000, "reviewTime": "09 18, 2009"}