{"reviewerID": "A243HY69GIAHFI", "asin": "B00000J3Q7", "reviewerName": "tropic_of_criticism", "helpful": [37, 38], "reviewtext": "As it makes little sense for the 100mb to be the original Zip you put on a  new system anymore, most people who buy this product will probably be  upgrading from an old parallel version.  To be sure, it is an improvement  on that device. It's noticeably faster.  But it's smart for only a couple  of  very specific kinds of user.The first is the \"Backup Bandit\".  If  you only use your zip drive for routine, automated backup of files that fit  easily onto a single 100mb disk, it's unlikely you need much more than this  device.The second is the \"I've-had-a-Zip-for-years Geek\".  If you have  a huge library of Zip 100 disks already amassed, and the average file size  is above 10mb, then there's an argument to be made for staying with this  product.  Notice that I'm talking here about a library of truly BIG files,  typically graphics.  If all you have is a massive library of text  documents, you shouldn't fear switching over to the Zip 250 at all.In  my opinion, anyone else should go for the USB version of the Zip 250, and  add on a FireWire adapter when it becomes available.Why?Well,  the Zip 250 USB with FireWire is simply the most flexible Zip out there.  You can use it on literally any system that has at least USB ports, can  achieve the lightning speeds of internal SCSI Zips if the computer has  FireWire ports--and you don't have to sacrifice a scrap of portability.  While the Zip 100 here can be fitted out with a FireWire adapter, it can't  use Zip 250 disks.  True, the Zip 250 is mysteriously slower than a Zip 100  if the files are something above 10mb.  But you'll never notice the  difference with the vast majority of files.  What you will notice if you  spend any time seriously archiving your work is how nice it would be to  have a little bit more room on a 100mb disk.  The Zip 250 solves that  problem by giving you a lot more room to play in.  In particular, the 250s  are obviously better-suited to sharing larger multimedia files between  computers, or even between platforms.  Finally, the 250 simply LOOKS  cooler.  Those looks even translate into utility, because its trim profile  really does make it a little easier to carry.In fairness I should point  out that the 100mb appears to have a substantially lower price tag.  But  it's not, really.  You pay on average 1.5 times as much for Zip 100 disks  (per megabyte of storage space) than for Zip 250s.  Long term, your storage  savings with a Zip 250 more than make up for the up-front difference  between the two models.", "overall": 3.0, "summary": "There are better Zip drives out there", "unixReviewTime": 968457600, "reviewTime": "09 9, 2000"}