{"reviewerID": "A14JBDSWKPKTZA", "asin": "B00000J3UH", "reviewerName": "Bob Feeser \"MillCrafters.com\"", "helpful": [4, 4], "reviewtext": "I bought this Targus CLN5 15.4 Traditional Leather Case through Amazon with Data Vision as the seller. Why did I mention that? Because this case has recently undergone a \"refresh\" as they put it, which means they re-designed it. The newer version, which is what I received from Data Vision, has way more pockets and space than the much older original version. I contacted another large supplier and they in fact had the older version, and were charging more money. You will notice that it is selling for much more from all of the other suppliers. The new one is great.This model, unlike some of the competition is all leather on the outside. Lesser models have leather faces on them, but then they have plastic sides. There is plenty of room for everything in here. I have a 15.4 inch laptop, and I can store the large section of the A/C adapter in the same section. They even have an adjustable dividing flap in that section so it does not touch your laptop. The remaining detachable plug in cord of the adapter goes in the compartmentalized section of the case with all of the other items, like wireless mouse, cable connector for myVantec LapCool 4 LPC-420 Foldable Notebook Cooler with 4-Port Hub (Black)which sits neatly under the laptop since folded up for transport it only takes up .9 inches of space. (9/10ths of one inch) So this case has ample room for my HP 50G-133US laptop as well as the .9 inch cooler sitting underneath. With the velcro secured tie down strap, nothing moves.There are more compartments on the other side as well. The pictures illustrating this case are a mish mosh of both series. The one I received from Data Vision, the newer \"refresh\" version as they call it, is the one you see in photo number 1, the featured photo. If you notice the second picture and other pictures are a different case, the older version. You can easily see the difference because the older one has a long pad on the strap, and the new one has an oval, adjustable one. By visiting Targus's website you can see photos of the new one in its completeness. I would upload those photos, but I think it is smart to leave the mix, since that is what some of the suppliers are selling.This case has a definite luxury about it. They have their top cases going for 4 times as much, but this one really fills the bill nicely; it's executive material without going over the top. Hey for 10 or 15 dollars less than the Data Vision price you can buy an all plastic one.Overall this case is well designed, and comfortable. Highly recommended.", "overall": 5.0, "summary": "It's the Max", "unixReviewTime": 1246320000, "reviewTime": "06 30, 2009"}