{"reviewerID": "A27LYK37L6L37M", "asin": "B00000J3UJ", "reviewerName": "D. Lynn \"Dennis\"", "helpful": [0, 4], "reviewtext": "I travel with my notebook in my backpack. I have had three of these things. You have to read the instructions to set the combination correctly!They all have worked well and they NEVER have changed the combination on me spontaneously!The newer model has the same features but uses AAA bats and not a 9V which the old one used.  It is thiner than the old model also.  I like the blinking red light when ever I arm it.  I run the cable through my zipper on my backpack and leave in strapped to the desk or chair in my hotel room.  It  creates a shrill LOUD alarm (if you set it for this feature) when the unit is moved.  There are two sensitivities.  You can set it to only alarm if the cable is cut.  Yes you can cut the cable with a good set of wire cutters...so it would not stop anyone determined to take your notebook from you and had strong intentions to do so.  It will stop someone from just grabbing it and trying to run.I also really like the little gadget in the photo...(lower right hand corner of photo) it fits into the security hole of my notebook very snugly.  The cable of the Defcon can go through the hole of this gadget and you can just lay it next to your notebook and it will start to \"scream\" as soon as the notebook is moved (it does give you a ~15 second warning before \"screaming\" with a loud CHIRP sound, so you can disarm it.  Go to Targus website and check it out.  I don't work for them.  I do believe they sell a quality little alarm.  It is not Fort Knox,  it is a lot better than nothing.  Blinking light and siren deters the common dumb criminal (not on drugs or really crazy)from taking your computer.  It's should be just one of a series of methods you have to secure your notebook, not the only one.It's nice for travel.  You can even hang the thing on a door knob and know if someone opens the door.  It's a motion alarm with a blinking red light.  The number of blinks tells you how it is armed. I recommend it.", "overall": 5.0, "summary": "There is a newer model than the one in the photo: It's Great!", "unixReviewTime": 1214784000, "reviewTime": "06 30, 2008"}