{"reviewerID": "AQT8N7YPGVWCM", "asin": "B00000J3UJ", "reviewerName": "Jamal", "helpful": [0, 0], "reviewtext": "Wow. I am enraged right now at this godforsaken POS laptop \"lock\". Let me set the scene:I go into the library for a nice, long afternoon of studying. I don't feel comfortable leaving my laptop on the table whenever I go to the bathroom, so I bring this Targus Defcon CL along to secure my computer for whenever I'm not at the table. I connect it and get on with my studying. Come dinnertime, I feel it's time to go, so I put the combo in the lock and IT WON'T UNLOCK. WTF.I am getting frantic, thinking maybe I've gone insane and forgot the combo (which would be impossible since it's the digits of my freaking date of birth). Desperate, I Google \"Targus Defcon CL won't open\". Lo and behold, this exact same thing has happened to hundreds of other people!! The Amazon reviews alone are almost all about how the combo will randomly change on you! Now I'm trippin out, so I start Googling a way to open the piece of crap up without the combo. Luckily, engagdet.com did an article a few years ago about how easy it is to cut the cable or to decipher the combination of these things.I drive home to grab a strong set of wire cutters, and come back to cut the cable. Takes me about 10 minutes to cut through, with a 7\" wire cutter (something a person can have in their pocket while you're away from your comp, spend 10 min, and be off with your laptop in their hands). Unfortunately, during that 10 min duration, someone reports me to the librarian because they think I'm trying to steal a laptop. I have to log in to the computer to prove that it's mine. Slightly embarrassing, but even he thought it was hilarious that the lock not only messed up my combo, but was pretty easy to cut through.SO, to recap, the reasons this is the WORST PRODUCT I HAVE EVER PURCHASED:1) IT WILL RANDOMLY CHANGE THE COMBO. THIS HAS HAPPENED IN MORE CASES THAN NOT (Google it).2) The cable literally takes 5-10 minutes with a mediocre set of cutters to get through. Anyone can take your laptop if you are off in the bathroom or something for a bit.", "overall": 1.0, "summary": "The worst product I have ever purchased in my life. Straight up.", "unixReviewTime": 1296086400, "reviewTime": "01 27, 2011"}