{"reviewerID": "A36NE7OSWUC5KS", "asin": "B00000J40X", "reviewerName": "Darwin \"Computer consultant\"", "helpful": [6, 6], "reviewtext": "I've had my SPIII for about two years now, during which the pricing has come down some and the package offerings have increased, so this review may not match the exact contents Amazon offers here. My unit came with a 32MB memory cartidge, the serial port connection cord, the USB programmer cord, the 12V power cord for the cigarette lighter, the &quot;sticky&quot; dash mount, and a MapSource CD with codes to unlock one region (the US and Canada consisted of 5-6 regions, IIRC). I have since bought the beanbag dash mount and a 128MB card and purchased the &quot;unlock all regions&quot; option for City Navigator--probably already included items for a new purchase in today's package. Additionally, I downloaded the &quot;British&quot; voice package from Garmin's website to replace the default &quot;American&quot; voice--the British lady's voice seems less harsh and less like a drill sergeant when giving directions!I love this unit because it makes navigation so easy--isn't that the idea behind a GPSR? With the CityNav map information loaded into the memory card (and with 128MB it fits all of PA, DE, MD, and D.C. and good chunks of WV, OH, NY, and NJ) I am able to get turn-by-turn directions to nearly any street address. If you ask it to route you to a given destination, the unit actually tells you when a turn is coming up, e.g. &quot;In point two miles exit right,&quot; or &quot;In 500 feet turn left.&quot; If you are driving without a destination selected, the unit will display the cross streets by name as you approach. You can zoom the map in for street detail or zoom out to see more of the countryside. If you have a destination selected, the unit will zoom in automatically as you approach and zoom in even more for a detailed overview of approaching intersections as you near a turn.If you are in an area for which you do not have the MapSource detail loaded, the unit still has an internal base map that contains cities, highways, interstates, and major bodies of water, so it can still route you from city to city using the major roads. This makes driving long distances cross-country feasible and you can load up the memory card with the areas you expect to spend most of your time in if you don't have enough memory for the entire route.However, in those areas for which you do have the map detail loaded you can get turn-by-turn directions to an address or even select various destinations (restaurants, attractions, banks, shopping centers, etc.) listed by name and/or distance. The unit also displays address and phone information for those destinations, which is useful to call ahead and make reservations or check for vacancy if you're the spontaneous weekend tourist like I am.The 16-color display is beautiful--major routes are in red, arterials in thick black, minor streets in thin black, rivers and lakes in blue, parks and golf courses in green, and the background will change at sunset or sunrise to yellow (daylight) or black (night) as appropriate (the black streets will also switch to white at night).Please note that the map detail, which includes streets and popular destinations, is a feature of the map software, not the unit itself. Garmin seems to issue updated map software on an annual basis, but you must pay for those updates. I'm still using CityNav 4.1, although Garmin's website states that 6.0 is coming out this summer. The new 6.0 software will probably contain more business listings and reflect more recent road construction, but I'm doing fine with 4.1 and don't see a need yet to pay for the upgrade. One reviewer complained about the lack of Starbucks locations with his map, and I expect Garmin will be adding more and more types of businesses like that as time goes by.Enough babbling--in summary, here are some pros of this unit:o Cheaper than most in-dash GPS systemso Portable, so you can share the unit with your &quot;fleet&quot; or take it along in a rental car (and you'd best hide it or take it with you when parking so it doesn't get stolen)o Voice navigation, so you can anticipate an upcoming turn without having to take your eyes off the roado Color display--so much better than a gray scale map!o Accurate and helpful when driving somewhere unfamiliaro Automatic route recalculation if you miss a turn or have to detouro Address and phone info for listed businesses/sites so you can call aheadAnd the cons I've experienced:o Voice navigation could be somewhat improved for confusing intersections--do I take a right or sharp right at this five-way?o Eats batteries--but this unit is too bulky to walk around with, so there is no reason it should ever be used without being plugged into your cigarette lighter.o Awkward interface--entering street names or address numbers is awkward with the rocker buttono Loses signal in built-up areas with tall buildings--usually when you are downtown and *really* need directions the most, unfortunately! However, this is a problem with all GPS receivers and due more to the nature of the GPS system than the unit itself.All in all, I love my SPIII. It has all the features I really need. There are units out there that are newer, have more features, and may be easier to use, but they're also more expensive. As long as Garmin keeps releasing updated map software compatible with the SPIII, this unit should serve my needs for many more years.", "overall": 4.0, "summary": "Great GPSR for driving anywhere!", "unixReviewTime": 1090454400, "reviewTime": "07 22, 2004"}