{"reviewerID": "A2IY49V4ARN4HC", "asin": "B00000J40X", "reviewerName": "K. Parry", "helpful": [6, 6], "reviewtext": "Please allow me to preface this review with the fact that I have absolutely no sense of direction.  For those with excellent sense of direction, this may seem like an extravagant purchase until they come down in cost.I had to travel to California recently (I only lived there my whole life before 1999), but since I had never driven in California before, I was quite nervous about doing so.  The rental car had a GPS very similar to the Street Pilot, and using that gave me a great sense of confidence in driving around.Shortly after my return I realized how badly we needed a GPS in our car.  The Street Pilot was the best option for us because it has all the features of a factory-installed auto GPS, but the added convenience of being portable- now when I head out of town I can take the Street Pilot rather than having to rent a car with a GPS.  Not to mention the Street Pilot is about 1/2 to 1/3 of the cost of a factory-installed system.Some of the other reviewers have complained about how long it takes the Street Pilot to recalculate a route once the vehicle has gone off-route.  I have intentionally gone off-route several times just to see how it performs, and I have been very pleased.  It does take a few seconds, but from my experience it did not take so long that I got any further off-course than I already was.A feature that I found to be very helpful in the Street Pilot which was not in the rental car's GPS is a search by company name.  If you're looking for a department store, but you can't remember its address, just search by the name, and the Street Pilot will navigate you to the closest one. If you're looking for that great Chinese restaurant a couple of miles away, but you can't remember the name, you can search for Chinese restaurants in your area and find the correct one based on its address.  Want to order ahead, or put your name on the seating list?  Once the Street Pilot finds the restaurant you're looking for, it displays their phone number on the monitor as well.About the only two complaints I have about the Street Pilot are very trivial.  On the rental car I used, the GPS would automatically lower the volume on the stereo when the GPS needed to announce an instruction.  Being an external unit, the Street Pilot does not have this luxury.  Since I tend to listen to music, well, at ear-splitting volume while driving, it does take a little getting used to lowering the volume when using the Street Pilot around town, but again, this is a very minor complaint given all of the positive features the Street Pilot has.My other complaint is that occasionally it does give directions which are not the most direct route.  I used this on a trial basis in areas I was familiar with just to see how it performs, and I did find myself thinking on occasion \"why is it telling me to go this way, when that way is much more direct?\"  Especially since I live within a half an hour of Garmin's world headquarters, it would seem to me that they would at least know the most direct routes around here!  But even at this, the Street Pilot DOES get you to the correct destination every time, even if it sometimes takes an indirect route.I noticed that the package includes both a beanbag mount and a permanent dashboard mount for the Street Pilot.  Since Street Pilots have a way of being swiped, my suggestion would be to always use the beanbag mount, since a permanent mount could cause thieves to break into the car to find the GPS that is no longer in the car.  I drive a new Jetta, and I did not want to get sticky stuff all over my dashboard, so I chose to try out the beanbag.  It does not slip, even when making sharp turns.  I suppose if I were in a collision this would not be the case, but in normal driving, the beanbag is great.Of course, as others have advised, do not leave your Street Pilot in the car unattended for any reason.  But given the fact that you're going to be spending around $1G for this puppy you probably already knew that.And one other safety feature that I think is great, but others might be annoyed by it: once you are driving, you cannot change the destination; it goes into a secure mode.  To change the address, you need to stop the car.  This may be a nuisance to some, but given how badly people drive while talking on cell phones, it's probably best that Garmin tries to curb people from pressing all sorts of buttons on their GPS while zipping down the road at 75 MPH.", "overall": 5.0, "summary": "Expensive, but a VERY worthwile investment!", "unixReviewTime": 1052438400, "reviewTime": "05 9, 2003"}