{"reviewerID": "A3SMN4GQEQBCJ5", "asin": "B00000J434", "reviewerName": "C. Farmer", "helpful": [1, 1], "reviewtext": "After recently purchasing a new Palm Vx, I thought it would be a good idea to invest in a better form of protection than the included leatherette flap. The Palm V hard case is about the only sleek option that there is at the moment.The case attaches to the Palm V via the left stylus storage area. A stylus shaped piece attaches the Palm to the hinge in the case. The case itself opens like a book and allows the Palm to move much like a page in the book. Located behind the Palm on the inside of the case is an area to store a business card or other small piece of paper. The case comes together nicely and has a cut out for the IR port as well as the right stylus.Pros:1) Protects as advertised. The point of a hard case should be adequate protection first of all, and this case delivers as advertised. The aluminum reinforced plastic shell hugs the Palm V tightly and securely.2) Allows for IR port usage while resting in case.3) Case does not allow for you to accidentally turn the unit on while in your pocketCons:1) Heavy: One of the selling points for the Palm V series is the sleek, lightweight design. While this case may not seem like too much additional weight, the combination of the Palm V in the case is noticeably heavier. In fact my wife's Palm III and my Palm V weigh about the same now.2) Obstructive: hot sync is really only accomplished by taking the unit out of the case due to the girth of the case itself. A friend of mine who has a keyboard tried to rest the unit on the keyboard and found the case too cumbersome for this purpose as well.3) Hand holding the unit is more difficult. With the included leather flap, you are able to fold it behind the unit to easily hold the Palm in one hand. The hard case does not fold back on itself, which means there is a much larger surface area to support while using the Palm. This is especially annoying for me since I use my Palm frequently while standing or walking here and there.4) ...Overall, I think the hard case is best suited for someone who is looking to provide the best protection for his or her Palm in the smallest package. You will have to decide if the increased weight and obtrusiveness of the case is worth the added protection it offers. At this time, I am still using the case, but I anticipate going back to the default leather flap in the future when I grow tired of the Cons listed above.Thanks for your time...", "overall": 3.0, "summary": "Good protection comes with a trade off", "unixReviewTime": 1009670400, "reviewTime": "12 30, 2001"}