{"reviewerID": "A3W112102BC6BG", "asin": "B00000J434", "reviewerName": "J. Lara", "helpful": [2, 2], "reviewtext": "I initially bought the Special Edition one but since i loved that so much i went out and bought the silver one as well. Now i rotate my cases. The only difference of the silver case and the blue special edition case other than color is the logo in the front. The blue one has the circular palm logo while the silver one has the dotted \"P\" logo of palm, like the one that you see whenever you reset the unit. I first bought the slim leather case for my Vx and after i used it for about 2 months, i became quite dissatified with it. One of the reasons why i was not happy with the slim case was because it made the whole Vx a lot bigger then it really is. Also after a few months the leather case had a few noticable scratches. It also began to warp. I decided to find an alternative. After much thought i decided to get the hard case for the Vx.  At first i was discouraged that i had to remove the case every time i hotsynced. However after heeding the suggestions of many others i found that proping it up on a book or a bunch of cd cases actually works well. I dont think there is any other case that allows you to sync that easy without removing the case. In that aspect i dont think there is a better case. However i discover that you have to insert the unit properly for the case to open and stay closed right. If you dont push the case far enough into the silo it really wont work right. If you insert the unit properly it opens and closes brilliantly.The spring loaded feature of the case is probably its best feature. When opening and closing the case it is very noticable that there is more tension opening the case then there is closing. In that aspect there is really no other case out there at offers that.One thing that i disliked about the slim leather case was that often times the buttons were accidentally pressed. whether it was the application buttons or the power button, it often got pressed even with the leather case firmly closed. That was not the case for the hard case. Although the contrast button was pressed occationally pressed, its extremely rare.Also with the hard case firmly shut, the unit is allowed to move a little, just enough to allow some impact to be absorbed when you accidentally bump or drop it.Finally and more importantly the case is one of very few that actually protects the unit, looks good and maintains the shape and sleekness of the Vx. It adds virtually nothing to the overall size of the Vx. Its BEAUTIFUL...I just hope that it will fit the m505 when i go get that! :-)", "overall": 5.0, "summary": "The best overall case for the V series", "unixReviewTime": 990316800, "reviewTime": "05 20, 2001"}