{"reviewerID": "A1AQ8LQW5QQSTD", "asin": "B00000J434", "reviewerName": "Lynn B. \"alceria\"", "helpful": [5, 5], "reviewtext": "When I saw pictures of this, I expected this to be a substantial case.  Since it's called a hard case, I expected it, well, to be HARD.  But it's not.  It's plastic with a thin metal cover on the front and back that look more like they are there for fashion than funciton.  The metal sides will give if you try to bend it.  Also, I think the closing mechanism is terrible.  You have to get the Palm in there just right for it to close completely and even then, it's not a tight seal.  And usually when it's put in this way, the top of the case will hit the contrast button and you'll have to keep fixing it so you can view the screen. It does not snap together, which annoys me.  While the case itself may not stay shut, the Palm *is* securely held in the case, which is one good thing about this case. It has a holder similair to the stylus, so you just slide it in one of your stylus slots.  I prefer this way of attaching the Palm, rather than some other cases which use Velcro.  I'm not going to trust velcro with something that is as expensive as a palm.I totally don't think it's worth the money, but at the same time, having good protection for your Palm is an absolute necessity, so I actually DO recommend that you get this product.  My Palm has taken several tumbles and it's no worse for the wear.  I've had my Palm and case for about two weeks now, and there's already quite a few scratches on the metal casing.  So it does protect it.  But if you are expecting this case to be really nicely made and substantial, guess again.  It will however offer some protection to your PDA.I think Palm could and should be making a better product.  Our Palms cost us a bundle and we want to protect them.  It's almost like the people at Palm want our PDA's to break so they can sell us more.  I don't see why there's so much emphasis on making the cases as small as possible.  I'd rather see a slightly bulkier, yet streamlined case that not only securely held the Palm, but had about a quarter inch of foam padding on the inside to protect the unit from damage, and then a true metal casing on the outside.  Even with some extra padding and bulk, the case would still be tiny.", "overall": 3.0, "summary": "Overpriced But Necessary", "unixReviewTime": 973987200, "reviewTime": "11 12, 2000"}