{"reviewerID": "AGVB3UZIPFHEF", "asin": "B00000J434", "reviewerName": "Sheldon", "helpful": [135, 138], "reviewtext": "The Palm Hard Case will keep your Palm V protected, without adding much to it's size or weight.  Since I have the Slim Leather Case, and tried the RhinoSkin case, I'll try to address some of the complaints others have  posted.It's only plastic -- True, but the outer metal shield adds quite  a bit of protection.The spring is weak -- Part of the problem with using  the Palm V hard case is installing your Palm.  If the rail is not centered  in the stylus holder, either the front or the back of the case will not  close properly, giving the impression that the springs are weak.  True,  they could be stronger, but if you use your Palm a lot you want it to open  easily.  There is a line and a flat side on the rail to help you center it.  It may take a few tries, but keep at it.You have to remove your Palm to  use the HotSync cradle -- Not true.  Just move the cradle to the edge of  the table or desk and let the case hang over the edge.  Just be careful you  don't knock it off the desk accidently.  Others have suggested placing a  book under the cradle.  Either works fine.Let's face it.  You bought  your Palm V because of it's size, and you probably use it a lot.  If so,  this is your best option when it comes to cases.  Pretty good protection,  easy to carry (very slim and trim), and easy to open and close.  This case  also solves the problem of your Palm turning itself on accidently, a  problem with the leather cases and covers, although the leather cases are  far more elegant and sumptuous.  Also, because this case does not press on  the scroll button, if you forget to turn off your Palm, and close the case,  your Palm will will turn itself off and not run down the battery.The  RhinoSkin case does offer better protection, however I did not feel it was  worth the money (See my review).", "overall": 4.0, "summary": "Your Best Option", "unixReviewTime": 960508800, "reviewTime": "06 9, 2000"}