{"reviewerID": "A204ETWOV23HO4", "asin": "B00000J4CX", "reviewerName": "David J. Huber \"Addicted to books!\"", "helpful": [4, 4], "reviewtext": "I love these cases, and have a few of them, and will get more.  No real complaints with them - sure reduced the amount of shelf space my DVDs required, and allows me to organize by genre.  The sleeves are held in a 3-ring binder, so they can be pulled out and re-arranged, too, so if you like to keep your DVDs alphabetically, you can pop a new CD into the stream without having to move every DVD like one would have to with the stupid other caselogic cases that don't have removable pages.  The material is strong adn well made.  I very much like the leather look and feel of the case, and they look sharp on the shelf.  The zippers are strong and well formed, the rivets are good, the binder material is sturdy. These babies will last for a good long time.My only complaint with this case - and also the 10 DVD holder from caselogic - is that they really don't hold that many without bulging or overpacking. I figure the 20 DVD holder averages about 18 discs, and the 10 holder gets 8 or 9.  Figure it this way - I have 8 of these holders. One holder when I bought it was missing 5 sleeves.  But even though I started 5 sleeves less I should have, it doesn't matter, becuase after filling all the holders to their capacity, I have about 20 sleeves left over that I can't use, becuase the case holders aren't big enough to hold as many DVDs as they say.The other caveat is that they have no place in which to put a label to let you know what's inside them.  I thought of putting stickers onthem, but realized that open and closing them would eventually force the stickers to come undone, and look ugly. So what I did, and I recommend this to you, is to make small cardstock labels with the contents of the case (I sort mine by genre, so mine say \"Action\" or \"Science fiction\", and each genre has it's own color scheme, etc. I did not put the movie names on the labels, cuz one never knows when one will need to move a movie to another case to make room for another, eh?), and then tied some string to them and put the string through the hole in the zipper handle. This system works wonderfully, and if you make really nice cards for them, they look good, too.For those two reasons, I only give these 4 stars.Those caveats aside, these are wonderful - the sleeves have room to put the front page or other amterials from the DVD, space for the disc itself (they can even fit 2 DVDs in them, for those double DVD sets like Star Wars).  They reduced my shelving needs by about 80%, and for that, it's worth the cost,... And it's way easier to carry 20 DVDs in one package, then 20 plastic DVD containers.Buy these, get your life in order, and open some space in your house.", "overall": 4.0, "summary": "Fantastic! Though not quite as spacy as it says", "unixReviewTime": 1041897600, "reviewTime": "01 7, 2003"}