{"reviewerID": "A1FVN80HHHR3RA", "asin": "B00000J4EY", "reviewerName": "P. Killion", "helpful": [2, 2], "reviewtext": "Well since most reviews have gone into the specifics of this device, I won't delve too deeply into those aspects. However, very rarely did I see any mention of how cheap of a device this is; the plastic feels of very low grade, the reset button litterally rattles it's so loose. Overall, yes the device works, so I won't knock it for that; unfortunately I have no means of testing the actual surge-protection, but I just have to hope that they used better quality electronic components then they used for the case build.Pros of the device:-----------------------+Smart circle design; obviously the main advantage of this is taht you are no longer limited by annoying power bricks taking up/blocking outlets. For that it works great.+Cute design; it looks slightly better than a normal surge protector with its circle form factor and brightly color coded outlets; however, the design is slightly hindered by how cheap the materials are, and looks less cute in person.+Long cord; 16ft is pretty long, so make sure you need that long of a cord, since the average cord length is around 6-8ft for a surge protector. Still for my application, a long cord is a plus (since I needed at least a 12ft cord).Cons:----------Really bad build quality; again, just super cheap plastic, and the reset button is really wobbly, barely feels like it's held on. The cord seems of decent gauge/insulation at least, and the device has some heft so it may just be cheap on the exterior.-No swivel outlet; for the cost of this device, it really should come with a swivel outlet connection, so if your outlet is upside-down (connected to a light switch) or you need it to go to the right of the socket, the cord will be tweaked in the wrong direction. I have no problems with cheap protectors not having a rotating outlet, but on something that costs almost $40 it really should have included it.Summary:-------Look, if we're rating the device on whether it provides power or not, of course it works, and should get 5 stars. The circle design is also very nice, and again worthy of some stars. But with how poor the build quality is on this (and this was ordered from Amazon directly, not 3rd party), and the fact that they didn't even throw in nicer features like a swivel socket for how pricey this retails for, I can't give this a fantastic rating (but will still give it an OK rating as it does in fact work, but that alone doesn't deserve 5 stars). I purchased the device on a Cyber-Monday sale, and even at the significantly-reducted price I'm still debating on if I should keep it or not. I have several surge protectors from all sorts of brands, and as such I'm somewhat disappointed with what should have been a nicer protector feeling and looking so cheap. I'd say for a sale price it might be worth it, or if you're really looking for a longer cord surge protector it might be worth it (although I have several longer-cord protectors that didn't cost near this much), but I've purchased much better protectors at even better prices when they go on sale.", "overall": 3.0, "summary": "Poor build-quality, but otherwise it does what it should", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}