{"reviewerID": "AT2J7H5TRZM8Z", "asin": "B00000J4FS", "reviewerName": "A Customer", "helpful": [12, 13], "reviewtext": "I am the very satisfied owner of the Palm V connected organizer. I had long wanted a hand held organizer, one that would have both computer interchangeable abilities and one that would be able to perform different applications. Christmas day was a happy one for me last year, not only because of the brimming smiles on my children's faces; but because that is when I received the Palm V as a gift from my Santa (my wife!).After giving the product and it's instructions a look over, within moments I was on my way and began the charging procedures necessary prior to it's use. This was my only initial disappointment, having to wait for the initial charging that takes 4 hrs. I couldn't wait to tinker with my new toy, and it was a bit annoying. After completing the charge up, I installed the cd that came with the product to familiarize myself with it. The cd is both quite informative and very easy to follow. Then I was ready to begin to learn about my new toy.Looks can be deceiving when it comes to the appearance of the Palm V. In viewing the device, with it's ultra sleek, thin design; one might come to the conclusion it could be nothing more than your basic address/date book. This little &quot;power packer&quot; (as I like to call it) is simply amazing!The applications that can be utilized with the Palm V as well as the storage capacities are as follows:1) Address book: that holds up to 6000 addresses2) Appointment record: that records up to 3000 appointments3) E-mail functioning: that can receive up to 200 e-mail messages4) Memo pad: that can hold up to 1500 memos5) To Do List: that records up to 1500 to-do items6) Expense Reports7) Games8) Security9) Calculator(All storage figures are approximate, and flexible according to the overall storage capacity of 2 MB)The Palm V also comes complete with the necessary software to facilitate all functions on the organizer. Other items that came with my Palm V were the synchronizing cradle &amp; battery recharger, the handbook, an adapter, a protective cover, and one metal stylus and a spare plastic one.While the Palm V comes to you with all the pre-programming stated in my epinion, it also has the capability of being able to receive downloads from the internet to expand its functions, or to simply download games to play on this hand held device.The ease of operation of the Palm V is remarkable. On it's face are are 5 buttons on the metal frame and an area on screen with 4 buttons (to be used with the stylus), as well as an area for information input or free hand graffiti writing. All of these help the user quickly and efficiently operate the Palm V to expedite the tasks at hand. The device also has a back light that can come in rather handy.Input of information into the Palm V can be done in a number of ways. One can access the keyboard on the device, or use special graffiti free hand writing to input the desired material. The device may also be directly hooked up to your PC and the information typed in with your computer's keyboard.The greatest thing about the Palm V is the ability to transfer data between the device and your computer. The ability to be able to access e-mail, download information from the internet or your computer, for me is a God send; and in my opinion nothing sort of revolutionary! To process the transference of information, the Palm V needs to be placed into the HotSync cradle. Then the user just presses the HotSync button on the device to perform the HotSync operation. It proves to be completely user friendly as far as the exchange between the organizer and the computer.Maintaining your organizer requires as little as a few minutes charging a day of the Palm V, by placing it in its cradle. No need to buy batteries, it is self contained with a Lithium ion rechargeable battery. It is so small in size and weighs a mere 4 ounces, it easily is carried in a coat pocket; both comfortably and unnoticed.My main use for the Palm V is during my business hours. It is always on my person, for me to access at a moment's notice, to jot down things I need to remember (which are many with my bad recall). Whether it be to record an appointment that I have just confirmed with a client, or a note to myself; the Palm V has become an invaluable device; one that has proven to make my day much more pleasant and hassle free. No more need to run to a desk for a paper or pen, or to ask my callers to hold on; I am always ready with my Palm V on hand.If you do not have any prior experience with a hand held organizer of this kind, and always thought about purchasing one, I would highly recommend the Palm V. Once you have had a device like this, you will never want to be without one. Just like all the modern luxuries in life, what you don't have you do without and don't miss; but what you've had and have no longer, is greatly missed and still desired for easier living. Thank you Palm V for making my life, just a little bit easier!", "overall": 5.0, "summary": "The Palm V connected organizer: Put your mind at ease", "unixReviewTime": 1005004800, "reviewTime": "11 6, 2001"}