{"reviewerID": "AV27WAAYOTH0U", "asin": "B00000J4FS", "reviewerName": "Brian Dobben \"engineering manager\"", "helpful": [132, 134], "reviewtext": "I've had my Palm V since June 1st. To my brother, wife &amp; parents who conspired for my birthday: THANK YOU!!!!!  Within two weeks I abandoned my Franklin Planner, and regretted not having had a Palm device 15 years ago.  OK, that was impossible - but it has dramatically changed my life for the  better, and I can't imagine ever going without it. In the last several  months I have grown to be a very definite power user, and the corporate  resource person for Palm-platform PDA's. Our guys have tried several others  and are convinced that the Palm platform is the best and most flexible.  I  am very heavily into 3rd-party software evaluation (&amp; some  accessories), preparing recommendations for high-efficiency Palm  device/software packages for company-staff issue. Eventually I may put  together my own personal web-site, and post some evaluations and  recommendations for software/accessories for Palm users.Having said all  that, here's an engineer's (my)perspective on the Palm V: Visors will be  great, and Palm IIIx's are just fine, but the Palm V package size is  definitely worth a lot to me. Forget the sexy appearance - it's great, but  the superior Form Factor rules. Yes, I would prefer that the Vx cost is  about what the standard V discounts for now, but since it will ALWAYS fit  in my shirt pocket (without changing my shirt wardrobe) I ALWAYS have it  with me (in a place that's probably least susceptible to being damaged or  lost) - and that's what it's for. Though I prefer to use the slim padded  3COM case, I frequently slip the original leather flap-cover on for small  shirt pockets, &amp; thus can still carry a separate pen/pencil/stylus  device. A big plus with those covers that I've never seen in a review: the  soft \"grabby\" texture of the rubber-like spine flex keeps the Palm from  sliding, even if you do toe-touches. Ta-dah... it doesn't fall out on the  floor!!!!  (Very big benefit since the cover isn't a padded case.)Likes:  I like being able to keep synced with both my office laptop and my home  desktop (with the included MS Outlook Conduit)... autocharging in the docking  cradle... a battery that's never gotten below a half-charge... nice screen...  the size.  I really like the unit overall - a truly great device.Any  problems? Yep. I did have to get the updated e-mail patch from the Chapura  site to avoid some lock-ups when synching e-mail.  Also, I highly recommend  TealScript (the custom-tailorable graffitti add-on) for it's ability to  help you tune up your handwriting speed/recognition - and it visually  showed up a mysterious problem with the screen occasionally screwing up  handwriting by adding a horizontal line: 3-COM quickly replaced it under  warranty, and it's been fine.Memory space? The average user probably  will have no problem for a couple of years - I've met people with III's  that are using less than 1k... a year after they get it: they've seen &amp;  use very few aftermarket programs. However, I've got more programs in there  than will fit: launcher, datebook, calc &amp; memo replacements, travel  programs, doc reader, picture viewer, several clocks, a dozen utility and  security programs, over a dozen Hackmaster hacks, and a few games. Since  FlashPro gave me the extra 800k memory room (awesome), I found I probably  had enough that I could otherwise get by fine without deleting rarely-used  fluff programs - except that I use it heavily for work &amp; software  evaluation. The memory room of the Vx would be heaven - the perfect device,  I think. It'd be handy to carry a lot of maps, but my current standard P5  doesn't have the memory room without deleting, say, my picture viewer. (Oh,  the screen? It's great! Yes folks, it IS a 16 greyscale display!) Probably  I'll upgrade to the Vx &amp; give my wife my standard V (P5) unit: she  thought it was no big deal when I got it, but has fallen in love with the  capabilities and wants her own Palm device. Bottom line is that if you're a  minimalist, the 2k of P5 memory is fine. But if you like to carry a  Gerber/Leatherman/Swiss-Army device (like I do) because a pocketknife  leaves you unprepared... better get a Vx or get the 8mb upgrade on your  P5.Price? When Handspring comes out with something to compete with a Vx,  the price world will probably be great. Yeh, P5's are expensive compared to  some of the lesser PDA's - but compare the price to a palmtop computer, and  they look like a great deal... especially considering the impact on your  lifestyle.Can I mention my essential add-on programs list? Tough area,  but currently I wouldn't give up these - listed in order of descending  requirement: UnDupe (get it!), TealScript, Travel Clock, Hackmaster,  (SwitchHack, StayOffHack, PalmV hack, Invert Hack &amp; Invert, FindHack,  CatHack), DateBK3 (&amp; dbScan), BackupBuddy, IDPalm, FlashPro, a good  launcher - either Commander or LaunchEm have too many great enhancements to  do without. Must-have accessories: WriteRight screen covers, Throttle  Stylus/pen. I regard the PalmV hack and StayOff hack as absolute essentials  for Palm V users, and Invert with InvertHack give proper screen display  when the backlight's on.  In-depth info?  O'Reilly's \"Palmpilot: The  Ultimate Guide\" is a fantastic reference for ALL Palm owners.", "overall": 4.0, "summary": "Awesome product, but larger memory of the Palm Vx is welcome", "unixReviewTime": 939513600, "reviewTime": "10 10, 1999"}