{"reviewerID": "A3KKOBGO2ZQY3P", "asin": "B00000J4FS", "reviewerName": "Ernest Kim \"An Average Joe\"", "helpful": [35, 36], "reviewtext": "Using my Palm V always makes me smile because it is about as close to perfect as any electronic device I've ever used.If anyone is on the borderline, not sure if a PDA is for them, this device will not disappoint.  It does everything that you'd want it to do, does it well, and does it  quickly.  Plus the ability to sync the Palm V with your computer's PIM  (inc. Microsoft Outlook) makes importing and exporting contacts a  breeze.If you're not sure about the Graffiti writing system, I can tell  you that it's a very easy to learn.  Five minutes worth of practicing and  you'll have it down (it's very, very close to the normal alphabet).  After  a few days you'll have it completely memorized (the Palm folks also include  a handy &quot;cheat sheet&quot; sticker that you can stick to the inside of  the cover that's included with the Palm V).As someone who bought an  Apple Newton MessagePad (and lived though that debacle) I can say from  experience that the Palm is not a product that only a geek can love.  Anyone who is busy and wants to be able to keep track of contacts and  appointments will find this device invaluable and I sincerely mean that.  Once you have one you will not want to be without it, and it sure beats  hauling a fat old paper based organizer around.Some quick notes; the  Palm V Hard Case rocks!  If you travel a lot make sure to get one.  It  keeps the Palm V completely safe from harm and looks beautiful.  Also, with  the upgrade to Palm OS 3.3, you'll be able to sync your Palm with any  laptop with an infrared port without the need for any cables.  This is  very, very cool and very useful for road warriors (one caveat here, the IR  sync does not yet work on Windows2000 based systems).Hope this helps!", "overall": 5.0, "summary": "An Incredible Combo of Form and Function...", "unixReviewTime": 957398400, "reviewTime": "05 4, 2000"}