{"reviewerID": "A2E2I580OO3HET", "asin": "B00000J4FS", "reviewerName": "M. Broderick \"mikebinok\"", "helpful": [7, 7], "reviewtext": "My Palm V was wonderful, and I replaced it immediately when it was stolen--Probably the best argument that I really got good value from it!  I had not used any form of portable computer, PDA, or similar device before,  but after just a few months I found mine indispensible.  I chose the Palm V  over the other Palms, and over any Windows-based system because of the  sliim profile. I can put it in the front pocket of my slacks and it is not  obtrusive. The usefulness of the built-in functions for keeping to-do  lists, addresses, and calendars is obvious.  Less obvious is using all the  downloadable software available on the internet--Often for free, but more  often at a modest price, at least for the really useful stuff. I use the  calendar book function in a way I suspect the designers didn't intend--I  enter reminders to myself for a set date and time, so my alarm will go off  and the Palm will display a message such as &quot;Call Norman now.&quot;  I  also find the Search function very useful.  If I remember that I dealt with  Norman, but have forgotten his phone number or last name, I can have the  Palm search for &quot;Norman&quot; and display his name and address  (assuming I entered it when I first talked to him) as well as any notes or  memos I wrote about our discussion. You can do this for any word or name,  so if I remember discussing widgets with a guy, but have forgotten his name  or phone or company, I can search for &quot;widgets&quot; and again  everything I've entered on the subject will be available.  In fairness, I  have to say that if you don't have a fairly busy life, you may not have  much use for it, but if your life is a busy one, I predict you will find  the Palm V (or Palm Vx) invaluable. This includes people who aren't  &quot;high-powered executives.&quot;  Stressed--out students or overwhelmed  homemakers will find it useful.", "overall": 5.0, "summary": "Invaluable for busy people", "unixReviewTime": 961286400, "reviewTime": "06 18, 2000"}