{"reviewerID": "A1SAQB40R8C44A", "asin": "B00000J4FS", "reviewerName": "Phil W.", "helpful": [26, 32], "reviewtext": "I owned a Palm III for a while when it came out, and then stepped up to the V after about a year with my III. What can I say? I was allured by its sexiness and general asthetic appeal.I have now relied on it for about a  year for all my organizing needs. I have used every part of the Palm  Software suite except the expense reporting feature.While I like the  Palm V's style, I have become more and more disappointed by its features  and memory issues.Features: lacks decent sound for starters, a beep is  boring and weak. When I carry the Palm in its home (my pocket) I cannot  hear the alarm tones even with volume maxed! The screen is a mixed bag.  While its clarity is better than other organizers, it is very hard to read  in slightly dim areas because the backlighting leaves a lot to be desired.  Battery power is okay, but not anywhere near the advertised time of 30  days.Memory is a whole different issue. All I have on my palm is some  1500 addresses and 1000 calendar entries and it tells me I am half full, as  you know they advertise a lot more capacity. I don' use but a couple of  aftermarket programs.The Graffiti recognizer is crap. When it works it  puts the wrong letters on the screen. Real users need to get Jot! from  CiC.Palm, Inc.'s tech support is the WORST! Most of their support staff  can hardly speak English; so imagine them trying to explain a highly  technical issue! Whats more, they don't even care. I was pormised a return  call - had to call back. I have not once ever received a real response by  email - only autoresponders that say &quot;24-48 hours&quot; - still  waiting on my inquiry from January!In short, save a little longer and  get the Cassiopeia E-115 (when it comes out). In my experiences with  head-to-head comparrisons of Cassiopeia E-105s to my Palm V, the Cassio was  a true frontrunner! The E-115 will certainly be even better! If you need a  great datebook and address book to keep you straight and don't need sound,  memory, genuine Word Processing, or Spreadsheet, or color screen then GO  WITH THE PALM V!  But if you need features and real performance, get a  Windows CE Device.", "overall": 3.0, "summary": "Efficient Organizer; but low on features and memory", "unixReviewTime": 958176000, "reviewTime": "05 13, 2000"}