{"reviewerID": "A1KL1YVYYMQE2E", "asin": "B00000J4GE", "reviewerName": "W. Moncure", "helpful": [1, 1], "reviewtext": "Memorex is a brand name that does offer excellent product support, and certainly this product is excellent for two reasons. First, because it's easy to use. Cover art from CD's that have missing artwork can be relatively easily dropped into the blank template software provided at the Memorex website, and you can create cover art that functionally replaces the missing original artwork inside the jewel cases for your CD collection. Where it gets tricky - if darn near impossible - is creating the rear front insert printing. But if you're looking to put a cover and a tray insert in quick and fast this is the product.The instructions for creating cover art that looks decent or retail-presentable is very spare if not available at all. Part of the reason for this is that 99% of all retail CD cover art and jewel case inserts are printed on glossy paper and not the type of paper that ships with this product. The Maxell product, however, is on matte paper. This requires attention to detail when selecting inkjet printer settings, as you want to use the amount of ink that is usually dispersed for, say, a matte greeting card. If you use the incorrect setting, you can often spoil the insert by using entirely too much ink and creating a \"wavy\" effect in the art that will doom your intentionally perfect effort to the waste bin. So do a few test runs before you make a final copy - or at least expect you'll use 4-5 to get used to the product if it's the first time you're making cover art.The format of the pre-printed and pre-perforated sheet is excellent, however. But there are some bits of advice worth considering when removing the cover art. As the manufacturer indicates, you will want to fold along the seams that need to be torn in order to get a somewhat clean cut from the 8.5\" x 11\" sheet. You won't get the seamless cut you get, say, from Avery business card stock of the premium variety, but you'll get an acceptably clean cut if you follow this rule.Also be careful not to tear the perforations on the rear art that are meant to be where the folds are. I did this on the first sheet and had to repeat!The software enables you to line up the different edges of the original cover art to the template itself - but as with anything on a printer, make sure your printer is lined up correctly with the paper so you don't have any overlap. My advice is to slightly oversize the original art (easy to do if you have a basic understanding of image editing software) so that you can be sure you have a complete piece of art without white edges on top, bottom, or either side. It takes some tweaking - it's not as simple as just dragging, dropping, and printing.All that said, this product is more than adequate - software and inserts - for making gift mix CD's. The intuitive software guides you through the processes of creating cover art with either custom or stock image backgrounds, and placing track lists on your inserts. In fact the software is so useful, I am considering the use of the software with my own sheets sourced from another paper supplier, and then cutting the art myself from standard sheet stock.In short this product is adequate for replacement of cover art of value-priced CD's to be sold at retail, or to give a faceless CD a new jewel case home for your personal collection. But if you're looking for perfection in recreating major record label quality cover art, then look elsewhere. Alternatively if you are making your own CD's to be jewel cased as gifts or to create DVD ROM cover art for custom projects - business or personal - this would be an excellent product. For example creating a professional portfolio or storage cases for personal media would be two excellent uses for this product. Since I have almost one hundred of these sheets, I'll work my way through them. But because I have customers who demand near-retail-new perfection in their purchases, I am going to have to begin a thorough search for a product that maintains more of that specific aesthetic.On value and price this is an excellent product - certainly much cheaper than the retail locations where I had seen them locally. And again if you're using these for personal data storage, home-made products, or whatnot, these are excellent. That said they provide an exacting and demanding customer an ersatz product, that, if printed on a low DPI printer, can appear even - dare I say - kitschy.But with Amazon Prime offers and excellent delivery, I'm not throwing stones at retailers - just letting consumers know that if you're looking for what I was looking for - replacement cover art with the aesthetic of that of the major record labels, you'll need to do a little more digging out on the market for a good fit.", "overall": 3.0, "summary": "Another Ersatz Insert Replacement - But Good for Custom CD's / Gifts", "unixReviewTime": 1331942400, "reviewTime": "03 17, 2012"}