{"reviewerID": "ACDUPC4QGE99F", "asin": "B00000J4M9", "reviewerName": "Joseph Chiu", "helpful": [57, 59], "reviewtext": "Our office used to use a handful of the EN-104 4-port hubs and some of the EN-108 (the 8-port version of the same product).As 10 Mbps hubs go, the EN-104's are really nice.The quality of NetGear equipment has always impressed me:-  Nice sturdy metal construction instead of plastic.-  Status indicators built into the jacks, so you can easily tell which cable is connected and is active.-  Right-angled barrel power connector which reduce the likelihood of disconnecting power accidentally.-  With an easy-to-access switch, Port 1 toggles between station mode and uplink mode.  Unlike some hubs where two jacks are wired together, this design prevents accidentally shorting a station to an uplink.-  Screw-mount notches on the underside allows for easy attachment to the wall, underside of a counter, etc.If you want to set up a network without spending much, these hubs work well.  However, I suggest you buy a 10/100 Mbps hub instead.Here's why:Practically all new networkable devices today support 100 Mbps (FastEthernet) as well as 10 Mbps (Ethernet).  The EN-104 hub (and other 10 Mbps hubs) will limit you to the slower speed.As 10/100 Mbps hubs are readily available today, and are quite affordable, I think your money is better spent on the faster hub.Is there a noticeable difference between 10 Mbps and 100 Mbps?  It depends on your usage, but if you regularly work with files larger than about 300 KBytes or larger, you'll notice a tangible difference.  For truly large files (like graphics/movies, or when installing an application via a network drive), a 10 second transfer at 100 Mbps will take well over a minute at 10 Mbps.If the NetGear 10/100 hub (DS-104) is a bit too pricey for you, you might consider the Linksys EFAH05W 10/100 hub.  Though not as &quot;nice&quot; as NetGear equipment, the Linksys 10/100 hub is only a few dollars more than this NetGear 10 Mbps hub.", "overall": 4.0, "summary": "A solid hub, but 10 Mbps is too limiting today.", "unixReviewTime": 969753600, "reviewTime": "09 24, 2000"}