{"reviewerID": "AEWYZOB8G3MBQ", "asin": "B00000J506", "reviewerName": "D. Amini", "helpful": [8, 9], "reviewtext": "I have owned five of these UPS units over the past four years. I purchased three for my Mac and PC at home. Then I had to purchase two replacements for units that simply quit. Currently only ONE still works! I have very infrequent power outages, perhaps three in the past four years. These units work well to allow you to save your work and shut down. My G5 mac was so power hungry that I had to use one for the computer and another for the 23 inch LCD.  I can't comment on other UPS brands such as Belkin,  but I have seen many competing brands on the web and at the computer stores. There seen to be quite a few dealers selling refurbished APC products but this may be a reflection of APC's popularity rather than the poor reliability of their brand. My experience over the past four years has been mixed. These are not inexpensive units and you have to decide how precious your data becomes. If you really fear the loss of data during a blackout then the answer is clear. I chose to switch to high quality surge suppressors and never work during potential storms. Many users do not have that flexibility so a UPS is essential insurance. The units I puchased were identical and only one unit is still operational after four years. I can accept the need to replace the battery every one to two years; three of the batteries failed and alarms beeped until I bought new batteries. Prices vary from $15 to $50 depending on the vendor. Battery life depends on many factors so I don't begrudge APC for wear and tear on the battery but to have 4 out of 5 units simply stop working is unacceptable. I bought APC branded batteries and can't explain why the recurrent failures. I'm frustated with my APC products but it may be a problem with this model. Just beware of the hidden costs of battery replacement when purchasing an UPS!", "overall": 2.0, "summary": "Not Very Durable. Will need battery changes.", "unixReviewTime": 1139097600, "reviewTime": "02 5, 2006"}