{"reviewerID": "A304GUEPCPYM3Z", "asin": "B00000J579", "reviewerName": "citan-uzuki \"citan-uzuki\"", "helpful": [13, 14], "reviewtext": "I keep a lot of computer equipment at home, due to the fact that I am an A+ technician working to complete my MCSE (microsoft certified systems engineer) credentials.  I bought a pre-owned computer from ebay last month in order to practice setting up computer networks at home.  This particular computer is a business-class desktop, designed more for the office environment rather than the typical entertainment PC that we would normally have at home.  I decided to add DVD capability to this system, in order to enjoy a movie at my work desk whenever the mood strikes me to take a break from work (which happens quite frequently).  I added a Sony DVD player, this particular Soundblaster soundcard, and a pair of Cambridge Soundworks speakers.  Within thirty minutes, I was watching The Lord of Rings.Now, about the Soundblaster.  This is a very good Soundcard for its intended purpose.  Which is to provide basic sound functionality to a desktop computer.  The sound quality is good enough to enjoy listening to stereo sounds from music CDs and DVDs.  But please, do not expect this card to provide you with theatre-like surround sound quality.  This is definitely the wrong price range if you need that kind of quality.I compared the sound quality of this office system to my primary home system.  My home system is a Dell Dimension 8200, with a Turtle Beach Soundcard and the Altec Lansing surround system.  I switched the mode of operation of the Altec Lansings from surround to stereo for comparison purposes between the two systems.  Subjectively, you can definitely tell the difference between the two.I can recommend this Soundblaster to anyone who is simply looking to add stereo sound to his or her desktop computer.  It is inexpensive and easy to install.  It will require the use of one of your PCI slots.  For your information, I installed this card on an IBM 300PL desktop PC.  The system has a Pentium III processor and 128 MB of RAM.  It is running an evaluation copy of Windows 2000 Advanced Server.  The DVD player is a Sony DDU1621 and the Monitor is a KDS 17 inch flat screen CRT.  If you are interested, I wrote reviews on the KDS monitor and the Sony DVD player, here at Amazon.", "overall": 5.0, "summary": "An effective basic soundcard", "unixReviewTime": 1088121600, "reviewTime": "06 25, 2004"}