{"reviewerID": "ALVYD6HBLYI0W", "asin": "B00000J6WY", "reviewerName": "D. Johnson \"Chi-Town Dale\"", "helpful": [6, 8], "reviewtext": "I was really looking forward to getting these binoculars. I had owned Bushnell binoculars in the past and was very happy with them.These arrived totally broken.The left main lens housing was sheared completely off from the unit.Looking at them, I found they were constructed using cheap plastic for the main body. The lens housings are screwed into the body, but the plastic is so fragile that apparently when they were dropped sometime during the shipping process the plastic shattered.I probably could have Super-glued the housing back on but then they would have been subject to fogging since when the housing broke off the Nitrogen that is injected into the housing escaped. Nitrogen is used to prevent the lenses from fogging.While checking out the remainder of the unit, I worked with the quick focus lever and found that it didn't hold focus very well either. I would like to see a unit that has a dial focus with a lever fine focus so that the major focus point is stable. The lever focus would be really nice for finer focusing after you have zeroed in on the subject. I would have used them for viewing auto racing for the most part, so once you get the major focus point clear, a lever focus for fine focusing would be great for viewing a moving target like race cars that can vary in distance by up to 1/4 of a mile closer or further than the main focus point as the cars travel around the track. That is where the quick focus lever could do a great job. But to use it for the entire focus field is too much and it isn't fine enough since a tiny bump in the wrong direction can cause you to lose sight of your target object entirely.I also agree that the design of the focus bar is poor in that you have to use both hands to focus since you can only push down. Either that or if you have a long finger you can reach across the center and push down on the other side of the bar as well.I won't be reordering a replacement. Instead I will look for binoculars that have a more durable housing since using binoculars subjects them to being \"knocked around\" and if the material used by Bushnell shatters so easily, they are not going to last very long.So my advice to anyone who owns these particular binoculars is to protect them from being dropped or even bumped into trees, etc very hard since the housing is brittle and will shatter. If you use them in Winter, they will be even more brittle and the housing will shatter even more easily than in warm weather like we have now.I would also advise Bushnell to change their packaging since if they make a product that is this fragile they should pack it in thicker shock absorbing materials than they currently do since what they use wouldn't protect a product a fraction of the weight and bulk of this product. That would lessen the chance of catastrophic damage such as these were obviously subjected to.My cell phone, which weighs 3.5 ounces came in a corrugated box with a total weight of one pound with 10 ounces of that being the box and packing materials (the charger weighs about 2 oz).Yet these binoculars that weigh 12 TIMES as much as my cell phone, with optics that are far more vulnerable to damage from the shocks of shipping and handling than a cell phone have only a couple of ounces of material to protect them from damage and came in a box no sturdier than a cereal box. It is a miracle if any of these binoculars get to the customer in one piece!", "overall": 1.0, "summary": "Flimsy Product", "unixReviewTime": 1216166400, "reviewTime": "07 16, 2008"}