{"reviewerID": "A25M2X8KHSS2NC", "asin": "0972683275", "reviewerName": "Ultimate Ducky \"Ultimate Ducky\"", "helpful": [8, 15], "reviewtext": "Unfortunately, I'm returning this mount.Though I like the look of it, particularly the two part plastic piece that clips to the wall mount portion to cover the bolts, I feel that the one I ordered wasn't well made.I purchased it to mount aLG 26LE5300 26-Inch 720p 60Hz LED LCD HDTVin our kitchen.The mount arrived quickly and was well packaged. Unfortunately, the arm was welded to the wall bracket at a slight angle, meaning that regardless of how it would mount it and the LCD would never be level.Also, the powder coating near one of the bolts had come off and I could see some rust already forming.I decided to see if the mount would be the right fit for the tv before returning, figuring I would just get a replacement and hope for the best. I'm glad I did because this led me to find two other issues.The first one I blame on the manufacturers, the second I would consider a design flaw of the LG lcd.The first issue is that the screws supplied to attach the bracket to the tv are too few and two short. The screws are only 12mm long, and would barely catch in the threads of the TV if they weren't recessed at all. Most mounting threads on lcds and plasmas are partially recessed. I stopped by my local Lowes and picked up two packs of similar screws (M4-70 or something to that affect). $0.80 a packet so not much of an expenditure, just a big hassle. I needed 20mm long screws to mount this to the tv, so a pretty fair difference over what was supplied. The manufacturer supplies several different thread and gauge options, but only one shallow length of each set.The second issue is that this universal mount covered the power and HDMI ports on the back of the 26le5300. Again, I think this is more of an issue with the tv then the mount, as they're situated rather high and central. Either way, it's something you'll want to check on your tv before ordering this product.I actually returned this and in its stead purchased a similar mount from the same company. TheVideoSecu Swing LCD Wall Mount 20 inch Extension 55 lb loading capacity for LCD TV Monitor Flat Screen VESA 75mm/100 mm 1USgets very high marks from me. It's basically the same arm with a 75x75 to 100x100 VESA head on it. This second arm did not have any of the manufacturing errors of the previous model and fit the back of my tv perfectly.I understand that it's a very affordable mount, and that most of my issues may have been resolved with a replacement. However, I just can't give this mount any higher rating than I have.", "overall": 2.0, "summary": "Poor Quality Control, May Block the Ports on Your TV", "unixReviewTime": 1283558400, "reviewTime": "09 4, 2010"}