{"reviewerID": "A1RJUXDK64O91A", "asin": "B00000J6WY", "reviewerName": "Sandy P \"saprater\"", "helpful": [20, 22], "reviewtext": "I bought this item to go nature viewing and must say that it really is a great binocular for the price.  The items viewed have a really nice 3-dimensional look to them and the diopter comes in handy even for someone with very bad vision like myself.  The focus for this model (16 x 50 Wide Angle) is a flat tab between the barrels that makes it VERY convenient to use without having to look or stretch your fingers.  It gives a very nice field of vision and has roll down eye cups, which is good just in case you want to wear your glasses or shades.  The binoculars do shake a little b/c of the power of the magnification.  And it can be a chore to hold for long periods of time b/c of its weight.  It weighs about as much as one of Michener's hardback novels.Here is where it can get interesting.  The binoculars come with a pleather carrying case, a really cheap neck strap that looks like a plastic shoelace, and a cheap cleaning cloth that is way too abrasive to be used everyday.  I suggest replacing both the neck strap and cleaning cloth as soon as you can.  The soft, microfiber cloths they sell in eyeglass stores works great.  Plus, pick up some of the eyeglass cleaner (spray directly onto cloth, not lens) as it really gets the lens clean and protects any coating on the glass.Tripod use:  highly recommended to get a steady picture.  You can get a regular camera tripod for around 18 dollars.  Yes, this binocular comes with a tripod adapter.  No, it's not very easy to find. &lt;g&gt;  The instruction booklet is virtually useless, but I found out through the website that the adaptor is located behind the front cap between the barrels.  Just screw the cap off and viola, there is your threaded coupler.  You will still need to get a binocular adaptor to connect the binoculars to the tripod, but I've found that they aren't too expensive:  around 7-16 dollars for the generic models. I gave this item 4 stars b/c of the poorly written instruction manual and cheap accessories.  Hope some of this info helps.  Can't wait to see the stars tonight!", "overall": 4.0, "summary": "Hope this sheds a little light on the product", "unixReviewTime": 1089072000, "reviewTime": "07 6, 2004"}