{"reviewerID": "A2KZOIOFXXMC1H", "asin": "B00000J6WY", "reviewerName": "The Penguin \"Techno Geek\"", "helpful": [2, 2], "reviewtext": "These are decent binoculars.  They are rubber armored and seem fairly sturdy.  I live on the 9th floor near the beach.  These are great for watching moving boats and jetskis go by through my living room window.  They are good for a quick look at something, but difficult to hold steady for more than 30 seconds.  I guess that's the same for all 16x binoculars.  They work better with a tripod mount and a tripod.  These are probably easier to hold steady than 20x50's.  The Zip focus is handy.  The focus at 16x magnification is more critical than 8x or 10x binoculars.  I find myself re-focusing very frequently.  Kind of a pain after using my other Bushnell 8x25 Permafocus binoculars, which NEVER need to be refocused.  I got these for stargazing.  They don't work as well as expected for that purpose.  First, the BAK7 prisms don't transmit light as well as BAK4 prisms.  Second, the 50mm objective lens is not large enough for 16x magnification at night.  I also own a pair of Pentax Whitetails 10x50's which are much better for stargazing.  The Whitetails are much easier to hold steady and the image is much brighter at night.  The Whitetails are slightly heavier though.  The Celestron 15x70's are probably a better choice for stargazing if you want high magnification.  I thought about returning the Bushnell 16x50's because they aren't so good at night.  I gave them a second chance today and decided to keep them for daytime use.  Not bad as a spare pair to have around with higher magnification than 8x or 10x, but I don't recommend them as your first or only pair of binoculars though.As for magnification, 7x and 8x binos are fairly easy to hold steady.  10x approaches the limit of steadyness for handheld use.  I used to have a pair of Tasco 12x50's and tried to use them for stargazing.  I had to prop my elbows on a car hood to use them.  Even then, they were not very steady.  I loaned them to a friend for a football game once, and I never saw them again.  No great loss really.  16x is really pushing the limit for shakeyness.  There's no way I'd buy 20x binoculars for handheld use.  8x seems to be the best compromise between steadyness and magnification.  For stargazing, many authors recommend 7x50 binoculars.  Personally, I don't think 7x magnification is good enough.  You'll want something with higher magnification after trying them.  You can't really go wrong with a pair of 10x50's for stargazing, like the 'Pentax' Whitetails I mentioned before.  The 10x50's might even be cheaper for the same optical quality as 7x50's.  A pair of 8x56's or 9x63's would be good for stargazing too, but the 10x50's are more bang for the buck.  If you've never owned a pair of binoculars before, and you want some good ones for daytime use, you can't really go wrong with a good pair of 8x40's.  I like the 8x40's better than 7x35's, because 7x is not high enough magnification.  The price difference between 7x35 and 8x40 isn't that much.", "overall": 3.0, "summary": "Not bad, but could be better", "unixReviewTime": 1335484800, "reviewTime": "04 27, 2012"}