{"reviewerID": "A20AAU9AUQ2ATE", "asin": "B00000J6WY", "reviewerName": "Virgin User", "helpful": [0, 0], "reviewtext": "The pair of 16x50 Bushnell Powerview binoculars I received were defective from the start, with serious double vision and unequal focus between eyes (despite diopter adjustment), so I can't comment on their optic quality.  I did test each barrel separately and thought the 16x50 view was big, bright and clear. . .Although it seemed neither side focused real shapely, that may have been from the defect(s) my pair came with.Currently (3/2014) the listing for these 16x50 Porro-Prism binoculars says Roof Prism for some reason ??I tested my 16x50's on a sunny day.  Tho they're high power (16) for the objective lens diameter (50), the exit pupil size gave me no trouble. . .It may have been in double vision but it was easy to get the full view, at least on a bright day.There are complaints in the reviews about the Lever focus mechanism, versus a focus wheel.  The little that I used the binoculars, I didn't have a problem with the lever focus.  In fact, focusing by rocking the lever with a finger on each side was kind of nice.  The lever mechanism seems like a promising idea but apparently whether Bushnell executed it effectively is in question.  And I suppose it's possible the lever mechanism had something to do with the unequal focus between barrels and apparent soft-focus but given my pair's other huge problems, it was impossible to tell.The reviews complaining of the too-wide interpupillary adjustment are SPOT-ON.  I'm male of average height.  My eyes aren't particularly close together but my binoculars at their narrowest interpupillary distance were barely narrow enough for me.  I've never before had that trouble with binoculars.  These binoculars would be useless for lots and lots of people.Otherwise the binoculars seemed solid and durable.My main problem wasn't with the binoculars but with Amazon Warehouse Deals, where I bought them.  There's no reason binoculars this defective should have been relisted and sold to me...It's plain bad business and bad customer service. Anyone considering buying binoculars from Warehouse Deals should do it with eyes wide open for lemons.  Luckily they're pretty easy about returns and letting you try again. A keeper arrives eventually.Of course I'll return them.  I'm ambivalent about trying another pair of 16x50 Powerviews.  The complaints about the focus lever and interpupillary adjustment had me on the fence to begin with.  Then I get this pair that's so miserably out-of-whack. . .It might be a fluke or it might be the Powerview design ??If you're looking at Powerviews, consider Bushnell H2O; I have a pair of 8x42 H2O's.  For about the same price the H2O's are waterproof & more solid and come with a wheel focus and better twist-up, rather than fold-up, eyecups.  However, H2O's don't have the attractive selection of high powers and big objectives.", "overall": 3.0, "summary": "Lack of narrow interpupillary range could be a problem - think about Bushnell H2O's instead", "unixReviewTime": 1394755200, "reviewTime": "03 14, 2014"}