{"reviewerID": "A38X9XX2ZRR0ON", "asin": "B00000JBAH", "reviewerName": "AS", "helpful": [0, 0], "reviewtext": "I do not know if my experience was the same for those that had an awfull time installing this modem. But after force install I was online all in all about 20-30 minutes, sure that should not be the case especially now days coming from a well known brand such as this (was), install should have been 2-3 minutes.First out of the box, the install disk failed, error something about corrupt or missing driver... that seemd ok the instructions warned of a possible system patched needed, ok so did the patch, same error. Missing or corrupt file... hmmm I wonder how many bad install disks are floating arouund aggrevating people.This is really a great stable fast modem, feel bad for those that gave up on the install. Anyways, first I had to figure out what driver on the disk belongs with my modem, after a few trial and error and educated guess I identifieds the installation driver directly on the disk and manually loaded the drivers.But thats not the end of this story. For some reason the PCI card barely fit into the case, the aligment was off and could barely fit. I did manage to get everything seated but it was difficult, the plate needs to come in a 8th of and inch, perhaps even a quarter.My install was in a Dell Dimension tower, Win98se, the old USrobotics finnaly caved in after years of slowly dying.Modem connect fast and realatively seems to work pretty fast as far as browsing web pages, almost comparable to low speed DSL, really seems that good. Connection consistantly made at 45k, which is very exceptable, the old USR when new pegged 52k alot, and I was impressed, but eventually that card died after 5 years... I have an old MOT 56k about 8 years and still runs very well.3 Stars, aggrevating installation, bad disk etc., and bad manufacturing, the alignment was difficult to seat properly, very tight fit. After those hurdles, runs very well.NO MATTER WHAT MAKE SURE YOU GET THE MODEM THAT IS HARWARE BASED NOT SOFTWARE DRIVEN!!! THERE ARE TWO VERSION OF THE DIAMOND SupraMax MODEM MAKE SURE IT IS THE CORRECT ONE!!! Look for the PRO model, it has the on board \"DSP\" chip... hardware based.If having difficulty install the SupraMax PRO version, look for the \"PCIPROA\" on the disk. Otherwise for the NON-PRO version use the multiple install disk folders that are next to the \"...PROA\".", "overall": 3.0, "summary": "Install disk fail, however manual install works great", "unixReviewTime": 1162339200, "reviewTime": "11 1, 2006"}