{"reviewerID": "A41JUIFTT1J4B", "asin": "B00000JBAT", "reviewerName": "Kevin R Hoyt", "helpful": [2, 3], "reviewtext": "I got my Rio PMP 300 from my employer as a gift.  It was my first exposure to MP3, as up to that point I had been dismissing it as a fad.  Having the device, and about 150 CD's, I figured why not give it a shot.The installation of the software went smooth.  I found an update, and installed that as well with no problems.  Then I started trying to rip and found that the included software was hardly stable.  I was running on Windows NT, which seemed to be supported by the manufacturer, but with some caveats.  I would start ripping and the software would crash.  I would try to transfer to the device and the software would crash.  I would complete a transfer to the device after several tries only to find that one or more songs didn't actually make it.  Bottom line - the connectivity for this device was pathetic.But speaking for the device itself - I loved it.  The music played cleanly, without interruption, regardless of how much I shook the device.  The buttons on the front are well placed, well labeled, and nicely inset just enough so they still provide easy access, but you don't have to worry about them protruding.  It has all the features you might want including random and repeat.  The display let's me know how much memory I have, what track number is playing, and the time of the song.  There are also various other indicators that are helpfull (battery, etc.).The memory on this device is small - 32Mb.  And the manufacturer says it will only support up to 64Mb total with an expansion card.  That expansion card can hold it's own set of music so you can swap them in and out without effecting the music on the built in memory.  However, vendor chose the odd memory type of 3.3V for the external memory versus typical CompactFlash.There's a convenient &quot;lock&quot; switch on the side that keeps the buttons from registering.  This can be good in two ways: it won't get turned on accidentally and burn battery, and you won't accidentally hit the stop button and interrupt your listening.  The belt clip is handy, and detachable, and the battery life (one AA) is quite respectable.In all, I really love my Rio PMP 300.  It's perfect for a trip to the gym, a jog around the neighborhood, or even for a short plane flight.  If all you need is an hour (30 mins on internal memory alone at a 128 sample rate) to pass the time, then you really don't need to spend more - this is the perfect device.", "overall": 4.0, "summary": "Great little device for short duration play", "unixReviewTime": 995587200, "reviewTime": "07 20, 2001"}