{"reviewerID": "A243HY69GIAHFI", "asin": "B00000JBJQ", "reviewerName": "tropic_of_criticism", "helpful": [27, 30], "reviewtext": "Certainly not the best speakers you could ever have for your computer, the ACS33 nevertheless fills an important niche in the market.  If you're looking for subwoofered sound on the cheap, this is probably your best bet.  They're competent performers, without taking price into consideration.  Look at how much they cost, and you'll think there aren't better speakers made on the planet.  They have the potential to work, as do most speakers, on both Macintosh and Windows machines.Interestingly, they also have a secondary use.  Because they don't need a computer to work at all, they can be plugged directly into any stereo system that has the ability to output its sound (that is, one which has an AUDIO OUT jack).  They can thus give resonant stereo sound--even to lowly portables.  You'll think twice about whether you really need to upgrade to a whole new system after hearing these speakers.  (Before buying for this purpose, however, I'd recommend you go to altec-lansing.com and grab the manual for this product, just to make sure that it's compatible with your stereo.)Inasmuch as there are drawbacks to the speakers, they are ones you would expect from a product so inexpensive.  As another reviewer has rightly pointed out, there's no volume control on the woofer.  There's also no bass, treble, or speaker-independent volume control.  And the speakers are rated at only 10 watts, with a relatively indelicate frequency response.But, big deal.If, like most people, you've got your computer jammed into a corner in a busy room, you don't have the soundspace to set up a truly extraordinary auditory experience.  If you've got a lot of people living with you, anything more than 10 watts is discourteous, anyway.  Unless you have a room that you can dedicate to the computer, and that's relatively isolated from others, it's extremely unlikely you would actually be able to use more than this system offers.", "overall": 4.0, "summary": "Doubtful most users need more than this", "unixReviewTime": 977961600, "reviewTime": "12 28, 2000"}