{"reviewerID": "AFKEI3OEU5U85", "asin": "B00000JBLJ", "reviewerName": "DJ", "helpful": [0, 0], "reviewtext": "I have to ring in on this item. I have owned mine for over 2 years now and I sit at my home office desk many hours a day talking into it.There are many more elaborate and MUCH more expensive items out there but my question is, why? Why would you spend 60 or 50 or even 20 dollars on something when this 10 dollar headset works as well as it does. I have never had anyone complain that my voice was weak or that I sounded odd when using this unit. In fact, I don't think anyone can ever tell I'm on a headset. I can hear the caller crystal clear and the noise cancelling mic delivers as it was meant to.In my opinion, manufacturers do not always put as much effort in the headset jack section of phones they do not expect to be used in an office setting. This is not to say ALL office or multi-unit phones are exceptional. Some of these are weak in this respect. With simple home phones, doubly so.My Motorola SOHO set has an excellent jack section. I mention this because this will have a huge impact on your experience with this or any headset.One huge problem for me with wired headsets has always been, when walking around with the unit on, I get the cord caught on doorknobs and various hazzards around the home/office. When this happens, it rips the phone off of your ear and has destroyed more than one more expensive unit. Hence, the willingness to try this less expensive unit. Funny thing is, although I've managed to rip this thing off several times, I don't seem to have damaged it in any way. It has outlasted every single headset I have ever owned. And it works and sounds as great now as it did the day I got it.I bought this thing figuring if it worked but only lasted 8 or 10 months, I could just buy another one and save some money going this route. Well, if it ever does break, I can assure you I will be buying another one!One side note, this makes a great gift for someone who wants a headset but doesn't want to spend the money for one. They'll never know you spent 10 dollars on it. Not that I would do anything like that ;>)If you cannot handle an over the ear headset, or if you are wireless, this is obviously not a fit for you. If you are using a wired headset, you should give this a try.", "overall": 5.0, "summary": "An Outrageous Bargain", "unixReviewTime": 1148601600, "reviewTime": "05 26, 2006"}