{"reviewerID": "A3LDPF5FMB782Z", "asin": "1400501466", "reviewerName": "Alan  Houston", "helpful": [3, 4], "reviewtext": "The Nook Tablet, in both the 16gb version and 8 gb version, are the best color e-readers of 2012.  Both are bargains when purchased at the discounted price Barnes & Noble provides to its members.However, they are designed for reading...if you want a gaming tablet, a Skype video tablet, or need access to thousands of apps, you need an I-Pad.I have owned a \"Brand X\" color e-reader for about a year, but seldom use it for reading because it causes eye strain. I have a Nook Simple Touch e-reader that is wonderful for books, but its e-ink screen is black on white only, which does not work well for colorful magazines such as \"Automobile\" or \"National Geographic\".Barnes & Noble has an offer that enables its members to buy the Nook tablet for MUCH less than the price quoted by internet vendors, so I took advantage of their offer...plus the staff of my neighborhood Barnes & Noble were very helpful, and invited me to classes they provide to teach new owners the in's and out's of their new tablet. Mine is the 8gb version, which works as well as the 16gb version. I added a 32gb memory card, so my Nook has more storage for books than I could ever fill.The Nook Tablet is the best of both worlds. It is easy on the eyes for long reading sessions because its screen was designed to prevent eye strain. The fonts are very clear, very sharp, and have very high contrast, enabling you to read with the screen set at a very low brightness level, eliminating eye strain. Independent tests have verified that the Nook tablet has less reflection and glare than any color e-reader or color tablet, because the screen's glass cover is bonded directly to the LCD, eliminated the air gap that causes glare.The vivid color makes magazines \"pop\" even more than their paper versions. Barnes & Noble adds a special \"text only\" option for magazine articles that make it easy to read the text by enlarging the fonts and putting the text of the article in a single long file.The Nook \"shop\" does not work as well as the Nook website on the internet for searching for specific books or categories of books. So, I downloaded the Dolphin HD browser from the Nook shop and use it to look at the Nook shop's book inventory. The Dolphin browser uses tabs, so I can put two or three books I am considering in their own tab, and switch back and forth.The Nook Tablet has Pandora Radio installed, so I can listen to my favorite music while I read books. The sound is weak through the Nook tablet's puny speaker, but wonderful through good earbuds. I also transferred about fifty of my favorite CD's to the Nook's memory card, so I can listen to music even when I am not near an internet connection.When I get tired of reading, the Nook tablet lets me watch movies and tv shows on Netflix or TV.Com. Movies on Netflix look wonderful, because the color balance on the Nook tablet is superior to that of any seven inch tablet currently available. Skin tones are difficult to get \"right\", but the Nook tablet does a great job.Many reviewers make the error of comparing the Nook Tablet to full-blown tablets, such as the Apple I-Pad. The Nook Tablet is designed to be an e-reader, and for that purpose, it is superior to any of its seven inch competition. The fact that it includes Pandora Radio and Netflix is a bonus...but it IS an e-reader. The Nook Shop has a relatively small number of apps, each of which has been tested to verify it works well with the Nook tablet's seven inch screen...most Android apps are designed for a three inch or four inch screen.The reading apps for children are impressive. Last week I downloaded a free children's book that combined the best of the \"book world\" and the \"video world\". The book played music in the background...as a character walked through a field, the flowers were swaying in the wind. The book provided an option to have a character read the book out loud, and an option to turn the voice off, so your child can read the book to herself. Many of the children's reading apps are free, or cost less than $5, a bargain compared with the $15 or $20 children's books sell for in stores.The Nook website offers a \"book of the day\" for adults and a \"book of the day\" for children. The illustrations in the children's books take advantage of the Nook's color screen. Yesterday's children's book was \"Mary Poppins\", a bargain for $2...but the REAL Mary Poppins seems a bit scary compared with the Julie Andrew's Disney version.For people who want MORE than just the world's best e-reader, Amazon.com sells a $35 SD card that converts the Nook Tablet into a conventional Android tablet with full access to Google Play and its vast array of Android apps. Just put the N2A card into the Nook's card slot, and restart the Nook. When you want to use it as just an e-reader, take the N2A card back out. Best of both worlds...the best seven inch color e-reader becomes a very good seven inch Android tablet.", "overall": 5.0, "summary": "The BEST Color E-Reader - With Bonus Features", "unixReviewTime": 1336003200, "reviewTime": "05 3, 2012"}