{"reviewerID": "A3TWFM69THKQBK", "asin": "B00000JBUI", "reviewerName": "Dr. M \"Professor\"", "helpful": [0, 0], "reviewtext": "I have two of these, one I just bought (used-mint condition) and one I bought new several years ago which is now dead.  People who do computer-aided design and need fine cursor control absolutely love the FX because the large ball gives you just that - better fine control than any other mouse or trackball.  However, some actions, like drag and drop, are difficult to do with the traditional left button and ball, and instead require the use of the 3rd button as a drag lock, which is easy to do, but different than you may be used to -- once you get the hang of it, it becomes second nature.  The fourth button can be programmed for scrolling.  The buttons are programmable - you can choose what function you want them to perform.The hand placement over the curvaceous FX body is also very comfortable and even relaxing - once you get used to it, and don't try to drag and drop with the left button and ball.  You can use both your thumb and one or even two or three fingers to move the ball around without ever tiring or straining.The downside of this model is that Logitech has abandoned it due to a patent infringement suit, and no parts are available for repairs, and no one I know repairs them.  To get a part, you must cannibalize another Trackman Marble FX, and the cannibalized parts will already be used and aged with a short life span -- assuming you can get a used one with still usable components.  There are no new FX's anywhere.Another downside is that the FX only came with either a serial port or a PS/2 connector.  There are no USB or wireless versions.  And every attempt to utilize a USB adapter results in some functionality being lost.  The serial port has long gone the way of the Dodo bird, and PS/2 ports are non-existent on new model computers.  In another 5 years the FX will be largely obsolete and incompatible.  This has already affected the going price.  Whereas a couple of years ago, even a poor-condition FX commanded a steep price, a mint-condition FX now command less than $100 (I won my minty for only $82 just yesterday as I write this). Yes, there are vendors still listing FX's near $300, but they aren't getting many takers, if any.The bottom line for this once very superior design is that apart from a few fanatics (like myself) who have yet to upgrade to a new USB-only PC (or Mac) the FX is dated, and soon will be obsolete and incompatible with the new equipment coming out.", "overall": 5.0, "summary": "Once superior design now dated and headed for obselesence", "unixReviewTime": 1284681600, "reviewTime": "09 17, 2010"}