{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B00000JBUI", "reviewerName": "magellan", "helpful": [10, 11], "reviewtext": "This is one great trackball. The product I bought is actually the Cordless version of the FX Trackball, but it's basically the same as this one except for the cordless/wireless feature. The ergonomics are a little different also but it's basically the same trackball device.You can't beat the smoothness of this trackball. I've seen lots of them over the years but none ever impressed me enough to buy one until now. Now that I've tried one I'm a convert. The action is extremely smooth once you adapt a little to the finger movements to move the ball. Also, getting used to the placement of the four different buttons takes a little time. But once this is accomplished the ability to move smoothly and quickly around your computer screen is vastly improved over a typical mouse.The buttons are all configurable as to function, but I've found sticking with the default settings during the software setup is the best way to go. There is one thing I am trying to see how it works out. I reconfigured button 4 as the delete key. This is sort of convenient because it allows you to browse and delete files just with the  trackball instead of having to use the other hand to hit the delete key on the keyboard after highlighting a file with the trackball. Pretty convenient for those occasional cleanup tasks on your hard disk.Another thing I have found useful is to use medium instead of low acceleration, which allows you to shoot all the way across the screen by moving the trackball maybe an inch and a half or so, but then to drop the overall sensitivity down a bit. The default setting for trackball sensitivity is right in the middle of the range on the slider adjustment bar. I drop it down one more tack on the slider bar. This assists in hitting all those small buttons when using high resolution on your monitor. The medium acceleration gets you there faster but then you have more control once you're there to zero in on the button. Try it and see if you like this better than the default settings. You will find these settings by opening up the Trackball program menu, clicking on &quot;mouse properties,&quot; and then on the &quot;motion&quot; tab.One last thing I do to customize the operation of the trackball is you can check a box that causes the cursor to jump to the highlighted button of a new dialog box. I find this useful also.I noted a very interesting new feature. One of the buttons when clicked pops up the &quot;Webwheel.&quot; This is a wheel with 10 different pie-shaped pieces which are configurable as web addresses or for other web-related functions, such as go back, reload, go to favorites/bookmarks, and so on. When you hit this button, the wheel comes up, and you basically have a second menu to choose selection from. Pretty cool.I should mention the software install is a little non-intuitive. The instructions say to disconnect your mouse and plug in the new trackball (with the power off). However, when you boot the machine, Windows 98 sees the now missing mouse and wants to autodetect your hardware again and recreate the entire driver database. Not knowing what would happen I just cancelled out of this screen and let the computer boot up normally but without any mouse function. I then loaded the software, using the tab key to navigate around to configure everything, which wasn't too hard, and after you are finished it asks do you want to reboot, and after that the trackball works normally.Although not cheap, all in all a fine product that is worth the money.", "overall": 4.0, "summary": "Made me a convert", "unixReviewTime": 984355200, "reviewTime": "03 12, 2001"}