{"reviewerID": "A2XIOXRRYX0KZY", "asin": "1400501466", "reviewerName": "B.L.", "helpful": [0, 0], "reviewtext": "When B&N; designed this one, they were putting together a reading device that also happened to have some tablet features. As a result, what you get is pretty limited.It's a fairly sturdy device by feel, and not difficult to hold for a while and use. The quality of the screen is pretty good and it's not difficult to read for extended periods of time (so long as you're not out in the sun anyway, almost all LCD screens perform poorly there).Very little of the space on the device is available for sideloaded content by default, so you need to use microsd cards to add more if you want to do too much with that.You can sideload content from any source that uses Adobe DRM for epubs, and also epubs that don't have DRM at all. This means that getting ebooks from the library is pretty simple. You can install an Overdrive app and do it directly without going through a computer if your library uses overdrive.You can root it to get access to more apps. If you want to run a more pure version of Android, you can go for either putting together a Cyanogenmod card yourself or purchase one already made from Nook2Android.B&N; gives away a book and an app every Friday on their blog, so that's worth checking in on regularly.On the whole, this is an okay device for reading and can be a kind of nice semi-tablet to give to someone who normally tends to load their computers/tablets up with viruses by being carelessness. It's locked-down state works in your favor from that perspective.For more general tablet use, this is a pretty poor choice. Also, as of mid-2013 the later devices (Nook HD/HD+) have been radically marked down, so if you're going to buy one of these you should look to get it pretty cheap. Otherwise, it'd almost certainly make more sense to hold out for something more full-featured.", "overall": 3.0, "summary": "Decent Little Reader, Poor Tablet", "unixReviewTime": 1371686400, "reviewTime": "06 20, 2013"}