{"reviewerID": "A2FHM5FB0BXKGA", "asin": "1400501466", "reviewerName": "Dr. Elaine O. Chaika \"book, movie, tech lover\"", "helpful": [17, 19], "reviewtext": "Months later, I am still happy with this Tablet, but you should know 2 things. One is, you'll get it for $224 if you're a B&N; member.  Also, if you go online, often they have a deal such that if you buy a year's subscription to the NY Times, they reduce the price of the Tablet.  To get the member's discount, you're better off going to a B&N; store.  BUT THE BIG THING is, if you already own Kindle books, Barnes and Noble stupidly don't provide a Kindle app, HOWEVER, you can buy the cheapest n2a card, either on Amazon or on n2a.com.  This allows you to boot your Tablet up as a full Android tablet (like the $500 ones), and you can get the Kindle app on that.  There's no problem accessing your Kindle books on the Nook.  Since, as noted below, the Nook eReader is beautifully designed, much better in my opinion than any Kindle, so I use my n2a card only when I'm reading a Kindle book.  I find B%N and Amazon charge about the same for books. There are some books on Nook that Kindle doesn't have, and some on Kindle that Nook doesn't have.  However, only Nook has the Page Perfect editions and the Enhanced editions of books with embedded video, audio clips, and animations.One other thing: the Nook has a tab for \"My Stuff\" so you can download music, pictures, videos and documents easily onto the Nook. You don't have to buy music for it.  Use what's on your PC or what you rip from disk. I am doing a project of editing and making slide shows of over 4,000 pictures.  For that, I bought a 32 disk san drive for the Nook to download the pictures to and to work on them using a Nook app.  I don't know how you could do that on the 8 gig Fire. I don't know if you can put pictures on the Cloud for the Fire.  However, I can make many different slide shows and digital albums on the Nook Tablet without any Cloud.I got this and the Kindle Fire on November 16, 2012.  Then came days of comparing them side by side.  You can see my review of the Fire on its page's customer reviews, so, how about the Nook?  First of all, if you want one, get it from Barnes and Noble. It cost $199 with a year's subscription to the NY Times.  Even without that discount, it costs $249 with free shipping (and, this month the NOOKcolor Tablet is only $149!)Hands down, for the money there is no finer Tablet than this Nook.  Some reviewers say they're going to get a Sony or a Galaxy for their features. I have no quarrel with that, but you pay for those features.  Sony and Galaxy are fine tablets--I've tried them out, too.  However, the Sony is on sale for $399.99 this month, and the 32 bit is on sale for $499.99.  Comparing it side by side with the Nook, the Sony salesperson said, \"Wow! it's as good as the Sony!\"  Yes, and for about the half the price.Another salesman lamented that the Sony doesn't have the Netflix app, which comes with the Nook. Of course, Sony wants you to buy their movies.  Barnes & Noble just wants you to buy their books, which is fine for a Bookaholic like me.  B&N; has 2,500,000 titles available, over 1,000,000 free.  Since they have a lot of earlier editions of books, Book Freaks like me can purchase those or get them free.  They even have a Page Perfect series which are facsimiles of beautifully designed books. What you see on your screen is what a reader in 1867 or 2007 saw, brilliantly illustrated and unusually printed books.  You'd pay a fortune for them in their original editions, not $3.99. Many children's classics are in this series, but also adult books, like Butterflies.The Nook also has Enhanced Editions with audio and video clips embedded in the text.  Some of the old books are also Enhanced.  Changes because of misprints or other errors in the original are underlined.  You touch them, and can see what the original had. One of my Nook Books is a collection of Kafka.  You touch underlined passages and up pops a picture of the street Kafka has mentioned, or of a notable person he's alluded to.  In general, eBooks are superior to paper if they are on a Tablet with access to the Web.  You read in more depth, and can envision what the author is writing about without interrupting your reading experience. The Nook's connection to the Web is as fast as your wifi and is accessible with two clicks: Look up and Google (or Wikipedia).The Nook comes with Pandora and you can also download music from your computer using the USB cord which comes with the Nook.  Pictures, videos and documents can all be downloaded to the Nook, which has built-in folders for each, and, if the 16 Gig iof the Tablet is  not enough for you, you  can put a 32 Gig or smaller SD card.That's not all!  If you're App happy, you  can buy the N2A card for the Nook Tablet, which gives you every App in the Android Marketplace without rooting it and voiding the warranty.  I myself have been happy so far with the thousand or more apps available for the Nook, with new ones being added each week.  Truthfully, if it's apps that are what you want most in a tablet, the way to go is the iPad--for $600-$700 at the least.I gave my granddaughter a Nook Tablet.  Many of her friends have iPads; however, she says, she can get the same apps as her friends do. Using the Drawing app, she designed her birthday party invites on her Nook and then emailed them also using her Nook eMail.  She says she prefers Angry Birds on the Nook.  I can't comment. Angry Birds don't tempt me, but I do play some games on my  Nook.The Nooks have no cameras or Face Time, but with the money you save by buying the Nook, you can get an iPhone which does  have both.  If you want features like that in a Tablet, it costs $500 or more plus monthly data fees. No data fees with the Nook, of course, although you can browse the Web with ease and speed, depending on your router.You can stream movies and TV stories with ease on the Nook.  The picture quality is excellent if your wifi is.  I'm in a rural area with no 4G, but I still get crisp, clear movies with my wifi device.  Apps standard on the Nook are Hulu, Smithsonian, Showtime, and Netflix.  There may be more sources of flicks on it, but, truthfully, I haven't looked--and, since they add apps every week, you have to keep looking.If, like me, your primary use for a Tablet is reading, the Nook is tops.  Their eReader is elegantly designed and beautifully intuitive.  It even tells you how many pages are left in the chapter you'e on.  Notice, it displays page numbers, not \"locations\" like the Fire.  If you can't remember  who a character is, put your finger lightly on the name. 5 popups show instantly.  Touch Find, and in a second you have a page which lists every page that word has been on, complete with it sentence. (You can do this with place names as well.)  The other choices are Highlight, Note, Share, Look Up.  The Share lets you highlight a passage and send it to your Contacts--not social networking sites.  For those, you use the Share option in the menu at the bottom of the screen.  My friends tell me they love getting these passages from me.  Of course, I choose those  that are witty or relevant to a discussion we've had.  Other reading options are Go to Page, Back, Find (for when you want to type in the search screen), Contents, Text options, Brightness and Discover.  This last shows you other books on the subject you're reading about or by the same author.In short, as an eReader, the Nook is tops. As a Tablet, it does well, although not as well as those that are way more expensive.  Actually, everything it does do, it does very well.  It just doesn't have certain features--but that is true of every Tablet I've seen except the iPad.  As of now, the iPad's picture quality is not as good as the Nook's or, for that matter, the Fire's.  The iPad3 will have hi def, however.", "overall": 5.0, "summary": "Outstanding 7\" Tablet", "unixReviewTime": 1329350400, "reviewTime": "02 16, 2012"}