{"reviewerID": "A14JBDSWKPKTZA", "asin": "B00000JDF5", "reviewerName": "Bob Feeser \"MillCrafters.com\"", "helpful": [33, 42], "reviewtext": "I bought these Belkin cables. They are very nice quality. They seem heftier than a lot of the other cables. My system analyst neighbor mentioned that he prefers to buy the 1000 foot roll. He runs them to wall outlets, then uses the 7 foot or 14 foot snap in cable from the wall to the PC. That way, you don't have to buy a 40 dollar crimping tool.You can't solder these cables. They require a metal to metal contact, and lead-solder doesn't qualify. Also, it is critical to keep them spiraled, all the way up to the end. Even when attaching, instructions call for twisting them right up to the connection.Since the tech instructions, tell you to keep them down to under 350 feet, these cables, whether they are long or short, are in the right lengths.I know Amazon doesn't print prices in their reviews, but they have the local major chain office supply stores beat hands down. The 50 foot roll was half again as much locally.These are the Category 5e cables. They give you a better return feed, which results in better overall performance. So insist on 5e instead of just 5. I initially bought some wall plates from (a nation wide electrical supply store) that were Category 3, then I returned those for the snap in option Category 5. Those were returned also, when I went to (a nation wide building supply center)... (of all places to go networking) and they had the complete Leviton line of 5e accessories.If I had to do it over again, I would still buy the Belkin 50 footers. I don't want to have a 500 foot roll of ethernet cable hanging around.These are tops. Gold plated connectors, Snag free ends, that protect that little lock in tab on the ends. You know the frustration of unsnarling a phone wire, out of a wiring mess, and the little tab bends over backwards, never to work properly again. Well Belkin built twin arches over the sides to prevent just that. Way to go. Highly recommended, good stuff, for a good price.", "overall": 5.0, "summary": "These cables are tops in any size", "unixReviewTime": 1063152000, "reviewTime": "09 10, 2003"}