{"reviewerID": "A1G9SOE51HET8E", "asin": "1400501466", "reviewerName": "Frank", "helpful": [1, 1], "reviewtext": "I bought this ebook (16G) for my Kindergarten and elementary children to read books on trips and my old child to check email. It does the jobs well until now. I personally like it very much for its excellent hardware performance. With low price, fast response, and light weight, book size, and Barn and Nobles support, It is the best device for children when you want to have something as an alternative for your computer.I am a fan of Amazon.com and meant to buy a kindle for my children. but the displayed sample on my local Bestbuy store showed me that the nook tablet responded much faster than kindle fire. It could not be generally true, but based on the displayed tablets, I had to choose the nook.Until now, I have had mainly happy experiences with it. It has apps for children, one of them has many Smithsonian videos that my small children love the most. My college age child also use it to check email at home because it responds in second to wake up, and we do not have to turn it off for many days before it runs slow. After you turn it off and restart it (hold the power button for seconds for on and off), it become fast again.I just found last day it has a recipe App with more than 17,000 recipes. It has pictures for most of the products.My children have asked me to buy the istory app for 3.99 dollars, but it contends 24 or more story books for children that it reads to my children. Wonderful! The American history app is excellent too, It costs me 1 dollar or so (not remember exactly now).Problems: It did start after my children left it idled for hours while a game was running. After the battery was charged for a whole night, it still refused to start. When I tried again in the afternoon, it started but took more than 10 minutes. I guess the software was damaged and repaired. It is now as good as it was before. I am still wondering what was wrong with it.It is not a computer and can not be connected to TV. only one or two of my children can use it in the same time. We still have to use computers when we want to enjoy movies or photos together.It was designed for you to buy their books. but I think the prices of most books are not low enough for me to purchase e version. I would rather buy some hard copies instead. However, one of my children loves the classical books which are free or only one dollar each. She is happy with the books.As a summary, the machine is excellent, sturdy, fast, and convenient for emails and web browsing. The books are not priced low enough for me to purchase although there are some old free books. Apps for children are wonderful. My children love it.", "overall": 5.0, "summary": "Excellent toy and tool for children", "unixReviewTime": 1338336000, "reviewTime": "05 30, 2012"}