{"reviewerID": "A6VFSC0BW75Y0", "asin": "1400501466", "reviewerName": "Frederick J. Haab", "helpful": [5, 5], "reviewtext": "I pulled the trigger on three of these on pre-order back in November.  I'd cancelled my order for as many Kindle Fires because I felt the technical specs justified the extra $50 for the Nook Tablet.  I also appreciated more onboard storage and expandability since we're a four person family and I drive ... all three were for my wife and kids and not me, and I expected they'd be used on the road a lot.I think that by the time anyone reads this they should know that the tablets (both Kindle and Nook, to be fair) are tied to their respective distributors.  That didn't come as any surprise to me, I fully expected it.  I knew that, without modifying the device (not really acceptable for your average person, if you ask me), I would be stuck with B&N;'s app store.  What I didn't know was how woefully limited that app store really is; it pales in comparison to Amazon's and doesn't even register when compared to the android marketplace.My daughter got hers first (a late birthday present).  For the most part, she was satisfied with it.  I made sure wifi was available throughout the house; we downloaded a couple of apps (Angry Birds, of course, and a drawing program).  The first thing to notice is that the B&N; app store has a tiny selection of free apps.  The ad-sponsored version of Angry Birds can't be found, but for a couple of bucks I didn't mind paying - I paid for the non-ad version for my phone, too.Netflix works as well on the tablet as it does on any other device in my home (PS3 and a bluray player, both hardwired networking) as long as wifi connection is good.  Her other use was email, and since she hardly gets any, the built in app was OK.The other two tablets I purchased were for Christmas for my wife and son, and that's where the problems started.  My wife gets copious amounts of email from several different accounts and likes to keep it as neat as possible... she also uses her smartphone and computer and doesn't want to have to delete things three times.  The built in email application absolutely sucks.  You can't even empty the trash to completely delete messages you don't want.  We experienced this on our phones and installed the highest rated email app we could find on the android marketplace, which also happened to be a FREE app.  B&N; makes nothing by distributing free apps in their marketplace, so this app was not available at all, and the selection was slim for other apps.  Even the touchpad app that people were using to syncronize with Microsoft Exchange servers apparently doesn't work (and is very expensive for an app).As I mentioned, I knew I'd be limited to B&N; app store - I just didn't realize how limited that app store was.My wife then started getting a bunch of free samples of books, and bought several of them.  They all downloaded except one stubborn one.  That book would load just fine on all the other Nooks in our house (the other two Tablets and we have two original Nooks, as well).  I sent an email to technical support and received the usual \"we got your request and will reply as soon as possible\" message, along with the addition that they are experiencing a high volume of help requests.  That was a week ago and we still have not heard back.  After a few days, though, we physically took the Nook to the store to get help.  Nothing worked; off/on, archive/unarchive, even de and re-registered the device (losing our wifi and email configs in the process).  This book still will not load.We finally \"side loaded\" the book, which required installing a program on my wife's PC (which is very annoying in itself) and we were required to create an Adobe ID (how much spam will we get from them, I wonder?).  After side-loading the book, it has no cover art... more annoyance.  That book still won't download correctly, even after they told us it'd be fixed in 48 hours (that was five days ago).I am not one to \"root\" products like these (especially since they aren't \"mine,\" as I won't be the one using them).  As the \"guy,\" it seems I'm responsible for all technical support in the house and didn't want to deal with the ramifications (or, frankly, even take the time to run through all those steps to do it).  It's not that I can't, it's that it's a pain in the buttocks and I simply shouldn't have to.  We were not asking for the world, we were asking for a table that had Nook e-reader software and allowed a few other niceties.  I wasn't expecting an iPad for $250, but I was expecting working software and a functional email program.It's technically not a bad tablet - the screen is bright and clear and responsive; the UI is decent (although I prefer the four buttons on my android phone over the single big \"n\" button on the Nook).  It's solidly built and sturdy; with Angry Birds and Netflix as my only benchmarks I can say they both run much better than they do on my phone, with no pauses (that I saw) in Angry Birds at all.However, the accumulation of annoyances was a bit too much for me (let's say there was a nagging voice coming from somewhere... the other side of the bed).  I am returning all three - luckily B&N; has a holiday policy that will allow me to return them, which is very cool of them.  They have not lost me as a customer; I have my books purchased from them and will continue to buy.I hope them the best in the future; it was a nice try.  If they just weren't so tight fisted about control over content (especially apps, in this case) I'd have stuck with it.  Technically speaking, the device is quite good and, at the current time, IMO, the hardware is worth the price tag.  I wouldn't mind being limited to the B&N; app store if they actually offered more apps... a LOT more, as they have practically nothing compared to what's available for the android community at large.  Again, I'm not asking for an iPad; I know the iPad can do some really cools things this Tablet can't, just something to make the \"tablet\" part of the Nook Tablet more worthwhile.I imagine they'll fix glitches with the download problem, too.  I'm not the only person who had a problem, but I think everyone else managed to find a solution (besides side-loading).  Keep in mind I generally know what I'm doing and tried everything, and the \"expert\" at the brick-and-mortar store couldn't fix it, either.  The lady from Glee didn't come out and entertain us while they fixed our tablet, either... that was disappointing.So that's my review - it's decent hardware hamstrung by a few bugs and tight fisted control over content.  Some will argue that it's not meant to be a tablet, it's meant to be an e-reader, but let's be honest - it's marketed as a tablet; it's called the Nook TABLET.  It doesn't have to be an iPad, but it should work a lot better than it does at being a tablet.", "overall": 2.0, "summary": "People shouldn't be surprised about what it is, but still disappointing.", "unixReviewTime": 1325635200, "reviewTime": "01 4, 2012"}