{"reviewerID": "AQNEQQ96MKX3Y", "asin": "1400501466", "reviewerName": "Gojira Neko (godzilla cat) \"widowpress\"", "helpful": [6, 6], "reviewtext": "I went to a few places just to try testing them out, best place to test them out first hand was BN. The people at Walmart didn't want you near them, and didn't know ANYTHING about them. Best Buy was pretty much the same, except you could 'sorta' test them out. BN though had people trained to know EVERYTHING about them, even the stuff that was not listed about them on the BN website.First thing not listed: if the Nook Colour can do it, so can the Nook Tablet. (for instance... read .cbz files without installing any extra apps)The 16gb model was much more responsive than the 8gb, so to me it was well worth the extra 50 bucks.Add to that that currently if you buy one at BN and don't like it, you have 2 weeks to return it for a full refund as long as it is still in new condition (so no attempting to root the device, which from what the rep told me will brick it unlike the Colour)that pretty much sold me, I found a place with micro SD cards on sale, bought a few, and took my Nook home.Pros:The screen is AWESOME! I use it for reading .cbz comics and .pdf files more than anything. The missing gap between the glass and screen made reading much better. Also the response on the touch screen was great.much better response time at turning pages, launching apps and using the inet that other tablets in the budget rangenative flash supportnative .cbz support (main reason I bought it)supports almost every popular ebook format except for .mobi (which can be converted to epub or .pdf anyway)good size for holding one handed for reading and lightweight (under a pound)battery life... 11 hours+ with wifi off, 8+ with it on, I tried it out and watched lots of movies and did some reading on it without it coming close to dying on me.a test drive opportunity if you buy it at BN and dont scratch it up or anything. I like the idea that I was able to take it home and so if it actually does everything that I want it to do wihtout a fear that I'm stuck with it for good.also if you buy it from BN you can buy an 'oops' return warranty (which means if you spill coffee on it or drop it, it can be replaced)affordable if you go without things like eating out 2x a week for awhileCons:lack of Android Market, lack of some apps I would like to see on the BN market (such as Google Music app) no sideloading apps at the moment either. That being said, this also means that apps available from BN will actually work with your Nook, there isnt a quantity over quality in the app store either. This means that if you've bought an app from Android market, you will have to buy it again if you want to use it on the Nook.The screen. trust me, I love it. But unlike other tablets where if you crack the glass you just have to replace the glass, on the Nook if you crack it, the screen is toastno front facing camera (or any camera for that matter). The ability to use Skype would have been nice, but wasn't a complete necessity. I've had many friends with tablets that had a camera that swear they never used it even once, and thinking about it, I wuld seldom use it either since most places outsite of my house that I will use it are places where video chatting would be frowned on, like Starbucks or the libraryno bluetooth, which to me didn't matter, but it seems to be an issue for some people. There IS bluetooth, but it's disabled and there isn't a way to enable itno GPS, this would be nice, unlike bluetooth, I would actually use it.mono speaker instead of stereo, again seems to be an issue for other people, I plug it into the minijack on my surround sound at home or the jack in my car stereo when I'm on the road though and its just fine. I use headphones if I'm out and about. Why on earth would I care about speakers that I never use anyway?no .flac support. a good chunk of my digital music now is .flac. it does have .ogg support thoughno .avi support. again, a massive portion of my movies etc are all in .avi format. It does have .mkv and .mp4 support though, so from here on out I will just have to rip my video files in those formats if I plan on watching them on it.lack of decent accessories selection. lets face it, the case market seems to be geared toward people that worship at the church of Steve, and the availability of accessories shows it.", "overall": 4.0, "summary": "GREAT .cbz (comic file) reader an more!", "unixReviewTime": 1330300800, "reviewTime": "02 27, 2012"}