{"reviewerID": "A1RFYCSNNOJ0VW", "asin": "B00000JDGQ", "reviewerName": "A. Alkins", "helpful": [2, 2], "reviewtext": "Paying (little cash), I was not expecting a great deal of volume from this speakers. Consider this, some cheap non amplified speakers cost near $15 dollars and for double that price, you would expect about double the quality. Well, let me tell you, this baby more than quad-triples the sound of those speakers.The Creative labs PC WORKS 1000 system comes complete with the 2 satelitte cubes, the subwoofer, power adapter, audio inputer cable, mounting stands, velcro attachments and screws. Installation was very easy, just plug the speakers in the back of the sub, plug in the power adapter in the power source and the audio cable in the sub and the source.The included manual is quite small but is adequate enough to help you set up and get the system running. They have recommendations on placement and volume. I plugged my system into a discman first. When I first turned it on I was amazed at the power of the bass. The OOMPHS really shocked me.Concerning the volume, this is one of the problems I have with the system. First off, the volume is somewhat hard to find the appropriate setting. (There is a bass adjustmant on the sub and a volume control on the audio cable) Finding a balance in bass and treble is quite hard. When the bass level is at 50% (as set when you first get the system), the bass tends to overpower the treble at lower volumes while the treble overpowers the bass at high volumes. Solving this problems involves alot of tweaking and depends on the type of music you listen to.My second problem with this system is the supplied velcro strips. These were supposed to be used to mount to a wall. I was obviously skeptical at the concept but I tried it anyway. About 3 days after mounting them to the wall, on one of the speakers, the velcro pad unstuck from the speaker so the speaker fell. After re-sticking it, almost a day later, the velcro pad stuck to the wall unstuck so the other speaker fell. After this happened, it is obvious that the actual sticking surface which attaches to the wall/speaker is too weak, not the velcro. If you decide to use the velcro, let the pads stick to the surfaces for atleast 2 days before mounting the speaker to the wall.Those 2 problems are my only ones, other than that the volume is excellent. You will be suprised about the amount of volume you can get from this system. Its hard to explain,...hear the sound, you will be amazed.....In conclusion, if you think about it, the cost of these speakers warrant it to be a typical speaker system for any computer and can easily be used for a small home theatre system. The speakers are magnetically shielded so you can mount them to your monitor. If you got extra cash and you want neighbours 2 or 3 houses down the road to hear you, consider pumping out that cash for a more expensive system. But for regular people like me on a budget, this system is an excellent solution for any sound need.", "overall": 4.0, "summary": "Cheap but powerful speakers", "unixReviewTime": 990057600, "reviewTime": "05 17, 2001"}