{"reviewerID": "A3IB1W0SVED0Z3", "asin": "B00000JDGQ", "reviewerName": "Mike Powers \"mkp51\"", "helpful": [4, 4], "reviewtext": "The Cambridge SoundWorks PCWorks speaker system was designed by Audio Hall of Fame member Henry Kloss and made in partnership with Creative Labs, the company that also manufactures Soundblaster audio cards for PC's. Simply put, this compact computer speaker system is an absolute dynamo!! It consists of two 3-inch X 3-inch X 3-inch satellite cubes, a 9-inch X 6-inch X 6-inch subwoofer unit, and a wired remote volume control unit. The subwoofer is the central unit in the system. In addition to pumping out a deep, mellifluous, natural sounding bass into the room, it provides amplification for the satellites.It doesn't take  long at all to get the Cambridge SoundWorks PCWorks speaker system set up and running. Here's all you have to do:* Connect one of the volume controller's 6-foot leads to the computer's &quot;audio out&quot; port, and the other lead to the subwoofer.* Connect each satellite's 10-foot lead to the subwoofer.* Plug the subwoofer into household current.* As the instruction manual points out, the human ear can't distinguish the location of bass frequencies; so subwoofer placement is not critical. I suggest placing it on or near the floor on a low-lying shelf.  For best results, don't  place anything within 4 inches directly in front of the subwoofer.After setting up my Cambridge SoundWorks PCWorks speakers, I really put them through their paces.  I test drove them with music as diverse as Beethoven's &quot;Spring&quot; violin sonata and &quot;The Best of the Guess Who.&quot;  I played a variety of computer games.  And, I watched the movie &quot;Gladiator&quot; in my computer's DVD player.  In all cases, The sound from these little Cambridge SoundWorks PCWorks gems was simply magnificent... at all times, crisp, clear, well balanced, and natural.  Never  any distortion, fuzziness, or clipping, regardless of how loud I set the volume.I &quot;discovered&quot; Cambridge SoundWorks speaker systems a couple  years ago, when I bought an &quot;Ensemble IV&quot; satellite/subwoofer system for my stereo. When I first bought it, I was amazed at the sound quality that emanated from that miniature dynamo; two years later I'm still amazed.The Cambridge SoundWorks PCWorks is as good as my &quot;Ensemble IV&quot; system; in fact, I rate it as the best computer speaker system I've ever heard. Considering its very inexpensive price tag, it also a system that packs a huge &quot;bang for the buck&quot; for consumers.So, if you're looking for a new computer speaker system that will bring your games, music, and movies alive, look no farther that Cambridge SoundWorks PCWorks. Go ahead... buy `em and set `em up... then kick back and enjoy the music!!", "overall": 5.0, "summary": "A compact audio dynamo!", "unixReviewTime": 992563200, "reviewTime": "06 15, 2001"}