{"reviewerID": "A2PWNYM29NJ2J4", "asin": "B00000JDHV", "reviewerName": "redcat72 \"redcat72\"", "helpful": [3, 4], "reviewtext": "I bought this camera after reading several reviews here, on CNET, and also by visiting webcam sites that use this particular camera.  I heeded the advice of reviewers to go directly to 3com's site to download the latest drivers for this, and installed those first instead of using the CD-ROM.  No problems on a Micron, 450MHz, 96 RAM, WIN 98 machine.  I installed the software no prob, BUT be forewarned the Webcam32 software (to create your own webcam on the internet) included is *not* registered!  You will have to pay for it if you plan to use it for more than an hour.  I did pay, just because I wanted this specifically for a webcam.  I'm not that crazy about the Webcam32 software though - it feels quite amateurish.  Alas, it's the only thing I have, so I will stick with it.  Apparently many other webcam creators like it.  The low light performance of this camera is excellent.  It self adjusts to many light situations.  Even the largest image resolution is very clear. I previously had a Logitech QuickCam Web USB Camera, but the image was quite grainy on that, and it was hard to get anything clear in a dark situation.  But it's user friendliness was excellent.  And it had a convenient FREE membership to spotlife.com, that hooked it's software into Logitech's, which did all the work for you to send a webcam image to their site. (with a quick refresh time as well).  I only wish this 3com camera had something as useful and easy software-wise. Also no problems with angling of the camera in the direction you want, as I read in another review.  Perhaps I got an improved version?  The cable doesn't weigh it down at all, and it sticks in the position you put it.  3com has discontinued this camera, so get it while you can for good quality!  This camera is quite small unlike the photos.  If you are just starting out, you might want to consider another cam for ease of use.", "overall": 4.0, "summary": "Excellent image quality! User friendliness could be improved", "unixReviewTime": 992217600, "reviewTime": "06 11, 2001"}