{"reviewerID": "A3W112102BC6BG", "asin": "B00000JDK0", "reviewerName": "J. Lara", "helpful": [13, 13], "reviewtext": "I bought these babies the same day that i bought my Vx. I thought that it would have been a good investment counsidering how small the styli are. Considering my penchant for misplacing things, particularly pens, i thought i should go ahead and get them. For some strange reason, I've only lost one in 6 months and that was the one that came with the unit. In that aspect one pack of these replacement stylus should last you a while.However if you can get other replacement styli that can fit the silo i suggest you go that way. The replacement styli dont seem to fit the silo as well as the original one. It doesnt fit right. After a little investigation i found that the plastic tip (the part that can unscrew) is slightly larger in circumference then the original stylus. Thats why it seems a little tight when you take the it out and put it back. Why this is, i have no clue but it's really annoying.For anything else you can get these babies to preserve the continuity of the unit, otherwise i recommend you find another replacement stylus that can fit the silo.Personally though i dont use the stylus. I recommend you go get one of those multi-pens that have a stylus, pen and pencil all in one. All serious Palm users use one of these instruments simply because any type of prolong use of the stock stylus will certainly give you cramps, at the very least. Its like writing with a toothpick. If you anticipate that your going to be scribling on your palm a lot go get a multipen. Cross makes a good one, Lamy and Rotring also makes excellent multipens. Personally i use a Rotring black matte Trio-pen. It carries a blue pen, stylus and pencil. Its a great size, weight and looks incredibly cool.Again if you anticipate scribling alot on your palm, i strongly recommend getting a multi-pen. However if you dont think you will be the stock stylus will suffice.", "overall": 3.0, "summary": "Good but not great", "unixReviewTime": 985478400, "reviewTime": "03 25, 2001"}