{"reviewerID": "A2ULPJ9UDZCGQ2", "asin": "B00000JF4M", "reviewerName": "Amazon Customer \"tech writer and web developer\"", "helpful": [35, 35], "reviewtext": "If you want to convert your VHS video tapes into digital format and don't want to purchase an expensive video capture card, this is an alternative.I've been able to convert VHS tapes into decent MPG, Real, and Microsoft Windows Media files in size 320 x 240, but not without some hassle. As an earlier reviewer pointed out, the software that comes with this product is very buggy and be prepared to spend some time troubleshooting to get it working.Here's my first experience. I use Windows 2000 on a PIII 550Mhz, with 256 RAM and 20 Gig EIDE harddrive. When Dazzle arrived, I followed the directions and installed the software and put the plug in the USB port and then discovered that this software only works with Windows 98. I visited the Dazzle web site and found out that you have to purchase a program called Movie Star is you want to use it with Windows 2000. I wound up ordering the software for [more $] plus shipping. Once, I received the new disk, I installed it, and once again, it did not detect the unit when I plugged it into the USB port. And again, I visited the Dazzle web site. I discovered that they have posted a patch for the Movie Star software that fixes &quot;some minor problems.&quot; I downloaded and installed the patch and after rebooting the machine, I was able to get it to detect the unit.The next step was to get Dazzle to work with my cheap... Mitsubishi VHS player. I was able to get it to work with the S-Video port from my Panasonic DV camcorder, but I couldn't get it to detect the output plugs from the VHS player. Finally after rebooting the machine twice, I got it to work.Next getting the software to work was another challange. despite having a fast machine with a lot of RAM, I found the Movie Star program to be very unstable. I was able to capture up to 60 minutes of video and save it to the MPEG format, but everytime I tried to edit or export the video as Windows Media or Real, it crashed the machine. I downloaded a copy of Ulead's Video Studio, but couldn't figure out how to import MPEG files. I finally bit the bullet and wound up downloading a free 30-day trial of Adobe Premier. I found Premier to be a very stable and easy to use program. I just wish it didn't cost [so much!]For my trouble, I found the output from Dazzle to be satisfactory. You would get better results if you spent big money for video capture card that would let you plug an S-Video cable into the back of your PC. Another better alternative would be to use Firewire. (I always use Firewire with my Panasonic DV camcorder and it works great.)After my experience, I cannot recommend this unit to others. I don't think it's fair that this company charges Windows 2000 users extra $.. for buggy software. And I think they could improve the USB connect so it isn't so difficult to use. I am giving this Unit two stars because it does the job, but only after spending a lot of time and some additional money to make it work.", "overall": 2.0, "summary": "It works but prepare to spend time troubleshooting", "unixReviewTime": 987724800, "reviewTime": "04 20, 2001"}