{"reviewerID": "A2ILMCJBXWF5TS", "asin": "1400501466", "reviewerName": "Steve \"Steve (Walnut Creek, CA, USA)\"", "helpful": [52, 57], "reviewtext": "Update 2-Sep-13:Put on CM 10.2.2 (Android 4.2.2) last week.  I've got to say, it's nice.  Fonts are small, though one could choose dpi if they had visual issues (google this).  Netflix works, and the UI is really quite nice - pretty much no need for Button Savior, battery life is same as CM7.  In general I like it better than CM7.  My major hardware dislikes are headphone jack requires a little wiggling sometimes, no BT, no GPS.  Seems to charge fine with a normal cable.At this point I lean toward Samsung tablets - I like the IR and the microSD slot.===========================Update Jul 2012: I've installed Cyanogen 7, which works with button savior.  I had trouble installing from .zip booting into recovery but was able to install without a hitch using a bootable microSD card.  Fonts are sometimes a bit big, as is line spacing, but in general, CM7 frees you of the B&N; walled-ness, even as somewhat mitigated below.  Netflix doesn't work, and Google Chrome won't run on Android 2.3.  Headphone jack a bit intermittent - need to wiggle wire sometimes.===========================Original review, Dec. 2011.===========================First I give a summary, followed by the details if U are interested.  I hope people will read reviews here, as, if you say much at all on B&N;'s site, they don't post your review and don't allow you to modify it so that U can post it!:A Nook Tablet could be quite good if you only want to:-  Read ebooks purchased from B&N;-  Browse the web on a tablet-  Play a small selection of games, having to pay 3-4X normal Android/Apple pricesGet something else or modify it if U want to:-  Buy a full selection of games/apps-  Pay the same price for a game as U would on an iPhone/iPad, Android Phone buying from either the Android Marketplace or Amazon App Store.-  Play music where U can sort by artist, album, genre, etc.-  Play mpeg videos-  Watch YouTubeIf U are willing to do a bit of work, you can do all this by modifying the device.  I used it rooted with the modifications described below for 11 months, before installing Cyanogen 7.2 on it.  This is a huge improvement over rooted with the below modifications - it's essentially a normal 7\" Android tablet now.The Details:============My daughter got a Nook Tablet for Christmas 2011.  She'd been saving for an iPad (~$500) but at the rate she was saving, we took pity after a year and a half.While she does read (and so do us parents), she also wanted to use it as a music player, and a movie watching device while away from wireless in the car, on a plane, etc, and she wanted to play some games.I did my reading and we seriously considered an iPad for the family with each of our 2 kids putting in $150 or so.I read about the Kindle Fire and Nook Tablet - the Fire only had 8GB of onboard storage at the time, and no micro SD slot.  A deal-breaker.  This was pre Samsung GalaxyTab, Nexus, etc.  Since the Nook Tablet has 16GB and a micro SD slot, we went to a store to take a look.  Sales guy was good, and the device hardware shows well.  Once we got it home and were doing more reading about setup, we found the first of our issues:Issue #1: Onboard Memory========================Of the 16GB of storage, you can only place your own items in 1GB.  The rest is for B&N-purchased; content.  1GB is not enough for a music collection, or any significant amount of video.  A 32GB Class 4 micro-SD card was also in her stocking, having read about this ahead of time.Once she unwrapped it and we set it up (easy enough), annoyance #2 showed itself:Issue #2: App prices and quantity=================================2 Examples: Angry Birds and Fruit Ninja.-  BN Market: $2.99, $3.95.-  Amazon's Android Market: $0.99 (ad-free), with free ad-supported versions available-  Android Market, $0.99 for either, plus free, ad-supported versions available.-  Apple App Store, $0.99 and $0.99, plus free, ad-supported versions available.YouTube: free/pre-installed on all Android/Apple phones/tablets I know of, not available on the Nook Tablet, not in the Nook store.I didn't buy either game, but instead looked back to some of my pre-Christmas reading - U can load Amazon's Appstore without rooting the device, esp. if it's running v1.4.0 of the software.  I got that working and bought $0.99 ad-free Fruit Ninja and Angry Birds.  While I was at it, I side-loaded a few other apps by e-mailing them to myself and web-browsing to get them, and got usb drivers working on an XP laptop so I could sideload via adb over usb.I wasn't home for Christmas, but I did have my work laptop which has music on it.  I copied some over and began to use the music player....Issue #3: Built-in Music Player Limitations===========================================The built-in music player in Android is decent - has been since Android 1.5 - the first version I used.  U can, generally, sort by artist, album, etc, and the UI has dark backgrounds rather than white.  The Nook built-in music player doesn't allow sort. For this, I didn't want to buy a music player, so I went ahead and rooted the device and installed Honeycomb's (Android 3.0's) music player, which is free.  Also put the standard Android YouTube app on since I could now access the Android Market.  The problem wasn't quite solved, because changes to the SD card (adding files) weren't recognized.  I tried Winamp, Songbird and Android 4.0's music player when ICS came out.  They had the same issue.  TTPod does work - you can manually refresh at any time.  I now run Cyanogen, whose music player (modified stock android to add gesture support) works just fine.  They were aware of tablets when they wrote it.This is ironic - B&N; had to do actual work to make it much worse than using the normal android version, plus they had nice opportunities to improve on the experience of a phone due to the large screen - Cyanogen 7 Android supports gestures for music - do an arrow to the left like \"&lt;\", say, and it'll go back a track.  This would be great while driving.(Note that U can unroot by putting a copy of 1.4.0 on an SD card which, though I'm not sure, would probably allow you to return the device if U needed to).Issue #4: Built-in Video Player Limitations===========================================I'd also brought on my work laptop half a dozen videos I nabbed from our TiVos from which I stripped the commercials, saving them as mpg videos.  These wouldn't play with the built-in player.I solved this with MX Player, free version, which plays them fine. U can do this only if U've installed Amazon's App Store or rooted and can access the Android Market. People out there are selling PC software to convert videos to a format Nook Tablet can use. No need - just get another video player.  MX Player Tip: brightness control is an up/down swipe on the left hand side of the screen, volume on the right.Issue #5: UI Inflexibility==========================U can't add shortcuts to the desktop, and can't do much with the sliding apple-style bar either.  For this, I installed App Manager (tough to find a .apk to sideload using adb, so I needed rooting and then got it from Android Market).  This is a fantastic app and I don't use my GoLauncher screen much any more.Also, there's one physical button.  Standard android buttons such as menu (right-click) and back aren't always around in the UI, and holding home doesn't bring up a list of open applications as it does in carrier or stock android.  They should have put those standard 2 buttons on the device.  Update after a month rooted: use Button Savior, which gives soft buttons with a flyout.  Once in a while, you have to use NT Hidden Settings to check USB Debugging unless you use Cyanogen.  Update post Cyanogen: CM7 can have soft buttons (back, menu, home, etc) displayed all the time, if desired, and has Button Savior installed as well.Issue #6: Can only charge with their charger/cable==================================================Nothing more to say.  BlackBerries and Android phones in the house all can charge in the car or at all the computers by just connecting a cable.  It charge very slowly, even if it doesn't tell you it is, when connected to a PC because or other charger.  With some irony, B&N; has had to mail me both a charger and a cable this year due to breakage.  If they could charge with any micro-USB cable, they wouldn't have to.  Update post-Cyanogen: With Cyanogen, it charges with any micro-USB cable, though slowly unless it's the actual Nook stuff - there must be something in hardware.Issue #7: OTA update breaks all the niceness I've achieved==========================================================An OTA update, v1.4.1, will break the ability to mail yourself .apks to be used to enable non-BN apps to install and to enable debugging.  I imagine U could have done these steps while on 1.4.0 and gotten sideloading via PC/adb to work, but U can't disable OTA updates.  U can if you root, though, so I did, then used SQLite to modify a setting to only update when done manually. It'll never auto-update.  Update post-Cyanogen: irrelevant now.Goodness #1: Hardware is pretty sweet=====================================Snappy, installs apps fine, opens them quickly, videos are fairly smooth, scrolling is pretty good (but not as nice as Apple's).Screen is great from angles, clear and bright.It's lightweight and can be held easily in one hand.Speaker is pretty loud - louder than any of our phones except maybe BlackBerry.Goodness #2: the Reading Aspect===============================The reading end of the device is well-implemented, though I give Amazon's original Kindle and all subsequent ones and advantage - an order of a book on an original kindle appeared on the device in less time than it took me to back out of the purchase UI.  Doing so from the web is also very fast.  A web order using a computer of a B&N; sample appeared about an hour later, but quite snappily when done from the device.Goodness #3: Books with Videos/Sound====================================Yes, these are available on Kindle Fire and iPads. I know. I do like the talking kid's books (reminds me of a LeapFrog Tag pen, but without the ability to touch words and hear them), and the free cookbook sample had a video of making a chocolate sauce.  This is good for cooking!  U can see what each stage is supposed to look like.Goodness #4: Good if U Root it, for $250========================================When rooted, it's a nice tablet + it has the B&N; connection, and it cost $250.  It isn't an iPad (no cameras or BT), and it's half the price.  Update Nov 2012: There are now a multitude of 7\" tablets (ASUS, Samsung, Google) which get my recommendation.", "overall": 1.0, "summary": "Very Limited Unless You Modify It", "unixReviewTime": 1325462400, "reviewTime": "01 2, 2012"}