{"reviewerID": "ATELSGYOHCL3E", "asin": "B00000JFIF", "reviewerName": "Jessica", "helpful": [36, 37], "reviewtext": "So many people have written about the technical part of this wonderful camera. I agree with many of them. You won't feel bad about spending your $$$. I've shopped around and I've made my decison with confidence. (Yes,  you can find this item for less at other e-stores, but I trust Amazon, they  deliver promptly and their Customer Service is great!)  Some customers have  said that this camera eats batteries like crazy. It's only true when you  use the LCD monitor to TAKE pictures. If you use it  for reviewing (and  deleting) the pictures you have taken, it lasts a long, long time. I have  purchased my camera before Thanksgiving. It's December 12, and after taking  hundreds of pictures (most using flash), I am STILL using the batteries it  came with!  Lemme tell ya a little secret, if you do take pictures using  the LCD monitor, and you get the message that the battery is low, turn off  the camera, let it rest for a little while and turn it back on again. The  battery life will show full again! No need to change the batteries until it  tells you it's dead and you have been taking pictures using the viewfinder.  Now, it is not a bad idea to get yourself some rechargeable NiMH batteries.  I've seen many good comments about the brand MAHA. Also, I have seen great  reviews on MAHA's charger model MH-C204F. Some people have mentioned them  here. But I didn't know where to purchase them from. So here you go. For  more info on the MAHA products, go to Maha-comm website. And to purchase  these two products, check out Thomas-distributing's website (sorry I can't  include the exact web addresses according to the reviews guidelines, but it  isn't hard to figure out). For around $50 I got the charger and 8 NiMH  batteries. Now you can go on the road and not worry about your batteries  dying or where to purchase them.  It's a lot of fun to have a digital  camera and take hundreds and hundreds of pictures knowing you don't have to  pay for developement or wait to finally see your pictures. Just download  them and enjoy or use the video cable to see your photos on your TV. Or  just use the LCD monitor! :)  -- From a happy Olympus/Amazon customer. :)", "overall": 5.0, "summary": "The D340R is a great camera!", "unixReviewTime": 944956800, "reviewTime": "12 12, 1999"}