{"reviewerID": "A3KSDF3A05PXJ7", "asin": "B00000JGNB", "reviewerName": "J. Russell", "helpful": [78, 79], "reviewtext": "This is a versatile charger that charges all standard size NiMH and NiCads, and reliably. I have used it for a year with no problems, a good value for the price.Smarter chargers have been recommended here(at about three times the price) to compensate for some of the issues with not-so-smart but less expensive chargers like this one. I must admit, the information provided by Energizer with this charger doesn't help to understand the limitation of this 'fixed time' charger.It will put 430MilliAmps for 5 Hours into a AA NiMH. 430Ma times 5 Hours = 2100MaH. It uses 370Ma in its 'NiCad' setting for 3 Hours = 1100Mah for AAs. Since there is always some existing charge left in rechargeables before recharging, if your NiMH AA's capacity is less than 2500Mah(typically yes for AA NiMH) they will be fully charged by this charger. Likewise, NiCad AAs less than about 1200MaH(typical for NiCads) your batteries will be fully charged.You can use the information above and the charging currents given on the Spec Sheet for this charger to figure charging capacities for other size and capacity batteries. C and D size capacities greater than 30000MaH will not be fully charged in one 5 hour cycle and will have to be cycled twice(2 X 3000Mah = 6000Mah)or more times, unless left in the charger to trickle charge for a long period of time(a good idea in any case to top off all charges). Every 24 hours of 65ma trickle current will add another 325MaH charge to a C or D cell till it reaches its full rated Mah capacity. Trickle charging batteries by leaving them in the charger after the 'timed' charge cycle (5 hours on 'NiMH' setting, 3 hours on 'NiCad') will keep your batteries topped off to full capacity at all times without hurting them.So, this charger is a good value if you understand what it does and and does not do. Those with less knowledge or time, but more money, may want to buy the more expensive Smart Chargers others have mentioned here. The Vanson would be my choice, a very good value. I have derated this charger because of lack of information provided to the consumer by Energizer on its site and on its Spec Sheet for this charger. They're not alone in this department, but there is still no excuse for this.If you really don't need a Universal(all battery types charged) then you can get a Smart AA/AAA combination charger for much less. I would recommend the RipVan Lighting 4000N at RipVan100.Com. It charges fast but gently(doesn't over-heat batteries, a life killer).Hope this has helped everyone. Rechargeables are the only way to go for saving you gobs of money and the environment gobs of abuse. Buy good high capacity rechargeables, like highly rated Energizer's, and buy a good charger that will treat them right for you. Noooooo overheating by cheap Quick Chargers.", "overall": 3.0, "summary": "Good for the Price, but Understand it ain't Smart", "unixReviewTime": 1125014400, "reviewTime": "08 26, 2005"}