{"reviewerID": "A35FTKYO9UQZWF", "asin": "1400501520", "reviewerName": "AmazonFever", "helpful": [69, 72], "reviewtext": "I've owned an Ipad 2, an original Kindle Fire, and first generation 3g dual screen Nook. I decided it was time to upgrade my original Nook and went with this tablet. I purchased mine direct from B&N. This is a fantastic ereader with a few tablet functions. I really like the interface on this ereader more so than the Kindle Fire. Don't get me wrong, the Kindle Fire is a very nice device, but I like the personal touch I can give the Nook HD. It's more customizable.I can create my own wallpaper and customize my home screen. The ereader is very light and easy to hold with a contoured, grippy back. The screen resolution is fantastic! Even small print is readable. The colors in magazines is exceptional and the scrapbook feature is an innovative touch. I really appreciate having a physical home button, and external volume rockers & power button. The interface is very user friendly and aesthetically pleasing. Setting up email was a snap and customizing my security settings from lock screen passwords to shopping passwords is much appreciated. Web browsing is very zippy on this device. More zippy than the Kindle Fire. Ereading is also a pleasure, with customizable fonts & backgrounds. I was surprised at how well I was able to read on it outside in the shade. It still has a lot of glare, but it is much more readable than the Ipad or the Kindle Fire.I can't see the Ipad or Kindle Fire screen at all outside with all the glare. Nook HD is NOT as readable as an eink screen, so I will be keeping my original Nook of 3 years for outdoor reading. But for a tablet ereader, I was really surprised at how well it did outside in the shade. I have since given my husband the Ipad 2, as I like the 7\" form factor of the ereader/tablet devices. I take them with me everywhere. If you were to ask me which I liked better, the Kindle Fire or the Nook HD...well...I wouldn't be able to choose. Amazon has a larger store for books, apps, movies etc....but I like B&N's Nook HD for it's interface, superb screen and customizable home screen. It also has expandable memory, and you can sideload epub books. I also like the look of the Nook HD better. It would come down to personal preference and which store you have the most investment with. All in all, the Nook HD is a great device that hasn't gotten the attention it deserves, and is worth serious consideration.", "overall": 5.0, "summary": "Great little device!", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}