{"reviewerID": "A127KI9JEAESJ1", "asin": "B00000JI4F", "reviewerName": "Randy L. Plunkett", "helpful": [2, 2], "reviewtext": "1 Star because it doesn't work.Apple: 2013 iMac - drive won't even register, just clicks away.Apple: 2009 MacBook Air - same as above.MS Windows 7 on a 2012 Acer laptop:Pulled up directions at mfr. website. FL-UDRV model number not found - it's under SBT-UFDB. Anyway, plugged drive in; Windows 7 installed the driver; checked to ensure it &#34;mounted&#34;.  I even had Windows search for an updated driver. Nope, the current one is good. Then the fun: inserted a 1.44MB floppy disk with data; the drive did not activate any Windows &#34;window&#34; like a CD/DVD does. I had to bring up Windows Explore to view the drive. Clicked on it, the drive actuated - click, spin, zoom, zing, the green status bar showed progress! But alas, Message Window! This disk in the drive is not formatted. Wow. Eject. Insert blank floppy with the tab set to unlock. Again, had to select from the Explore window. Again, click, spin, zoom, zing. Oops, disk needs to be formatted. Select Okay. Now it was hummin'. Windows green status bar once again showing progress - the drive is spinning - green light on - then stop. Then a new window pops up with formatting options. All fields looked correct so I selected the Format button. One more time for click, spin, zoom, and zing. Then stop. New window - Windows cannot format the drive. Several attempts followed to get this thing to work. Shut down the PC. Booted with the drive connected - no dif. Tried different USB ports - no dif.MS Windows 8 on a 2013 Toshiba laptop:See above.I'm not sure what's up with Sabrent and their models. I purchased the FL-UDRV. There is no manual on their website for it. There is for the SBT-UFDB, though. I took a chance on a product that had 22% negative reviews (39 out of 174 were 2 stars and below).  The SBT-UFDB fares no better with 61 out of 197 reviews rated 2 stars and below. That's 31%!  Guess I'll keep looking.Bottom line - it's going back.", "overall": 1.0, "summary": "Sabrent External USB 1.44MB Floppy Disk Drive (FL-UDRV)", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}