{"reviewerID": "A1RO3O4905L66T", "asin": "B00000JMO4", "reviewerName": "B. Garrett \"kitchen guy\"", "helpful": [67, 68], "reviewtext": "I've played with this digital camcorder for about 5 days now and I am delighted with it's quality and features. If anyone's disappointed with the quality of the video (see reviews below), they are probably being  unrealistic in their expectations. To get better video, you'd have to go up  to a 3CCD camera (at about 3times the cost!). As for those who say that the  camera is too big and heavy, I say just TRY shooting a still video without  a tripod with a camera as small as a paperback book! You NEED something  larger to get a good steady picture (even with &quot;steadyshot&quot;). I  appreciate Sony's innovative digital 8 because the tapes are less  expensive, but you still have the quality of digital recording (the Pauses  are terrific!). I'm not worried that these tapes are not interchangeable  with the mini-DV format. I mean, how often would I want to trade digital  tapes with someone? I also have the option of playing back any old 8 or  hi-8 videotapes that were previously recorded, and converting them to  digital (try THAT with a mini-DV camcorder)! I like having A/V outputs AND  inputs so that I can digitally record from a source other than the camera  lens. The Sony infrared &quot;nightshot&quot; is astounding. It's like have  nightvision goggles for your camcorder! The LCD screen on the TRV310 is  WONDERFUL... 3.5 inches! The 20X optical zoom is sufficient, and going  partway into the digital zoom ain't too bad either (as long as you don't  try to actually use the full 360X!) I cannot say enough good things at this  point. If I have to find something negative to say, I wish some of the  controls were in easier locations to get to while I'm still filming. All in  All, a nifty camcorder that I HIGHLY recommend!", "overall": 4.0, "summary": "A GREAT digital camcorder at an ASTOUNDING price", "unixReviewTime": 940377600, "reviewTime": "10 20, 1999"}