{"reviewerID": "A1ILWPH1GHUXE2", "asin": "B00000JMO4", "reviewerName": "JB", "helpful": [4, 4], "reviewtext": "I have had this camcorder for 4 years and I am still happy with the purchase.For myself being a big guy, I was never comfortable with the tiny MiniDV camcorders out there, and the size of the Digital8 camcorders is a nice fit in my hands, without being too large and heavy for my wife to use comfortably.I have not had much chance to do comparison testing, but the picture quality is very good.  In some cases I might think the color is a bit undersaturated, but I prefer this to seeing colors pushed beyond what they should be.  I have no complaints about the sharpness of the video.  In very low light the picture doers become grainy; I suspect that new camcorders out there may do a better job in low light than the TRV310.One thing I really like about this camcorder today is that it seems better built than the Digital8 models than Sony is currently producing.  In addition, the lens is a bit larger on the early Digital8 models, so low light performance may actually be better than the current ones (but I have not done a comparison).  I also will recommend the TRV130 for video editing; I have had no problems loading video off of the camcorder onto my Windows XP PC with a firewire cable.My complaints on the camcorder:1. Still uses tape, which can jam up inside the camcorder (luckily I havent lost a tape yet).  I've also been told specifically to use *only* Sony Hi8 / Digital8 tapes with this unit.2. There is a manual exposure setting, which is good for shooting candlelit scenes, etc.  But the camera is missing a manual white balance that I wish it had.  The white balance is done automatically when the camera is turned on; when indoors with natural light I will point the lens to a blue object at powerup to eliminate a bluish tint to the picture; likewise if the indoor scene is lit I will point at a warm-toned object to eliminate everything looking orange.3. The supplied Infolithium battery is useless.  I which Sony would include one of the larger batteries as standard.4. As mentioned above, low light performance could be better.  The low light settings the camera provides are rarely used.Altogether, I'm very happy with this camcorder.", "overall": 4.0, "summary": "Excellent product after 4 years - only a few small gripes", "unixReviewTime": 1103673600, "reviewTime": "12 22, 2004"}