{"reviewerID": "A1X3DA7C61WZLQ", "asin": "B00000JMRX", "reviewerName": "Kris", "helpful": [3, 3], "reviewtext": "This radio is a great value in a PLL-digitally-tuned radio.  It is being phased out in favor of the Eton/Grundig E100.  These days there has been a trend for analog-tuned radios with digital frequency counters like the Grundig 350 field radio.  While these radios are easy to tune and bandscan, they do not have any memory presets and the tuning drifts after a few hours based on temperature and humidity.  The Grundig YB300PE, on the other hand, is a true digital radio and has 24 memories.  The memories are a boon for FM/AM listeners like me who like to \"channel surf\" during the long 12-minute commercial breaks on Howard Stern and the Don & Mike show.  The direct frequency input is unheard of at this price, especially for a Grundig.  Granted, this radio is no longer made in Taiwan but mainland China (the box actually says \"QUALITY PRODUCT MADE IN CHINA\" in big letters, possibly in response to the reviews it gets in the Passport to World Band Radio book).The extras that are included with this radio cost almost as much as the radio itself: a quality AC adapter that doesn't introduce that annoying 60 Hz hum, a reel antenna, a carrying case, earbuds, and a lanyard that is actually really handy (the radio is much smaller than you might imagine from the pictures).  It runs on 3 AA batteries for what seems like forever in FM, and only a little shorter when always in AM or shortwave (cheap off-brand AA batteries are included).I can't really say that the speaker is useful for those who want to hear music but those folks are better off with the YB400PE, the larger cousin of this unit, or even Sony ICF-SW7600G.  No single-sideband is available but if you're serious about something like that you won't be buying a radio at this price, anyway.Overall a good radio for AM and FM digital preset channel surfers like me and the occasional jaunt into shortwave.  A great clock radio for travelling, too.", "overall": 4.0, "summary": "Great size, easy controls, true digital tuner, tinny speaker", "unixReviewTime": 1109289600, "reviewTime": "02 25, 2005"}