{"reviewerID": "A1I3GL5GLBEQ7X", "asin": "B00000JMRX", "reviewerName": "N22Tango \"Film tonight at 10\"", "helpful": [1, 1], "reviewtext": "My Grundig 300PE was a Christmas gift, 2009. One week later, it wouldn't turn on.(PLEASE NOTE THIS IS AN UPDATED REVIEW... MY FULL REVISION AND EXPLANATION IS FOUND BELOW, UNDER THE ASTRIX ...)I've installed new batteries and it won't work on the external power source either. The \"light\" works, but nothing else will power up.This is frustrating, and sadly Grundig when it was a product made in Germany, was an outstanding line of radios. Now that they are made in China, there is no reliability in the products.I'd suggest \"buy at your own risk\" and understand that this radio has a short shelf-life.The audio quality (while typical for a radio having a speaker this small) was GOOD. It had an easy time receiving a signal inside my home in a rural area, miles away from FM transmitters. My old Sony portable radio (which I purchased and took to Russia in 1989 in order to get shortwave broadcasts from the USA) finally died after 20 years. The Grundig (when it worked) never performed as well as my Sony (made in Japan)but I wasn't too disappointed with the performance of Shortwave listening on this tiny radio. The Sony would hold a station better and not drift as bad as the Grundig and the Sony had vastly superior audio, despite having a speaker about the same size as the Grundig.******* UPDATE.  This Grundig radio EASILY \"dies\" often after being powered off and left to sit idle for a few days. I thought a component had gone bad inside the radio and I was about to shoot a video to post on YouTube showing a hammer crushing the darned thing because it \"died.\"  However, I have been able to get this radio to working again (on several occasions) by pulling the cover off where the batteries go and discovering on my own, that there is a very VERY tiny reset button under the batteries. It has to be reset with a toothpick or a paper clip. When I reset the radio, it's like it comes back from the dead and works. But that being said, resetting this little monster is a frequent chore.", "overall": 3.0, "summary": "Xmas present, poops out but can be \"reset\" to work again", "unixReviewTime": 1263427200, "reviewTime": "01 14, 2010"}