{"reviewerID": "AY8Q1X7G96HV5", "asin": "B00000JSES", "reviewerName": "Chris Prinzivalli", "helpful": [4, 7], "reviewtext": "Sony Has Sure Come Up With Another Great Hit...This DVD Player Is The Only One You'll Ever Need To Buy...At This Price And With Features, You Can't Beat It...Below Are Features And Details For All Of Us Technical  Junkies...Alot Of These Specs Are Typical Of All DVD Players, But Sony Has  AVery Well Engineered Unit...If You're Not A Techie, Just Go And Get One At  Your Local A/V Store... Features: *Sony precision drive system;  *-Advanced SmoothScan high speed search; -. *32-bit RISC processor;  *-SmoothSlow slow-motion forward and reverse. *10-bit Video DAC with 27 MHz  processing. *Component video output (Y/PB/PR). *Digital video noise  reduction, equalizer. *Dolby digital 5.1-channel decoder with full  adjustments.  *Sony digital cinema sound modes for movie playback.  *Customfilediscmemo display lets you name CDs.  *96 kHz, 24-bit linear  PCM capability.  *DTS digital output to an outboard decoder. *CD-text and  DVD-textdisplay with compatible discs.  *5-way picture navigation for  superior menu control.  *Jog/shuttle ring; menu disc control.  *Quick dial  access to CD tracks and DVD chapters.  *DVD navigator multi-brand remote,  phosphorescent keys(These Keys Are So Cool). System:  *Plays DVD-video.  *Plays CD digital audio. Plays video CD. *Precision drive system Sony's  second-generation transport design includes dynamic focus, active tilt  control and an advanced DSP servo system for superb tracking of disc  imperfections. Also has high-speed stepping motor for fast track and  chapter access.  *Digital RF processing.  *DSP servo: adv.  *DVD-text, CD  textdisplay. Displays titles and other information with compatible DVDs.  Displays song titles, artist name and disc titles with compatible CDs.  *Customfilediscmemo.  Video:  *SmoothScan 32-bit RISC processor.  *10-bit, 27 MHz video DAC.  *Digital video noise reduction This circuit  reduces video noise-the tiny flecks and specks of unwanted color that can  detract from your picture.  *Video equalizer (Who Will Ever Use This).  *4-tap letterbox conversion.  *SmoothScan high-speed search for./rev.: adv.  Uses a 32-bit RISC microprocessor for superior scan quality in frame  advance, slow motion (at 1/10 and 1/5 speed) and high-speed search (at 2X,  10X and 30X speed)-all in forward and reverse.  *SmoothSlow forward/reverse  A refinement of SmoothScan for enhanced slow speed performance in forward  and reverse. *Frame-by-frame forward/reverse.  *DVD repeat, program,  shuffle.  *DVD resume play. Audio:  *96 kHz, 24-bit linear PCM.  *Dolby  digital 5.1-channel processing: Built-in. *Dolby digital setup controls.  *DTS digital output lets you hear multi-channel digital sound from  compatible DVD discs, when connected to a DTS decoder or an A/V receiver  with DTS decoding. Compatible Sony models include the TA-E9000ES  preamplifier, STR-DA50ES, DA30ES, DE935 and DE835 A/V receivers (Receiver  Must Be DTS Compatible).  *Variable Coefficient (VC) digital filter A Sony  breakthrough that actually enables you to choose the basic digital  filtering process. Lets you adjust the character of CD sound between  &quot;Sharp&quot; and &quot;Slow&quot; roll-off in accordance with program  material.  *DigitalCinemaSoundsystem DSP system that reproduces the  precise acoustics of acclaimed mastering stages at Sony Pictures Studios in  Hollywood (If You've Ever Been There, You Know How Good It Sounds - SSL  Console And Genelic Speakers).  *Virtual enhanced surround sound creates  the sound of rear speakers when you're only using a stereo pair. *Digital  output off mode.  *Audio priority automatically finds and plays the audio  track with the most channels -DTS or Dolby digital tracks. No more  searching through menus.  Convenience:  *Graphic user interface menus: bit  mapped. *Screen saver if you pause the player during an extended telephone  call, you projection television could be damaged by phosphor burn-in.  Sony's screen saver can literally save your television.  *Bit-rate display  shows the video data rate. *Bit-rate history.  *Audio level meter.  *5-way  picture navigation Sony convenience that generates on-screen menus for  discs-even where the producers did not.  *DVD navigator remote for easy  access to DVD functions. You'll find the Sony shuttle ring, menu disc  point-and-click control and unified operation for 38 brands of television.  The DVP-S7700 and S550D remote controls also operate the volume control for  8 brands of A/V receiver.  *Sony shuttle ring: unit, remote.  *Menu disc  control: unit, remote.  *Multi-brand TV remote These remote controls also  operate 38 brands of television. The DVP-S7700 and S550D remote controls  also operate the volume control for 8 brands of A/V receiver.  *Multi-brand  A/V receiver volume control. *Phosphorescent remote keys principal remote  control keys that glow in the dark for easy visibility (Once Again, These  Keys Impress The Ladies). Outputs:  *One component video output interface  that maintains the highest possible image quality by keeping the video  picture in its original Y/PB/PR form.  *2 s-video outputs.  *2 composite  video outputs. *Opticaldigitaloutput enables digital-to-digital  connection for outboard Dolby digital decoding, DTS decoding or PCM audio  D/A conversion. *Coaxial digital output offers superb system flexibility  when connecting outboard Dolby digital or DTS decoder.  *Two pairs of  analog stereo outputs.  *Dolby digital 5.1-channel output.  *S-linkinterface connection to other Sony A/V equipment that enhances  system convenience. *Headphoneoutput with volume control. Specifications:  Video Horizontal Resolution, DVD:greater than 500 TV linesAudio Frequency  Response (DVD, 96 kHz PCM):2 -- 44,000 Hz, 1 dBAudio Signal-to-Noise Ratio  (DVD, 96 kHz PCM):&gt;115 dBAudio Dynamic Range, DVD:&gt;100 dB Harmonic  Distortion:&lt;0.0025%Weight:7 lbs., 8 oz. Dimensions:17&quot; x  3-3/4&quot; x 12&quot;", "overall": 4.0, "summary": "Sony DVP-S550D - Naturally, Another Sony Hit...", "unixReviewTime": 962236800, "reviewTime": "06 29, 2000"}