{"reviewerID": "A1J87C2DKBO441", "asin": "B00000JSGF", "reviewerName": "A. Evans", "helpful": [14, 14], "reviewtext": "I don't know about the rest of you but I have been researching products to allow me to play music for about 2 months and I've had a hard time making a decision.  I've looked a mp3, minidisc, and regular cd players.  I finally chose to jump in and buy this mainly because I didn't want the mp3 craze to pass me by :^).  Here's what I think:Styling:  Look good.  It is almost exactly the size of a cigarette box but the depth is about 3/4 less.  The clippable pouch that comes with it is okay but you need to undo the velcro tie to turn it on and completely pull it out to vary the volume.  The pouch is quite cushion-any and probably saved me when I dropped it.  It does feel and look durable.  The blue backlit screen looks attractive.  The mp3 file names scroll across the screen rather slowly but, again, a minor point.Sound:  Apart from the miserable headphones (my main problem was static as the headphone jack swiveled around the entry socket) the sound is good to great.  I wasn't looking for &quot;knock your socks off&quot; sound anyway but I am quite happy with it.  The highest volume setting is not as loud as I'd like it but it doesn't bother me to any great extent.Loading music:  Loading is quick thru the USB port.  I use  RealJukebox Plus (the one that costs money) along with an add-on to manage music loading and I am very happy with it.  I didn't like the Rio Audio Manager but it works fine.  Setup was a piece of cake.  Very intuitive and fast.Memory:  64MB allows me to place almost any CD I have in memory.  I have a mixture of 128KBS and 192KBS sampling rates on my mp3s and at 192 a single CD is about all that fits on there.  The expansion port for memory upgrades will come in handy.Overall:  Nothing really to complain about.  A nice little gadget that I'm very happy with.", "overall": 4.0, "summary": "This was a tough decision", "unixReviewTime": 971827200, "reviewTime": "10 18, 2000"}