{"reviewerID": "A1FIGM5NXX9J3Q", "asin": "B00000JSGF", "reviewerName": "Edmond Meinfelder", "helpful": [37, 41], "reviewtext": "I bought a Rio500 and regretted the purchase 5 minutes after opening the package.To load software from the computer to the Rio500, you use the AudioManager software that comes with your Rio. On 3 of 4 computers I tried the Rio software on, the software failed to properly interact with the Rio,  popping up a dialog saying, \"Either your Rio is busy or it has insufficient  memory. Try turning your Rio off, then on again.\" A brain dead message - I  wasn't trying to copy anything to my Rio, so memory isn't an issue here.  Diamond's tech support did find a work-around that worked on 1 of the 3  failing computers, though.The reason I bought the Rio500 is because  memory is expandable using flash cards. More memory is good. Also, I have  some Compact Flash cards for my digital camera lying around. Unfortunately,  Diamond opted to call their proprietary memory card, a flash card even  though the memory is incompatible with any device using the standard  compact flash card. The only reason I can fathom for the similar name is  duplicity on Diamond's part.The other reason I bought the Diamond is for  use in the gym. I grow weary of the classic rock at Gold's and want some  Talking Heads, Lords of Acid or maybe Mozart. The carry case packaged with  the player, however, is tedious. The fabric mesh case completely obscures  access to all controls. In fact, while fumbling, I accidentally placed the  Rio into \"loop this track\" mode. How did I do this? There is no loop  button. Several minutes of inspection, between workout sets proved  fruitless. Later, after I got home and read the manual - fold out pamphlet  is more apt - I learned Diamond overloaded the use of the multi-button. Not  only does the multi-button turn, but you press it for selections. If you  have a Sony HandyCam, you know the drill. However, while in the gym, the  Rio's interface had me baffled. I blame Diamond for a bad interface.A  classic problem in the field of computer science is the knapsack problem.  The knapsack can store only some many units and given a selection of  different-sized units, the problem is to optimize how much you place into  the sack. The limited memory of the Diamond is the knapsack. Your MP3s are  the items you place into the knapsack. Unfortunately, when placing MP3s  onto the memory cards, you have to select which card the MP3 is stored upon  - either the onboard memory or the expansion. The AudioManager does not  optimize for you. Leaving you to figure out how to best use every megabyte  on your Rio. This lack of optimization is exceptionally tedious.Looking at the  specifications the Diamond Rio500 seems a winner, but after some use and  field testing, I realize terrible mistakes were made. Diamond duped me with  their illegitimate \"flash card,\" the AudioManager isn't fully baked and the  interface to the player isn't straight forward due to one button having  more than 1 function. Give this player a miss and wait for the 3rd  generation MP3 players.", "overall": 2.0, "summary": "Rio500 -- Great Specs. Terrible Implementation", "unixReviewTime": 954115200, "reviewTime": "03 27, 2000"}