{"reviewerID": "A3FTI86WAVJOLG", "asin": "B00000JSGF", "reviewerName": "John A. Radi \"jradi\"", "helpful": [46, 53], "reviewtext": "Diamond/S3 has created a MAJOR dud w/ this product. I will never again purchase another Diamond/S3 product, nor will I allow someone to do so w/o hearing me out first.For starters - the box says that it's firmware is upgradeable to  support higher memory capacity at a later time.  Then after we'd already  bought it - they said they wouldn't upgrade the firmware past 32MB cards.  A huge uproar came about from all the owners since other companies were  supporting the 64MB cards.  Finally they relented.Then the new Rio's  won't support the memory cards that you buy for this product.  And memory  is the most expensive part.  There won't even be some sort of an expansion  pack - the new Rio's will use a proprietary type of memory which means you  can't use it in your PDA or Camera - and you'll pay a lot of money for it  too.Then, there product is HIGHLY bugey.  Crashing often, it has huge  battery issues.  For instance - if you're transfering data and the battery  dies then the unit has to be reset at the FACTORY.  And this happens a LOT  because unlike other USB products that are powered off the USB Bus, the Rio  drains batteries like CRAZY when transferring files.  I end up having to  put in a brand new battery every time I transfer files just because I don't  want to deal w/ a Factory Reset.The USB cable - not sold anywhere so you  can't get a replacement. You HAVE to get 3rd party software to download MP3's  to the Rio because what it comes w/ is Useless.  The CDROM it comes w/ has  3rd party software that you can only use for 30 days, thankfully MusicMatch  and RealJukebox will take care of that.The Rio500 will not be upgraded  to support some of the new codecs (WMA) which are half the size of MP3's.  The Rio600 comes w/ it - so obviously they're recognizing that this new  Codec is the way to go, but they won't support their older products.And why not?  This &quot;older&quot; product is the most current product  available by them to date.  And it's not like after shelling out $275 for a  unit,  you're willing to &quot;upgrade&quot; to another player in 6  months!Are you getting the feeling that they've upset me a bit!", "overall": 1.0, "summary": "I wish I could give it a negative rating", "unixReviewTime": 961200000, "reviewTime": "06 17, 2000"}