{"reviewerID": "A1KW4AGRCOIWI2", "asin": "1400501520", "reviewerName": "Sean Bryan \"Sean Bryan\"", "helpful": [0, 2], "reviewtext": "This is a really nice item. With the way I use it, the battery life lasts for several days of reading and browsing the web. Magazines on this screen are amazing, I especially like reading Time because of the outstanding photography they do. Books look great, and the selection of games on the Barnes and Noble store is alright. A little annoying paying again for games I already bought on my phone, but that's not so bad.Further, you really don't need to pay again for games if you install a custom ROM on an SD card. You can either purchase one premade (google for N2A for more info) or you can burn your own if you google a little more and spend the afternoon trying different things. It's not scary at all, especially since you're only doing stuff on the SD card not the tablet itself. If you want to undo it, just take the card out! Anyway, the custom ROM just gets you stock android, and that opens this great device up to the full android market of games and apps. You can still read all your Barnes and Noble stuff on the B&N; android app. I read my Wired subscription that way, as well as some books. Anyway, I think this device and the ROM on the SD card is the best of B&N; and android.Anyway, I'd compare this with the Google Nexus 7. The nook has a slightly higher resolution screen, which is kinda neat especially for magazines. No front facing camera on the nook, but my phone already is great for video chat so I don't miss it. Also, the custom ROM I put on my SD card is android 4.2, whereas google says the Nexus is android 4.1...maybe they'll get an update soon I don't know. So, either way, you probably can't lose.EDIT: Barnes and Noble opened up the stock software to be able to use almost all of the apps in the google play store. So, I don't use my custom ROM at all, because of the better battery life and just overall fit and finish of the Barnes and Noble stock software. It's a great tablet!", "overall": 5.0, "summary": "Great tablet, even better with custom ROM on SD card!", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}