{"reviewerID": "A12DLJESJKM1OQ", "asin": "B00000JXV3", "reviewerName": "Roy Chan", "helpful": [2, 2], "reviewtext": "Pros: Excellent value, great picture quality in S-VHS, jog/shuttle, S-Video in/outs, Easy setup, cables included, quality construction, lots of features, OK tracking, Super VHS ET mode, 400+ lines of resolution, Has 19u Heads For Taping In The Extended Mode, Can Record Super VHS On Standard Tapes, do I need to say more?!?!Cons: Tracking problems in EP mode, flimsy, some color problems, Super VHS tapes may be hard to find and expensive, the menu system is kind of complicated, Clunky remote, traditional programming procedure, Front Display PanelThe Bottom LineThe HR3600U is a bargain &#65533; the picture quality, S-VHS ability and features for $ are excellent.Highly Reccommended!!IntroductionMy reason for purchasing this VCR was simple. I wanted an inexpensive VCR with S-Video inputs. For those who may not know, S-Video inputs allow the transfer of 400 lines of resolution, as opposed to the usual 260 or so transmitted via RCA connections. In theory, the higher the resolution is the better the picture looks.FunctionalityIn addition to the VCR, there are a set of RCA cables and an S-Video cable included as well. Overall the unit is a piece of cake to setup. The unit has both RCA and S-Video jacks on the back, and a set of RCA jacks on the front. This makes it easy to hook up an external source (such as a camcorder or something) and record to VHS. I have my unit hooked up to my computer (it has a video card with S-Video out and RCA audio outs), and I haven&#65533;t actually used the input jacks on the front of the VCR. Another feature I really like is the simple 1-touch recording button on the unit. The way I have it set up, I can just reach up from my computer and hit it, and off it goes.This unit has a jog/shuttle wheel which is used to perform all the rewinds and fast forwards. I&#65533;ll have to say, this is my first experience with a shuttle wheel. I like it! It just seems more cool than a &#65533;rewind&#65533; or &#65533;fast forward&#65533; button. Lol The unit rewinds tapes faster than my old Zenith VCR.The clock is easy to set as well. I think this is an area which has been greatly improved upon in recent years. For that matter, all the menu items are laid out in a common sense manner, which makes programming and such even easier.I noticed some were saying they didn&#65533;t like the remote control, but I think it is just fine. Grant it, I don&#65533;t use it much, but the times I have used it, I haven&#65533;t encountered any problems with it.Two other things I really like are (1) Having a time code counter display on the LCD so you know how much you&#65533;ve recorded. (2) When you rewind, this little bar pops up on screen and shows you where you are relative to the length of the tape. It&#65533;s not really super useful, but I just like knowing where I&#65533;m at.Picture QualityI&#65533;ll have to say that for $, this unit produces great quality dubs in regular VHS mode. I&#65533;ve been using it for several months now, and the video productions I&#65533;ve produced always come out looking very good. And that&#65533;s the most important thing! I haven&#65533;t dubbed anything in S-VHS or S-VHS ET mode yet because none of my projects have warranted that. I would imagine that the picture quality would be even more outstanding than the regular VHS mode though.Nit PicksWhile the outer enclosure looks nice, the unit &#65533;feels- cheap. I don&#65533;t think it would hold up too well under any kind of rough conditions. Hopefully this VCR will reside either in your home theater or a setup like mine where it stays put and isn&#65533;t moved around too much.The cheesy &#65533;glow in the dark&#65533; keys on the keypad of the remote. I hate it when electronics manufacturer&#65533;s use these gimmicky things. They never work.ConclusionsFor the money, you just can&#65533;t beat this VCR. The ease of setup and great picture quality are this VCR&#65533;s strongest points. I highly recommend this VCR to anyone looking for a budget level VCR.", "overall": 4.0, "summary": "Good Value, Not Perfect, but A Perfection for viewing needs", "unixReviewTime": 1045958400, "reviewTime": "02 23, 2003"}