{"reviewerID": "A3S58J9HNVKP32", "asin": "1400501520", "reviewerName": "William Shakespeare \"The Bard\"", "helpful": [1, 4], "reviewtext": "Mixed up the review to show how the Nook changed with Updates within 12 hours of opening the box.Opened the Nook packaging with great anticipation. The instruction set is barely nuts and bolts but it gives one the essentials.It passed the back pocket test famously. This was done straightaway. Was very pleased with this feature.But buyer beware. I discovered this Nook tablet has no camera at all. Who ever heard of such a thing? There is a reasonable expectation.The Nook downloaded and upgraded itself famously. Everything was smooth and cheerful.The speed of the Nook was very good in my opinion. Page to page was smooth and cheerful and moderately fast. The book pages are easy to read. Another Dan Brown book (I think). Made the discovery with Inferno. Played/watched Linux Action Show and other video for about 3 hours with about 15% of the battery power left.Checked YouTube and Amazon to see the how the graphic's engine worked in the Nook. The motion pictures were crisp and clear on YouTube and Amazon. The sound was very excellent and voluminous much to my surprise. Can hear the device clearly and with ease even though I am kinda hard of hearing. The movie scenes moved like a big computer rendering of the graphics. The motion pictures were like a TV broadcast. Not kidding.Now the ultimate bummer: their much touted microSDHC card can not play your own content downloaded from a computer. Later, several hours later there was an additional patch of 75 upgrades that made the microSDHC capable of playing video files/movies. The selection it can play is very limited compared to other more recent operating systems in Android devices. The latest Android operating system is 4.4 KitKat. The Nook will not play certain AVI or HD files. It is very persnickety  What the Nook can play is rendered exceptionally well indeed. It can only play things downloaded from Nooks libraries for sale-wrong as mentioned. I would have never bought this dohickey if I knew thee was no camera natively in advance.One always takes for granted a camera. And their microSDHC is nothing short of a rip-off. Jeez- wrong now.My Chinese Brand X tablets can play my media content in AVI. MP3/4 and other popular media formats very well indeed. These Brand X tablets can play far more movie/video files than the Nook. Their Android versions are newer than the Nook's.The back pocket thing was a real plus. Great sound. Great graphics. Good speed.But these pluses can not counter balance the negatives. The camera is not as important as real robust motion graphics and awesome sound to me. Now I am thinking I will keep this Nook because it does have a viable if not bugged up microSDHC card port capable of music and motion picture replay. Forget file sharing in Android.B&N; needs a No Brainer award for greed and stupidity just like Apple, Kindle and Nexus. Apple, Kindle and Nexus deserve the No-Brainer award more because the Nook's microSDHC does work but has limited compatibility with the files/apps that can play these type of music and movie files.Now I have to go through the hassle of returning this thingamajig. May keep this on the hope there will be patches further to play music and movie files.If you need a camera don't buy this.", "overall": 2.0, "summary": "B&N Nook 16 Gbs Tablet Has No Camera Can Play Limited Selection of Video on microSDHC", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}