{"reviewerID": "A2T049UQONS0OY", "asin": "B00000JYLO", "reviewerName": "Larry VanDeSande", "helpful": [14, 14], "reviewtext": "I have used this camera since the late 1990s for mostly professional purposes. I write and edit a newsletter for a state agency and am often asked to take photos at award programs and/or to accompany job announcements, often with almost no prior notice.Of all the cameras I looked at in the 1990s, this was the one that best suited my needs. The reasons for that follow:1. Shooting photos on a diskette was easier than engaging software and changing documentation from the camera to a file on my PC.2. The 10X zoom is very accurate and allowed me to do adequate work even when I could not get close to my subject.3. The camera is flat out easy to use and has a large viewfinder, a large left hand grip, and big button to press when shooting pictures.Before I bought this camera, I worked for three decades for newspapers and in communications offices of governmental and nonprofit agencies doing the same kind of work I do now. In all those years I never used a camera that was as easy to use as this one, nor did I use one where transmitting the product from the equipment to e-file was easier.Having said that, this is a low resolution camera that will not always give good results. It is adequate for head shots and has always come through for me in events.But I've taken photos of my cats at home where their eyes look more like diamonds than eyes, and I took some pictures of the Christmas tree where the lights looked more like the stars or snowflakes than lights on a tree.So don't buy this to create award-winning photography. For all the same reasons, it doesn't produce very good hardcopy photos.But this is a great camera for someone that needs to take pictures right now and get an adequate product online fast. That's my mission at work and this camera has always helped me achieve it.In addition, the battery charger works fast and I've never had to pay a dime to get anything fixed in more than a half-decade of use. I don't know how this stacks up in the camera industry but it's a lot better than most of the electronic equipment I use in the office or at home.", "overall": 4.0, "summary": "Good camera for fast performance, low resolution results", "unixReviewTime": 1124755200, "reviewTime": "08 23, 2005"}