{"reviewerID": "A1JSO7PPEA0W72", "asin": "B00000JYWQ", "reviewerName": "Bibliophile", "helpful": [90, 91], "reviewtext": "I bought a Nikon Coolpix (my first digital camera) about a six months ago and am very satisfied with it.  Previously, I had owned a Nikon 35 MM &quot;point-and-shoot&quot; camera, but was interested in the advantages a  digital camera would provide;  immediate gratification through seeing your  pictures NOW, the ability to send JPG images to freinds and relatives, the  ability to delete pictures &quot;on-the-fly&quot;, etc.  What I got was a  mixed bag of results - mostly positive.Before I go any further, I must  advise you to get the following options:  two sets of rechargable NiMH  batteries which should be standard with the camera (I use the Kodak ones  available at Amazon.com), a higher-capacity memory card (I use a 128 MB San  Disk - Nikon's OEM), and some sort of adapter to transfer your images  quickly - the serial cable is just too slow.  I have purchased a SanDisk  adapter and insert the memory card directly into the PCMCIA slot on my  laptop computer for rapid transfer.Anyways, in use the camera is  fantastic.  Initially, I was using the 640X480 resolution setting to save  space, but with the new, larger card, I now use the 1600X1200 setting with  moderate compression for all pictures.  I find that the card can hold about  100 pictures at this resolution.  Once I find a picture I like, I use the  Microsoft Photo Editor software (comes with Office) and reduce the  resolution as appropriate (web pages, etc.).  I store my  &quot;keepers&quot; on CDROM at the higher resolution - you can always  reduce resolution and size.The picture quality is great.  The flash,  however, should only be used up to 10' - any further and your pictures come  out too dark.  Nikon USA has a web page with the latest firmware available  for download - which I recommend.Low points for the camera include the  fact that the lens resets to full zoom every time you turn the camera off!  I find myself zooming out every time I turn the camera on - this eats up  your batteries and takes time.  The flap that covers the memory card does  not always stay closed and flops open from time to time.  Sometimes, the  camera takes a while to reset between pictures, so a bit of spontaneity is  lost.There are now newer cameras out there.  I find that the 2.1  Megapixel capability of this camera meets my needs and that, given the  recent price reductions, I would buy this Nikon now if I were in the market  today.", "overall": 4.0, "summary": "A Great Digital Camera", "unixReviewTime": 959126400, "reviewTime": "05 24, 2000"}