{"reviewerID": "A3LDPF5FMB782Z", "asin": "1400501776", "reviewerName": "Alan  Houston", "helpful": [226, 231], "reviewtext": "The Nook tablet is a great color e-reader with the \"bonus\" of being able to read your email, shop on Amazon.com, surf the web, watch tv shows on Hulu Plus, movies on Netflix, and listen to the world's largest selection of music on Pandora Radio.  I added a 16gb sd card filled with thousands of my favorite songs. But, the Nook is designed to be an ereader...it is not a games tablet, or an IPad.I got my Nook Tablet (8gb version) from Barnes & Noble because of the extra discount I got with my B&N; membership...the price was MUCH less than advertised by most internet venders. I already have a Brand X color e-reader and a Nook Simple Touch reader. My old color reader was hard on my eyes for long reading sessions, the Nook Touch is great for books, but it does not have internet access or play music and magazines don't really work without a color screen.The Nook tablet has very sharp, clear, and contrasty fonts and is very pleasant to read, even for several hours. There is a night mode, and also a sephia mode for reading in bed without bothering anyone else. Magazines look great on its color screen. I listen to music on Pandora while I read, and when I am tired of reading, I can watch a movie on Netflix or a tv show on TV.com. I installed the Dolphin browser which uses tabs so I can switch quickly among various web pages.Vevo music videos look great, but the Nook's speaker is too weak to enjoy music. However, music sounds great through good ear buds and when I plug the Nook into my computer speakers.The Nook is an e-reader, NOT an I-Pad or high powered tablet. It does not have access to Google Play to obtain apps, so you are limited to the apps in the Nook app store. Those apps have been developed just for the Nook and its seven inch screen. The apps in Google Play are mostly designed for the smaller screens of cell phones, while Nook apps are designed just for the Nook.Bottom line: the Nook Tablet 8gb is a terrific way to read books and magazines while enjoying your favorite music (I loaded a 16gb memory card with thousands of my favorite songs...transferring the songs over to the Nook from my laptop was fast and easy).For folks who want the \"full\" tablet experience, Amazon.com sells the N2A card which enables you to boot your Nook into a full tablet mode, with access to Google Play, and the 400,000 apps available there. And, the N2A card also permits booting the Nook back into its original Nook settings, as the card does not modify any of the Nook's software or settings.", "overall": 5.0, "summary": "Great Color E-Reader With Extra Features", "unixReviewTime": 1334102400, "reviewTime": "04 11, 2012"}