{"reviewerID": "A14XUCN5OC998O", "asin": "B00000JYWQ", "reviewerName": "Dusty White \"Advanced Tarot Secrets author an...", "helpful": [1, 1], "reviewtext": "I love my Nikon. It was a gift from a friend who is a professional photographer. She had outgrown it and was tired of me complaining that I saw this or that and wished at the time I had a better camera than my phone.If you have never used one of these before it will take a little getting used to. The camera pivots in half (which is quite disconcerting and a bit confusing) so you can change the angle of the viewing screen to the lens. The whole thing rotates freely 360 degrees, with snap-lock settings at each 180, so you can watch yourself \"taking a picture of you\" or use the viewing screen versus the manual viewfinder. The flash is a bit annoying, as it automatically fires in even remotely low-light circumstances. A simple press of a button disables the flash, but then you have a longer exposure time (about one full second) which means that you have to keep your hands really, really still. Just for fun, try taking a picture of the full moon and see how much you hand shakes.This camera is really at its best during the day. It should win an award for being the official picnic (or even beach) camera. It really is point and shoot, but it has an easy to learn and use zoom, auto/manual flash, and you can turn off the viewfinder with the push of a button if you are running low on battery. The live motion feed on the viewing screen is a bit jittery, but for the price that is nothing to sneeze at. My guesstimate is something like 3-5 frames-per-second of video capture on the view screen while you are searching for that perfect moment to snap the picture.The short version: It is self-contained, easy to load and swap the memory card. It takes high resolution photos, and is so easy to use (and durable) that a 5 year-old could handle it (carefully). Stock up on extra AA batteries though. It eats through 4 of them in a few days of use.Hope this helps", "overall": 4.0, "summary": "Easy to use and highly addictive", "unixReviewTime": 1221350400, "reviewTime": "09 14, 2008"}