{"reviewerID": "ATF9GIT9E3X5S", "asin": "1400501776", "reviewerName": "Alexander Wilke", "helpful": [6, 7], "reviewtext": "Between this and other popular competitors there isn't a lot of difference in hardware.  The software and usability is noticeably different though, and that's where you should pay close attention.  I bought my wife the Nook Tablet for Christmas and she uses it a fair amount.  I haven't heard any major complaints from her but here are the ones I've heard most often.The Barnes and Noble App Store is a joke.  I looked through it for about 5 minutes and barely ever saw a free app.  Many popular apps and games are there, but usually you can only get the paid version.  Adding insult to injury, side-loading is difficult if not impossible without rooting the device (this will void the warranty).  I didn't expect side-loading to be a given really, but if you block those apps you really need a decent App Store to make up for it.The SD card slot, which many people may not ever use, is in a pretty odd spot.  It's not really hard to pry back the cover but since you're working with a micro-SD card it can be really annoying to  line up such a tiny card in the slot.  If that wasn't annoying, it is definitely annoying to load your PDFs or whatever from the SD card once its inserted.  For someone who isn't really tech-savvy it isn't obvious how to read those files.  The reader app could really do a better job of detecting documents when the SD card is inserted.On the aesthetic side the launcher could use some work.  Although I think the scrolling app dock at the bottom is slightly more elegant than a grid-like app drawer, there's little organization to the home screen.  You can drag icons around, to and from the dock, but apps/books don't lock to any kind of grid on the home screen.  Some of us who are more anal retentive just won't stand for two icons being less than parallel.  You can see a better view of your media by opening the Library app, which is a nice app, but I find the contrast displeasing, further emphasizing this is a tablet with e-reader functions (or vice versa maybe).  Basically the cohesion isn't there and you start to wonder, with all of the restrictions, why you didn't just get a regular tablet.I still haven't rooted my wife's tablet but maybe if something annoys her enough she'll let me do it.  Otherwise, if you're not planning to root the NOOK, beware of its restrictions and browse its App Store for a bit to see if the selection and prices are a deal-breaker.  This is an e-reader FIRST and a tablet SECOND.  If you're satisfied with its e-reader capabilities I'm sure you'll be happy with this device.", "overall": 3.0, "summary": "Know What You're Buying", "unixReviewTime": 1338854400, "reviewTime": "06 5, 2012"}