{"reviewerID": "AOMQZAS76F3V3", "asin": "1400501776", "reviewerName": "Donald E. Fulton", "helpful": [2, 3], "reviewtext": "(update) I find my review written about Nook HD included here for an entirely different model tablet. Amazon or B*N this is unethical!D.F.---------------Nook HD overviewGreat screen, no cameras, weak speakers, crappy battery life, compromised android OS, but an inexpensive way to browse web and run the world of android apps on a fast, beautiful display. Plus it has a microSD slot to hold lots of videos for offline viewing. And of course, its original purpose, to provide a slick interface for purchase and reading of magazines and books.PlusesWide range of browers available. I have 9 on my machine. All browsers for tablets have reduced functionality so some browsers are better than others for specific tasks. For example, Firefox will play video in HD and does not redirect to mobile sites. Tint and Zirco have a homepage that will access a local html file. With several browsers installed it's easier to get around site restrictions. Firefox has an addon that auto-deletes cookies. Chrome allows spoken search inputs.The world of 700,000 android apps can now be accessed on Nook HD including big and nice apps: Google earth, Skype, YouTube in HD, Adobe Reader, WiFi Analyzer, WiFi Fixer (essential Wifi tool), Google maps, best solitaire ever (by MobilityWare), and free 'run' games. Custom moving backgrounds on Nook HD home screens are fun.AnnoyancesIn two months I have not figured out how to add a browser link to Nook HD home page. Some browsers have the option to add a link to the homepage, but it never works! (It must be that the Nook HD OS does not allow this)Poor battery life, by test I get only 4 hours.Adroid apps normally just suspend, so it tends to take too many presses and taps to cleanly start an application.Audio does not shut off when you exit most radio and music apps. With no OS support for shutting apps down I often have to resort to a reset to silence them.Built-in email has a short time window so you only see few or no messages. Apps like FastHotMail can provide workaround.Screen capture is clumsy (pushing Home and Vol- requires a lot of force and nearly simultaneous pushes).Nook HD not really useful for music, sans headphones, because sound volume on speakers is relatively low.Setting up icons on home screens is kind of a pain. Half of the main screen is taken up by a carousel that cannot be removed. The Nook recommended way of moving an icon to an adjacent screen is to hold icon overlapping the edge, but I find this hit or miss, it only seems reliable after a reset.File directories can be accessed via USB, but have some annoyances: Many file managers have a hard time finding personal files lost in a maze of OS directories. Nook HD allows deletion of its standard user directories (like 'kids B&N; files') only to later write them back again.Tablet does not reliably remember some settings. Occasionally I find the screen will be dim or the notification is too loud and when I look the setting has changed.No way (that I have found) to add personal data for quick entry.(update)Bluetooth keyboard problem solvedI have an inexpensive bluetooth keyboard that works fine with another tablet (Blackberry Playbook), but I could not get it to work with Nook HD. It would pair fine, but nothing happened when keys are hit. I see others complaining of this too. Finally I solved the problem with an app called BlueInput (available on Play Store). It now does the pairing, not Nook OS, and you select the bluetooth keyboard using 'Switch Keyboard' icon.(update)Fix for adding web link icons to the home page. Some browsers have the option to add a bookmark to Home, but this never seemed to work in Nook HD. I think I now understand the source of the problem. The default Nook HD launcher (with carousel) ignores them. The work around is to install the Nova launcher, and it will show them on the home screens.", "overall": 3.0, "summary": "Cheap way to browse web and run android apps on a fast, beautiful display", "unixReviewTime": 1374796800, "reviewTime": "07 26, 2013"}