{"reviewerID": "A3A57GX8FJ4QNQ", "asin": "B00000K13A", "reviewerName": "MrBios \"PaulC\"", "helpful": [34, 34], "reviewtext": "Update 03-14-2010: These tapes can get pricy.  Buying three or four tapes can add up to more than the cost of the printer.  This is how I deal with it.  Order three or more online at Amazon.  Remember, these labels help you organize your life and or business and or customers and I have come to believe the value of this outweighs the cost by a long shot. White on Black is the best as I have tried Black on Clear but if the surface is dark then you can't read the label.  I have used Whit on black but the letters are not as clear - the advantage is it looks classier then the white labels.Three years ago I purchased Brother ptouch PT-1950 (there is an update to this model which is even better) for about $72.00.  It is larger and heavier but you get much better results than the smaller brother PT-1180 which I bought around 2002 and replaced the cutter a couple of years ago.  The PT-1950 has USB and I recommend downloading the update drivers and free software from Brother because it lets you get more out of the tape reviewed here because you can print 3 lines instead of 2 and any font installed on your computer as well as many types of boarders.  You can even save the labels you make and open them later to reprint.  Once you go the USB route and see how nicely you can arrange your labels it is HARD to go back to the little handheld units.Review Starts Here:This is the classic black letters on white tape.The magic: the tape is separated from the backing in the label printer then the letters are burned with a thermal print head from the inside of the tape then it is stuck back down the backing and comes out of the machine. This is why the letters cannot be wiped off even with alcohol or other cleaners.Black letters on white works on all surfaces.  I have used black letters on clear backing which looks nice but requires the label be stuck on a light surface.  If surface is dark it is hard to see the label.  Black on white is also the cheapest most common tape.Brother's price is on the high side and I don't know of any generic aftermarket tapes.  Amazons price is about the best I have found and I trust Amazon.-----------------------------------------------------------------------------------------------------------------------------------TIP: Buy three tapes at a time so I don't run out and it makes the cost easier if you take your lumps in one shot!  If you buy the tapes one at a time you will be reluctant to use them when you need them.TIP2: Ways I use brother tapes:On the ends of power cords (like the type that comes with typical wireless router).  By labeling them it make it easy to relocate cords or pack up and move or if a power pack gets separated from what it belongs to it is easy to match up.Car: I label the date and miles I last changed the air filter, fuel filter, or battery, etc.  These labels will last for years in your engine compartment!Customers: sadly I used to label computers with a magic marker! Yuk!  Labels look very professional.  I also add notes such as \"be sure to remove cable x before y\" etc.My \"P3 International P4460 Kill A Watt EZ Electricity Usage Monitor\" that I bought on Amazon this summer.  I put a label on it that says something like push \"up\" 3 times to show Watts (which is the only function I use).  I also measured every electronic thing in my house and put a brother label on it that showed the power use when off/on and idle if that applies.I labeled my brother CX4800 computer printer with the info for the generic ink cartridges - Amazon!I will label a flashlight what bulb type PR-xx and where to buy it.  I label hard drives with the size, data I bought it etc so I can see that without removing it to read the label.  If it's for a customer I record the date installed.There's a million uses for these labels and the make your life more organized and better (The bible says God is not a god of chaos - Amen!)", "overall": 4.0, "summary": "Works great but expensive and no generic market", "unixReviewTime": 1138665600, "reviewTime": "01 31, 2006"}