{"reviewerID": "A1MZVETF38AMZ6", "asin": "1400501776", "reviewerName": "NowImMad \"Jake\"", "helpful": [70, 73], "reviewtext": "Pros:The hardware is nice, I have the 8GB - Its fast, responsive and the screen is beautiful. Great for reading books and netflix. Battery life - Read 'Catching Fire' and 'Mockingjay' on a single charge. Email and web are decent too - nothing special.Cons:The B&N; Nook OS and the B&N; App selection are both terrible. The Nook OS is counter-intuitive and not user friendly, there is no BACK button!? Take a toll of how often you use the BACK button on your phone or android device and you'll realize how annoying the lack of this simple common-place feature is. You can hit the 'N' and go back to home any time - though often I wanted to go Back, not start over. The selection of apps in the app store are laughable. I literally could not find a single app I wanted, even searching apps that they advertise like Comics for nook (not installed? not available?). I found a few apps for $4.99+ that i have downloaded for free on Itunes and Google play (android market).Recommendation:BUY THIS -N2A (TM) - 32GB Nook to Android bootable microSD Card for the Nook ColorTakes the Good hardware of the Nook Tablet and replaces the useless OS with trusted Full Android. Read the reviews, they are all true! Before i bought this card, the nook was basically useless and frustrating - now I have an android tablet and since it is NOT rooted, still have warranty too, though I recommend squaretrade. Check my N2A review for more info.Update: I have had this tablet for over 6 months now and love it. I have had no issues and all my friends and family want one. Note: I use this exclusively with the N2A card in Android mode. N2A recently emailed me with the update from Gingerbread to Jellybean and its working great and their customer service is excellent. I cannot recommend this company/product enough.", "overall": 3.0, "summary": "Good Hardware - terrible OS and App availability", "unixReviewTime": 1334620800, "reviewTime": "04 17, 2012"}