{"reviewerID": "A2FY4IRPNJCRUK", "asin": "B00000K13L", "reviewerName": "Cyrus", "helpful": [3, 3], "reviewtext": "I love my Label Maker.  I have a home office as well as a shop filled with supplies for our events.  There is something tacky about sharpies and duct tape.  I have 4 different color labels (this one being the green) and so our 4 different setups each get a color.  Then on each label I can put my company info incase it is lost of misplaced.The label material it self is a heat transfer label.  Meaning if it gets hot it will become black.  The green is more of a mint green, which is not an issue unless you are trying to make it match something. Overall, the resulting label is very resilient to fading in the sun, being pealed off of most surfaces (some plastics like Rubbermaid they do not stick to) and the size is very readable in both large and small fonts which my Brother pTouch prints.Now the down sides, which can be big for some people.  I am 27, and for a guy I have nails, which I need to get the backing off.  There is no split down the center like a crack and peal, so you have to try at the corner for a bit.  Once  you do a few you get a method down but it is still a pain if you need to label a ton of things.  (My label maker has an auto cutter so if i have to make 20 of the same label i turn it off, print all 20 on one strip, peal the backing off of the whole thing then cut off the labels one by one with scissors)  The second issue is chemicals.  I have tried to use them in the garage, but brake cleaner, degreaser and some oils will rub the ink right off.  It is weird because it is a heat ink so it must be a layer on top of the label which i am wiping off, but either way I had a flashlight and I tried to clean the oil off of it one day and the label became blank.  The sticker it self was awesome and stayed in place with no problem.Over all a great little label product, 90% of the applications it works perfectly, and the adhesive becomes quite strong over time so they dont fall off in 2 weeks.  If you are labeling automotive stuff or Rubbermaid bins you will need another product.", "overall": 5.0, "summary": "Great organisation Green is more of a Mint", "unixReviewTime": 1308009600, "reviewTime": "06 14, 2011"}