{"reviewerID": "AQGUDK0MSQ95L", "asin": "1400532620", "reviewerName": "anildgl \"A. Dgl\"", "helpful": [3, 3], "reviewtext": "If anyone have used previous version of nook you will immediately see the improvements on new version of nook. One of the most important feature I found on the new nook was better page turn response. The screen refresh when moving from page to page is much quicker, nearly matching the refresh rates of the latest Kindle. The Nook also added a laundry list of interface and usability improvements, such as the ability to organize your book collection by category which is called \"shelves\".I liked 600 X 800 display screen. It comes with 16 shades of gray and is easy to your eyes. I can read all day without hurting my eyes. My personal opinion, i would love this device more if I could read it at night without lights.ProsLibrary with thousands of books, magazine that comes free, built-in free wireless data network, plus Wi-Fi connectivity (no PC needed); separate capacitive color touch-screen pad for navigation, and a virtual keyboard for notes and annotations; 2GB of internal memory (capable of storing 1,500 electronic books) as well as a microSD expansion slot for additional memory; font style and size are adjustable; displays image files and plays MP3 music files; compatible with Windows and Mac machines; battery is removable and user-replaceable; allows free browsing of full-text books while within Barnes & Noble stores; you can lend certain e-books for up to 14 days free of charge; EPUB format compatibility lets you read free Google Books and loaner e-books from your local library; page turn speeds are faster with firmware upgrade.The bad: No protective carrying case included; color LCD ( for color nook)  has an impact on battery life; for black & white battery is really good,in-store reading and loaning capabilities come with notable limits and caveats; no support for Word or text files; no ability to download books when outside the U.S., even when on Wi-Fi.Does it beat Kindle?According to design my answer is no.  The third-generation Amazon Kindle is lighter, thinner, and simply feels a little better to hold in your hand. It also offers double the battery life, more internal memory (4GB versus 2GB). But the new upgrades has given some new features to nook that are not available in kindle. Nook should definitely remain under consideration when you're shopping for e-ink e-book readers. The decision may come down to a personal preference, such as how you feel about the color navigation screen versus the hard keyboard found on the Kindle.If my review did not answer any questions, leave a comment below and I will try my best to answer your question.", "overall": 4.0, "summary": "Worthy wifi e-reader for everday reader.", "unixReviewTime": 1293321600, "reviewTime": "12 26, 2010"}