{"reviewerID": "AIAT4UQM6AS8G", "asin": "B00000K2YR", "reviewerName": "Flynbike", "helpful": [0, 0], "reviewtext": "Before a recent off-road group outing, a CB was on my short list. After reading plenty of reviews I kept finding myself turning back to this. Finally pulled the trigger and ordered one - even picking up a ~$10 savings on a repackaged one from Amazon's Warehouse Deals.I've had such success with the AA battery base attached that I haven't even been deeply tempted to permanently install the unit with a fixed antenna. Here's my take on it after a half dozen trips.Pros - Comes with everything needed to be functional, short of batteries and a fixed mount antenna.- Adequate range on alkaline battery power and stubby antenna.- More than adequate battery life. I did 2 day-long trips before I was tempted - not forced - to change batteries.- Startling clarity. A fellow 4 wheeler asked me what unit I was using, that he wanted to buy one for a backup / handheldCons - might be a minor point - or a technical nightmare - but it'd be mad handy if the unit could be used with 12v power andthe whip antenna..In short - there's not much more to be added to the fine reviews and the strong performance of this unit. For value, clarity, power, versatility and installation flexibility, I can't see this unit getting beat.Update:Relative to the \"Con\" noted above... I emailed Midland support to ask about the 12v / whip antenna issue, and to ask about a replacement volume knob. They very quickly and graciously responded that it is indeed possible to use the unit on 12v power with the included antenna. Here's their clarification:\"When you slide the mobile adapter on the bottom of the radio it disconnects the rubber duck antenna on the top of the radio. To avoid that from happening you canplace a small piece of tape on the bottom of the radio over the small squared contact right next to the 2 screws on the bottom of the radio before you slide on the mobile adapter.\"A replacement knob was sent as well.I tried out the unit with the 8 AA rechargeable base. Worked great for the trip, staying on a total of 30 hours in scan mode while I ran the batteries out. (Eneloop rechargeables)", "overall": 5.0, "summary": "Killer Bang for the Buck", "unixReviewTime": 1382832000, "reviewTime": "10 27, 2013"}