{"reviewerID": "A3S5KSCNM13MSB", "asin": "B00000K2YR", "reviewerName": "Jayden17 \"JD\"", "helpful": [6, 6], "reviewtext": "I am overall pleased with the Midland 75-822 radio. Out of the box I was picking up a few transmissions with the rubber ducky antenna, mostly truckers from the highway about a 1-1.5 miles away, and even some powerhouse channels from across the country. Using these as mobile units you could probably transmit to maybe 1/4-1/2 mile between two identical units with the rubber duckies which isn't bad when you're out in the field with a buddy. Once I had this setup in my Jeep however I was easily receiving transmissions from 5-10 miles away. I have this setup with all FireStik equipment:FireStik II antennaFireStik stud mountFireStik 18' coaxI'm also using a rugged ridge Jeep mount.The total setup yielded 1.0 - 1.2 SWR - pretty darn good on a Jeep.A few notes about using this in your vehicle. It's convenient when you don't want to mount a full size unit within the cab of the vehicle. It's so small that I can store it in my center console or the glove box - which is nice for Jeep owners since you can easily store it away to prevent theft. This unit has all of the functions of a full size CB within a tiny package the size of about a normal CB mic. The sound is very clear and the transmissions come off clear from what I've been told.The only thing I really didn't like about this CB is that the product description says full LED back light, however the back light only stays on for 5 seconds, even when powered via the car adapter. I figured that it would only turn off after a few seconds with the battery pack installed, which makes sense, but there's no reason the light can't stay on when you're in the vehicle. It's also only lit by 2 LEDs - one from each side of the display - not technically full back lighting, but clear enough to read the display from a few feet away. The only issue is when you want to continually toggle channels etc. at night, you've got to keep hitting the light button first. Also, which would be REALLY nice, is to have lighting behind the buttons, sort of like a mobile phone. There is no lighting behind the buttons so you've got to remember where each button is and what they do for night driving.Overall this is a 4 out of 5.", "overall": 4.0, "summary": "Great setup for my Jeep", "unixReviewTime": 1359504000, "reviewTime": "01 30, 2013"}