{"reviewerID": "A1XEL9W3JBAT4P", "asin": "B00000K2YR", "reviewerName": "Joe K. \"Joe K.\"", "helpful": [8, 9], "reviewtext": "CB radios were very popular in the 70s. 1 in 10 cars had one! In the mid 90s there was some what of a come back that may have lasted for a couple of years. In 2013 there really are not that many CB radios out there.  This is the reason I think some of the reviewers think their radio doesn't work, there is just nothing for them to pick up!  This being said, CB radio is still alive and used.  Truckers use them so you can always find out what the traffic is like, or where a speed trap is, and there are still people out there with base stations and mobile cbs providing for interesting conversation.  Just not as many as 35 yrs ago.  Having base stations, mobiles, and handhelds in the past I decided to re-enter the cb world with this Midland. It came nicely packaged with everything that is advertised. First I put batteries in it and listened in the house.  Heard truckers on 19 plus found that on 20 there is a whole group of locals that talk on their radios nightly. This was just using the included antenna.  Next I hooked it up to an old Firestik IBA5 Indoor Cb Base Antenna I had stored away, and I was picking up enough transmissions for the radio to be entertaining!  Next day I drove around with the radio in my F150 with the stock antenna and batteries. Nothing.  Not a single thing to be heard.  Last night I put a magnet mount Midland 18-2442 Mobile CB Antenna on top of my truck, and used the unique cable accessory that came with the radio. You snap it on to the bottom of the radio where the battery pack goes, and  you plug one connector into the cigarette lighter and the other to your antenna cable.  The radio pack and this device slide off very easily and slide back on securely, so you can attach it to the radio or take it off in a few seconds.  I ran the cable from the antenna through the door.  Closing the door on it was just fine  with no damage to the cable.  Now for the big test!  I drove 15 miles to work this morning during a major snow storm!  The radio worked like a charm.  I was picking up all the truckers (a lot of them) and getting reports of conditions around the whole area!  The rechargable battery pack allows you to run the radio home off of your AC current, or if you prefer use the regular battery pack for normal batteries, or use the car device with your cigarette lighter.  There are also jacks for a speaker and mike.  So essentially you can use this radio as a base station,  a mobile radio, or as a handheld!  Small enough to just slip in your pocket.  Also the sound, although not really loud, is vey clear and  easy to understand.  Radio also picks up the weather bands. I'm very happy with it.  I haven't transmitted to anybody yet, but I can tell transmit works well by testing it with an old handheld I had.  Distance would be measured by the type of antenna I use and how I tune it. Once I make a few contacts I'll get back here and let you know  how far I got. I buy radios for fun and in the week I've had this I have had a lot of fun with it, and would recommend it if you want to have some fun with cb radio.Update: Yesterday I was in a higher area (in my pick up using the Midland 18-2442 antenna) talking to a base station 7 miles away!  He said the radio sounded good!  So after using it for a few weeks now, I'm very satisfied and really glad I bought it!", "overall": 5.0, "summary": "Nice little CB radio!", "unixReviewTime": 1359676800, "reviewTime": "02 1, 2013"}