{"reviewerID": "A84O215CIZY6W", "asin": "1400532620", "reviewerName": "Chantellicus Optimus", "helpful": [4, 4], "reviewtext": "I was the biggest nook/kindle hater on the planet before being gifted this nook. I would constantly diss the e-readers claiming that books were soooo much better. Then I ordered a book series from Amazon and the books/print was so tiny that I could barely read them without straining my eyes and driving myself crazy. My mom (&lt;3!!) gave me my brothers old nook since he had a new nook color so I could download and read the series on this. It wasn't cheap to download the books, but compared to reading the free versions a friend had sent me (which were horrible because the text was all messed up...typos galore) but the option to make the text larger or smaller and the clarity of the screen made the 8+ dollars per book soooo worth the price.The battery on this lasts so long it's insane. I would read daily maybe 5 hours per day over the summer (hey, I had to finish the series before school resumed!) and I only had to charge it once a week tops, even then the battery wasn't drained I just didn't want to give it a chance to run out. I am so in love with my nook now it's insane. I can download almost any book I could possibly need and carry it around in this tiny little, lightweight nook.Another big plus....MY BOOKMARKS DON'T FALL OUT OF THE NOOK!! Nothing is more frustrating than losing your place and going bananas trying to find it without revealing something you haven't read yet.Also, when it comes to textbooks this is a lifesaver!! My back loves the nook. I cannot recommend the nook (or any e-reader in general) enough. You can still buy physical books (I do and will never stop because I absolutely love them) but for an avid reader the nook is such a great addition to your life.Even though my first nook was free (making it that much sweeter), I would gladly lay down $100+ for a replacement if anything happened to mine or for a newer model, not the color though, that's more like a tablet PC than an e-reader.", "overall": 5.0, "summary": "From hater to smitten with this amazing little device...", "unixReviewTime": 1317513600, "reviewTime": "10 2, 2011"}