{"reviewerID": "A1XY86U23W6LQ", "asin": "1400532620", "reviewerName": "C. Owen \"Contrary Insight\"", "helpful": [4, 4], "reviewtext": "I asked for this e-reader for Christmas due to seeing it in a Barnes and Noble store and learning about its features. It  offers greater compatibility with different ebook formats than the Kindle (particularly the EPUB format), has access to special offers when you're inside a Barnes and Noble store, and permits you to lend books to other Nook users. There's also a little color LCD touch screen at the bottom for accessing menu options.Personally, I haven't taken advantage of most of the Nook's features yet, but I do like what I see so far. The touchscreen adds a great deal of versatility to the device and I'd say it's easier to access menu options this way than with just one e-ink screen and some buttons. I also appreciate the ability to upgrade the memory with a microSD card, but I would have preferred to do so without opening the device. Also, if you have a problem with the Nook, you shouldn't have a problem getting a replacement. I, er, damaged my first Nook through, shall we say, \"user error,\" but B&N; staff was happy to provide a new one for me.It's not quite perfect, though. It's kind of heavy, for one thing. The touchscreen is a bit slow to respond and can significantly drain the battery, for another. And, some of the Nook's buttons seem to be a little too stiff. I prefer soft, clicky buttons, you know? Maybe in its next iteration the Nook will have proper buttons instead of this \"bendy plastic\" business.Anyway, which e-reader you get largely boils down to your personal preferences, and which retailer's online library you'd rather have access to. For my part, I think the Nook satisfies all of my needs just fine. Be careful where you buy it from, though. $180, which is the price it's selling for on Amazon right now, is way too much when you can just walk into a brick and mortar store and get it for thirty bucks less.", "overall": 5.0, "summary": "An excellent e-reader", "unixReviewTime": 1295481600, "reviewTime": "01 20, 2011"}