{"reviewerID": "A2GML5RFMHMAYW", "asin": "B00000K2YR", "reviewerName": "MrCrobos", "helpful": [0, 0], "reviewtext": "I was looking for a radio in case of emergency situations, and this was the perfect solution.  More people have CB's then any other type of radio because of the truck drivers, so I know there's a better then average chance I could reach someone else in an emergency with this radio.  I live fairly close to one of the busiest freeways in the U.S., and can get a signal with this if I step outside of my house.  I purchased a simple magnetic car antenna, and love how easy it is to swap this from car power to handheld power, so I know I'll be ready either way.the sound isn't super loud, but I can drive with the heater on full blast and the windows cracked on the freeway and hear it if it's near my head.  I've had no complaints about the sound quality, and get fairly good reception (so far 4 miles with the car mounted antenna for certain)Most CB's require a calibrated antenna of a certain length for maximum range, so I'm certain I could get farther range with a smal amount of effort, this functions as well as my old truck mounted CB I had when professionally driving.Great for camping, we talked the whole way down with the car mounts, then kept in touch in the park with the handheld packs.  Has a powersave option that keeps you going as long as your batteries can stand (I had to buy 8 rechargeable AA batteries seperately for the charger pack)  We did have a few issues when on the far side of the park from each other, but getting to higher ground put us back in touch again (this was a mapped distance of 6 miles from hilltop to hilltop)I've had otehr small scale cig lighter powered radios and this one has been better in every reguard.  The unit doesn't overheat, hasn't blown a fuse, and functions just like you'd expect a quality item to.  Standard mounts and plugs for everything but a talk mic.  You can purchase a headset unit, or else you'll have to use this as if it were a Standard CB mic, but you can easily plug any headphone jack in for headphone or external speaker sound.Overall this is a really functional, solidly built, hybrid design for the non-professional driver in need of a radio.  I'd recommend anyone who doesn't wish to purchase and install a full blown CB in their personal vehicle buy one of these, the more people around you with one, the better off you'll be in an emergency situation.", "overall": 5.0, "summary": "Perfect general use radio for the recreational user", "unixReviewTime": 1364774400, "reviewTime": "04 1, 2013"}