{"reviewerID": "A13ZT5G31M5WJ5", "asin": "B00000K2YR", "reviewerName": "P. Bridgman", "helpful": [0, 1], "reviewtext": "UPDATEOK, I received a replacement radio from Midland.It took about 2 weeks for the replacement to arrive. It came in a small brown box, not the retail package that I sent it in. All the parts were piled in the box with packing peanuts. The radio and accessories were all fine, not beat up or scratched. I guess it didn't look expensive enough for UPS to bother trying to smash to pieces. The only thing wrong was the wrist strap was not in the box. I probably wouldn't have used it anyway. I put some rechargeable batteries in the battery holder and turned the radio on....and I was receiving skip, so the problem was fixed with what is probably a (refurbished) radio. Looks new though and it works. I should not have had to pay shipping to have a defective radio replaced but that's life. I like the radio!Received the radio and placed the batteries in the battery holder and turned the unit on. Did not receive any CB signals but not too suprised with the flexible antenna. Checked out the weather channels and received them fine. Took the radio out to the truck and installed the vehicle adapter and connected the radio to a Wilson 1000 antenna and flipped through all 40 CB channels....nothing but background hiss. I backed the squelch all the way off and got the same result. Connected the Cobra 75WXST back to the antenna and received skip on almost all channels. Reconnected the 75-822, checked the SWR, all channels below 2, still no CB reception. Packed the radio back in the box, called Midland, sent radio to Midland and now I will wait for a few weeks and think about the extra $10.00 it cost to own this radio due to shipping to Midland. Customer service at Midland was pleasant and spoke english. I could have sent the radio back to abetterwaytobuy but the turn around time from Midland seems to be shorter than the long wait I had the first time from abetterwaytobuy. Also I think that Midland will probably be sure that I get a working unit when they send one back. So, I can't comment much on the radio itself as far as performance but will update this once I get the radio returned.", "overall": 4.0, "summary": "Update on \"Received an apparent lemon\"", "unixReviewTime": 1276819200, "reviewTime": "06 18, 2010"}