{"reviewerID": "A3LWTNKF8T05AK", "asin": "B00000K2YR", "reviewerName": "perstare \"perstare\"", "helpful": [6, 6], "reviewtext": "...and I've owned my 75-830 for more than 10 years.My 75-830 is reliable, compact and its WX weather capability is priceless. (On one occasion, I didn't know that a small rainstorm that I was driving in was actually the leading edge of a hurricane. I did manage to outrun the hurricane, thanks to my good luck in finding out **exactly** what I was driving in.) It can be quickly converted to a CB portable walkie talkie.I do recommend this unit.I got it many years ago, new, on eBay for $45. You can use that for comparison, if you wish to.New addition: Now I own the 75-822 also. -----------------In my opinion, Midland has produced an **extraordinary** unit here.It can be used as a walkie-talkie. It comes with two different battery slide-ons to provide power for this purpose. One slide-on is designed for conventional batteries.  The other slide-on is for rechargeable batteries, and the 75-822 includes an AC power supply to recharge the batteries.It can also be used in a vehicle. Another slide-on is provided for this purpose and will connect it to the 12v plug and to the external antenna. If you use a magnet-base antenna, you can move the entire package from vehicle to vehicle in **less than five minutes.** Time it yourself and by the way, I recommend a magnetic-base antenna* because it is so easy to transfer your CB rig from one car to another.It can be used as NOAA Weather Radio.I now own three CBs, two of them purchased in the last month. Each time I shop around for a new CB, I compare **all** the brands **carefully.** I keep coming back to Midland. I've owned my first Midland (75-830) for more than ten years; It's never failed me.* Remark: Amazon has for sale, the ProComm JBC101, a little stubby \"rubber duckie\" magnetic antenna which you can plop in the **center** of your automobile roof for even radiation in all directions. You can remove it in an instant (for carwash, for example) and put it back again later. I have two magnetic antennas. I didn't pay more than $20 for either one of them.", "overall": 5.0, "summary": "This unit seems to be the later version of the 75-830...", "unixReviewTime": 1272067200, "reviewTime": "04 24, 2010"}