{"reviewerID": "AJQRYTPV3JK3C", "asin": "1400532620", "reviewerName": "Dan O.", "helpful": [2, 7], "reviewtext": "I bought a nook about 8 months ago. I wanted to consider a Kindle but they were not available locally so I was very hesitant to buy one sight-unseen.BN had just released their wifi-only version for $149 which was very reasonable. I bought one from BN with moderate research and minimal hands-on. I have regretted it ever since.Today I said goodbye to my nook library and bought a kindle3. I can't comment on it very much except it is light-years faster than the nook and the interface actually works. I have about 90 books in my nook library, most of which I paid for so I'm a little frustrated.Things that are good about the nook:1. It looks much better than a kindle. While it sits there unused on my nightstand.2. ePub support. I live in Alaska which means it will be another 5 years before our libraries start loaning books via epub so it's not a big deal for me.3. Free Fridays. Every Friday nook owners can download a BN-selected book for free. Most are crappy fantasy/romance books but I have discovered several very good authors that I wouldn't have otherwise.Things that are bad about the nook:1. Awful, awful, awful touch input. I cringe thinking about using my nook with the unwieldy touchscreen. The screen itself is slow to respond, it sometimes registers additional clicks but mostly just ignores them while giving you visual feedback so you wait 5-10 seconds for it to actually do nothing.The touchscreen display is very jerky and difficult to navigate. You navigate the menus by scrolling through them on the touchpad. It will randomly jump to the top or the bottom. It will randomly ignore a touch (there is visual feedback, so it's not a mis-touch). It will randomly click twice on the succeeding menus.Trying to type on the keyboard or use it to look up a word (you need to use arrow keys on the touchpad to scroll a sluggish cursor around the page to pick one) is a test in patience I no longer have patience for. The keys provide visual feedback when pressed. This suggests you can type away merrily until you look at the text field to see only 2 or 3 characters were actually used. You have to type very sloooow and deliberate for the gnomes inside to catch up with you.The touchscreen is the main reason I ditched the nook. It is horribly implemented and makes the entire device borderline unusable.2. Browser. The BN rep sure talked that up. After spending 15 minutes trying to use the browser to register a BN account so I could actually read books I gave up and used my laptop. The browser takes about 30 seconds on average to display a page. It doesn't matter if it's a real page, the mobile version of Facebook or just google search. It will also randomly crash every minute or two. And by crash I mean you will suddenly be returned to the home screen for no apparent reason.Do not buy the nook if you even think you might want to try using it as a browser to check your email while you're sitting in bed reading a book.3. Battery life sucks. Sorry, but it does. I like to read a lot and having to charge it every couple days makes me upset they claim a 14-day battery life on it. I think it gets about 14 hours per charge (minus the 10% when it automatically goes to sleep). There is a persistent charging bug with the nook, or at least with mine; If you have wifi enabled but the device is sleeping (as in just normally leaving wifi on) when you plug it in to charge, the wifi will activate internally as it (I assume) checks with BN for book updates. This stops the charging and it will not resume unless you turn off the wifi and unplug and replug the charging cable.This is very frustrating as you plug the device in and forget to turn off the wifi. The next morning you grab it only to see the cute \"Your battery is too low to operate\" message.4. It weighs about 20% more than the kindle and is noticeably thicker. Not a big deal, but if you're in bed reading with one hand it weighs about as much as a heavier hardcover which means you're switching hands every so often. Heavier does not always mean better.5. Page turns. When I first got the nook it took between 3-5 seconds to turn a page. I would actually press the page turn button when I got to the last paragraph and could finish it before the page turned. A software update has vastly improved the page turn speed (about .5 seconds now) but only when turning the actual book pages. Library pages, shopping and browsing shelves still take 3+ seconds. I have tried a factory reset twice and either my device is defective (BN support did not think so) or it still sucks. This also strongly influences the cursor movement speed when trying to select a word and the speed at which you can enter text.6. Screen readability is acceptable. It looks like the page was printed on a crappy inkjet printer, with pixilation apparent. The kindle is more crisp and darker.7. The included Merrium Webster dictionary is broken. A large number of entries simply do not work. If you search for one of the effected entries the nook performs a search before inexplicably returning you to the book page. I do not remember which letter(s) are affected but it does not appear to be priority for BN to fix.8. Shelves. Shelves are BN's answer to everyone complaining how difficult it is to find books in the library. You can create a custom named shelf and place books on it. It is very clunky and sluggish and expect to spend 30 seconds trying to find your new book and another 15 trying to put it on a shelf. Sometimes it just won't let you put a book on a shelf and you have to restart the nook. This adds another 2 hours because you will be so frustrated by this point you will put the nook down start punching holes in the wall.9. Sometimes books fail to open. This means you have to go back to your library and open the book again. I have no idea why it happens but it happens frequently enough to mention. Once you get a book open and keep reading that book until you're finished it works well enough. But the menus, navigation and overall usefulness is virtually nonexistent.10. It's built on an android platform, which means it's buggy and randomly crashes or stops working. A restart usually solves this, but I keep shouting \"WHY, WHY, WHY\" every time I have to. Although I haven't had to restart it since I got the kindle. This may or may not be a result of not using it any more.Closing thoughts: I would encourage you very strongly to use one before buying it and investing in an e-library only to find yourself in the same situation I found myself. If you really have your heart set on it, buy from a local BN and try it out for a couple weeks so you can return it. I waited for the nook software update that was supposed to fix all these problems. After that seemingly only addressed the page turn speed I was outside of the return period and stuck with this nice-looking nightstand decorum.", "overall": 1.0, "summary": "Save your money, or 10 reasons the nook is awful", "unixReviewTime": 1305417600, "reviewTime": "05 15, 2011"}