{"reviewerID": "A1QPUBF6U5EQM6", "asin": "1400532620", "reviewerName": "Dare2Dream", "helpful": [1, 1], "reviewtext": "When I purchased this item it was still running $150.  At the current price, I think it's a good deal but I'm not sure it would be my choice if I could roll back time.  I originally purchased this because I wanted to rent ebooks from the Library and that wasn't an option with the Kindle.  Now, they come for the Kindle as well as in epub and pdf formats.  You can basically use any ereader to rent these now.I read all these reviews saying that the black and white was like paper, easiest to read.  It's not anything like a paper book, it's far less \"bright\" when it comes to reading.  Don't get me wrong, I love ebooks.  I haven't read a paper book in a year.  It is just that even in regular light it is not as easy to see for me.  You absolutely can read it without a light during the day, but it is not nearly as crisp or easy as it would be with a paper book.  I have a clip on light, and with that it's perfect at night.  I'm able to read in bed and not disturb my husband, if one wants a black and white reader as close to paper as you can get--I'm just not sure this is what one would expect.This reader has a browser which you can use to get on the internet.  It was handy when we were in a hotel with wifi and I didn't bring the laptop and I needed to know when a business opened.  It's certainly not easy to surf, this would not be my choice to use unless in a pinch.The battery does not last as long as I expected.  I get maybe a week and a half out of it, if I turn it completely off when not using it--and if I have it on airplane mode (not wifi enabled).  I do read at least a few hours a day.  The time is much shorter if I let it just hibernate.I am not sure if the text size options are specific to the device or the book.  It appears to me it is the device that offers limited options, though it varies based on the originating text of the book. The text size on extra large--the largest option-- is often (it varies by book) small enough that it would equal that of a normal book.  My vision is pretty good and occasionally I'm annoyed by how small extra large is.  In some books medium is the same as extra large in others.  I do think that for anyone with vision challenges, limited text size might be an issue.Obtaining books is easy to do through Barnes and Noble.  You need to go online on a computer and provide a credit card.  You can then order them on the computer, or through your device.  I generally use the computer, but if you know what you want--ordering directly from the Nook is quick and easy.  Transferring library rentals is also as easy as drag and drop, using Adobe Digital Solutions (free app, the library should have a link to download it).All in all, it's a good ereader.  I've never had any mechanical issues with it.  It is sturdy and reliable.", "overall": 4.0, "summary": "Not Sure I'd Do It Over Again", "unixReviewTime": 1322265600, "reviewTime": "11 26, 2011"}