{"reviewerID": "A89ZZKNDFQH23", "asin": "1400532620", "reviewerName": "Delaney", "helpful": [6, 6], "reviewtext": "I have been eyeballing e-readers for a while and I was absolutely certain that I was going to purchase a Kindle.  Well many moons ago I worked at Barnes and Noble and stopped in to visit and old friend.  He introduced me to the Nook, I shrugged up my nose and said, 'Yeah, I'm sold on the Kindle.'After playing around with the Nook, I really found myself enamored of it.  I like the touch screen.  I like that the battery replacement if necessary is something the consumer can do.  I liked that you could share your nook books with others.  On the Nook that I have -and I did purchase a refurbished Nook - games included are suduko and chess.  The daily is a feature that automatically downloads articles specifically for the Nook users.  The library is where you can store all of your books and create shelves for your titles and organize the titles.  Shopping is a breeze, either directly on the nook or online.  You will need a card, be it debit or credit to purchase the books, you can use gift cards, but I believe that you need to have a card on file.I can store and listen to music on my Nook, I can access the internet (mine is WiFi) and use it to search and answer email or update facebook.In short, I'm madly in love with it.  I have not had any problems with it.  The charge holds for a pretty long time, I haven't measured it in time myslef.It is simple to use, very friendly and there is an incredible book selection for the Nook.  i happen to be a big fan of classic literature and Russian literature and I have had no trouble filling up my library.  Storage capacity is quite large and i have an additional micro SD card just in case, but I am no where near filling up my storage yet.The books are also available on my personal computer, and if I decide to archive a book, but do not necessarily want to delete the title altogether, I can archive it and later retrieve that title from my online account.  Archiving titles would allow you to free up space on your Nook.Recommendations, I have a silicone slip cover to protect my Nook if I drop it, I also have a slightly hardcover case to protect the Nook when it is in my purse, I do have a book light as the screens are not backlit to avoid glare.The only downside, some fools will think your screen is paper and they will touch it in awe and smudge up your reading screen.", "overall": 5.0, "summary": "I really love this", "unixReviewTime": 1293667200, "reviewTime": "12 30, 2010"}