{"reviewerID": "AOVTLYTHVDNUX", "asin": "B00000K2YR", "reviewerName": "Tradecraft \"Live by the Sword\"", "helpful": [2, 2], "reviewtext": "The Midland 75-822 40 Channel CB Radio is a solid handheld CB with just a few flaws that prevent it from being absolutely great. If you are looking for a truly portable CB radio this is the one to get bar none. It is important to understand the capabilities of this radio. Many people rate radios poorly because their expectations far exceed the capability of the radio.  Most CB radios are 4 watts which is generally good for a distance of 2-6 miles. As with any radio there are a lot of variability's that will impact the effectiveness of the radio. CB radios are not for long distance communications. If you need long distance comms then you should consider a ham radio which requires a license from the FCC.Pros:+ Multiple methods to power the radio: Car charger, alkaline batteries, and rechargeable batteries+ 4 Watts+ Weather channels work great and can be very valuable+ Quick button to transfer between channels 9 and 19+ Very easy to use+ Radio itself is well built+ Can use high setting for 4 watts or low setting for 1 watt which will save batteriesCons:-The adapter for the car charger and alkaline batteries are very stiff when removing from the radio-Both alkaline and rechargeable battery cases seem delicate especially when being separated to put the batteries in the case. Time will tell how durable these will be over the long run.Recommendations:+ Upgrade your antenna to theCobra HA-TA Hand-Held CB Antennawhich, in my case, significantly improved reception. It is also good to have a backup antenna.+ Get theWILSON 305-38 300-Watt Little Wil Magnet Mount Antennafor your vehicle. You will not get reception if you use the rubber duck antenna in your vehicle.+ Get the bookEmergency Radio Communicationsby Caleb Watts for a good understanding of radio capabilities, rules & regulations, and a good example of an emergency radio plan.Overall Assessment:The Midland 75-822 40 Channel CB Radio is a very flexible CB radio that can be used in multiple situations such as in your vehicle or out hiking. The radio itself is very well made and while the battery cases seem a little problematic they are not a deal breaker but they do cause me to give this radio 4 stars instead of 5.If you are looking for a handheld CB radio the Midland 75-822 is a great choice.", "overall": 4.0, "summary": "Overall a Great Radio with Some Minor Flaws", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"}