{"reviewerID": "A1PAGHECG401K1", "asin": "B00000K3RK", "reviewerName": "Chel Micheline \"Chel Micheline\"", "helpful": [45, 45], "reviewtext": "We purchased the ETX 125 and we found the Autostar to be necessary.It was very easy to plug into the telescope and turn on, but getting the telescope aligned was another story. The first night we went out with just the Autostar and the telescope, assuming that we would have enough to get started. We were very wrong.In order to align the telescope and get the Autostar working, the unit first asked us to find true north. Yikes! We gave it a rough guess. We were off compleetely, we would find out the next evening. Next was the exact time, which we also guessed on our inaccurate watches. Then we picked the nearest city, which is about 30 minutes away. Then the unit asked us to find two stars in the sky and identify and align them in the telescopes eyepiece. The stars that the Autostar gave us to find were not exactly well-known stars, and they werent in a part of the sky that was devoid of other bright stars. Without a map of the sky, we were lost. Pollox, Rigel, Castor were some of the stars we have come to know well through the Autostar. Needless to say, we did not get the Autostar working that night.The next night, we went out equipped with not only the scope and the Autostar unit, but also a compass (to find north), a detailed map of the sky (to find the stars it was asking us to), and a watch that had accurate time on it. Before we headed out, we took the time to enter in our exact latitude and longitude into the Autostar. That night was a great success. After a short time spent aligning our two base stars in the scope, we were off to explore the universe and beyond. We saw Saturn, Venus, Jupiter, the Pleiades, the Orion Nebula and several Messier objects that evening.I highly recommend the Autostar, but wish that the booklet would have warned us that we needed to be prepared with the compass, star map, latitude/longitude, and exact time to make our experience with it successful. The only drawback to the unit was that it needs to be aligned and reset every time it is used, but its not like there are other competing units to use. Its well worth the money, and enhances the experience with any Meade scope.", "overall": 4.0, "summary": "necessary accessory", "unixReviewTime": 980035200, "reviewTime": "01 21, 2001"}