{"reviewerID": "AXYGT3CBHC1WA", "asin": "B00000K3RK", "reviewerName": "DH", "helpful": [9, 9], "reviewtext": "There are two schools of thought on the use of go-to telescopes.  One school believing that it takes away all the skill and fun from astronomy.  however, I'm a believer in the other viewpoint.  I think go-to capability opens up astronomy to the masses and brings the universe just that little bit closer to everyone.  I purchased the Autostar for my ETX about a year ago and it has had extensive use.  Out of the many many times I have used the autostar with the scope, I estimate it has performed as desired on 90% of my viewing nights.  Unusually, I seem to be able to align my ETX rather easily depsite the fact that many people have difficulty.  I think I have had luck on my side as the ETX, while a beautiful scope, can be a little temperamental.  Even after doing a quick and rough alignment, like pointing it in the general direction of due North, without using a compass, I still get very accurate results with the autostar.  I even changed locations the other day, moving from Auckland to Taupo, (some 3 hrs travel distance by car) and inadvertantly used the Auckland co-ordinates while viewing in Taupo.  Suprisingly after alignment, I still got accurate positioning from the autostar.  Once you get the hang of the menu system the autostar is really quite simple to navigate around.  The amount of data is staggering, but given the size of the playground, it's not suprising.  The unit itself is comfortable to hold and the adjustable brightness makes reading the screen simple in the dark.  I havn't found the built in red light at the top of the unit very good as it is just too dim to make out charts etc.  The trusty old torchlight with red nail polish on the lens is hard to beat on that score.  I suggest that if you are operating from a tripod, you attach something to the back of your autostar that lets you hang it up on the tripod when you are not using it. Otherwise it can dangle around and get in the way.  On a couple of occassions I have had the unit fail to operate correctly or reset itself. These have been far and few between, and readily fixed itself.  Ultimately the Autostar is a computer so an occasional reset is not entirely unexpected.  One minor problem I am experiencing at the moment is the scrolling text on the lower line of the display panel is tending to fade a little the faster it scrolls.  This has occured since I started using a power adapter for the scope so this will need investigating. This however is only a minor niggle. If you have any concerns about your Autostar consultthe best resource on the net for the autostar, Mike Weasners site. The Autostar is highly recommended and really an essential purchase to go along with your ETX. Clear skies everyone and happy alignments.", "overall": 5.0, "summary": "Huge database of Information", "unixReviewTime": 1022112000, "reviewTime": "05 23, 2002"}