{"reviewerID": "A2OKCS5234ZV7S", "asin": "1400532620", "reviewerName": "Flower", "helpful": [8, 8], "reviewtext": "First let me say that when the Nook first came out on the market it caught my eye. I begin to research e readers.. I even went to the store and tested the nook, played with it. I went to other stores that had other e readers and looked at them as well. Then one of my coworkers showed me her Kindle and I was able to play with it and look at it.Then the i pad came out, So I went to the store and looked at the i pad and played with it as well. I have read review after review and watched you-tube...Well The holidays came and my husband bought me the Nook!!! I was so excited! I wanted the Nook as soon as I saw it, but took my time and compared it to other e readers.. I knew right from the start which e reader I wanted after being in discussion with others about e readers and after looking and playing with a few of them.Right out of the box the Nook, made me happy and gave me confirmation of my long desire to own the Nook. My husband knew that I wanted it, but I waited trying to justify why I needed an e reader and to see if anyone of them would go beyond my expectations. The Nook did exactly that! For me the Nook was worth the money and time it took to decide on which one to purchase... Here is why I love the Nook, I can lend books to other, I can download from my library which is so awesome! I can surf the net for FREE!!!!!! no monthly fees like the i pad, It fits in my computer bag, purse, which makes it so easy to take with me, It has my favorite games, Chess and Sukodu! It was easy for me to download a ebook that I already have, but have been unable to read due to me not wanting to tote my lap top around, the book loaded right from my lap top to the Nook in no time... The amount of free books that are available to the Nook, and the daily free treats from Barnes And Nobles! Which will more than pay for the Nook over time. Being able to call Barnes and Nobles and talk to a live person over the phone and being able to walk in the store and get face to face customer service.I also like the fact that when you are in the store you can read ebooks for free for an hour and download more free ebooks! For me It was the right choice for our family, as when we go to Barnes and Nobles with our children we can stay longer now that we have the nook and can receive free treats and more free ebooks! It pays for itself... These are some of the reason why I love my nook and I am excited that I received the Nook for a gift! I can not say enough about the Nook, I don't have to be tied to one book store like Itunes, Ibook, are the Kindle store... I don't like limits and the Nook allows me to be free to choose where to get my books from...Now with that said, When I visited my local Barnes and Nobles and received a free smoothie, It was so stress free and everyone was so nice.. I could not believe it!I have also downloaded music that I can listen to and have my ear plugs for that, I have also downloaded several books which was so easy to download that I was shocked! I like getting my monies worth, and not having to pay extra monthly fees.Now with that said, I hope that when you do your research you will consider the Nook, I am surprised that there are not more reviews than the current number of reviews. Well back to my Nook, as I can not put it down!What a great gift, and a great buy!!!**************Update****************5/30/2011The Nook is still awesome... Since I have owned the Nook for a while now, I came back to offer an update..As far as downloading books, I downloaded books the other day and before I could blink they were on my Nook!I am still happy with my Nook and love my Nook! I have recommended the Nook to friends and family who have also made purchases and are happy with the Nook as well.The performance of my Nook is awesome, and I have had great experiences with my Nook since the day I was surprised with the Nook as a gift! Best gift anyone can give! The joy of reading!I take my Nook with me every where! My children are still in love with my Nook and love to play the games on my Nook or read a book. My husband even likes for the children to read books on the Nook. The Nook has brought so much fun and the joy of reading to our family!You can also go to Barnes and Nobles and take classes to learn more about your Nook as there is so much to learn and so much that the Nook has to offer. Check in your area to see what times your local Barnes and Nobles offers classes.I also like the Nook because the Nook continues to educate you on a daily basis with the daily blog of what took place on the days of the week, for example if you turn on your Nook right now and go to the daily, it will inform you what took place on this date. Which to me is a neat feature as you get to learn something new about something you may have  not known.As far as the touch screen part of the Nook, we love it! It does not distract us but adds to the beauty of the Nook in our opinion. It is easy for my family to use.********2012 Update*****Well it is 4/24/2012 and I still love my Nook and my Nook still works great! I just wanted to give another update for individuals looking for a e reader.As of this date, our children are now asking as they did before can they have my Nook. And for now they can use my Nook, but I still love Nook and I am not ready to give my Nook up. One day we will purchase Nooks for the whole family.As far as use, I was out in the sun and reading with no problem. So many e reads and tablets are currently on the market. This nook still works for me and still performs and amazes me. There is still so much to learn with the Nook I currently own. If you are looking for a great affordable e reader. Don't over look Nook.  Good luck with your decision.Hopefully this update will help you in your decision. We would by one hundred more and pass them out as gifts and charity, just so people can get to read and find joy in reading! Great tool to use to educate children and adults!Back to my Nook!", "overall": 5.0, "summary": "Great E-Reader 2012 and Nook Still Rocks!", "unixReviewTime": 1293580800, "reviewTime": "12 29, 2010"}