{"reviewerID": "A3IROM8JD6KAVG", "asin": "1400532620", "reviewerName": "Floyd Sense", "helpful": [1, 1], "reviewtext": "I've owned this original Nook for two years now and have read dozens of books on it.  I've also spent dozens of hours on the telephone with Nook support and other activities related to keeping it running.  I'm an experienced software designed/programmer, engineer, etc. and I can assure you that compared to a paper book, this is a seriously flawed concept.  If you insist on buying an eBook reader, make sure you allocate plenty of time that you could have better spent on reading a real book to spend on arguing on the telephone with foreign call center reps.  B&N;'s concept of customer support is severely lacking and they appear to have little knowledge when it comes to supporting electronic gear.On top of those problems, consider the very concept of the electronic book.  While you will pay close to the same price you'd pay for a real book on sale, you won't own the book - you'll have a license to use it.  When you're finished with the book, maybe you'd like to be able to loan it to a relative or friend, but you can only do that if they have a Nook and you can loan it for two weeks only.  I suppose when the two weeks is up, the borrower sees the book disappear, finished or not.And then there's the odd problem of your Nook for some reason being tied closely to the email address you had on file with B&N; when you registered your Nook.  I recently had to change my email address and updated my B&N; account with the new address and new B&N; password.  After that, I could no longer download books, and was unable to unregister and register my Nook (that was supposed to fix the problem, according to the support center).  If you happen to get yourself into that dilemma, be ready for a long drawn-out session on the telephone.  The problem was that B&N; neglected to spell this situation out on their website when I changed my email address.So, if you're into \"going green\", driving a hybrid car (and thinking it's going to save you money in the long run), then the Nook may be for you.  If all you want to do is read, forget the Nook and go to the local library or bookstore and spend your time reading.  Give the price of the Nook to a local charity.  Everyone will be happier.", "overall": 1.0, "summary": "Run the other way", "unixReviewTime": 1331424000, "reviewTime": "03 11, 2012"}