{"reviewerID": "A1TNK6MP89YXY2", "asin": "B00000K4KH", "reviewerName": "Jamie Wilson", "helpful": [129, 136], "reviewtext": "When it comes to notebook physical security you need a device that will deter crimes of opportunity -- such as those presented by leaving your notebook at your desk at work or at a table in a library while you browse the shelves.  If you want to protect your notebook from a determined thief, buy a safe.Most cable security devices are going to provide about the same amount of security so you need to focus on ease of use.  If a device is easy to use, then you're more likely to use it and use it properly.  The Kensington system doesn't get much simpler.  It consists of a cable, which is wrapped around a reasonably unmoveable object, and an attached key lock that attaches directly to your notebook's security slot.Compare the Kensington system with the Curtis 06414 system and you'll probably agree that the Kensington system is far easier to use.  Compare it's 1 piece system to the Curtis system which uses a cable, a seperate metal piece that hooks to the notebook's security slot and a seperate lock that connects that piece to the cable.  That's 3 seperate pieces, a little more effort to hook everything up and the possibility of losing that tiny metal piece the whole system depends on.I've used both the Kensington and the Curtis systems at work and have found the Kensington system to be far easier to use.  I put one key on my keyring, put the other key someplace safe and can toss the cable into my bag and be good to go.  With the Curtis system, I had to make use of its storage bag just so I wouldn't lose the individual pieces.  I'm also sure the extra effort required to setup the Curtis system will prevent some people from using the device as much as they should.The Kensington system costs a little more money, but it is definitely worth it.  It's my choice for my personal notebook.", "overall": 5.0, "summary": "Notebook physical security doesn't get much easier", "unixReviewTime": 1012608000, "reviewTime": "02 2, 2002"}