{"reviewerID": "A2JWF9IG8PJAOA", "asin": "B00000K4KH", "reviewerName": "Zen", "helpful": [0, 0], "reviewtext": "My product came packaged neatly in a clear plastic bag. Comes with two keys with bright orange tags. and a Paper Manual with the code to replace your keys if you ever lose them. Never got the link to the site to work, so codes were practically useless.The cable has two different ends. One end has a lock and attaches to your laptop and the other end is a loop.The end with the lock can swivel, so the lock revolves around the end if the cable ever gets tangled.I wrap the cable around the leg of my desk and pull it through the loop. This way, unless someone has a cable cutter or enough strength to rip the leg off the desk, they should not be able to steal the physical laptop. Unless they were aiming for the Hard Drive, graphics card, or DDR3 RAM; that would be a different story.Cable is almost no different than the heavy duty bicycle security cables. It has a diameter of roughly ~&#60; 1 cm. So a decent cable cutter can cut the cable in half.This is only a simple way to ward off thieves in a very basic environment. Better than nothing.&#62;&#62;&#62;Final Thoughts&#60;&#60;&#60; I only got this since I needed to use my laptop on my desk at my part-time job, and I can't be bothered constantly locking my laptop in the cabinet every time I step away from the desk.Keeps thieves from stealing your entire laptop. If they were aiming at the components of your laptop, all they need is a Phillips screwdriver and plastic gloves. Or if they had a good compact cable cutter, which nowadays are quite small.For ~$31, not a bad deal. TO me was better than a retractable cable as those are weaker and thinner. The long cable is good if I ever needed the extra length.Fits in my ASUS 15.6 inch N53SV-EH72 laptop and my Acer 14 inch V5-471P-6498 laptop.May recommend to others, I don't know how long it would keep thieves off my laptop but something is better than nothing. :D", "overall": 5.0, "summary": "Temporary Security measures. WOn't stop a CAble cutter.", "unixReviewTime": 1367452800, "reviewTime": "05 2, 2013"}