{"reviewerID": "A19HP1ACNFQDT", "asin": "B00001OPJQ", "reviewerName": "Kevin Arthur Wong \"pheriwinkle\"", "helpful": [3, 3], "reviewtext": "Let me start by saying that when I scanned all of my CDs in to iTunes to work with my iPod and iPhone, I deliberated long and hard about the compression rate I would use, and I finally settled on 320-bit AAC with explicit stereo, because I really could tell the difference between various setting after comparing them with carefully chosen songs.  And I do regret a bit not having done Apple Lossless Format now.  By this I'm trying to say I have sensitive ears.I was so looking forward to the TEAC AD-500 to solve all my problems.  (1) I really wanted to be able to control cassettes with a remote control and (2) I wanted a \"real\" single-disc CD Player that functioned as such, instead of using a DVD player to play CDs, which is slower and inconvenient--the track number is not displayed, the \"screen saver\" often engages so you have to hit buttons more than once after a time, etc.The first thing I did when I unpacked the TEAC AD-500 was to set it up and attached it to my tuner so that I compare it against my existing equipment.  The cassette player was the most disappointing.  I currently have a Pioneer CT-W606DR, which remains the best sounding cassette player I have ever encountered or read about online (that has a reasonable cost).  I chose two cassettes to compare mainly because I new that the magnetic tape in them was in excellent condition and has great sound quality.  These were \"The Dealer\" by Chico Hamilton and \"Introspective\" by the Pet Shop Boys.  I tried both with speakers and with headphones.  The TEAC sounded pretty good, I must admit.  However, when you compare it against my current Pioneer, it paled in comparison.  The Pioneer had far greater treble response, yielding a far more vibrant and crisp sound.  There was also a far greater \"depth\" with the Pioneer--that feeling that you can reach into the sound to touch the individual instruments.  I should say that I had Dolby noise reduction off on both units.  I mean, the TEAC does sound far better than my two Sony cassette walkmen.  However, the promise of a remote control was not enough for fogive the lesser sound quality.The CD section of the TEAC is less dissapointing.  I was comparing it to a Sony DVD-Recorder RDR-GXD455.  The similarity was much closer here.  However, I have to say that the Sony came out slightly ahead of the TEAC.  The tonal quality of the reproduction was a bit richer and the highs were a bit more crisp.  This might boil down more to a matter of personal preference rather than absolute superiority.So, alas, I'm going to return this unit and limp a long with the functional deficiencies in my current equipment in exchange for better sound quality.", "overall": 3.0, "summary": "Sound quality not up to par", "unixReviewTime": 1253923200, "reviewTime": "09 26, 2009"}