{"reviewerID": "A3ZCIEUX68DEZ", "asin": "1400532620", "reviewerName": "Kris Garvey", "helpful": [0, 0], "reviewtext": "When I first heard about e-book readers, I was skeptical and did not want to give up my precious collection of books. (I have a teeny tiny little hoarder of books inside of me!) But then I finally caved and decided to try one because of my difficulty in reading larger and heavier books laying in bed at night, and due to being away from home for periods of time where I couldn't easily carry a dozen books with me.The first reader I had experience with was when my grandpa had purchased one of those huge honkin' Kindle DS readers with the full key pad. I was excited about that one, but the price was WAY out of range. I decided to try and go with the Nook (after my typical pre-purchase ritual of spending days doing research on the best option) and I was so thrilled with it, I had nothing bad to say. I used that little beauty for a few good years, until I was forced to sell it to help pay bills. From the very moment the Nook left my hands I regretted it. I was certain I'd never find one that good again. And I don't believe there has been any readers since then that are that good still!Fast-forward to this Black Friday. The FIRST Black Friday when I actually HAVE some money to spend! And I am looking for a really good e-reader! I did come across the Nook on Amazon, and saw the new Nook Simple Touch, which intrigued me, because I wanted to stick with the e-ink display, and not have a full-size touch screen battery killer. Finally, I realized my love for the original Nook had never died, and it still had everything I could ever want in an e-book reader. I was even able to buy one from a vendor here on Amazon, who lived less than half an hour away from me, and it only cost me $50!!! I was SOOOOO excited!!Now, if only I had NOT wasted $5 on that stupid fake-leather black cover, that completely RUINED the casing on my Nook... :(", "overall": 5.0, "summary": "After All These 'Cutting Edge' E-Readers...", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}