{"reviewerID": "A2JWDEMXQ8SQTI", "asin": "1400532620", "reviewerName": "Leo", "helpful": [2, 3], "reviewtext": "I bought this device not expecting much out of it.  Reading books is a breeze...the screen is clear even in bright light.  The device is VERY light...feels like holding a small clipboard. I find myself touching the reading part of the screen....just a bad habit as I am used to using my iphone.  As with any device, you might want to breeze thru the manual first because I sure didn't...took me a while to figure out that the \"n\" on the front is the \"home\" key.The craftsmanship feels pretty low end.  I think if for some reason it fell out my hand, it would definitely break.  i have never dropped it...that's just my opinion.  Battery life is good...tho using the wifi decreases the battery life a lot faster.  Though this can browse the net, don't even think about having a good experience doing that...the browser sucks.  Keep in mind, this is not a computer, nor a pocket PC/tablet PC...so if you're looking for something to browse the net, you should buy something else.On a whole, I find the device to be a little slow, but great for what it is intended for. it probably \"turns\" the pages as fast as you would turn the page of a real book.  I'm already used to fast devices, so that is probably why this seems slow to me.**International Buyers**This device will download books if you're outside the US, however, you need to have a credit card that was issued from the US to purchase the books.  I even tried purchasing an eGift card from Barnes and Nobles and using that to purchase my books, and even though i was successful in purchasing the gift card, it will check your default credit card prior to deducting credit from your gift card.  I ended up having to change the name on the account to my mom's name and used her credit card to purchase books. (she lives in the US)", "overall": 4.0, "summary": "Pretty nice! Beware international buyers!! Read this first!!", "unixReviewTime": 1301702400, "reviewTime": "04 2, 2011"}