{"reviewerID": "AOY9SZTMNQWAW", "asin": "1400532620", "reviewerName": "Mercedes", "helpful": [9, 9], "reviewtext": "I received the Nook as a Christmas present.  I already own a Kindle latest generations, 3g/wifi.  However I soon discovered that not all books are available on the Kindle and 99.9% of the books I couldn't get on my Kindle are on Nook.  After much research I soon learned that if you want good ebook reader you buy either a Kindle or a Nook.  So I asked Santa for it.I will not tell you I like the Nook better than my Kindle or my Kindle better than my Nook.  Both have excellent features that make them both excellent ereaders.Here's a few on the Nook:  1- It keeps the book title, time, and battery charge visible while reading.  2-It starts up just a bit faster than the Kindle.  3-You can use your own photos for the screen saver and wallpaper.  4-it recognizes the table of contents in PDF books.  5-it reads EPUB file types (meaning you can buy books from Borders.com too and read them)As for the Kindle here are a few features I love about it:  1-I like the real keyboard as the buttons are much easier to push than on screen.  2-It reads PDFS much better than the Nook, more so when you have the PDF converted.  3-the page turns are a bit faster.  4-I prefer the black housing to white.  5-the reading page/screen has no glare at all (the Nook's little color panel on the bottom is very reflective) and it seems the print is a little darker.Both the Nook and Kindle are very easy to purchase and load books on.  I think the thing I was most disappointed in with the Nook are the covers.  They are not enough covers that actually close, like the Kindle and when sticking this reader into your purse or bag, you don't want the cover to open and scratch the screen/reading surface.If you are looking for a great ereader, you cannot go wrong with this Nook or the Kindle latest generation, in my book they are both on the top shelf.  Now if we could just get one that is a smashed together version of both their great features into one unit.Update:  After using both my Nook and Kindle for a while now I've decided I do like the Kindle much better than the Nook.  The page turning buttons on the Kindle are very very light touch, the reading screen does have darker print, and the collections feature is top notch.  Now my Nook, the buttons take some pushing to turn the pages, the reading screen is lighter, and the shelves option is ok.  What I don't care for in the shelves feature is I can't colapse the shelves to just show the shelves and then open them when I want to search in them.  I also don't care for the B&N; Library being seperate from My Documents.  On the Kindle these are all included together and you can sort them out using collections.  With the Nook you must use the naviation screen to switch between them.  I've also had some trouble with the navigation screen on the bottom.  I don't have large fingers and don't wear long fingernails so moving around on the screen should be easy.  However, when I'm tryting to scroll or select something on the touch screen I just can't seem to get what I want.  But when I don't mean to move on the touch screen but accidently touch it, I trigger a menu move.  It's still a very good reader, but when comparing options and usability, I'd choose the Kindle any day over the Nook.  I'll purchase most of my books on the Kindle and what isn't Kindlized will go on the Nook.", "overall": 5.0, "summary": "Excellent reader", "unixReviewTime": 1293321600, "reviewTime": "12 26, 2010"}