{"reviewerID": "A2Q5OH3DGQGMXD", "asin": "1400532620", "reviewerName": "Rob \"riverstone\"", "helpful": [161, 171], "reviewtext": "I have been an Amazon fan for a long time. My first attempt at owning a Kindle resulted in two failing devices for which I eventually obtained a refund.My birthday is today; my brother asked me what I wanted two weeks ago and I told him the Kindle. Unfortunately at that precise moment Amazon was right in the middle of rolling out the new Wi-Fi only Kindle and all models were unavailable.  So, I went for the barnes & noble nook Wi-Fi only.Considering my previous experience with the Kindle, I tried not to get too excited. I went on the net to read reviews of the nook and was fearful. I read that it was buggy, that it lagged when you changed pages, that the touch interface was not all that responsive.All of this was wrong; the page turns are quick and do not interrupt the flow of reading.  The touch interface is very nice and I like seeing my book covers in color. When you choose the Cover Flow, your books slide by with the touch of a finger and you simply tap on the book you want to read at that moment.  This was surprisingly helpful when I went to make purchases on the B&N; Store. I know you don't judge a book by its cover, but how many times has a nice colorful packaging led me to a book I wanted to read, uhm; many times. I was really intrigued with the \"swipe\" page turn that you used the touch screen for, however this did not seem to function correctly on the store model or on my own nook. Strangely, after a period of time, it now works perfectly. A representative told me it simply had to adapt to my touch...I don't know how much I trust that statement, however when she turned a page on the display nook it responded to her very well. (Perhaps it was a learning curve?)Side-loading documents: Wow, if you have any epub or pdf documents all you have to do is side load them and voila.  I do recommend a free program called Calibre, which organizes your books, helps you edit the tags, add a color cover, or convert to epub. Pdf is not very easy to read on the nook, but if you convert to epub it goes smoothly, unless there are alot of photos or images, which lessens the accuracy of the conversion. Calibre has even converted files like, Word-Doc, Html, Palm, etc. Calibre will let you pick and choose books to upload to the nook directly from the program; in other words it 'sees' the nook.Drawbacks to the nook: The battery life, that nifty little color touch screen eats the battery power like mad.  B&N; claim that you get 10 days, cut that in half. I do not know if this is because I use the touch screen to do my page turns or not,(the other option being the side buttons) but I am leaning toward, maybe? LCD screens notoriously use power; but using the page turn function does not require the back-light to be on, so I am not sure how it is eating up the battery so badly. It is honestly not that much of a problem for me. I am around my computer so much that it is unlikely a day will go by without it being attached to the CPU or an outlet next to my bed. I have gone almost four days with not re-charging; and I could see that little power icon decrease at least to slightly more than half in that time.Oh - and that nifty little cover flow on the color screen.  Don't expect it to work for Your Documents.  (There are two libraries, the B&N; purchased books and your side-loaded books or documents.) Also there is no way to sort your documents to your specification so you either sort by author, title, or the date you loaded them, very annoying if you build up a nice library; which is highly likely considering you can add an SD card to your nook and increase memory to 16 maybe 32 gigabytes. Speaking of which with that ability to increase memory, it would have been nice if the MP3 Player interface were a little more sophisticated.  An interesting ability is to play an unabridged audio-book and read the book at the same time. I am not sure who would do that, but then again I understand spoken Spanish more than I am capable of reading it.  This might be useful to me in that area, if I can find the matching audio-book/ Spanish-book. (Nuance in foreign language is often lost in English translation.)Never having owned a functioning 3G eBook-reader, I never really missed it with my home Wi-Fi. I have discovered several places close to where I \"haunt\" which have AT&T; free to my nook. I already have a huge collection of books lined up for me to read... so feeling a \"need\" for the 3G seems unlikely. I have always done this, collected books that line up, ready for me to read. (By the way... the in store B&N; Wi-Fi connection has s*cked at every B&N; store I have been to. Amazingly Border's free Wi-fi worked better, I just couldn't buy through the B&N; store. I had to go to my smart phone, buy the book, and it uploaded.)So how do I feel about my nook; I absolutely love it! To be fair however, had I received a functioning Kindle, I would have felt the same way about it, I am certain. I think the Kindle has deficiencies with the lack of a touch/color interface and the side loading documents ability. However, that screen kills the battery as I stated.  The reason for liking the separate touch interface is that you don't want to touch your e-ink screen; I don't see how Sony's all touch interface e-reader is going to be popular when you are smudging your read screen all the time, though I must admit I would like to try one out.The nook is comfortable in all sorts of positions, laying in bed, on the couch, holding it next to you; even laying it away from you and increasing the font so that you could read without holding it. I highly recommend a reading light, especially if you had grown accustomed to reading LCD screens in the dark (my kindle program on my Android phone.)It is rather frustrating, I would have preferred a Kindle simply because I was impressed with Amazon customer service when my Kindle malfunctioned.I do recommend the nook. It would be nice if they would lessen DRM restrictions so I could buy books from Amazon or any other place for that matter.SincerlyR", "overall": 5.0, "summary": "nook wifi is it a worthy e-reader? I think so!", "unixReviewTime": 1282089600, "reviewTime": "08 18, 2010"}