{"reviewerID": "A7HEVWKSWUSI4", "asin": "B00001P4XA", "reviewerName": "Autistic Aaron", "helpful": [7, 7], "reviewtext": "Upon determining that the Apple-brand ear pods included with my iPod were of inferior quality, I opted to have them replaced ASAP.  I assessed my options while remaining conscious of my budget and planned usage of the product, and decided on the Koss \"The Plug\" (or \"Spark Plug\") ear buds.  My other option was the Shure E2C model, as a friend owns these, and they sound phenominal.  However, since I don't foresee myself using my iPod all that often, I didn't up my budget to accommodate these.These headphones are of the \"ear bud\" style, which basically means that a foam/malleable nub is inserted into the actual canal of your ear (as opposed to ear pods, which snugly rest within the exterior of the canal.)  An important thing to know about ear bud-style headphones is that THEY WILL NOT PERFORM AT THEIR MAXIMUM ABILITY IF NOT PROPERLY INSERTED!  Instructions are clearly printed on the back of the package, and if not followed, you will NOT get the best usage out of your product -- in fact, the sound quality very well may sound terrible.To PROPERLY insert these ear buds, the ENTIRE foam nub must be fully compressed (via pinching and rolling with the fingers) and immediately inserted into the ear canal.  Additionally, your best bet is to gently pull your ear canal open by gripping the top of your ear with your thumb and index finger while inserting.  The ear buds then must be held in place (without shoving them in deeper) for approximately 8-10 seconds, while the foam expands into your ear canal, forming a solid fit.  If incorrectly inserted (i.e. not inserted all the way, not compressing the foam prior to insertion, etc.) highs and lows will sound AWFUL, even if you own a pair of $300 ear buds (yes, they do exist.)  Simply put, if you look in the mirror with the ear buds inserted and you can only see the plastic ear pod outside of your ear, then you can pat yourself on the back for a job well done.With that out of the way, the sound output of these rather inexpensive Koss ear buds is very impressive for the price.  The frequency response ranges from 10 Hz to 20 kHz, which is nothing to smirk at.  Distortion is cleverly kept to a minimum at all volume levels except for the very loudest point (I suggest breaking in your ear buds gently before hopping right in and destroying your ear drums.)  The bass output is subtle and effective for the most part, but doesn't perform very well with certain genres of music (while almost all electronic music sounds amazing, bass-heavy rock music or deep rap music may not produce the same satisfaction.)  It should also be known that there literally is no headphone, in-ear or not, that perfectly reproduces all styles of music, and this applies to even the most expensive models.  Any given headphone device will excel in certain categories of sound reproduction, while performing less impressively in others.  (Can you tell I'm an audiophile yet?)The few negativities to speak of are as follows.  The cable, while a decent length (not too short, not too long,) feels rather fragile.  Additionally, the included foam polymer ear buds are on the large side, and may or may not cause some minor to severe  discomfort after extended periods of use (upwards of an hour.)  Thankfully, replacement ear buds can be purchased in multiple sizes at most electronics stores.Overall, if you're finding yourself in the same boat I was and are looking for a suitable replacement for your disappointing Apple-brand iPod ear pods but don't want to break the bank, the Koss \"The Plug\" are HIGHLY recommended for the price.  I haven't heard any other in-ear ear buds in this price range, but I can imagine that these are hard to beat for the money.Just DON'T FORGET TO PROPERLY INSERT THEM EVERY TIME!  Once you get the hang of it, they can be properly inserted and snug in your ears within 15 seconds.  If you don't insert them correctly, they WILL NOT SOUND GOOD AT ALL, and you will have WASTED YOUR MONEY!  I'm a smoker, and even I hate wasting money!  So, educate yourself on in-ear headphones before buying any, and you won't be disappointed.", "overall": 4.0, "summary": "Amazing value, great sound if used PROPERLY!", "unixReviewTime": 1131494400, "reviewTime": "11 9, 2005"}