{"reviewerID": "A20Y7REXQZ1REW", "asin": "1400532620", "reviewerName": "Ryan Kurtz", "helpful": [11, 11], "reviewtext": "First off, I want to start out by saying that I love my Nook. My friend is an employee of B&N; so he was there to help guide me along in my selection and answer any questions I had. So, yes, I did have a little bias to the product to begin with. However, for what I need, this is perfect in almost every single way. In my review I'll compare the Nook to the Kindle ($139 version) and it's major differences, just so people know what I'm talking about in terms of other products as we go down the list.The Bad (If you want to call it that):1. The Nook is a little heavier than the Kindle. I'm not sure of the exact weight differences, but just by feel alone it is a tad bit heavier. Now, that can be a good or bad thing depending on how you look at it. I for one don't find it to be a deal buster, the weight is not catastrophically heavier and uncomfortable, but it is heavier than the Kindle. I do think, however, that the durability of the Nook is a little better compared to the Kindle. The Nook has built in paddles to turn the pages, while the Kindle has flappy paddles along the side that feel as though they could break if I dropped it on it's side or if I touched it to hard. My suggestion for anyone interested in buying the Nook is to also buy a carrying case for it so it makes it easier to read, almost as if you were reading a real book. The covers at B&N; usually start around $30.2. The Nook does have a touch screen that has a bit of glare to it. Some others have posted their reviews of how they dislike the glare when the touch screen goes dark. For me it is a bit distracting if you find yourself wandering away from the text. However, whenever I read a book I find many distractions around me while I read. It's not a huge deal in anyway and some have posted if you turn it to the right angle you won't see your reflection. Again, not a deal buster in anyway I wouldn't think.3. The start up time is atrocious. I can't defend this one in anyway. Amish people can put up houses in a faster amount of time before the Nook would have a chance to get to your homepage. Ok, so not quite that slow, but you get the idea. I haven't timed it yet but I'm going to take an educated guess that it takes around 1-1/2 minutes to start up. That is something that should have been addressed from B&N; to begin with. Again, I can't defend this one in anyway.Ok, so what you have all been waiting for: The Good1. The extra storage feature is superb. The Nook comes with a built in 2GB storage space. Enough for most people, 2GB will get most every book you want to read in your Nook with no problem. However, if you are a fanatic reader that has Newspapers and Magazines delivered to your Nook everyday or every week, this can begin to take up space if you don't free it up. But don't fret! The Nook comes with an extra storage slot for your SD card that can hold up to whatever the highest SD card space is out there. The great thing about it is, SD cards are a lot cheaper today than you would have found 3 years ago, so adding space is cheap.2. The Nook has a featured called \"LendMe\". This is something that the Kindle does not have and I'm sure for competition sake will have in the future. This a great, great, great feature to the Nook! If you have any friends, family or co-workers that have a Nook and have a book on theirs that you would like to read, you can hook up wireless or through the computer and Lend them a copy of it for up to 14 days. If you're a fast reader then you can knock out a 500-600 page book in easily 14 days.3. Your county library might be on the list of Nook rentals. In the county in which I reside in North Carolina, our county library is fortunate enough to have a system in which I can rent books for 14 days from the library. This also is something the Kindle does not have. Before I go off on how great the feature for renting books is, I should point out that the library is going to have a limited selection of books for you to rent. I'm a big Thomas Sowell reader and he has approximately 30 books out on the market. However, the county library that I rent from has only 1 book from his selection. So do you're research before you buy a book, your county library might have it already. The feature, as I have seen, is relatively easy to use. You do have to hard wire your Nook to your computer after you download some software, but it's really simple and the kind people at your local county library can assist you on how to do this. In fact our county library had everything we needed in terms of software and directions on their website.4. Finally. You can take your Nook to B&N; and read any book for up to an hour. Recently I went to grab some coffee at B&N; and wanted to read a book on Ireland. Popped open my Nook, connected to the B&N; network (already programmed into your nook for ease), selected the book I wanted to read from the list I searched on, and wam-bam I was reading a book. You can read lots of books on one Nook from their online selection without having to lug 20 actual books that you wanted to compare before you bought.In closing on this review I would say first and foremost do your homework. Go to B&N; or BestBuy and try out the Kindle, Nook and even the Sony Reader. Some will really like the touch screen of the Nook compared to the touchpad of the Kindle, but it's all in what you like. Some will like the fact you can Lend books and some won't.I'm sure I've missed out on something that others would like to know about the product before buying, so if you have any questions please contact me back here on Amazon and I'll try to get to you as quickly as possible.", "overall": 4.0, "summary": "Great Item, But Does Have a Few Flaws", "unixReviewTime": 1293926400, "reviewTime": "01 2, 2011"}