{"reviewerID": "A5JXRY7KNM1QK", "asin": "B00001P4XA", "reviewerName": "bweaver \"Owner of http://spotlightvt.com\"", "helpful": [3, 3], "reviewtext": "Overall I'm very pleased with The Plug headphones and I've been using them daily for over a month now.I purchased these headphones to replace the stock IPod headphones.  I use my IPod almost exclusively for listening to podcasts while I do my morning walk and while I'm driving to and from work.  For that reason I didn't need high fidelity.What I was looking for was 1)a headphone that would block external noise and 2)stay in my ear 3)comfortably.  4)Good sound was important to me, but I'm not that picky since I don't listen to a lot of music.  Here's how \"The Plug\" fulfilled my criteria:1. Noise cancelling: 5 stars. If you take the time to compress the foam by rolling the foam between your fingers and get it inserted correctly you get almost no external noise.  It acts almost like a regular ear plug.2. Stay in my ear: 5 stars.  Again if you compress the foam and let it expand in the ear canal.  If you don't it still stays in well, but not nearly as well as it does when it is compressed and allowed to expand.3. Comfort: 4 and a half stars.  The half-star deduction is because the hard plastic part of The Plug presses against a spot on my ear and causes just a little bit of a pressure point.  Everybody's ear is shaped different so your mileage may vary.4. I did try these with music and they do sound great.  I've never had an expensive headphone so I can't give a comparison there.I really liked everything about the stock IPod headphones for my use except the ear bud itself.  The foam covers kept coming off and they didn't stay in my ear very well during my walk.  The Plug headphone does remedy those problems.I'm knocking off another half-star because The Plug headphones have a thin cord that gets tangled much easier than the Apple headphones.  This is probably common to any other \"aftermarket\" headphones though.", "overall": 4.0, "summary": "Good headphones, great price", "unixReviewTime": 1186704000, "reviewTime": "08 10, 2007"}