{"reviewerID": "AMGGZCWY3VNZC", "asin": "1400532620", "reviewerName": "S. Morales", "helpful": [7, 7], "reviewtext": "With these new ereaders on the market, the act of reading has come back to be a very \"in-style,\" technologically advanced and hip thing to do in 2010. Books are now less intimidating and more fun and convenient, and this becomes only more encouraged through Barnes and Noble's Nook.Now, to cut to the chase, the Nook can do most things that the Amazon Kindle can do as well, and while the Kindle holds some ground over the Nook, on an overall scale, if you're looking for a better and more convenient ereader, I'd say to go for the Nook.Both the Kindle and Nook have clear displays, but overall, I would say that the Kindle's display seems to have better resolution. The Kindle also beats the Nook on battery life (as you'll notice that the Nooks battery life seems to last about a week, whereas the Kindle about a month, this is due to the draining power of the Nook's light-up touch screen menu). People may also prefer the button keyboard operation of the Kindle over the Nooks sometimes annoyingly sensitive or not-sensitive-enough touch screen. The Kindle is also thinner and lighter than the Nook. Both have mp3 features though, which helps them. It's always great to be able to read to your favorite music.Now, while it may seem in this paragraph the Kindle has the Nook easily beaten, one must look deeper into finding out why the Nook is a better choice. The reason the nook beats the Kindle is easy - in its navigation, presentation and overall ease of use.The biggest problem with the Kindle (that I noticed) is that the Kindle seems to want to have the look and feel of navigating like a laptop computer in the way it presents the main menu and font size, style and book selection. The problem with this is one thing - this is NOT a computer, it's a portable book, and Barnes and Noble knows this, and made their unit feel way less like just another annoying technological gadget but instead with a \"browsing bookstore\" type of presentation. This is a very BIG difference between the two, and you can sense it even after just a few minutes of toying with it. And this is only talking about the OLDER Nook, I can only imagine how much more amazing of a presentation the color Nook can get with all of its full color pictures and extras.On top of this, the Kindle seems to have placed the turn-page buttons way too attached to the ends, so you actually end up hitting the buttons by accident way too often, whereas the Nooks buttons are more of a soft \"bendable plastic\" type, so you never hit them by accident. This, on top of the little things like being able to slide your finger on the touch screen to turn pages as well as getting book covers and previews, daily logs, etc, give the nook an overall more \"coffee house\" feel which the Kindle doesn't even come close to. And even though the Nook is bulkier and heavier, it actually is made of a more durable softer rubber-like material, and along with the white paneling it makes it feel overall way more professional and studious. Not to mention just more attractive and stylish. This is easily the hipper of the two ereaders. Therefore, things like slightly longer load times, heavier feel, sometimes annoying touch screen and slightly higher price are actually very tolerable once you pick up both units and see and feel the overall difference.Books are an old-fashioned type of entertainment, and while the Kindle tries to make reading and literature just another tacked on 21st century technological piece of unrelatable modernized hardware, the Nook walks the perfect line of bringing the \"old-fashioned\" hobby of reading to a hipper style for the 21st century without taking away the studious professionalism of reading or disrespect the art of literature either. The transition is so much smoother on the Nook that you'll forget you're even reading off of an electronic device.", "overall": 4.0, "summary": "Nook BEATS the Kindle Overall, Reading Revived!", "unixReviewTime": 1292544000, "reviewTime": "12 17, 2010"}