{"reviewerID": "A2EDFATBY4VNTS", "asin": "B00001P4XA", "reviewerName": "D. Pritchard", "helpful": [4, 4], "reviewtext": "First, while I'm no audiophile and won't attempt to offer comments about the smooth, deep bass or crisp highs...your results may vary...I will say that I'm personally very pleased with the sound from these earbuds and find the isolation they offer is a real plus.  In fact, that's partly why I bought them:  Working sometimes in a very noisy environment that necessitates wearing hearing protectors, I thought it would be nice if I could turn them into headphones and at least enjoy some music while working.  I've never cared for earbuds that rest in your outer ear, so prone to falling out.  With the hearing protectors on over them, it was still rather easy to tug the earbug out of position.  &quot;The Plug&quot; stays quite well put, thanks to the soft foam cushions.  Away from work, the noise isolation of these stereophones continues to serve a great function, especially when travelling on airplanes or in any noisy environment.It is the isolation offered by the ear cushions that surely attribute to their efficiency.  Even low-powered headphone outputs on portable music players will likely still have all it needs to drive these plugs sufficiently for enjoyable listening.  The drawback of the ear cushions is, as others have said, that they do mean you must be careful about how you position the plugs in your ears, as that will affect overall sound quality.  The bass is excellent yet can become &quot;boomy&quot;.  That is why I say &quot;your results may vary&quot;.  But, for anyone willing to spend some time getting familiar with &quot;The Plug&quot;, I think they will be happy with the sound potential provided.Now...about the custom fit.  Yes, they really do custom fit to your ear canal if you choose the appropriate size cushions from those included.  However, again as mentioned, the provided cushions do not remain compressed very well while attempting to insert the plugs in your ears.  Moreover, while the foam does seem to be the best I've experimented with in terms of comfort against the skin and general acoustic performance, it doesn't hold up very well over time.  So, this led me to exploring for a substitute, and learning in the process what a difference in sound the type of foam makes.As I write this, I'm wearing my plugs, modified by replacing the Koss foam cushions with some I made myself from Aearo E-A-R Classic foam ear plugs.  The beauty of this approach is that as the ear plugs are designed for hearing protection, they do compress very well and hold their compressed shape longer, making it easier to insert the plugs into your ear canal, for a better and deeper fit.  But, therein lies the rub...it is that more deep, secure fit that affect sound quality.  My observation is that the impact is primarily upon the bass...making it even deeper and risking again a potential &quot;boomy&quot; quality.  I'm pleased with the results I obtained from the Aearo ear plugs after trimming them down in diameter so there wasn't quite so much foam to &quot;bulk up&quot; in my ear.  While the Aearo plugs work well and sound good, I've found an even more comfortable and better-sounding (I think) alternative in using Howard Leight Laser Lite foam ear plugs.  The latter have a Noise Reduction Rating of 32 and are made of a softer, smoother-textured foam than the Aearos.  I think the Aearos have a similar NRR, but they are not labeled with it.Now, how do you go about making your own ear cushion?  The approach I took was to compress one end of the foam ear plug down until it was basically flattened squarely against the other end on a flat surface.  Then, holding the &quot;pancaked&quot; plug in place, I heated a large nail over a flame and then pierced the center of the ear plug with the tip of the nail, pushing it gently through the foam so as not to tear the foam.  Rotating the nail tended to help.  Once the hole was pierced through the foam to the other end, I lifted the foam off the surface and pushed the nail fully through, this also serving to tug the foam along enough that it helped it to stretch back out along the nail shaft.  Once the nail cooled a bit, I slid the plug off the nail and had a rather cleanly pierced ear plug that I could then slip onto &quot;The Plug&quot;.  If the new ear cushion was too long or too thick to fit my ear well, I'd trim it down gradually with sharp scissors.  In the end, I made up several pairs of cushions to interchange as I like.  The Aearo plugs were rather easy to modify since the foam is stiffer and thus easier to pierce with the hot nail.  But, with care, the Laser Lite plugs could also be pierced without tearing the foam and they are smaller in diameter such that I found no need to trim them, except in length.  When the modified plugs are slipped over the sound delivery tube of &quot;The Plug&quot; earpieces, ensure the tube does not get crimped and extends fully through the cushion so as to deliver the best quality sound.This may sound like a lot of work for such inexpensive headphones, but they are great-sounding headphones for a small price and can be customized to your own liking with a similar approach to what I describe.When I'm not using &quot;The Plug&quot;, I switch to my Koss KTXPRO1 Titanium headphones...another pair of excellent headphones that I don't think can be beat for the price.  They too sound great and have very good efficiency, at about the same price as &quot;The Plug&quot;.  They are better-suited for an office environment where you need an open-air type earpiece to hear conversation through, rather than being isolated.  The volume control on the cord is also a real convenience and is the only thing I find missing from &quot;The Plug&quot;.", "overall": 4.0, "summary": "Efficient, Broad Response, Custom Fit...at least 4 stars", "unixReviewTime": 1083715200, "reviewTime": "05 5, 2004"}