{"reviewerID": "A1YF0SKMGV2BIL", "asin": "B00001P4XA", "reviewerName": "Jason L. \"bereanminded\"", "helpful": [14, 20], "reviewtext": "I own a number of different Koss, Sennheiser, Sony and Grado products and I am extremely pleased with them all.  (I truly believe Grado is the best of the four companies but they don't make an In-Ear product.)These \"Plugs\" are good for nothing in my opinion unless one wants to go deaf, get a blistering headache and have ringing in the ears.  The distortion can only be described as a \"sonic bass mudslide\" that overwhelms and perverts all sounds coming through these \"Plugs.\"  I am genuinely shocked that Koss would put their name to such a terrible product; perhaps these \"Plugs\" are designed for a younger generation that wants to be deaf by 25 while listening to the type of \"boom boom\" bass that rattles windows?  But these \"Plugs\" are the exact opposite of what an audiophile or anyone else who wants to just \"listen\" and \"hear\" his/her music, books, etc. through headphones.  Before the blistering eight hour headache these \"Plugs\" had given me was through, they were repackaged and shipment was arranged for a refund.  I've never been disgusted by a Koss product before but I feel that I write out my experience as a warning to others.  Audiophiles and music lovers, BEWARE!In terms of In-Ear headphones, I would recommend the updated version of \"The Plug\" known as \"The Spark Plug.\"  It doesn't have as long of a cord but they haven't set my teeth on edge or caused headaches such as the one I received from \"The Plug\" and they do offer some passive noise reduction.  I also recommend the Sennheiser In-Ear headphones.  They are more expensive (in the 60-80 dollar range) but worth it if you have the money because Sennheiser does make a better product in my opinion than Koss these days.  The truth is that Sennheiser surpasses Koss on almost everything these days.If you don't like In-Ear headphones (and I'm not much of a fan of them myself with a few exceptions) and don't want to spend more than $[...], the Koss PortaPro, Sennheiser PX-100, PX-200 (awesome and blocks sound!), the iGrado, Grado SR60 (the best for pure sound!), Sony MDR-Q22LP (great little set!) and Koss KTXPRO1 are excellent alternatives that I believe are truly worth five to ten times what they cost.  I hope this was of some help.", "overall": 1.0, "summary": "Blistering headaches & terrible sound reproduction;  BEWARE!", "unixReviewTime": 1160697600, "reviewTime": "10 13, 2006"}