{"reviewerID": "A2UHIN9H9DDZMX", "asin": "1400532620", "reviewerName": "Warren Steffey", "helpful": [3, 3], "reviewtext": "My wife received a basic Nook for Christmas.  Being electronically challenged, she immediately plopped it in my lap with instructions to \"Buy me a book\". As the nearest B&N; store is 30 miles away I elected to follow the B&N; site to my PC, to the Nook route.  Opening an account on the B&N; site, purchasing a book and downloading it to my PC was easy and fast. Prices are about half that of a printed version. Passing it along to the Nook was another matter.  The Nook came with virtually no usable instructions, either printed or electronic, to explain the procedure that I wanted to use.  After going back to the B&N; site I discovered a little free program called \"Nook for PC\". After downloading that program I was able to copy the book from my PC to the Nook. Everything works fine now, and my wife is addicted to the thing, she takes it everywhere. She still will not, however, try to load new purchases on the Nook.We now have three copies of every book we have purchased, one on the B&N; site, one on my computer, and one on the Nook. With one Nook, it is pretty hard to share after she finishes, and although I can read the books on my PC, that just is not comfortable or practical.  I personally think $150 or so for my own Nook might be a little too much so I am going to look into a cheaper alternative. Walmart has one or two for under $120, one for under $90 that some people like.The Nook is a good option if all you want is a book reader.  The other functions do not seem to work well enough to be practical. The Nook might be a little expensive for what you get, but the service at the B&N; store we visited twice was excellent.  One evening after dinner we visited a B&N; store with Nook in tow. After my wife found a book she wanted, we took the book and the Nook to the Nook counter.  The attendant was happy to purchase the book with her Nook and download it for her.  The book cost for $24 and change, downloaded to the Nook, $12 and change. He even offered to return the book to the proper place on the shelf.  Not saying they will do this all the time, but it was a nice experience, and we saved a little money.", "overall": 4.0, "summary": "Takes practice", "unixReviewTime": 1296777600, "reviewTime": "02 4, 2011"}