{"reviewerID": "A3346F1Q4PT8Q1", "asin": "B00001P4XA", "reviewerName": "J. Williams", "helpful": [3, 3], "reviewtext": "I'm giving a 4 star review for these earphones with a couple big caveats.  I've owned a lot of portable headphones throughout the years and most recently have used a set of Koss SportaPros that have served me well; they sound good (not as good as the PortaPros, but still good) and were pretty cheap.  But they leak sound terribly, meaning they're not a great choice for listening on a crowded subway or while at work, and also are not that convenient to carry around.  When I recently bought an iPod and finally got to try out some in-ear headphones, I loved the convenience of being able to stuff both my player and the phones into one pocket when not in use, but I never could get the stock iPod headphones to fit my ear.  They didn't sound particularly good either.  So I knew I wanted to try something else.I first bought a pair of Sennheiser MX-500's, and while I actually liked their sound a lot (better than the stock iPod phones), they didn't fit my ears any better.  They'd fall out even if I so much as turned my head to one side.  One of my co-workers then recommended The Plug, and at such a low price I figured I'd give them a shot.I've now spent a few days with mine and my feelings on the whole are mixed, but I do feel these earphones are a pretty good value.  Most importantly to me is that so far, they're the only in-ear headphones I've found that don't seem to require constant fiddling to ensure they stay in place.  I do have to use the largest of the several types of included cushions - I apparently have very large ear canals - but they seem fairly secure (though not tight) once they're in there.  Some people may find this type of earphone uncomfortable - you really have to place them well up into your ear canals (make sure you clean your ears well every day!) - but I find them much more comfortable than the standard designs included with most portable players because you don't have this piece of hard plastic wedged into your ear.Sound-wise, I'd say they're fine, though certainly not remarkable.  My MX-500's sound better, and my SportaPros sound a *lot* better.  I'd put these about on par with the included iPod headphones.  They're pretty bass and mid-range heavy, though like other in-ear headphones the \"bass\" isn't really very bassy - it cuts off well above what most larger headphones can reproduce.  It ends up sounding a bit forced and artificially juiced, and there's a lot of this fake \"bass\".  On the high end, there's a lack of clarity - things like cymbal crashes sound \"muddy\" and ragged.  This is typical of low-end headphones of any type.Still, I'd rate the sound \"good enough\" considering the application most people will use these for (portable listening), and considering the increased comfort and dramatically better physical stability vs. more conventionally-designed in-ear headphones.", "overall": 4.0, "summary": "Good for those with large ears", "unixReviewTime": 1109980800, "reviewTime": "03 5, 2005"}