{"reviewerID": "A33775AIB1A664", "asin": "B00001P4XA", "reviewerName": "Mark Colan \"duke-of-url\"", "helpful": [243, 249], "reviewtext": "NOTE: the description I saw on the Amazon page does not reflect the product I have.  Above it discusses a headband and an adapter which are not part of this product.  Also, the rated frequency response is 10-20k, not 16-23k.  I think this is (or was) an Amazon editorial error.My interest for this product is as a solution to listening to music, lectures, and movies while travelling, and I travel a lot.  I have a set of Panosonic noise-cancelling headphones which were good (about five times more expensive than these earbuds) though bulky, but the plastic broke so they won't stay on my head now.These earbuds are an excellent alternative to noise-cancelling headphones for the frequent traveller.  I find them more comfortable for extended listening than most conventional headphones.  The ability to seal out noise from the external environment is very good, and makes it possible to understand what actors are saying when watching a movie on an airplane.The overall performance - sound quality and noise blocking - is not as good as the Bose noise cancelling headphones, but the Bose are 20 times as expensive, much less convenient to carry, and subject to damage from the rough world of the road warrior.  If The Plug had an optional noise-cancelling unit (say, combined with the eq), it would be a killer combination - are you listening, Koss?).The sound is good.  Bass-heavy, to be sure; I would like them better if they had a flatter response, but the product is marketed at the portable music crowd, and many of them are looking for dramatic bass rather than golden-ears sound.Besides, mobile sound is always a compromise, it's just a question of whether the compromise they chose works for you.Here are some problems I've heard and the solutions:1. \"They fall out of my ear.\"  I think an older version of this product did not come with alternative cushions; the ones I bought recently (as pictured here) came with 3 alternative cushion pairs, one of which fit well in my somewhat large ears.  To make them fit well, roll the cushions in your fingers and squeeze them down, then hold them in place in your ears while they adjust the fit. Also, it is possible to fashion your own cushions (easy modification to commercially available ear plugs from pharmacy); go to google and search for \"koss plug mods\".2. What about when I have to replace the cushions, they'll get waxy/dirty with use?  See last sentence of #1.3. \"They sound tinny\".  I have a sense that the sound was tinnier on an earlier version of these earbuds, judging from comments I've read in feedback and on the koss plug mods page.  The purple plugs (as opposed to the older(?) blue ones) do not sound tinny to me; they seem a bit heavy on the bass instead.  Koss also makes a 3-band eq (20 dollars) for their headphones that can be used to adjust the sound some.  I have an eq on order, hoping it may temper the boomy bass a bit.  Of course, your player may have a way of changing the color of the sound, but my laptop does not.4. \"They're easy to lose.\"  The price of their tiny size and negligible weight, is that you need to be careful not to lose them.  I've already lost a pair.  Koss also makes a carrying case which may help, or you could just put them in a 35mm film canister.  But at $... a pair (compared to $... for noise-cancelling headphones) I'll just keep a spare pair around in my travelling case.Overall I'm pleased with the price/performance tradeoff for these earbuds, and they are an essential part of my travelling kit.  They sound better than any other earbuds I've used, and they remove a good bit of the ambient sound, offering more pleasure in listening.  I give four stars out of five because I'd prefer a less bassy sound, though some people will really like the way they sound.", "overall": 4.0, "summary": "Good, cheap sound solution for the traveller", "unixReviewTime": 1055116800, "reviewTime": "06 9, 2003"}