{"reviewerID": "A1FNHDWSN2KA0G", "asin": "1400532655", "reviewerName": "Alex Tamulis", "helpful": [11, 15], "reviewtext": "I knew about the NOOK Color even before it was released and I was really excited about this ereader, because I own a Kindle 3 and I'm part of the customers that think that it could offer more things and be more en par with the future. The NOOK Color has many features that appealed to me like touchscreen, vivid view technology, brightness adjustments, really nice web browser and mp3 player, etc. So I decided to order one with BlueProton cause they ship it to Canada, and I paid 60 dollars more than the actual price at B&N; and expedited shipping taxes on top of that. I didn't care, I just wanted my NC cause honestly I'm just tired of buying AAA batteries for my Clip light to read my Kindle 3 in bed. I noticed I never read in bright sunlight, I'm an indoors type of reader and I also like to browse while I read, mostly wikipedia and google and the Kindle we browser is primitive.Anyways, I got the NC promptly, I was super excited, but then I tried to transfer my epub books to it and noticed that my computer didn't recognize the unit's drive. Nothing popped. I had my iphone and my kindle plugged in and they were right there. I went to a friend's house and nothing popped on his computer either. A third try at a different laptop and same thing: nada. I went back home and kept trying and all of a sudden I started seeing smoke coming out of the USB port and a smell of burned toast. Really strong. I knew that unit was gone and that freaked me out. Everything else worked perfectly, but the USB was pooched. I returned it and they were very professional about it, but said that they found nothing wrong with the device. I bet they just reset it and tested ome of the features without actually testing its hardware. Anyways, I said I didn't want that unit back. Now here I am, with no Nook Color, nobody else sends it to Canada. I'm contacting friends in the US so I can send it to them, buying it straight from B&N; and then they can mail it to me. It's just weird that at this day and age we still can't have items shipped internationally, even when we're willing to pay more money for that luxury.Now I'm again using my Kindle like crazy, since it's all I got and it never fails. But I'm still gonna buy the NC no matter what. I just don't know if I'll sell my Kindle 3 in the future or keep it because it has sentimental value now, hehe.I think that for 249 US dollars, the NC is the best e-reader in the market. Right now the Kindle still leads and the iPad is coming strong, but 2011 will be the year the Nook Color will establish itself as a great competitor for these other two. If Amazon doesn't come up with a color Kindle with touchscreen, I strongly believe they will be the Betamax and VHS of the 2000s. But I really like the Kindle and if they came up with something like a reader's tablet, I would use it instead of using B&N;'s. However, that still hasn't happened and Jeff Bezos says he doesn't want that to happen just now. So I'll purchase a Nook Color and be happy with it.", "overall": 3.0, "summary": "Great device but why not ship it to Canada?", "unixReviewTime": 1292457600, "reviewTime": "12 16, 2010"}