{"reviewerID": "A37E5KVAKOZFVS", "asin": "1400532655", "reviewerName": "Amazon Customer", "helpful": [11, 11], "reviewtext": "I have been working on my fiction writing skills, and wanted an eBook reader so that I could read a variety of other novels to learn from them.  The Kindle is a great device, but I really wanted a color screen.  The iPad would have been a nice option, but was a bit expensive for my taste and a bit too large.  The myriad Android tablets on the market don't seem to get great reviews, though I suspect that will start to change once Android 3.0 is available.The Nook Color was a nice alternative.  Priced a little higher than some of the no-name Asian tablets, but far less than the iPad.  It supports multi-touch, has a decent color display, and the ability to insert micro SD cards into a slot near the \"loop\" on the bottom.Because it supports both ePub and PDF out of the box, you can find a nice selection of books to download (legally) on the web and read on the device without additional investment.  The Barnes and Noble site also offers a limited, but growing, selection of electronic books (both free and for-a-price).  If you get tired of reading, you can use the built-in WiFi and browser to surf the web.  You can also play a couple of the built-in games, with the promise of more coming in a future update from Barnes and Noble.My only complaints so far about the device are that the far edges of the touchscreen seem a little unresponsive, the micro-USB connector is a non-standard type that seems to require use of the proprietary cable.  The connector on the device itself seems to make poor contact with that cable, which makes it difficult or impossible to read on the device while it's charging.Apart from that, battery life has been really good.  I rarely have to plug it in before I am finished reading for the day.The built-in web browser works well, displaying pretty much any web site that an iPad or Android phone can handle.The WiFi seems to find and hold on to signals well, and I don't recall it dropping a connection so far.If you take the time to learn how to \"root\" the device, you can add the Android Market to it and many apps (like the Kindle app) work very nicely on it.  This gives you the best of both worlds in a sense... The ability to buy eBooks from Amazon and Barnes and Noble, while keeping your color display.As far as eye strain goes, I work at computers 8 or more hours a day on the job and more when I get home.  I find the Nook's display easy to read for hours at a time and don't feel that my eyes are any more strained than when I read a printed paper book.  But your mileage may vary.  If e-Ink works better for you, the Kindle is a great alternative.I like the ability to highlight parts of the books I'm reading, take notes inside the book as I read (e.g., to highlight particularly good dialogue, characterization, description, etc., as a writer), and to post updates to Twitter and Facebook about your progress through a book.All in all, this was my favorite 2010 Christmas gift and has (for me) eliminated any desire to own an iPad or any other eBook reader.", "overall": 4.0, "summary": "Very nice eReader with tablet functionality", "unixReviewTime": 1298073600, "reviewTime": "02 19, 2011"}