{"reviewerID": "A2WFBRX9R0D84U", "asin": "1400532655", "reviewerName": "Amazon Customer", "helpful": [3, 3], "reviewtext": "I have had my new Nook Color for about 24 hours so here are my early impressions:Pro:  good quality, good color, responsive to light touch, connects easily to WiFi, good eMail service, easy access to Barnes & Noble eBooks.  Very B & N friendly.  Very good battery charge life.Con:  Lousy quick setup guide (more like an advertisement), Only responds to finger touch (I prefer a screen that accepts stylus touch.  I have large hands and fingers).  Lousy speakers (but I expected that)  I Haven't been able to download movies from Netflix, I'll keep working on that.  Connection to Netflix was the main reason for buying the Nook Color.  Difficult to download other products.  No night time screen.  On line manual (>100 pages) is almost useless.This is my second tablet in the last month.  The first was a PanDigital Novel which I returned because it was an Android 2.0 and had limited capabilities and no access to Netflix.  AND TERRIBLE CUSTOMER SERVICE (NONE).  There is a B & N store 10 minutes from whre I live.  In the past I have spoken to the folks there and they seem very knowledgeable.  I will visit them again with my list of questions.  I'll do an update to this in a couple of weeks.Update.  Raised my rating to a 5 *.  I found out I needed to do a software update (from 1.3 to 1.4.1) in order to get NETFLIX.  The nice man at the B & N store did this for me in about 6 minutes.  I now get NETFLIX with very good reception.  At this time I really don't care about additional apps.  Everything I think I will ever want is in the NOOK Color now.  E-Mail in and out.  Downloads books from the Public Library in seconds.  Internet browsing ok.  eBay access is ok.  Bought a game for $0.99 just to check out my B & N account.  Easy.  NETFLIX was easy to set up.  Battery charge lasts longer than anticpated.  The software upgrade has made the device overall more user friendly.  The only complaint I still have is that I can't use a stylus.  Maybe I can exchange my fingers for a smaller set.  NOT SORRY I BOUGHT THIS GADGET.  Also, good quality and GREAT customer support.", "overall": 5.0, "summary": "Nook Color OK", "unixReviewTime": 1324598400, "reviewTime": "12 23, 2011"}