{"reviewerID": "A1B5Z5OG2NPFDT", "asin": "1400532655", "reviewerName": "beginning archer", "helpful": [2, 3], "reviewtext": "I purchased two certified nook colors directly from B&N;, for my kids to read ebooks on, and for some entertainment on long trips, Dr's appts, etc.Things I like about the device:-versatility- now has netflix- great little device for entertainment, as well as reading.-user interface:  much improved following the last update, both navigating the device itself and B&N;'s store.-option for expandable storage- handy for music and mp4's.-ability to make the device 'kid friendly'; the internet can be disabled, and purchases can be made to require your account password.Things I dislike about the device:-Read in store feature only for certain books, and virtually no kids' books.  The impression I got from B&N;'s webpage was that it was for all ebooks.  This was the main reason why I picked these up instead of waiting for the Kindle Fire to be released.  Major disappointment.-Charger cable sucks.  The cable itself is weak where the usb adapter attaches to the cable, and is very easy to bend and break.  one cable is now broken at that spot, and the other is close to it.  These cables are easily replaceable, so not a huge deal, but I expected better quality...  Also, the power adapter is quite bulky.-did not update automatically.  I had to manually install the most recent update (allowing me to disable internet, and install netflix). it was relatively easy to do, following directions from B&N;'s webpage, but there should be a way to check for updates from the device itself.-loses battery life fairly quickly while on standby.-no free games & limited games (maybe apple spoiled me...)-prices for apps and books seem generally higher than on my kindle (I have not made direct comparisons, this is just my general impression)I will try and see if I can lend books through my local library; this may allow me to use it more for it's intended purpose.Overall, the device itself is quite good- just not for what I had intended it for (in store reading- with the option to purchase the book, in print, from the store).If I had purchased the device for myself, however, it would have been returned.  My kids do enjoy reading on it, playing angry birds, watching netflix, etc. so I will keep it for their use.Edit:The nook colours use a usb longer than a standard micro usb; a standard micro usb cable will not charge the nook colour.  I did contact B&N; (I initially took my nooks into a B&N; store for assistance, and was referred to their tech support 1-800 number.  So much for the in store tech support...)  I was able to recieve two new cables under warranty, though.I am generally happy with the tech support provided over the phone, but am still disappointed by the quality of the charging cable, and the inability of B&N; to solve this issue in-store.", "overall": 3.0, "summary": "certified refurbished nook color", "unixReviewTime": 1327017600, "reviewTime": "01 20, 2012"}