{"reviewerID": "ADX81OJF8C5CF", "asin": "1400532655", "reviewerName": "Bill Lumberg", "helpful": [2, 2], "reviewtext": "I am the occasional reader but, I bought this for tablet capability.  It can be rooted in about 2 minutes to have app store.  Once that is done, You can use a home screen alternative and program to switch it to hide the overbearing and hindering B&N; store.  It's still there but, not right in my face. Default browser is OK  but, I prefer Dolphin HD.  It's much more than half and Ipad at exactly half the price.  Plus, when used as a reader, it's just light and small enough to be effective at that purpose.  I had a Pandigital novel that I got for Xmas that completely died in 3 weeks.  I took the refund money and made the smartest purchase that I can remember making:  The Nook Color.  The novel is pure garbage compared to this device.  Android 2.1 is so much better than 1.6.  I also couldn't get many apps to run on the novel  where this runs almost everything. Spend the extra $ and get the color.  Save the extra money from the Ipad. I was considering Archos 70 but, I couldn't find anywhere to actually play with it.  Plus, given their history; I had decided against it.Good:Nice screen,  capacitive touch,  strong wifi, decent battery life, Nice CPU @ 800 MHz,  512 MB RAM  Ipad only has 256  supposedly), Tons of free apps available, very reasonably priced,  portable,  Barnes and Noble magazines  very reasonably priced at $1 to $3 an issue), microsd slot.Bad  minor complaints):that silly plastic thing in the corner, mono speaker, micorsd slot instead of sdhc card slot, doesn't come with android market.Overall this is the best tablet for the money currently and probably will be for quite a while.UPDATE.  Couple of small annoyances: randomly reboots instead of sleeping, wireless doesn't come back up sometimes after rebooting.  Still very happy with it though. Sleep issue apparently also happens to those who haven't rooted.  I'm sure it will be fixed with update.UPDATE:  I am very unhappy with Barnes and Noble's many attempts to update my firmware without my permission.  They have tried twice and didn't succeed.  I believe that AVG antivirus is stopping it.  They got my girlfriend's and we have the same nook, that came with same firmware, that was flashed with same mod.  The only thing I can think of was AVG must have stopped it.  They got hers weeks ago and mine is still fine.  She wasn't running AVG and mine was.  It's the only thing I can think of.Who else does that?  I have items from Sony, Microsoft, Nintendo, HTC (Sprint), etc and NONE of them update my property.  Who do these people think they are? Well, they won't be updating my firmware and now I won't be buying books from them either.  Anyway, it's an aging piece of hardware and now for a bit more money something better can be bought.Side Note:  I had ordered a touchpad from B&N; back on AUgust 21st.  Not only did I not get one, they cancelled my order for me without so much as an email.  Not very nice.", "overall": 3.0, "summary": "Good product.  HORRIBLE company.", "unixReviewTime": 1296518400, "reviewTime": "02 1, 2011"}