{"reviewerID": "A2U9WJOGZSYM0U", "asin": "B00001P4XH", "reviewerName": "Headphone Pilot", "helpful": [169, 172], "reviewtext": "I already have two \"no name\" inline volume controls, but I needed another.  This Koss unit was no more expensive from Amazon than another \"no name\" from an electronics store, and I've been a big fan of Koss since the late 70s, so I bought it.First, what it IS and ISN'T.  This is a volume control, but NOT an amplifier.  It will make your MP3 player, etc., quieter, but NOT louder.  If your source is too quiet, look for a headphone amplifier.When I used to listen to a cassette walkman it was easy to turn down the volume when I needed to.  The volume control was a thumbwheel right on the player.  I have several MP3 players now, and they all have hi-tech context sensitive controls.  This means (for me, anyway) that I have to look at the screen to make sure the button or slide control is set for volume.  This control solves that problem.  Set the player for a volume slightly on the loud side and use the inline control to get comfortable sound.  If you need to lower the volume (to talk to someone, for instance) you can use the volume control without taking your player out of your pocket.This model has a three foot cord between the player and the volume control.  This is nice if your player has an FM tuner -- MP3 players use the headphone cord as an FM antenna.  My generic ones were only about 8 inches long and the FM reception suffered.The control has a clip on it, so you can wear your player safely in a padded pouch on your belt and clip the volume control to your chest pocket.A few reviewers have noted that lowering the volume attenuates high frequencies.  I tried using the EQ settings on my player (I was also using Koss PortaPro headphones).  When I had Bass Boost EQ settings I did notice some high frequency attenuation in both the Koss and generic inline volume controls; when the EQ was turned off I didn't notice as much high frequency attenuation, but the sound was very \"flat.\"  Anyway, I don't think I would have noticed it if other reviewers hadn't pointed it out.An inline volume control is very handy for portable MP3 players, etc., and this unit is well thought out, and works great.", "overall": 5.0, "summary": "Excellent for MP3 players with FM tuners", "unixReviewTime": 1237248000, "reviewTime": "03 17, 2009"}