{"reviewerID": "A39DQIQ1GO2J4Y", "asin": "1400532655", "reviewerName": "bookfinder \"bookfinder\"", "helpful": [2, 5], "reviewtext": "I have had the opportunity to test both nook color and kindle fire. My favorite is the kindle fire...1.) poor customer service from barnes and noble - the cable breaks easily, and this device is not compatible for swaps... what I mean is like on the kindles you can basically switch out the cables for any micro usb cable... nook color you can not do that... once your nook color is out of warranty, they will no longer replace the cable, so if it breaks, your like SOL until you buy another one for $19.95 + shipping + tax... The cable is really cheap and breaks to easily... I think each time I've had a new cable replaced I could only get it to last about 2-3 uses before it broke... it keeps breaking at the N...2.) the updates are horrible... basically you will have lag issues and the battery will drain easy if you don't update... actually after a while the battery will just start draining anyways and you can't keep charge...3.) it takes forever to turn on... you have to wait like 5 minutes and keep holding the power button and then like another 5 minutes to boot up... with kindle it turns on almost instantly.... After a while, you still have to wait about a minute for the kindle to boot up, but it still loads quicker than the nook color.4.) a feature i like is that the volume buttons are on the side... with kindle fire, you have to dig around to find them... they are in the settings... like you can only adjust the volume on kindle fire through the settings...5.) another feature i like is the card expansion slot. i like to store avi movies from my camcorder and what not on them, and you can't do that with the kindle fire.6.) check each stores content before you buy. each ereader loads different files... this is the main reason i bought both. Most of my textbooks for school are only available through barnes and noble, but I prefer to read on the kindle. After I'm done with school, I'm going to be selling my nook color, but I refuse to get rid of my kindle fire, unless they update to one that has the volume buttons on the side, and plossibly a card expansion slot. For me, i actually found out that most of the content I liked was available through amazon for free, and it cost at B&N;, so that may be another influence for when you decide to purchase... It's just I wish that amazon would just carry all the textbooks I need, so I don't have to keep going to b&n...;So, other than the software is a tiny bit easier to navigate around, i'd prefer kindle fire over nook any day... just because I get longer lasting supplies and better customer service.", "overall": 1.0, "summary": "Do not buy!!!! buy a kindle instead", "unixReviewTime": 1337817600, "reviewTime": "05 24, 2012"}