{"reviewerID": "A3KFIMCP87VH4U", "asin": "1400532655", "reviewerName": "BookMan", "helpful": [8, 10], "reviewtext": "I've held off on an e-book reader for a long time. The Kindle was always too expensive and, even now, I don't like the way the screen flashes when \"turning\" pages. After playing around with many different readers, over a period of several weeks, I finally decided to pick up a Nook a couple of months ago.One of my big considerations is that I wanted to be able to read .pdf files in color. The Nook easily satisfied that requirement. What I was expecting; however, is how FANTASTIC the Nook is after Android is installed on it. A friend of my just bought a new iPad 2 and showed it to me a couple of days ago. That, of course, is a wonderful device but VERY expensive. I started to look around the 'net and found that the latest Android Operating System, Honeycomb, can be installed on a micro-SD memory card and that this will allow the Nook to run the new OS. Even better, by simply removed the micro-SD card, the Nook returns to it's normal state and continues to run as before.I had NO IDEA how powerful the Nook Color really is until I installed Honeycomb on it. The Nook is now so great that it behooves me that B & N doesn't simply place Android on the Nook as the default OS! Yes, it's its that good! Just one word of caution. As using Honeycomb doesn't require that the Nook be rooted, it is a bit tricky to install but that's only due to the HORRIBLE instructions that the geeks who discovered how to put Android on the it. (As a rule, Geeks are usually incapable of writing in known-human languages.) I don't know if the warranty is voided by running Honeycomb but, as all that needs to done to get rid of it, is remove the micro-SD card, I suspect that no one will know.All in all, the Nook Color was already a great device but adding Honeycomb makes it AMAZING!", "overall": 5.0, "summary": "All I can say is WOW!!!", "unixReviewTime": 1300665600, "reviewTime": "03 21, 2011"}