{"reviewerID": "A3DH53FPYSP9E", "asin": "B00001P4XH", "reviewerName": "Media Man", "helpful": [1, 1], "reviewtext": "One of the first things I do when I'm buying new ear buds is check the cord length.  The majority of ear buds these days have cords that are much too short for everyday use often resulting in the ear buds pulling out of your ears or the cord coming unplugged from whatever device you're using.  This is where an extension cord/device such as this one is very useful.  Like many people, I sit at a desk in front of a computer all day, listening to music much of that time.  The iPod dock that I have on desk is just far enough away that my ear buds don't quite reach and wearing them isn't practical or comfortable.  Thus I purchased this item to add some cord length and some extra volume control.  Here are my thoughts;Pros+ Adds approximately 3' in cord length.+ Volume control switch is at the end of the cord and has a clip to attach to whatever you're wearing or carrying.Cons- Sound degradation is extremely noticeable.  Feels approximately like a 30-40% loss of sound because of the extended connection.  While I expected some loss I didn't expect quite this much.  The Volume switch barely raises the overall volume unless you have your device volume at max.- Flimsy wiring and weak connections tend to short out quickly if there is moderate or active use.- Amazon's stock photo doesn't exactly match the item I received.  My model matches the customer image that was submitted so there are slight differences such as the angle of the male end of the plug.  Could be problematic for some.While this item is useful to me in my particular situation I'd rate it poor overall.  It works for me because it will stay at work on my desk and not see any travel use.  Since I don't listen to my music very loud at work as I need to hear if coworkers are speaking to me, the low volume isn't a huge issue for me.  However, if you're looking to purchase an extension for your normal headphones to carry with you this is NOT the device for you.  Especially if you're going to be around a lot of noise or people talking (i.e. the bus, train, subway etc.).  If you're going to be in any of those situations you're better off going with a different product.", "overall": 3.0, "summary": "Functional but somewhat flawed", "unixReviewTime": 1308009600, "reviewTime": "06 14, 2011"}