{"reviewerID": "AARTX8A7CN0PB", "asin": "B00001P4XH", "reviewerName": "Neil \"Scrantonian\"", "helpful": [0, 0], "reviewtext": ".I use my new Koss \"Remote Volume Control\" on my desktop computer, in line with my powered speakers.Remanufactured Harman Kardon HK595 2.1 Computer SpeakersWhen I'm at the computer, I always have it playing something -- streaming music, news, National Petroleum Radio, whatever.  And the computer has a dozen \"virtual\" volume controls -- Winamp has a few volume controls; Windows has even a few more for adjusting the volume.  Why should I add the Koss?Pros:But, nothing compares in convenience to being able to reach out to a physical Volume Knob laying on the desk.  No mousing required.  Faster than a mouse or keyboard control.In fact, my keyboard has a dedicated volume control on it, which I used to be impressed by.  But it works through Windows, so sometimes its action is delayed after I hit it, and then it starts moving at some arbitrary speed when I hold the button down.  So it's a minor challenge to make quick, delicate adjustments.The tiny knob in the Koss has a silky feel to it.  I'll let you know in a few decades if the physical control ever gets dirty and scratchy.At the Loud end of its adjustment range, the control is very gentle and smooth.  So if you turn the Koss to maximum volume, and adjust all your virtual volume controls so the audio is just a bit loud, then it's easy to use the Koss to cut back the volume slightly and make very delicate adjustments around the desired volume setting.  Of course, the Koss can also reduce the volume to Zero, smoothly.Amazon published another review, the Koss' \"Most Critical Review,\" where the reviewer observed that the audio got muddy when the volume control was turned down to its lowest settings.  I wouldn't use it at the lowest settings, anyway, because else you're going to blow your ears off if you turn the Koss up towards the high end of its adjustment range.  Anyway, it seems clear to me that the other reviewer tried compensating for the Koss being turned to the low end by turning up other volume controls in his system so that he could hear the audio, and one of those other volume controls was causing distortion.  I.e., it wasn't the Koss at fault for causing the muddiness, and his 1-out-of-5 star review is erroneous.  I can confirm that there is no fidelity change when the control is turned towards its Low end.Cons:There's a clip on the Koss, so you can attach it to your shirt or short-sleeve and use it while you walk your mp3 and your dog.  The wire is plenty long enough for that (my wire is about 2 1/2 feet long), but if your desktop computer isn't located on your desktop, the wire might not be long enough for you to reach the volume control -- not unless you add an audio extension cable.  And you know, adding more audio plugs and sockets threatens to make more scratchy connections.The wire itself is thin.  We're talking the type of wire that has a few wisps of copper for the audio, a few more wisps for the ground, all inside a 1/16 inch diameter plastic sheath.  If I treat it gently, it will last a while on my desktop.  If I were to take it jogging and toss it around thoughtlessly, it wouldn't last a year.  Thinking of opening up the housing (which is glued shut) and re-soldering the connection?  Those wisps of copper and their tiny connections are very difficult to work with; good luck.Another reviewer mentions that he buys one of these periodically.  He blames himself because the wire breaks, periodically.  I think some blame should be reserved for the delicate design of a product whose function it is to be used on the run.", "overall": 4.0, "summary": "Controlling your volume with a \"knob?\"  That's so old fashioned", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}