{"reviewerID": "A2GP6XJ1V3MM3L", "asin": "1400532655", "reviewerName": "BumbleB Media", "helpful": [8, 8], "reviewtext": "I haven't really given up my Kindle (which I love and has its advantages). However, I got a deal on a Nook Color that was impossible to ignore and so I made the jump. If you're wondering if it's worth 2X the price, IMO it depends on your needs and wants. For people who want to create an inexpensive e-reader/Android tablet by rooting the Nook -- or if you love to read periodicals or books with lots of images -- the Nook Color is the way to go.It's surprisingly heavy to hold -- MUCH heavier than my Kindle with a cover. The battery life means you CAN'T be far away from an electrical plugin. My last charge lasted 2+ days with playing games, an animated screensaver and some reading. It's also wireless only.The backlit LCD screen is spectacular and I find it was better on my eyes for reading than I expected. However, I find that finding ebooks on B&N;'s site is harder than Amazon and I cannot find many inexpensive or the oodles of free ebooks like for Kindle. Lots of ebooks promoted on B&N;'s Nookstore are $4.99 - $9.99 or more. Too expensive, IMO. Seems like fewer Indie Authors on there in the $2.99 price range :(I decided to take a chance and rooted my new Nook Color which requires a micro SD card (I used a 2G card). It requires the ability to follow some technical steps that took me about 15 minutes total. I am not a major Geek, but I've been online for 15 years and know basic stuff like HTML (not needed for this) and moving files and some troubleshooting if I get stuck. The Rooted Nook is a bit quirky. While the original B&N; e-reader functionality is still there, I had to install a couple apps (launcher app and Softkeys) to toggle between the Android and B&N; screens.I CAN watch YouTube and surf the web easily. I also downloaded the Amazon Kindle app to my rooted Nook, and read my 100+ Kindle books on it (and get my freebies too!). You can't view Flash or use Hulu or Netflix (yet!), but maybe flash will work with the next B&N; update. note that a Nook Color doesn't have a mic or bluetooth to use with certain Android apps. A bummer for me because I like to dictate texts and emails on my phone using Nuance's FlexT9 app.Overall, my kids **love** the Android side of the rooted Nook Color, and I like getting some useful apps on a much bigger screen. So now we fight over it. Will I get rid of my Kindle -- no way. But I find the Nook Color becoming more my at home reader with the Kindle app on it, and my Kindle device turning into an away from home, travel e-reader.", "overall": 5.0, "summary": "Moved Over to the Dark Side From Kindle", "unixReviewTime": 1303344000, "reviewTime": "04 21, 2011"}