{"reviewerID": "A2XNOB1T796Y6B", "asin": "1400532655", "reviewerName": "ChibiNeko \"Sooo many books, so little time!\"", "helpful": [7, 10], "reviewtext": "Before I get started, I'll just say that my review comes from the unit we got at the bookstore to display. The overall product will still be the same, but some things (like the instruction manual) might be different.---------Reading: It's a nice clean picture & the backlit screen isn't too annoying, but I have a feeling that people will be feeling the eyestrain later. If you're looking to buy this for reading at length, you'll need to be aware of this. You can change the brightness of the page, but that doesn't change that ultimately you're still looking at a backlit screen.Downloading: Pretty fast download times, although I only downloaded the free samples from the storefront. (Hilarious since I work at a Books-A-Million & the storefront's B&N.; We're so going to lose money on ebook sales.)Internet: Pretty decent. I pulled up facebook & the page is crisp, clear & loads quickly. I also went onto failblog, a site with quite a few side ads. It was a little on the slow side, but that's to be expected on stuff like this. You can also pull up videos on youtube, so that's a bonus.Battery: Not bad, but obviously won't last as long as the Nook or some of the e-ink units out there. You'll get about 3-4 hours if you leave the wifi on. Not sure about the non-wifi battery life right now, but since the company says it's 8 hours I'd say it's probably about 6-7 hours.Extras: You can change the font, screen background color, & a few other things. While that's nice, I couldn't help but feel a little underwhelmed by it. There's also the option to be able to toggle back & forth between the publisher default & your aesthetics of choice. You can also change the background on the main page of the NookColor, which is a nice touch. Since we're not supposed to change that with our store unit, I wasn't able to play with that any.Touch Screen: It's OK. Pretty easy to use, but a few times I found myself really having to wrestle with it to turn pages. Sometimes it would be too sensitive & I'd end up a few pages ahead of where I wanted to be. Not a deal breaker, though. It didn't happen enough to where I'd get overly irritated, but people who are all thumbs with touch screens will be irritated.User Friendly: It's not very intuitive to use. People savvy with e-readers & gadgets will be able to figure it out pretty quickly but people who are new to the scene will be pretty confused with everything. The unit for my store didn't come with any written directions- it was all on the unit. That means that if it's like this on the sale unit then that won't be all that helpful for the people who aren't able to navigate well on the unit.Overall: My opinion is that it's OK, but not exceptionally so. Go for the iPad if you really want something like this. (I know it's more expensive, but if you're willing to pay $300 then paying $500 might not be that much of a difference.) It's basically a Nook/iPad hybrid, but without the option for all of the extras & apps. (Of course if all you want is an e-reader & wouldn't use the iPad's extras, then this is great.) Overall it isn't a bad unit but it just doesn't have anything to really make it stand out. If you're a big fan of the Nook then go for this unit, but I'd play with it in the store first.The only two things that really make this stand out from the other e-readers on the market is that the unit is in color and that the internet on this unit is far better than some of the other options on the e-reader market. While the color option is great for children's books & magazines, this might not be enough for users who predominantly use their readers for plain print reading & that the ones who would want these things might already have it in the various tablets that are on the market.I did enjoy playing with the unit in my store, but I don't know that I would choose it over the regular Nook. Of course this is just my opinion, but again- before making a big purchase like this, view a unit in the store first.3.9/5", "overall": 4.0, "summary": "Not bad, but might not sway many users of other readers on the market", "unixReviewTime": 1290729600, "reviewTime": "11 26, 2010"}