{"reviewerID": "A2ZR3YTMEEIIZ4", "asin": "1400532655", "reviewerName": "Christopher Wanko \"-C\"", "helpful": [5, 6], "reviewtext": "I'll admit, I bought it to hack it.  If you have no interest in hacking this device, then let me start with the \"stock\" review first.As an eBook reader, it is very good but not great.  eInk and its variants will always be the gold standard by which you measure a reading device, because the utility of such a display in daylight is unrivaled.  My hope is that in time, the Pixel Qi displays make their way into Kindles, Nooks, iPads, etc on such a large scale that this is no longer an issue.  Alas, it remains one, and it is a key criterion for many.  As an LCD touch screen, it is very bright and colors are rich, not saturated.  Touch sensitivity is a little rough, as is accuracy.  I did not see a calibration function.Wireless connectivity is very, very good but for some reason, will not connect with some routers.  The range is impressive, better than my Droid 2.  Speeds are very good, but I neglected a speedtest in this round.Integration with the B&N; store is very tight as expected.  The store app for the Nook is better than the Android app, necessarily: you can browse magazines and newspapers, for one thing.  Display of media is well-formatted and fairly intuitive; I never cracked the user manual or quick start guide (then again, I rarely do that for anything I buy). Prices are competitive with other vendors, and it does handle sideloading of books onto microSD cards.  By the way, 32Gb microSDs are supported.  I run with an 8Gb, and I've filled it mostly with music.And oh by the way, it plays music very well.  Some of you might listen to music while you read, and I am one of those weirdos.  This device, stock, will do just that.  Overall, I like this device, but would probably prefer eInk if I was buying it solely for reading media.However, I bought it for cheap tablet use.  In this regard, it has amazing potential.  Despite the fragmentation of custom ROM and rooting options, you can indeed settle on a Cyanogen ROM and find a lot of functionality on the cheap.  I can browse websites easily if I don't need Flash (currently not working on this ROM); I use PocketCloud to log into my home machines and I can work from there if needed.  I'd love to have Swype on this, or even Graffiti, but it is sufficient to have access to the Android Marketplace and all the attendant apps I have stored in the cloud.  There is no microphone or camera, so those apps have no place here, nor does GPS exist.  However, Bluetooth is available in Cyanogen nightlies so you can now try pairing it with headsets and keyboards.  Thus far, the potential is not fully realized but it perfectly suits my needs today.  With time, this will become a great tablet once Flash is fully operable and the Honeycomb ROMs are fully baked.Stock, 4 stars.  Hacked, 5 stars, tremendous value.-C", "overall": 5.0, "summary": "DIY Tablet on the cheap, and not bad \"stock\" either", "unixReviewTime": 1300233600, "reviewTime": "03 16, 2011"}