{"reviewerID": "A10TI75YHEDJ55", "asin": "B00001P4XH", "reviewerName": "TsukuyomiNoKami", "helpful": [0, 0], "reviewtext": "This is yet another case of the product delivered being somewhat different than the product image, which is not agreeable in principle of making an online purchase. The product I reviews has a slightly different casing that the image and also the wording is not white but grey. My problem is that in this case I feel with this image the seller is trying to give a somewhat skewed image on the device.For one, the 3.5mm male connection(going into your device that is producing sound) is not a right angle connector. This can be a issue for some users since depending on their intended usage a straight connection can cause undue torquing on the 3.5mm port potentially causing damage to either the connector or the jack on the device itself. To balance this somewhat the 3.5mm cable is flexible and the jack is fairly small in comparison to some straight jacks that are larger and stick out quite far.Secondly, the metal clip that is supposed to attach the device to a shirt, pocket, ect.(which is not shown in the product image) is really cheap so does not hold fast to whatever you try to clip it on.Lastly, the volume control it recessed into the chassis so it only protrudes slightly. This can be taken as a positive or a negative depending on your perspective. On the positive you will not have any issue with the volume control breaking or the volume being altered unintentionally. However because of this, altering the volume can take slightly more deliberate effort than usual. It also means that it might be uncomfortable for those of you with larger fingers. This again has to do with your preference and how you change the volume(either with the tip of your finger close to the nail or with the flat of the tip of your finger.)Overall I would have preferred the item been closer to $5 than the $10 it costs, but I was in a hurry(which I rarely ever am when it comes to electronics). So keep what I said in mind and look around for something that might fit you better before deciding. That is unless you were like me and just need an inline volume controller quickly and without hassle.ADDITIONI noticed this a while ago buy forgot to add it to my review, when changing the volume the sound to the headphones(or whatever device is connected)is changed so that the volume in one ear becomes louder than the other. It happens when the volume is only changed slightly so only another minor move is required to bring the sound back to normal but it is noticeable.", "overall": 4.0, "summary": "Pretty good, but not perfect", "unixReviewTime": 1339286400, "reviewTime": "06 10, 2012"}