{"reviewerID": "A102RLOGIBBDMW", "asin": "1400532655", "reviewerName": "Cool Chris \"Cool C\"", "helpful": [8, 9], "reviewtext": "First off, do not expect Nook Color to do wonders.  It is not meant to be tablet or an iPad replacement.  It is foremost an e-Reader with some bells and whistles.If I'm given a choice, I would not buy a Nook.  For the price, I would rather get a Kindle Fire.  I own 4 laptops, 1 iPad 2 for my wife, and 3 Kindle Fires for my kids.  Nook Color is an afterthought and it is for me.  I bought my used Nook Color on another site for $114 (free shipping) 2 weeks ago.  And it was a steal.  The Nook I received was in working order and it looked new.I had no trouble turning it on and everything worked perfectly.  The only gripe was it was extremely slow compare to some of the tablets I own.  Again, I reminded myself that this is not a tablet so I had to be fair.  The features are not too bad but the navigation was confusing at best.Fast forward to today.  B&N; was smart to release an update (1.4.1).  If you already own a Nook Color, you should get the update.  The update improves the speed dramatically.  The navigation still lacks finesse though.Here are some of the goods- I bought it cheap- It has an expansion slot.  I inserted a 16GB micro SD card and Nook recognizes it right away.- The web works fine.  It can now even watch some YouTube.  It also runs Flash.  Nook 1, iPad 0.- The new update allows NetFlix to run.- There are some apps that are extremely useful.  I love the Smithsonian Channel and Pulse.- The magazines look great.  The update also improve the navigation.- The interactive books are great.  My daughter absolutely loves it.And now the bads- I constantly look for free stuff.  Unfortunately, B&N; doesn't offer a lot of free books that are worthwhile.- The apps itself, is sad to say the least.  The offering is a fraction of what you can find in iPad and Amazon.  And most of them are costly too.- While the update improve the speed of web-surfing, it still is slower than iPad and Kindle Fire.- The speaker is terrible.  It is located on the back of the device.  If you hold the Nook on your hand, you may cover the speaker. The best solution is to use a head phone.- The navigation overall needs to be improved. It is a basic Android without much thought.  At times I don't even know whether to double-tap or hold to get more options.Here is my final take.  If you are short on cash, and would like a good e-reader/tablet.  Go get a Kindle.  If you can find a Nook for less than $150. Go for it.I would not spend more than $200 on a Nook (be it a Color/Tablet).  There are much better options out there.Update January 24, 2012I have used my Nook for a month now and all in all, I like it because it allows me to read my magazines and books.  It sure beats a 10 incher tablet.  The update 1.4.1 is definitely a must if you want to use Nook Color to its full potential.  However, I found out yesterday that the update was actually used to close the loop on dual-boot and disable any sideload of apps.  The version 1.4.0 allows the Nook to load Amazon app and the Launcher EX.  Basically it allows other apps other than B&N; to be loaded.  The automatic update 1.4.1 disable this option.  So, if you are dare enough to install other apps, you can backdate the version to 1.4.0 if you want to load other apps.Update February, 2012Nook continues to lose to Kindle Fire in terms of contents.  B&N; could not match to the behemoth of Amazon and I don't think it will ever be.  However, if you are stuck with Nook, there are a few apps that you must have (they are all free).  It helps the Nook Color to be a good companion in a boring world.- NetFlix is a must.  7 inch on your lap and plug in a pair of headphones.  You are good to go.- Smithsonian is interesting.  Want to learn something that you forgot.  This app works great but contents updates are slow.- Dolphin Internet Explorer works great for anyone wants to do quick surfing.  Very fast and very convenient.- Don't know what interest you, try Stumbleupon.  It randomly pulls internet content based on your interest.  Works great on YouTube vidoes.- Good with words, try Nook Crossword.- Who doesn't use Dropbox.  It is a must.- Springpad is great to jot down quick notes.- Pandora works great too, but you need a pair of headphones though.- Who needs newspaper when you have Pulse.", "overall": 4.0, "summary": "Not a bad product and close to being perfect", "unixReviewTime": 1323820800, "reviewTime": "12 14, 2011"}