{"reviewerID": "A21A9F84S9AZIP", "asin": "B00001P4ZH", "reviewerName": "Akop Pogosian", "helpful": [2, 2], "reviewtext": "I was little skeptical about buying this one. Portapros are produced all the way since the 80s and have a flimsy look. My doubts continued as I was unpacking my Portapros. Could this little, flimsy, plastic set of headphones be that good? All of my doubts have evaporated once I have tried using them. These headphones have two big pros:1. Sound quality: One thing you should be aware of is that these headphones are _loud_. I have compared them to my Sennheiser HD201 and Sony MDR-A34. There is no comparison. Portapro is much louder. Of course, if you don't like it, you can turn down the volume. However, despite the loudness, the sound is excellent. I can pick a lot of details in my music CDs that were nearly undetected with the MDR-A34 and barely audible with the HD201. When I play first person shooter games, I am getting excellent directional sound.2. Comfort: The comfort is excellent. The headphones sit very tightly on my head and yet they don't apply much pressure to my ears. I can wear my Portapros for hours without feeling any discomfort. The reason for this, is that these headphones come with extra cushions the sit above your ears and shift some pressure to your head leaving very little pressure on ears. You can also choose how much pressure you want to have applied to your ears. If the default is too much, you can shift some of that pressure to the auxiliary cushions by changing the \"Comfort Zone\"  settings (the blue buttons above the driver, it's best to start playing with them once you already wear the headphones). Since the headphones sit tight on your head, they're suitable for outdoor or gym use. The cable length is just right to reach your PC speaker or mp3 player (about 3 feet), but I suppose that some people will find it too short. Finally, the set folds easily and fits into a small leather bag provided for portability.And, have I mentioned lifetime warranty? If they ever break, just send them to Koss with a $6 check. They'll fix or replace them for you. Overall I am very satisfied and would recommend these headphones to anyone who needs cheap, reliable headphones with good sound quality for either indoor or outdoor use.", "overall": 5.0, "summary": "The best computer/mp3 player headphones for the money", "unixReviewTime": 1282608000, "reviewTime": "08 24, 2010"}