{"reviewerID": "A2YM85TO0H2JET", "asin": "1400532655", "reviewerName": "D. Emerson", "helpful": [10, 10], "reviewtext": "EDIT - Update 1.4.1 (12/21/2011): BIG update rolled out on December 14th, with lots of big changes, most of which really improved the device.First, the \"n\" key, which originally functioned as a home key taking you back to the original home screen, now functions as the menu key instead, like on the new Nook Tablet. Prior, there was a softkey arrow that would bring up the menu function, and Barnes and Noble has moved that function to strictly hardware. I'm torn about whether I like this update, because honestly, I don't like relying just on a hardware key for something like a menu, especially with the issues I've had with Nook parts (I've owned two cords in the past year alone.) It does makes multi-taking easier, when switching from one application to another (say reading to internet), because you don't have to go to the home menu function first. For those of us Nook Color originals, it takes adjusting from old habits, but so far, it's not a bad change.The reader application functions in a much more friendly manner. The page numbers are on the bottom of the pages, instead of the top, in a much less chintzy font, and pulling up the menu tell you how many more pages are left in the chapter. Not really a necessary change, but kind of nice. There are some fonts added, along with FINALLY adding the option to change the tone of the page from white to sepia, night, or off-white. The books also read sideways now, in a two-page fashion, though I'll admit, I don't use that much, and won't, even with the ability to have it on something other than kids books. Just makes the actual reader app a much more rounded and friendly one.The magazine reader had a few changes that are nice. There are animations for the page turns now (though why they don't have that option with the books is a big of an in-congruency), though the animations disappear when you zoom in. The menu at the bottom pulls up the pages in miniature picture form, but are in a much more appealing, accessible manner. Rather Mac-esque, really. Nothing huge, but it makes it all more friendly-looking. Randomly, the magazine reading app is the only one where the \"n\" button is still a home button, and not a menu one. Wondering if they'll notice that and change it in the future.The PDF reader had some AWESOME changes. Before, reading PDF files was incredibly clunky, and did not resolve well on the screen at all. Reading a book involved zooming in and scrolling down, instead of sideways like the ereader application, and when you closed the PDF file, reopening would take you right back to page one, and never saved your last place. Ridiculously cumbersome, and not user-friendly at all. The new update not only saves your place, but it resolves the page so that the text fits better on the screen, and allows the pages to read much more easily sideways. It also scrolls sideways, instead of down, which just makes sense and follows with the overall expectations of the reading experience.Interestingly, enough, they still haven't resolved the issue of PDF files not having a cover when on the home screen or in the menu, even when the information is attached, which is something I was hoping they'd resolve. It's not a huge issue, but it's just a visual annoyance when all the EPUB files have cool graphics show up on the home screen, and PDF files just have grey with the title of the book. Lame.Overall performance of the menu functions and flipping between tasks seems zippier than it was before, and I really appreciate that. The menu functions seem much more efficient and smooth, and that just makes for a much better interaction.The ebook store also changed around, and B&N; completely reordered all the categories and changed the look. I can't say I appreciate all the changes they made, because you can no longer organize things like apps or books based on price, and instead have to search manually in the menu. I'm frugal, I'll admit. I miss the ability to find free apps easily, because let's face it, it just makes me happy.Overall, I love the update they rolled out, though! It's nice to know that B&N; is staying loyal to their original customers and keeping the devices updated.*  *  *EDIT 4/12/2011: Barnes and Noble did an update recently which fixed the glitches with the screen when plugged in, finally. I have not had any issues with the screen lagging or glitching since.*  *  *EDIT 2/28/2011: A new update now allows for Android apps and email on the Nook, which is exciting. I'm not all that into the apps they have, especially the games, but it's a nice touch! It has also fixed the issue of not being able to put your own books on the home screen, and the issue that the Nook was having with recognizing cover art for those books. I can now also put other apps on the home screen, such as the Email or Pandora app, which gives the entire thing a much freer, most customizable feel. Though apparently this update has cancelled out the last one, because the screen glitches when plugged in are back. Oh, well, I'm just happy to now be able to put my own books on my own home screen! Vast improvement right there!*  *  *Original review, from 12/2010:I received my Nook Color as a gift for an early Christmas, and have been using it for a few weeks now, enough time that I decided I can make an educated review.Pros/Cons-It has a great screen, with sharp resolution. Book title colors and wallpapers look sharp and clear, and the touchscreen is responsive. You can adjust the brightness, though I rarely found the need to adjust the brightness even a quarter of what it could be, since otherwise it was a bit too bright on the eyes. That being said, I found that when you plug it in to a power source and try and use it, the touchscreen goes crazy, and won't even perform simple tasks like unlocking the device. You can't flip to the next screen without several swipes, and turning pages can be a haphazard activity. That weird glitch doesn't affect the device at all when it isn't connected to a power source, but it's such a pain when the device is low on battery power and you want to read while it's charging.-The hardware on the Nook Color is nice, with a muted metallic finish on the front and back, which gives it a nice grip, though I immediately bought a cover, so the fact that it's somewhat grippy doesn't matter much any longer. The weight is nice, about the weight of a small hardcover book, which I found rather pleasant when holding. I still don't get the random open-hole thing in the lower left-hand corner, though. It's like you're supposed to use that to clip the device onto something, but I hardly thing someone is going to just clip it onto their keychain for convenience. It's clearly not awful-looking, but I guess it just seems kind of superfluous to me. Oh, well.-The battery life is surprisingly good. I don't have to WiFi on when I'm at home, and the device will go for several days on low-brightness. I actually had it on one charge for about 7 days one time, and was pretty impressed, considering other devices with LCD features tend to eat battery life like some kids eat Cocoa Puffs.-It's Android-based, which is great. However, B&N; doesn't allow any apps from the Android market, which is such a crime, considering that the tablet could be a fantastic tool if B&N; would open up the gates on that one. The fact that it's Android-based isn't really a selling point, it's more of a potential point to keep an eye on, one that hopefully the company will do more with down the road. The tablet does come with certain apps like Pandora and games like Sudoku, which will do in a pinch if you're bored.-It comes WiFi enabled, and it connects to networks easily and without issues. It does recognize B&N; WiFi hot-spots, and remembers them, which means that you don't have to reprogram the networks or worry about not being able to access the in-store features, which is really convenient. The browser is pretty decent, doesn't have flash, but performs very well. I actually used it for emails and checking my Facebook when I was out of town, and it was snappy and quick, though the fact that it doesn't have pinch/pull zooming features (which the picture gallery does, oddly enough) is a bit of a turn-off, because it can make browsing somewhat clunky and inaccurate.-The B&N; store they have on the device is convenient, loads content easily, and is very user-friendly to navigate. Once you have your information in, downloads are quick and easy, and you can also set a password for downloads, to prevent someone downloading books without approval. Also, if you have a gift card for B&N;, you can use it to buy books, but you have to go online to your account first, and save the information on your account before it'll charge it, and it'll always charge to that card first before your credit card, which is a pretty cool feature.-The reader itself is awesome, and you can sideload your EPUB files easily onto the device from your computer and start reading them immediately. You can't, however, read PUB files like you can on a regular Nook, which I found obnoxious, since I have a lot of eBooks in that format (that are from a B&N; affiliated website, no less). You also can't put files that HAVEN'T been downloaded directly from the B&N; store on the device over WiFi onto your home screen, so in order to pull up your own personal files sideloaded onto the device (even ones downloaded directly from B&N; online), you have to go into the Bookshelf menu and go from there. Which means that if you don't have WiFi all the time (as I do), very few of your books will be able to be put on your home screen, which is such a childish thing for B&N; to do, really. It takes away the personalization that the tablet could do so well, and bothered the heck out of me when I first discovered it. Granted, you could probably fix it by rooting the device, but you run the risk of other issues in the software when you do that, so hopefully B&N; will come out with an update to fix that annoyance.-The Nook does read PDF files, but it's a very awkward process, since the screen ratio doesn't fit the allotted size, making the text tiny and incomprehensible, so trying to reads books in that format is a headache; zooming in is awkward and clunky, and takes to long to be worth the effort. Also, closing and reopening the file takes you back to the first page, which, if you're attempting to read an extensive document in several sittings, gets really old really fast. If you have book in PDF form, I would suggest downloading something like Calibre and converting them to EPUB to save yourself the trouble.-Music loads and plays easily, though I honestly haven't used that feature much, since I have an iPod, and if I want a playlist, I go from there. Pictures also load easily, though you have to have it in the gallery/grid feature to see previews, otherwise they are just displayed with file type images until you click on them to open. Silly little issue, but again, something B&N; will hopefully fix in the future.Anyway, great product, but really, more potential than actual greatness at this point. I love the fact that I don't have to leave the house to read a book, which is great since I'm at home with an infant all the time. Is it worth the money? If you buy it directly from B&N; online, it's $249, which isn't an awful price for touchscreen reader (it's really only about $100 more than a regular Nook or Kindle), so I would say that yes, it is. It's just still somewhat disappointing that it feels like it's half-finished, but I'm looking forward to see where it all goes from here.", "overall": 4.0, "summary": "Some quirks B&N needs to work out, but otherwise, great reading device", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}