{"reviewerID": "AM76TKHVICZC6", "asin": "B00001P4ZH", "reviewerName": "Amazon Customer", "helpful": [3, 3], "reviewtext": "follow-up comment, June 11, 2007I ended up sending one of the broken headsets back to Koss, along with a $6 check.  Turns out, these have a lifetime guarantee, and for $6, they will repair or replace them for you.  I got the new pair in rapid order-- total turn-around was about 10 days.  Caution--if you send these in for repair, do NOT include the pouch;  they returned only the headphones, without the pouch.  Anyway, it was really nice having the new headphones.  BUT, this morning, I picked them up to put into the little carry pouch I use for my Nano and headphones, and found that the left earpiece was dangling again, broken at the swivel point.I really like the comfort of these headphones and the fact that I don't have to crank up the volume to hear.  But, I am now actively looking for a replacement to use, as these are obviously too frail for the constant folding and unfolding they get for my commutes to and from work.  Sorry to have to do this, but I would change my 4 stars down to 3 (but Amazon is not letting that happen).If you will not be stuffing these in a storage pouch but will be simply laying them on a desk or table, then these are great.  If you plan to fold and open a lot, I now suggest you look for something more durable.Sorry, KOSS!------------origianal review Jan 6, 2007:Quality good enough to make me get  a 3rd pairI have gone through 1.5 pairs of these things, now (my current pair is nearly ready for replacement).  The first pair finally broke apart while folded in the soft bag that comes with it (I had had those about 6 or 7 years) -- I took them out and the left earpiece had broken at the plastic attach point and was left hanging.  My second pair is now only 2.5 years old (purchased April 2004), and the wire at the plug end is getting iffy.  If the wire moves, sometimes the phones go into single ear mode, so I guess one of the wires inside the very thin cable is breaking at the joint.  This plug has a right angle into the player, and it is right at the cord end of  the right angle piece where the wire is weakening.  I am going to try taping it here to keep it from moving, and see if that solves the problem temporarily.I do side by side test with this headphone and others used by other individuals.  I ask them to put the volume where it won't blow out my eardrums, then I listen using their phones and settings.  I then plug in my portapros, and listen.  So far, I have not found anyone's setup to beat  the quality and clairty and volume delivered by these phones.  Usually, I have to turn the player DOWN when I plug in my phones because they pick up so much more than others.If you are prepared to buy a new pair of these every 5 years or so, then these are definitely a good deal.I just wish Koss would send a hard case for storage since I do believe that the soft case does not protect them enough when they are stowed.  Koss could also thicken the cable a little bit to make it more durable, or do a gradual thickening as the cable nears the plug.  When I get a new pair, I will tape that end of the cable to try to postpone this problem -- less than 3 years is too soon for this to happen.Becasue of these two design flaws, I rate these a 4 intead of the 5 that the quality of sound delivers.I listen to jazz, smooth jazz, pop, rock, and audiobooks primarily.Happy listening!", "overall": 4.0, "summary": "not durable enough -- my revised review changes star rating down to 3 stars", "unixReviewTime": 1168041600, "reviewTime": "01 6, 2007"}