{"reviewerID": "A2VR3SNZMCUTZ6", "asin": "B00001P4ZH", "reviewerName": "Amazon Customer \"Use Open Source - Firefox, etc\"", "helpful": [8, 10], "reviewtext": "Amazon just reminded me that I purchased these from Amazon in 2000.These PortaPro's used to be THE standard as the most comfortable and best sounding headphones for portable, PC and casual listening. You can't go wrong at the price point.On my Cowon IAudio U3 player (MUCH better audio, watts, than any crApple Ipus), where one can really hear the quality of audio. It has several audio formats that include the superior open source formats like the losless FLAC and the best lossy format, Ogg.I listen to different types of music, classical, classic rock, blues, progressive,  audio documentaries, audio books.I am one that really loves to listen to music that is distortion free as possible. I love clear, clean sounds that are natural where you can really pick out all instruments, little nuances in harmonies. Where quietness, silence in a song, will be totally quiet.I have that as good as the PortaPro's are, they give more of a distorted sound, especially with distortion at bass. I say this in compariason to Sennheiser Headphones and what I see as the best of breed, the Sennheiser PX100s.Someone called them \"livier\" than the PX100s, where I totally understand what they are referring too. The \"livier\" part is why I gave them to me son. That is distortion, especially at bass. I don't like distortion or over amplification that creates distortion.But if one prefers that heavier, distorted bass sound, which many do, these are the ones.They are SOOO comfortable, but then again so are the PX100s.I for one, couldn't care less what others think if they look cool, ugly, whatever. What is essential is the comfort and audio quality.If someone is really bothered because they are NOT in a style that is not currently marketed, then I feel the issue is withe the individual, not the headphones.They really are great and I see at 29.99, a great buy.OR ... if you want, you can pay of $100, and get some heavily marketed headphones that are more stylist, but will be a more more uncomfortable and probably not sound as good as the PortaPros or the PX100s.I also will tell you that I cannot stand the headphones that are made to drown out sound. For one, the headphones that do allow air SOUND BETTER. The headphones that totally cut out air and environmental sounds, literally  give me a headache.I too want to know if someone is trying to get my attention or if their is some kind of loud noise that I should be aware of.JonAs for me, I have my PortaPro's to my son several years ago.I love a listen to music that gives me the most distortionless", "overall": 4.0, "summary": "Excellent ...but I prefer the Sennheiser PX100 - both great", "unixReviewTime": 1195689600, "reviewTime": "11 22, 2007"}