{"reviewerID": "A3IY8S20GL2IP4", "asin": "B00001P4ZH", "reviewerName": "Anonynja", "helpful": [1, 1], "reviewtext": "I've been wearing these daily for about 4 months now, and am extraordinarily pleased with them for the price. Yes, there is a caveat- I paid $40 for these, and for *that price* they have fit and/or surpassed all of my expectations. I believe these can compete with any headphones in the &lt;$100 range. I do have two complaints, though.Audio: 4/5. Bass is powerful, highs are clear, mids are crisp enough. Perhaps a little too well blended for rock (not much emphasis on treble), but fantastic for acoustic/instrumental pieces and hip hop.I dock 1 star because of the utter lack of sound isolation. Having on-ear pads with no noise cancellation tech really means NO noise cancelling (duh). This is fine, but it also unavoidably detracts from sound quality when there is any noise around you. The pads also bleed sound easily- I had to be mindful even playing at half volume in public.Aesthetic: 5/5. As authentically retro as you can get, since they are literally from the 80's.Build quality: 5/5. Simplicity makes for durability in this case.-1 for hurting your ears after a couple hours of wear. Fortunately, you can adjust the pads so they angle away from your ears, shifting the pressure up to the side of your head. The springy metal band will allow these to fit any head size. +1 for the 90 degree input jack. Straight jacks get bent out of shape too easily; this design won't suffer the fate of many a pair of iPod earbuds.For the price, there is no superior. That much I will assert strongly. If you want audiophile headphones and have over 100 to spend, or want noise cancellation (take the metro to school/work? you won't want to use these.) then I advise looking elsewhere. If you are on a budget and want simple quality without the bells and whistles, these are perfectly suited for you and you will enjoy uncompromising sound quality.", "overall": 5.0, "summary": "Know what to expect and your expectations will be met!", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}