{"reviewerID": "A2KQDWZZUBBNOJ", "asin": "0972683275", "reviewerName": "Bradley Pool", "helpful": [0, 0], "reviewtext": "I used it to mount a 32\" LCD TV to the wall... about 28LBS.  I installed it in less than 1/2 hour and am very happy with the results.PROS:-Comes with all of the hardware you'll need-Comes with some extra hardware of which I have NO IDEA what it is there for.  I suspect it's a 'universal' hardware pack for several models and not all hardware is used for all models, but it's nice to have a little 'extra' (which is always better than not enough!)-The included Level is nice... well it's cheap but it works!-The instructions did a decent enough job of explaining how to install the unit.CONS:-Metal is just a tad on the flimsy side.  I have no problems trusting it with my &lt;30lb television but if I were to mount something closer to its maximum rated weight of 55lbs, I think I would be quite a bit nervous about it holding up.-The holes in the base were just a little bit too wide for my wall stud.  I think the particular stud I was installing it onto was a typical 2X4 and if centered, the left and right side holes were just a little too far to grab both sides of the stud.  I had to reposition it so that the center holes were aligned to the left side of the stud, and that the right side holes were aligned to the right side of the stud.  As a result, I was only able to install four of the six bolts to hold it in place, but I don't feel it will be an issue with my 28LB television.  If your house uses wider studs this probably wouldn't even be an issue.-The metal does sag just a little bit with the weight of the television on it.  I mounted the base just a little bit \"off level\" to help compensate for this, and had no problems getting the television level using the adjustments available to me.CONCLUSION:  All in all It's not a bad unit.. ESPECIALLY for the price.  Yes I would have liked to see a sturdier unit, but when you take into account the &lt;$30 price tag, it's an excellent bargain.  I don't think I'll have any issue with a static mounting of my TV in the corner of the bedroom *BUT* if you are considering installing this unit for a television that will see a lot of traffic, constant repositioning, etc... then you might want to spend more money on something sturdier.", "overall": 4.0, "summary": "It works!", "unixReviewTime": 1306800000, "reviewTime": "05 31, 2011"}