{"reviewerID": "A1RVYSEJCY9BJS", "asin": "B00001P4ZH", "reviewerName": "A. Thomas", "helpful": [1, 1], "reviewtext": "Over the years, I've not had the best luck with portable earphones. Tired of the awful sound of default earbuds, I've experimented with Shure, Bose, Sennheiser,Klipsch, andJVCbrands, ranging in price from $25 to $100, but have never really been satisfied with sound signatures that were either too bass-shy, too muddy, or cramped soundstage. Eventually, I got tired with the uncomfortable and often dirty world of earbuds and decided to go back into the world of on-ear portable phones. Reading at Head-Fi about theKoss KSC75 Portable Stereophone Headphones, I ordered them from Amazon. While no match for myAudio-Technica A900x headphonesat home, I was impressed with the richness and spaciousness of the KSC75s, but it wasn't long before I found the clips uncomfortable for my ears, so after a couple of months I went ahead and ordered the KSC75's big brother, the PortaPros.I couldn't be happier with my decision. The sound signature is very similar to the KSC75s, but there is a touch more bass and depth. It's not a flat, analytical sound, not too muddy but very fun and warm -- perfect for portable listening around the office. They're open phones, so you'll be able to hear your surroundings and anyone nearby will be able to hear what you're listening to at high volumes, so bear that in mind. Build quality is fair, about what you'd expect for the price range, but the PortaPros are very light on my head. Considering that their sound is superior to a couple pairs of $100 earbuds I've used, I'll take the trade in isolation for comfort and sound quality. I'm also a fan of the 1980s styling.They're not perfect. In addition to the openness and build quality, the headband occasionally pulls out a hair or two, but it doesn't happen often enough to be burdensome. While the PortaPros fold down to a surprisingly compact ball, getting them into the included travel pouch can be a tight fit. Overall, the negatives are greatly outweighed by the positives.If you're in the market for a modestly-priced portable set of headphones, the Koss PortaPros are highly recommended.", "overall": 5.0, "summary": "The Best Portable Phones I've Owned", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}