{"reviewerID": "A3LWC833HQIG7J", "asin": "B00001P4ZH", "reviewerName": "austin_Larry", "helpful": [2, 2], "reviewtext": "The PortaPro has apparently been around since 1985. That in itself should tell you something about this product. I recently bought a notebook computer for around $500. It has a 750GB hard drive. Back in 2000 I bought my first notebook. It had 6gb and cost $1,100. In Electronic product terms these should have been retired decades ago. There are good reasons they haven't been though. The longevity of the PortaPro speaks volume about this product.I am fortunate enough to have a Soul by Ludacris SB300. It is a $300 headphone. I like it a lot. It produces an excellent all around balanced sound that brings out vocals and all instruments. The PortaPro does the same. The PortaPro actually sound better. The sound is breathtaking in its accuracy and clarity. They even leak less sound, are lighter, and require no batteries.  The PortaPro bring an unbelievably accurate, well-balanced, rich, detailed, and lush sound for the price. You are getting the music, all of the music, the way the artists wanted it to be heard. It isn't often a product can cost 8 to 10 Times less than other good products but the PortaPro does. You can get new headphones And a new iPod or other MP3 player and spend less than other headphones and still have the better set of headphones.And they are VERY comfortable and light. The headphones themselves are well padded as is the adjustment bar above. And the adjustment bar works. I have it set in the middle of the comfort zone and get just the right amount of snugness. You also get virtually zero sound leakage. It makes the PortaPro the Perfect work headphones: fantastic sound, virtually no sound leakage, comfortable enough to wear all day, very light, foldable and storable.The only nitpicking I can do is that the headband is not padded and they look maybe a little goofy. But the `goofy' gives you that nice comfort zone. All in all a quite extraordinary product. If Amazon had a product hall of fame where items made it for a combination of performance and value, the PortaPro would be in it for sure. A great gift for yourself or a friend or family member. Lastly before I bought these I did some research and they do have a lifetime guarantee. You can send them in and the shipping back costs a total of $6 from what people related on the internet. You can spend many times more for these and not get any added performance. Thank you Koss.", "overall": 5.0, "summary": "Extraordinary achievement: you can spend hundreds and not get a better headphone", "unixReviewTime": 1339545600, "reviewTime": "06 13, 2012"}