{"reviewerID": "AN6774EDYBQPP", "asin": "B00001P4ZH", "reviewerName": "Benjamin L. Chirlin \"Primus\"", "helpful": [2, 2], "reviewtext": "So headphones break on me ALL the time. I go through at least a pair every year. I guess I don't treat them amazingly and I like having music on me at all times so they get worn out fast. I realized awhile back I can go two ways on my next pair: cheap and easily replaceable or expensive and higher quality (hopefully lasting longer). I tried the latter a couple times since I'm a bit of an audiophile but this time I was sick of the joint at the jack breaking which is how pretty much every pair I've ever owned has broken (can't wait for the day of cheap, good sound quality wireless!).Then on CNET I saw the Koss Portapro listed as the best bargain headphones and I thought hell why not, my last pair were $10 and they only lasted six months. Got these and I'd say its probably the best dollar to quality value money can buy. The sound is rich and full, especially in the base department. When I first started using them, the treble sounded a little muffled but after a break in period I stopped noticing. I listen to a lot of bass heavy electronic music as well as alternative/indie rock and these cans are perfect for it. Because they're over here, you're not going to get great isolation but its good enough. Loud traffic might leak in a bit (and a good bit of sound leaks out) but its just enough to be aware of your surroundings while enjoying your music. I leave the fit on tight to get the best isolation though you can conveniently loosen things up if you want. They feel very nice on my big head either way with the temple pads. The retro stylings are pretty cool and they're definitely unique in their design.Some problems:I like the portable collapse mode but the included case (which is actually a very nice little pleather bag) is too tight a fit. Every time I squeeze the cans in there I'm afraid I'm going to break them or that I'm wearing the wire connections unnecessarily. I'll probably end up using the pouch for some other purpose though since it is quite nice. Along similar lines, it seems like they cut the cost so low by chucking out a lot of the casing and other \"useless\" plastics on the headset but that makes them feel overly fragile. So far they're holding up fine but they definitely feel a bit light. Likewise the plug is a bit small and looks like a definite Achilles heel. Lastly the cord is only 4' so if your audio source isn't in your pocket or nearby, you may run into trouble sans extension.Summary:Great deal for the money so why not? Also, packaging says Koss covers them for life though we'll cross that bridge when we  come to it.", "overall": 4.0, "summary": "Value Pro", "unixReviewTime": 1290124800, "reviewTime": "11 19, 2010"}