{"reviewerID": "A2FHM5FB0BXKGA", "asin": "1400532655", "reviewerName": "Dr. Elaine O. Chaika \"book, movie, tech lover\"", "helpful": [16, 20], "reviewtext": "I have been down and up with this reader for the past 5 months, but since April, it has been a joy.  B&N; has gotten its act together.  The problem I had with not being able to open books has been solved. B&N; not only finally found out what caused some books to lock up but also how to restore them.  There is no longer any problem with opening any books.When I first bought my reader, the tech support people were not well-trained. They are now.  I have 80 books on it and no problems with any of them.Now, the goodies:  B&N; just introduced Enhanced Editions of some books. These have videos, audio clips, animated maps, etc.embedded in the text.  It's wonderful.  I'm reading D-Day, and throughout there are newsreel segments pertinent to the text.  For instance, you read about Eisenhower and then play the video of him talking to his troops before they embark for the Normandy Coast.  You don't just read about bombing or fighting,you hear and see as well. It's a whole new reading experience and available only on the NOOKcolor (or the iPad with the NOOK app.)Pictures in magazines like National Geographic are gorgeous.  They look better than the print versions. There is a selection of apps for the NOOKcolor, with more coming out all the time.However, if you want all the Android apps, then  you can get an N2A SD card on Amazon that turns your NOOKcolor into a full Android tablet with access to the Market. You then  have the option of booting the reader up as a NOOKcolor or an Android Tablet.  You can even get a Kindle App so you can get and read books from Kindle on your NOOKcolor.Some people say that the backlit screen has glare and that you can't read it outdoors.  Not true.  I read my NOOKcolor in my sunny back yard all the time, and, although I'm a 76 year old lady, I can read for hours on it with no problem.Now for the goodies besides the Enhanced Editions.  You can get an app that allows you to work on Office documents on your reader.  Downloading files, pictures, and music is a breeze.The NOOK also allows you to borrow ebooks from public libraries.  All you need is a library card.  Libraries all over the US are lending ebooks.  So, you don't have to buy all the books you want to read.  That's a big saving. And, it takes less than a minute to download a  book.  You just connect your reader with a USB cord and Adobe Digital Editions displays the books you've borrowed & you drag the ones you want to the My NOOKcolor shelf.  As with Kindle, there is also a Lend Me feature so that your friends can borrow from you.The touch screen is very sensitive and I'm very clumsy, so it took me awhile to be able to navigate easily, rapidly, and without bringing up unwanted menus.  But that was true of the iPhone when I got my first one,Why don't I go all the way  and give this 5 stars?  Because the device doesn't have a \"sync to farthest point read\" feature, so if you decide to look at an earlier page,the only way to get back is to use this awkward slider bar.  I can never get it to stop at just the page I want.  The same is true of clicking on endnotes.  When you're through reading them, you have to navigate backwards to the text. There is a Back button displayed on the Notes page, but it disappears before you can read your note.  B&N; has some work to do on this.In sum, if you buy it at Barnes and Noble, the NOOKcolor is only $249, half the price of the cheapest iPad or even Android Tablets.  Yet, for $39.95 more you can get the card to turn it into a full Android Tablet.  It is incredibly more versatile than the Kindle. Page turning is smoother than on the Kindle--or am I the only one who sees the afterimage of the page you're going from while you're turning pages on the Kindle?  On the NOOKcolor, like the iPad, you just touch and you're  on the next page.One other thing: naturally, a touch screen will get smudged.  B&N; says to wipe it with a dry microfiber cloth.  I found that didn't clean it enough.  If the screen isn't clean, it can get jumpy.  So, knowing that the iPhone has a capacitative touch screen as does the NOOKcolor, I tried using the products sold in the Apple Store to clean the screen.  They work perfectly.As mentioned in my earlier review, I also like the NOOKcolor feature of your being able to share a passage with a friend without leaving the page you're reading.  Also, I find the Web browser is just fine. In fact, when I'm  reading and see a name or word I need more info on, I just touch it and when the popup appears, I choose Wikipedia or Google and surf to my heart's content. Then I just touch the \"book\" icon on the lower screen and I'm back to the page I was reading.  It's smooth and fast.I belong to Goodreads and when I'm through with a book, I can just go to the Goodreads app on my NOOKcolor and post my review immediately. Small touch, but nice.", "overall": 4.0, "summary": "Barnes & Noble Has It Act Togther Finally", "unixReviewTime": 1299110400, "reviewTime": "03 3, 2011"}