{"reviewerID": "A3DU46KRC2JFKH", "asin": "B00001P4ZH", "reviewerName": "Charles Dickens", "helpful": [2, 2], "reviewtext": "In comparing the Koss PortaPro with the Sennheiser 201, which is a good deal cheaper (and also quite a bit bulkier), I've concluded that both headphones are amazing for the price, but they're quite different. The PortaPro has significantly more bass. I had to keep the volume at about 50% what I keep it at for the Sennheiser. The PortaPro is perfect if you're really into bass, if you're really into the beat. The Sennheiser is better for purity of sound. I just feel that, in general, it gives a truer, purer sound. The sound that the original artist had in his/her head. A lot of people will LOVE the beat on this. But some people will find it overpowering. I'm listening to \"Something\" by The Beatles right now, and I'm pretty sure George didn't want Paul's bass to dominate so much.Or maybe this is the best way to put it: you know how when you go into the movie theater and the previews start playing, you're struck by how great the surround sound is? It's so rich and bassy, you can practically feel your bones vibrate. That's what the Koss PortaPro is like. It's GREAT for watching movies. But it just doesn't give the purest vocal sound for music. If you want to turn up the volume to focus on the vocals, the bass will deafen you.The sound went out in one side after 6 months. The headphones lay on the shelf for a year, because I never got around to mailing it in for warranty (they'll replace it for you but it isn't free). And then I decided to fix it myself, so I got a new plug from Radioshack and got down and dirty with wires for an hour. After 45 minutes I was cursing myself for choosing to do this myself. But finally I got it to work. And to keep it that way, I'm not going to use it on the move. I recommend getting a cheap pair of earbuds for when you're moving around (the Sony MDR J10 is my favorite - it stays on and it has lasted me longer than any other brand), and keeping these relatively more expensive headphones for use at home. As you move around, the wire bends in your pocket, and eventually the connection is severed.Oh, and I agree with other reviewers that these headphones do get painful after a while. But I kind of think that's a good thing...it limits your headphone use and will probably save your hearing in the long-run. And you do have to learn how to take them off without them pulling out your hair.", "overall": 5.0, "summary": "Wonderful - but maybe too much bass", "unixReviewTime": 1351900800, "reviewTime": "11 3, 2012"}