{"reviewerID": "A3S1YIQQW7AZO", "asin": "1400532655", "reviewerName": "EMAN NEP", "helpful": [6, 6], "reviewtext": "This is my first E-Reader, so my target audience for this review are primarily those who are also considering this relatively new technology.MY INITIAL REQUIREMENTS:In anticipation of some heavy travel, I decided that I needed something that would allow me to purchase and store enough books to last me 6 months. More importantly, I wanted something that would allow me to highlight and take notes on passages. Finally, if the physical copy of a book had pictures in it, I wanted to be able to see those pictures on my E-Reader.WHAT I LIKE ABOUT THE NOOK:--One of the first things to attract me to the Nook was its simplicity. There are only 4 buttons to be seen: A power button, Volume Up, Volume Down and the Nook \"Menu\" button. The buttons are inconspicuous and don't protrude.--I was able to download almost all of the books I was looking for from the B&N; shop. To be fair, some of the stuff I read is relatively obscure.--I like the ability to highlight passages with different colors and take notes.--I like that it shows pictures from books.--Although it wasn't something I was looking for at the start of my E-Reader search, I found that I liked the built-in games (Chess, Sudoku, Crossword puzzles, etc).--Finally, the touchscreen is pretty responsive (not perfect) and the menus are mostly intuitive.A FEW THINGS I DON'T LIKE ABOUT THE NOOK:--As mentioned earlier, the touchscreen is good, but not perfect. It can be really touchy and trying if you're trying to get a certain passage highlighted. Even more difficult is trying to navigate web pages using the browser. I don't recommend the Nook as a Netbook or iPad replacement, but it is nice if all you use it for is downloading more books or reading some online news.--Pictures from physical books sometimes show up on the Nook version of the book. When they do (like maps in fantasy novels) they are usually much, much smaller. Unfortunately all the Nook books I've seen don't allow you to resize or zoom in on these maps or pictures.OVERALL:For the most part, the Nook met my initial requirements. Some things I didn't think I'd use much before (Chess, etc) I actually use fairly often and will come in handy to pass away the time on a long plane flight or layover.If you want something that will just read books, then I'm sure you can find something better. Likewise, despite all the extra feature that the Nook has, it is no threat to the iPad.But for those that are looking for something in-between, the Nook is a handsome, intuitive and reasonably priced alternative.", "overall": 4.0, "summary": "KINDLE KILLER?", "unixReviewTime": 1303084800, "reviewTime": "04 18, 2011"}