{"reviewerID": "A2IGPYY0ULFD11", "asin": "B00001P4ZH", "reviewerName": "Clark Griswold", "helpful": [5, 5], "reviewtext": "I was seeking new headphones to replace my iPod nano headphones which are pathetic. I had some Koss earbud headphones that I loved but lost, so I needed new ones. So I came on here to find reviews of other headphones and saw that the reviews for the PortaPro were great. Since I had a great experience with Koss in the past (they replaced my earbuds on my old phones for free, no questions asked), I decided to try these. The reviews are right-on.I'd describe the sound of these phones as if two of the best speakers you've ever heard were on both sides of your head. The sound is great at all volumes. The clarity is such that I can hear parts of songs that I never heard before. The lows, mids, and highs are perfect. Some headphones sound bad at high volumes, and the sound gets muddy and the bass sort of shakes in your ear. Well you don't get that with these. It's like you're in the studio recording with the band. You can tell the difference between a 160kbps, 192kbps, and a 256kbps mp3 file with these headphones. The only thing I don't like about them is that I can hear outside noise, like cars whizzing by (a good thing, I guess) or the engine on the bus. This can be kept to a minimum by turning the volume up.The headphones look big because of the \"headrests\" they have, but  they are ergonomic. I was playing a video game while listening to these phones at forgot they were on because I didn't feel them on my head. They have three comfort settings: light, medium, and firm. They also come with a little case which is nice. The phones fold up to the size of a baseball, and both speakers fold inward. A small clip exists on the bottom of each phone, which attaches both sides together when you fold them. You then wrap the cord up and go. They can fit into a typical pocket. These are portable headphones, and I don't know why people say otherwise.They are some of the best headphones I've ever heard. No surprise Koss makes them. They are also manufactured in the USA so there is no outsourcing of jobs with these phones. I can understand why these phones have been on the market since the 1980s. They're fantastic.", "overall": 5.0, "summary": "Superb, above the competition.", "unixReviewTime": 1154908800, "reviewTime": "08 7, 2006"}