{"reviewerID": "A3RCGRXYBRKSRC", "asin": "B00001P4ZH", "reviewerName": "Danielle Greenhouse \"Author of What They Left...", "helpful": [1, 1], "reviewtext": "I bought these headphones a few years ago, after reading all the glowing reviews on Amazon, and I'm so glad I did.  I'm pretty rough with my headphones, and these things can take a beating.  I ended up replacing a pair after 2 years, which is unbelievable in itself, because I usually go through a pair of headphones every six months.  And it wasn't because they didn't work, it's just because the wire near the jack was exposed and getting frayed.  Here are all the pros:Value:  They are a great value for the money.  I've had more expensive headphones that didn't sound as good.  Even if you don't want to spend thirty-something dollars for headphones and don't care what they sound like, I still think it would be worth it, because you won't have to replace them every six months when something breaks on them.  These headphones are very durable and aren't made of flimsy plastic like less expensive ones are, so in the long run, they would be worth it.Comfort:  These are very comfortable.  There are 2 settings, tight and loose, to adjust for different head sizes.  I've never had a problem with the ear pads wearing out or anything digging into my ears, or whatnot.  These fit very comfortably on my head (I have a big head btw) and I've never had a problem with them sliding off.Portability:  These aren't the smallest earphones in the world, but certainly not the biggest.  They do fold up if you need to pack them and they come with a little pouch to put them in.  I bring them along on trips on all the time and I've never had a problem with them.Sound Quality:  They sound fantastic!  Better than a lot of more expensive headphones.  Though any headphone with the Koss name sounds great, I think these are the best.  Just the right amount of bass and treble.  Doesn't sound tinny, or like you're playing music in a tunnel.  If you're used to less expensive headphones, you're going to hear stuff in your music you never heard before.Ease of Use:  Well, most headphones aren't hard to use, and these are the same.  The only drawbacks to these is I found it hard to adjust to loose/tight setting on the sides and they are sort of of a pain to fold up (which is why I never fold them up).  I've owned foldable headphones that were much worse though.Build:  Awesome!  The headband is metal and the casing for the earphones are hard plastic and very durable.  Not long ago, I accidently broke off one of the earpieces.  Guess what, it pops right back in!  Five stars for build!I've never buy another pair of headphones, ever.  I bought 3 pairs of these, (One for home, one for the gym, and one to replace the ones from home) and I plan to buy more in the future, if need be.  I love love love these headphones.The only slight con I can think of is they aren't 'sleek' looking like other headphones, in fact they look like they came straight out of 1982.  I don't really care what they look like though, and quality of these headphones more than make up for the ugliness.", "overall": 5.0, "summary": "These are the most awesome headphones ever made!  I'll never buy any other brand!", "unixReviewTime": 1307145600, "reviewTime": "06 4, 2011"}