{"reviewerID": "A118A49ORGNEUM", "asin": "B00001P4ZH", "reviewerName": "D. Barber", "helpful": [4, 8], "reviewtext": "I got my PortaPro phones yesterday, and I am frankly disappointed.My intention was to use these phones with my computer for music listening at late hours. I was instantly defeated by the useless 4-foot cord length. I should have checked that out, but managed to miss it. Nearly every headphone designed for home use (as these originally were), come with at least five or six feet of cord-length. So right there, I was out of luck. Oh well, I thought, I can always use them with my MP3 player.My second discovery is that Koss, like many headphone manufacturers, is targeting it's smaller phones for the highly lucrative iPod market. This means that the guys in marketing are calling the shots. Not surprisingly, the phones have a cord-length that's right for the iPod crowd but not home users. Further, the sound has the exaggerated bass popular with kids into hip-hop, but at the cost of a balanced natural sound. I would describe the sound as smooth and quite pleasant, but rather unnatural. The low end is very exaggerated and the mid-range is down about 5dB. The highs are also way down, perhaps 6 or 8dB. Using my players equalizer I can make the sound acceptable, but these phones are typical of the \"bass is what the kids are buying\" school of design. Without a lot of tone control effort you should expect a bass-heavy sound that lacks any definition in the all-important midrange. I'm a lifelong headphone listener who has used Grado, Sennheiser, AKG, and even high-end electrostatics. I know good phones. These disappoint. I suspect that most of the reviews reflect people who don't use headphones much.One other point. Koss has been praised for it's generous warranty. Maybe, but read the fine print. Koss will replace or repair the phones (their option), if you provide a check for $6 and suitable packaging. Picture that. I spend $6 for repairs, $3 for a shipping box requiring a post-office visit, another $6 for shipping, and still another trip to the post-office. Some lifetime warranty. Incidentally, I would estimate the phones cost a maximum of $5 to make. Seriously, I base this estimation on material costs and the manufacturing processes, which I am familiar with.In conclusion, I cannot recommend these phones to anyone who values Balanced Sound over punchy bass.", "overall": 3.0, "summary": "Headphones", "unixReviewTime": 1250640000, "reviewTime": "08 19, 2009"}