{"reviewerID": "A3F2NSR3N0UKP0", "asin": "B00001P4ZH", "reviewerName": "defcon4", "helpful": [2, 2], "reviewtext": "Things I like:- Metal band seems durable and is easy to adjust- Sound quality- Affordable price (I'm not an audiophile, don't want to spend $100+ on headphones but I still want headphones of significantly higher quality than earbuds)- LightweightThings I don't like:- Nothing so farI wanted some higher quality headphones for use with my desktop computer; I found many quality headphones at the $100+ price point but wasn't looking for high-end headphones. I just wanted a medium to medium-high quality pair at a decent price that would provide better quality sound than your standard headphones. After reading many reviews and doing a lot of research, I found the portapros and am happy with them. The sound is more rich, bass comes through surprisingly well without sacrificing the high end. They are comfortable to wear for an 1 to 1.5 hours at a time and are very lightweight so you don't always \"notice\" them on your head. I don't carry them around anywhere, but the fold-up mechanism does make these pretty portable if that's what you will use them for. I'm very pleased with these and would purchase them again; they come with a lifetime warranty though, so I may be set for life.I'm sure there higher quality headphones out there that produce much better sound than these; the portapros produce great sound for the average to slightly discerning listner and are priced affordably. To give you a better idea about the portapro's sound quality,,,0=worst, fuzzy, crackly sound that makes it seem like your listing to a poorly tuned AM station10=best, sitting in an acoustically designed room listening to cutting edge, $10,000+ plus speakersPair of $25 JVC earbuds I got at Walmart and junked within 3 minutes: 1Stock iPod earpieces: 3My Vizio soundbar (with subwoofer): 7Koss PortaPros: 5Surround sound system: 8", "overall": 4.0, "summary": "Not an audiophile but still want quality headphones?", "unixReviewTime": 1294617600, "reviewTime": "01 10, 2011"}