{"reviewerID": "A633NIAR4JJAR", "asin": "B00001P4ZH", "reviewerName": "Dr. Marc Axelrod \"PM\"", "helpful": [4, 4], "reviewtext": "I've had these wonderful phones for three months. I use them for my ipod classic. The sound is rich and full. Strong bass with no distortion, even at high levels. Listening to Fleetwood Mac's \"Dreams\" makes the song sound like a dream. You can hear Stevie make sighs and sounds you don't hear on the cheap ipod earbuds.And when you listen to Led Zeppelin's \"Moby Dick,\" it feels like you're sitting right next to John Bonham as he pounds on the drums.It's unbelievable how good these phones are. When you listen to the Counting Crows' acoustic version of \"Amiee,\" with its mandolin intro playing in the left ear, and rich acoustic guitar coming through on the right ear, you will have an eargasm, baby! It is an experience!The Portapros are also, hands down, THE most comfortable headset I've ever worn. You can adjust them to fit tighter or more loosely around the ears, and the extra padding really helps with the comfort.I should say that these are not noise cancelling or sound isolating. I can't wear them in bed at night because even with the volume 1/3rd up on the ipod, my wife can hear them. Same thing with riding the train or bus. You won't want to wear them in public, partly because they look like something worn on the set of the 1984 flick Tron, and partly because your neighbors won't want to listen to your music.But if you care about excellent quality sound, and you are not disturbing anyone, these are THE best sounding headphones you can buy under $50. They are a BIG step up from the so-so ipod earbuds and a bigger step up from anything Walmart sells.I should say that these sound better on MP3 players than they do on Hi-Fi equipment. I definitely prefer my beloved Grado SR125s for listening with my stereo or with my laptop.But the Portapros are a steal at $38.I almost forgot to mention that there is a lifetime warranty on the Portapros. If they accidently break, and you still have your receipt, Koss replaces them for free. Awesome!", "overall": 5.0, "summary": "The best sounding headphones under $50", "unixReviewTime": 1233360000, "reviewTime": "01 31, 2009"}