{"reviewerID": "A5JLAU2ARJ0BO", "asin": "1400532655", "reviewerName": "Gadgester \"No Time, No Money\"", "helpful": [22, 90], "reviewtext": "Yesterday I spent over an hour playing with a real Nookcolor at my local B&N;, where I've befriended the staff as I go there almost every day as an unemployed.  Anyway, I was very dissapointed at this iteration of the Nook.First off, the Nookcolor is very heavy.  I think it's almost 1 pound, and since it's not a true tablet, you're supposed to hold it in one hand, but it'll strain your hand muscles after a few minutes.  Even the B&N; guy told me to hold it with TWO hands. That's pretty pathetic, I must say. The only way to use it for more than a few minutes is to pop it up on some support, which obviously is not convenient for a device that's primarily an e-book reader.Second, even though it's much faster than 1st- and 2nd-generation Nooks, it is still slow, especially when browsing the web.  Now, page turns are generally faster, but there is no animation, and sometimes there *is* a slight delay so you're never sure if the device registered your turn gesture.  Very annoying.Third, the screen is high-res but rather poor in contrast and viewing angles.  I think the resolution is 1024x600, and the DPI is in the high 100's, but overall I felt the screen looked coarse.  I guess for this price, they have to pick some cheapo screen, so no surprise there.  The color LCD screen, of course, draws down battery pretty quick, a fact even the B&N; staff acknowledges readily.  Also, the screen is completely unreadable under direct sunlight.Speaking of the screen, the digitizer is not very responsive, whether you want to zoom in or out or type something.  It's slightly better than my 4th-gen iPod touch but that's still a very frustrating experience.Fourth, the software is still buggy.  The demo unit in store had a few books, but half of them could not open, with some mysterious error message.  The web browser could not render several web sites I tried.Fifth, the interface is very confusing.  There is the hard nook button, there is some kind of drawer button on the screen.  After an hour I still found myself tapping the wrong button to do something.  Very dumb.Sixth, of course, you cannot access the Android Marketplace app store, at least without jailbreaking this.  Very few apps are available and there is no indication B&N; will allow more aps, since they wnat to use this sell e-books, which carry fat margins and have super-enriched Amazon and its founder.In short, this is a disappointing device, not the least because its hefty weight and barely useable screen are just ridiculous for an e-book reader.The list price is $249.99 and B&N; does offer a 30-day money back guarantee if you buy it from them.", "overall": 1.0, "summary": "Heavy, slow, poor screen, buggy", "unixReviewTime": 1291334400, "reviewTime": "12 3, 2010"}