{"reviewerID": "A2LYL1FEOLWFSJ", "asin": "B00001P4ZH", "reviewerName": "E. OMalley", "helpful": [1, 1], "reviewtext": "I'd been looking for some comfortable, affordable headphones that provide great sound and came across the reviews for these Koss PortaPro Headphones. The reviews do not lie...these are absolutely perfect for my purposes.I use these with my MP3 and PMP players, as well as my Blackberry Curve if I'm listening to music on it, and have found the sound to be phenomenal.  Now, I'm no audiophile but these definitely give me more detail than previous headphones I've owned so I'm very happy with them.  They are also extremely comfortable...I needed some over-the-head phones because I've always found earbuds and over-the-ear phones to be painful after awhile (I wear glasses, which are a definite factor).  These have been very comfortable on my ears and I can wear them for hours.  I have not had the hair catching issue that some people mention, so I've been lucky with that as well.Definitely worth the price, and if they ever break down I know Koss will provide me with a new pair.  I know they may look a little strange, but I've never had people comment on that - they just want to know if they are good and what kind they are.The only con is I wish the wire to connect to my devices was a little longer - not a lot, but just a few inches to provide a little extra give.  However, most headphone wires are WAYYY too long, so this is a very minor con.These are not noise-cancelling phones, and they were not purchased for use on planes (I have some foam ear buds I use for that purpose) so I can't comment on how they would work in that situation - I think too much noise would definitely get through.  So just use these in everyday situations (walks, in cars when others are driving, etc.) where it is actually a good thing to hear some of what is going on around you for safety purposes.All in all, I am very pleased with this purchase and highly recommend these headphones to anyone.", "overall": 5.0, "summary": "Great headphones!", "unixReviewTime": 1247702400, "reviewTime": "07 16, 2009"}