{"reviewerID": "AJXQJ5KGNLRVS", "asin": "B00001P4ZH", "reviewerName": "Epic Review", "helpful": [2, 2], "reviewtext": "I bought a pair for my family computer 5 years ago. Aside from replacing the ear pads once in the 5 years - they have sounded phenomenal and have provided years of good and satisfying use!  The independent reviews speak for themselves. Allow me to put it this way: Koss does not make many models of headphones,have been pulled out of bankruptcy in the 80's because of these headphones, and have not changed the design since their introduction in 1984. With that said, these headphones keep the company profitable - so let that be a testament of how good they are. Furthermore, companies do not change their designs if they struck gold - look at the German car makers and American muscle. They have not changed, have the same accents, and characteristics because you don't fix things that are not broken.Sound Quality:I bought AKG Q460s and they were horrible for the price. I had to sell those nightmares off to buy these. It served me right for considering anything but Koss. After hearing such bad headphones I missed the PPs because I am currently away. I needed these to remind me of home. These sound very well balanced, have great bass, and crisp mids, and lighter treble. I think that bass heads will not like these, but will nonetheless appreciate the sound quality and accuracy of these fairly neutral headphones. They do let in/out sound as they are padded and open air, but they are good for quieter environments and very comfortable. The open airs are better because the diaphragm vibrates freely which makes the bass sound less punchy and boxy. These are also very warm headphones with a presence of mids.Pros: Great sound and lifetime warranty.Cons: They are a little awkward because of the metal band, but you will get over it when you hear how good they are.If you are buying online and don't have the time to test them. Just buy these. It's a no brainer. These are the most liked and most reviewed headphones for a reason. If reviews don't convince you - I don't know what will!", "overall": 5.0, "summary": "Best headphones! My second pair!", "unixReviewTime": 1367884800, "reviewTime": "05 7, 2013"}