{"reviewerID": "A1XG38WOY3LY4V", "asin": "1400532655", "reviewerName": "Gadgets & Gizmos", "helpful": [7, 8], "reviewtext": "I should preface this by saying I also own a nook (non color 3g) and an iPad 3gI order a LOT from amazon so when it came down to getting an e-reader it was a tough choice to pick B&N; over amazon.Why did I do this?I still LOVE the value of a retail store, living down the street from a B&N; i go there often to shop and pick up little gifts as well as browse books. There have been plenty of books that by their cover (yes i judge) and short summary I would've bought but because of my ability to skim the book in store I have decided not to buy.Similarly there are some great books out there but for photography and coffee table type books, you really can't experience them the same way with a nook or an ipad. All that being said, I decided to support B&N; because their library is just as large as amazons and I throughly enjoy their storefronts.Ok onto the review.Reading on the nook color is easy, the Android interface is fast and reliable, not to mention easy rootable!Reading on the nook vs the nook color is vastly different because of the eink display on the nook. There is a fair amount of eyestrain associated with reading on a backlit display but I had no problems reading for well over 2 hours on it. The font was just as clear and easy to read as on my ipad.Size wise it is not much different than the original nook but is much heavier.It is lighter and easier to carry than the ipad because of its dimensions.In the end I did not buy this product to read on it, I bought it to root and use android honeycomb on it.This makes the this the best value out of any reader on the market in my opinion.The nook has virtually the same specs as the Samsung galaxy tab aside from the 3g.at $250 (buy directly from B&N;) you cannot complain, Honeycomb runs smooth and opens up an entire world of possibilitiesfor this little tablet.", "overall": 4.0, "summary": "Nook for an Amazon Lover?!", "unixReviewTime": 1300320000, "reviewTime": "03 17, 2011"}