{"reviewerID": "AGC75EPFB7CYD", "asin": "B00001P4ZH", "reviewerName": "Insomniak1 \"Insomniak\"", "helpful": [1, 1], "reviewtext": "I was going to reorder another set of Sennheiser PX-100-II because the cord started to short out at the plug-in point. I like using open air headsets at the office and while taking the pooch for a walk so that I can be aware of what&#8217;s going on around me. Just when I was about to click &#8220;add to cart&#8221;, I noticed the suggestion at the bottom featuring the Koss PortaPro Headphones. I immediately remember these guys from back in the SONY Walkman days! Upon further reading reviews I decided to go for them and here&#8217;s what I think after a good amount of usage (I like to &#8220;grade&#8221; my product reviews). Hope this helps.LOOKS: 7.5 -OK, I must admit that at first I thought they looked very retro and had a nostalgic feel to them. However, as I put them on and looked at myself in the mirror, I started to feel a bit awkward and &#8220;dorkish&#8221;. That sensation intensified as I walked down the street and noticed people giving me weird looks. Honestly, I really didn&#8217;t care, but noticed it nonetheless.BUILD: 8.0 &#8211; These headphones seem well constructed. However, the thinness of the headband, which is made of an aluminum strap, is a concern. I wouldn&#8217;t want to overly bend it for sure. There are also a lot of moving parts and the ear plates are made of plastic. I would not advise to step or even sit on them. The cable is rather thin but overall, if you treat them with respect, they should be able to last and the lifetime warranty puts me at ease.COMFORT: 10.0 &#8211; Hands down he PortaPro&#8217;s are easily the most comfortable headsets I&#8217;ve worn in a long time! They&#8217;re super light so you&#8217;d hardly think they are on your head. The ear pads can feel a bit strange when first putting them on, but quickly become seamless. And they feature a slide to ease pressure, just in case. They are more comfortable and secure on my head than my old PX-100&#8217;s.SOUND: 10.0 &#8211; I proudly own several types of headphones from Audiotechnica, to Bose, to Sony and even lesser known, great quality brands. I love sound (don&#8217;t consider myself an audiophile) so I don&#8217;t take my listening lightly. These little guys provide outstanding performance for the money! The open nature of these headsets provides a very wide, warm, natural feel to whatever you&#8217;re listening to. The highs are very clear and do not &#8220;bleed&#8221; into the other frequencies. The mids are very distinctive and present. The bass is &#8220;punchy&#8221; without being overwhelming (my PX-100&#8217;s were a bit too bassy). I can listen to all genres, from rock, to hip hop to classical and equally enjoy them without adjusting the equalizer setting (flat response). Live music is definitely a pleasure to hear with these guys.FUNCTIONALITY: 9.0 &#8211; Carrying them around is rather easy. They fold into a small, tight &#8220;ball&#8221; and they fit into a little pouch provided by Koss. Getting them into this position is easy and intuitive. They fit into any bag without taking too much space. The cord is light weight and of good length. I wish the 8mm plug was bent 90 because I put my portable device in my back pocket and sticks out a bit. One little gripe that most have is that when placing them on your head, the auto-adjust process happens automatically and you hair can get caught in the sliders. Ouch! But fortunately, that doesn&#8217;t happen too often. They don&#8217;t leak sound as much as I thought they would and that&#8217;s a plus.OVERALL: 8.9 &#8211; I am a believer now! While I do not use these for commuting (subway trains) because of the inability to block out sound, the Koss PortaPros have become the go-to headset to beat while walking around the neighborhood with my dog. The sound quality and comfortableness more than make up for the hit-or-miss retro looks. Highly Recommended.", "overall": 4.0, "summary": "Surprisingly awesome.", "unixReviewTime": 1402012800, "reviewTime": "06 6, 2014"}