{"reviewerID": "A2OVKPY380S7M3", "asin": "B00001P4ZH", "reviewerName": "James Chung", "helpful": [1, 1], "reviewtext": "I keep hearing about this little headphone that I just had to try it.  When the opprtunity came up for me to purchase a small headphone, I jumped on it.There are countless reviews here describing about PortaPro.  So I will skip most of things mentioned here.  I will just focus on my experience with it.First of all, Koss was not a known brand for me.  Only time I really saw their product was when I went to Thrifty (now Rite Aid) and saw their cheap earphones in their electronic section.  Naturally, I always thought they just make cheap quality products.  In last year or so, I started looking for a budget price headphone with good sound quality.  And this product kept popping up in reviews and people's recommendations.  I was intrigued by the fact that this product is essentially unchanged since it's launch in the mid 80's.For $25-$35 price range headphone, I am not so sure if there are better headphones.  It sounds just amazing.  Very full and rich low and mid sound (not muddled but clear and balanced).  Highs are not as strong but it is very well balanced with the rest of the sound range.Build quality is just average.  I don't mean it's badly assembled or anything like that.  But even by mid 80's standard, parts used are extremely minimalistic.  Some people commented on the metal adjustable band constantly shifting and not locking in its position.  Basically, it is not designed to \"lock\" into one position.  If you take your headphone off, you will have to readjust the length of the metal band.Another bad thing is that you just look silly wearing this thing.  But I think once you hear the sound quality, you won't mind wearing it.Again, for the price, I don't think you can beat it.*Update:  I LOVE THIS HEADPHONE!  :)", "overall": 5.0, "summary": "I can't Believe the sound quality on this cheap headphone!", "unixReviewTime": 1318464000, "reviewTime": "10 13, 2011"}