{"reviewerID": "A1YF0SKMGV2BIL", "asin": "B00001P4ZH", "reviewerName": "Jason L. \"bereanminded\"", "helpful": [13, 14], "reviewtext": "I have recently realized that I am what some like to refer as an \"audiophile.\"  I've always loved good sound reproduction, excellent sound range as well as quality.  When I was younger, I used to buy Koss pretty much exclusively.  Lately though, I've been somewhat disappointed though with a few exceptions, the Koss PortaPro being at the top of the list!These headphones have been around since I was a teenager and unlike me, they are still going strong!  They have fantastic sound, they are not overly affected in the bass range (they don't add extra bass for the \"boom boom\" window rattlers out there), they are economical, comfortable and just all around a fantastic buy.  Also, they are recommended by SERIOUS audiophiles as the best portable out there.I can't agree with that entirely; I also recommend the Sennheiser PX-100 and PX-200 depending on your needs.  But of the three, these are the least expensive but offer fantastic sound that you would expect to come out of a pair of full size cans (headphones, I guess I'm learning the audiophile lingo!).The Koss PortaPro have the Comfort Zone temple pads that help make them even more comfortable and the pressure between temple and ear can be adjusted literally by the flick of a switch on ear side of your head.  I have a massive head and these fit me with room to spare.  I like the firmest setting on the Comfort Zone but I've tried the other two settings as well and I can honestly say that there is a difference; it is NOT just a gimmick.  The Comfort Zone really works.These are truly portable also!  They fold up into a little ball that can then be placed into a convenient case that Koss provides.  I personally would recommend buying a semi-hard shell case that Koss also sells just for the extra protection.What more can I say?  If you'd like a few other recommendations in the truly portable range, the Sennheiser PX-100 and PX-200 are rugged, comfortable and highly portable.  (They collapse as well and fit into their own plastic case.)  If you like earbuds, the Sennheiser MX-500 is wonderful with its in-line volume control; the sound is absolutely amazing for something so small.  And finally, the Koss KTXPRO1 is an excellent portable headphone with an in-line volume control.  It uses a Titanium element to drive it.  All of these are great products but ultimately this particular review is about the Koss PortaPro and I really am blown away at how great these tiny portable cans truly are.  I believe you will be too.Though I've become somewhat disillusioned by Koss as I've become a so-called \"audiophile\" (why not just call me someone who really loves good sound to come through good instead of creating a term that sets me apart from everyone else?), I highly recommend these cans to you.  If you are on a budget, you especially can't go wrong.  Remember that Koss guarantees all their cans for life with their \"no questions asked\" guarantee.  It's worth it!  So as my review title states, \"The Koss PortaPro shines in every area.\"Oh, one last thing:  Don't listen to people who say these cans are ugly or clunky; they aren't.  The design is what gives the PortaPro its unique sound quality and I personally think they look cool!  Ultimately though, it is the sound that matters, right?  :)", "overall": 5.0, "summary": "The Koss PortaPro shines in every area!", "unixReviewTime": 1162252800, "reviewTime": "10 31, 2006"}