{"reviewerID": "A343JEP7ADY2YD", "asin": "B00001P4ZH", "reviewerName": "JazzMann \"Jazz-Wine-Sun\"", "helpful": [1, 1], "reviewtext": "I have both the Koss Protapro and Sennheiser PX100 headphones. I love them both! I just bought the Portapros brand new. My PX100 is 5 years old and the mechanicals are wearing out. Here's a comparison between the two.The mechanicals on the PX100 are a notch better than the Portapros. The PX100 has headband padding; the Portapros do not and take a few hairs out now and then. Once placed on your head, both are comfortable. The PX100 folds up neater than the Portapros. The PX100 design is sleeker, more modern and less prominent on your head. The over all construction seems a notch better on the PX100. Here's the interesting thing though. Both are open air but the Portapros seem to seal out external sounds a little better than the PX100. I cannot explain why. The Portapros are also slightly more efficient and play a bit louder.The Sound character of each is a matter of taste. Both headphones sound excellent. Both are sweet, clean and very detailed. Both are non-fatiguing. The Protapros are a bit bass heavy. On some music that bassy sound is magnificent. On other types of music with already prominent bass the PX100 is preferable. Surprisingly, the high frequencies are equally well extended on both headphones. The Portapros are a little sweeter in the high frequencies than the PX100.  The PX100 may be a little more accurate with a slightly better midrange than the Portapros.The PX100 is an up-to-date modern design. The Portapros are classics with a design that goes back 15 years! The original PX100 came with a nice case. The Portapros have a hook and eyelet at the bottom of the metal headband. They hook together to bind them tight to fit inside a small bag. I use neither the bag nor the case. You may want to buy both. You can't go wrong with either.", "overall": 5.0, "summary": "Koss Protapro vs Sennheiser PX100, an old audiophile's comparison.", "unixReviewTime": 1380326400, "reviewTime": "09 28, 2013"}