{"reviewerID": "A326VH8IUJ7JSV", "asin": "1400532655", "reviewerName": "Jeffrey Wong", "helpful": [20, 25], "reviewtext": "I don't usually jump on new technology or new products, but...  on seeing the vibrant color display of the Nook Color (NC), I took one home for a week.ebook Pros:Very quick to setup for ownership and downloading.Quick page turns and refresh rates.An accelerometer quickly permits reading in landscape or portrait mode.After resizing text you don't have to scroll down to see more text on the same 'page'  You just sweep your finger across the screen from R to L to see the next part of the page.The touch screen--sensitive & fast.You can lend books to other Nook owners for 2 weeks, and it really is a loan--you cannot access the book while offered or loaned.  (same as eInk Nook)You can borrow ebooks from libraries.  (same as eInk Nook)You can read a book for an hour each day at any B&N; store.  (same as eInk Nook)ebook Cons:short battery life, 6-10 hours?The touch screen. Don't touch it while reading or  1. a menu pops up for things like brightness settings, text size, highlighting, dictionary, share options, find button, content button & a slider to zip to a page quickly or;  2. the page might turn, or  3. the page will scroll vertically or horizontally.  You MUST hold the device by the margins outside the glass.  Great if you hold by the edges when you read a real book--all others, take notice, as my hands did tire of holding a book this way.You wish, after having seen how you upsize or downsize pages on the iPad (Pinch/spread 2 fingers on the glass) that you could do the same here.On the one I bought I saw some very irregular activity related to the menu flashing on and off without my having touched the screen & also the virtual keyboard would occasionally act up, e.g.,  a single key press of 'n' might give me 'nnn' or 'nmm' or even 'niin'The virtual keyboard requires you to press a '123' button to get numbers.web browser pros:great color and resolutionOn almost any monitor you'll have to scroll up/down to read long text passages.  The NC seemed to know how to center and wordwrap the text on most webpages in the display so as not require you to scroll left/right.Virtual keyboard has a \".com\" button for entering web addressesweb browser cons:It doesn't enlarge pages by the iPad/SamsungGalaxy pinch/spread technique.  You first must slide a finger on the screen to bring up a +/- buttons in a corner and then touch +.Same issue with my big long thumbs on the glass.  It'll scroll if I move my thumbs.I couldn't send an email until a BN tech directed me to the portable versions of [...] ([...]) \"m\" for mobile.Doesn't have 3GSame problem with the keyboard as above. When I took it in to B&N;, it played innocent and behaved well. Later, at home again it went nutty.Final verdict.  Not for me.  Perhaps a later version with better battery life, maybe color eInk, a version of the browser that supports Adobe Flash, a more behaved virtual keyboard with number keys above the letter keys. Possibly a carrying case that keeps my fingers off the screen while viewing.  Technology gets better and more affordable for late adopters.", "overall": 3.0, "summary": "Great color, still, not an iPad, not for long trips without AC", "unixReviewTime": 1292112000, "reviewTime": "12 12, 2010"}