{"reviewerID": "A2RI4QE6EO29CA", "asin": "B00001P4ZH", "reviewerName": "J. F. Hindy", "helpful": [2, 2], "reviewtext": "I have owned a lot of low to mid range headphones in my lifetime. Currently, I have a pair of skullcandy earbuds, a pair of the stock iPod earbuds and a pair of $35 Sony Studio headphones (the big over-the-ear ones).They were not working for me. The sound on the Sony ones were pretty decent, but prolonged use made my ears ache and could get very warm in the wrong climate (like...summer). They were also very heavy, so reading text books or just reading my Kindle, these things would not cut it as it would also put strain on my neck. My ears were just not made for earbuds, as I had various problems with those. The iPod earbuds failed miserably, as the sound was always too shallow for me and they kept falling out of my ears.So, I looked for the most rated headphones (not earbuds) with over a 4 star rating on Amazon and stumbled across these. Over a 1000 reviews and it still had 4 1/2 stars? Yeah, I'll take some time to check these out lol.So I got them a week ago. To avoid any \"premature\" reviewing, I let them sit the first three days with music on constantly, racking up about 36-40 hours of \"break in\" time before I tried them out objectively.First the headphones themselves. They are very, very light. The head band are a couple of thin metal bands with plastic pieces that adjust size. I like this because metal is durable but it's also light and airy and doesn't make me feel like I'm wearing a music factory on my head.The ear pads are more comfortable than I imagined. They are not dollar store ear pads (although they look that way) and are comfortable on the ears.A wildly awesome thing about these phones that people often overlook are all the parts that make them comfortable. The ear pieces themselves are hinged, so they bend depending on the shape of your ear. The metal bands are firm but flexible so it doesn't press too hard on the head or ears. Then there's comfortzone settings. It took a minute to figure out how the settings work, but once I did I was treated to a unique comfort experience. Comfortzone consists of two pads on either side that rest on the temples. The firmer the settings, the more pressure on your temples and less on your ears. I found this awesome as I could sit with these headphones on my head for 8 straight hours and feel no ear fatigue at all.Now for the part everyone wants to read: the sound. I am NOT an audiophile and I won't use any technical terms. The music sounded just plain great. I can hear bass lines in rock songs, hip-hop and rap songs thump (but not uncomfortably so). The music sounds whole and complete and not shallow and airy like iPod headphones do. The high notes sound good and even at high volumes don't cackle or distort and in no song that I listened to did anything sound muddy or wrong. The volume is well balanced. Maxed out is too loud and that's something my other pairs of headphones can't say. I've often had to max out settings just to get a decent volume on my Sony headphones. These I can keep in the middle volume range and it still sounds good.They're not noise cancelling and they leak sound. I'm okay with this because when I jog, I'd like to hear the cars coming before they hit me ;) so if you're looking for noise cancelling and quiet for others, then you should probably keep searching.All in all, for the price, I can't imagine having gotten a better pair of headphones. Personally, I love the retro style of the headphones. Keep in mind that Chucks have fallen in and out of style for 90 years and they're top sellers. This has been in and out of style for nearly 30 years and it's a top seller. I put them in the same category (and, as it happens, own both now) which is \"totally awesome\". If you're looking for some lightweight phones that sound great and have a unique look, then your search is over. I wish I'd found these 15 years ago when I started using headphones for the first time.", "overall": 5.0, "summary": "Everyone Was Right", "unixReviewTime": 1326585600, "reviewTime": "01 15, 2012"}