{"reviewerID": "A2WB7LZ595CR50", "asin": "B00001P4ZH", "reviewerName": "J. Harley", "helpful": [2, 2], "reviewtext": "**Update 9/8/10** These headphones are great but they do have one potentially serious design flaw.  The stereo connector is very flimsy.  Despite being very careful, mine broke in under a year.  The stereo connector literally just pulled apart as I was removing it from the ipod one day.  The wires pulled right out of the connector.  After checking the web, I see I am not the only one to experience this.  Someone was even kind enough to post a picture of it above, in the product photos.  I still think they're great headphones and I ordered a new  pair (although I plan to have these replaced under warranty and keep as a spare).  I knocked off one star simply because now I have to shell out $6 plus shipping to replace this set (although I opted to pay $30 for a new pair to save time).  However, if the second pair breaks as quickly as the first, prepare to watch the review stars plummet.  What good is something if it won't last at least a year?*** End of update ****I've tried pretty much all types of headphones. I was looking for a good solid pair, under $50, preferably over-the-ear but not too big (for gym, athletic use and better portability).  I stumbled across these on the web and saw that people loved them, so I came to Amazon to read some reviews.  Seeing that they were highly rated here as well, I ordered a pair.  These headphones have a solid reputation for a reason, they sound great.  The minute I plugged them in, I knew why they were so highly rated.  Clear highs, deep lows.  I mean, it's not bone rattling bass, but it's decent enough if you don't want to lug around a pair of $50+ self-powered heavy headphones.  Easily the best sounding headphones I've bought the past year.  And that's in a group of Skull Candy, Sony, Apple, self powered, noise canceling... I've tried it all the past year.  The only (extremely minor) gripe I have is that I agree with others that it does feel flimsy at times.  I like that the moving pieces are metal instead of plastic (can't tell you how many plastic headphones I've inadvertently broken from simply putting on and removing), but it still has a somewhat delicate feel to it.  They do come with a lifetime warranty, which is pretty sweet, (although a further check of the terms reveal you pay to ship them back and have to include a $6 check.  Something potential purchasers should be aware of).  I'm happy with my set and agree with everyone else that these headphones come in a portable package but possess full-sized sound.", "overall": 4.0, "summary": "Great headphones but build quality might be suspect", "unixReviewTime": 1258502400, "reviewTime": "11 18, 2009"}