{"reviewerID": "A7JK2LY3CHJ2H", "asin": "B00001P4ZH", "reviewerName": "J. Hartsell", "helpful": [3, 3], "reviewtext": "I shopped alot before I decided on these headphones i read all the reviews here as well as on many other sites. To tell you the truth I found the hype hard to believe for a product that has remained unchanged since the 80's . I rated these babies a 5 star for the sound quality and price it helps if you have a headphone amp if your using small devices to run them like  IPOD but not mandatory they get pretty loud without my amp and probably would protect your hearing better without it. I can tell and improvement with the amp but it sounds really good just plugged straight into the IPOD . I really like these over my VMODA bass earplugs for certain activities like exercise the bass buds sound better on alot of things without the amp especially but if you walk or ride with the buds in your hear the wire rubbing your clothes it amps up your breathing etc. plus if your walking like I do where people bike or drive you cant hear them coming up behind you , not a problem with the porta pros on. I have to point out that you can hear them if your sitting or standing next to someone wearing them so if your listening to somethiing loud and dont want to disturb others around you they dont work well for that like on a plane, bus, in a car so there are some limitations to it. people made alot of issue with the retro style either for or against. In all honesty they really dont look all that odd on your head and are quite comfy the fact that they fold up to carry in the bag is nice but they are still bulkier than a pair of ear buds. alot of people reviewd them as being studio quality monitor headphones this to me seems a bit much but they are definately on par with any headphones I tried while looking for a new set.I even felt they rivaled the bose over ear set although the noise cancelation you get from the cup does make the bose sound better on some stuff. I would say you cant go wrong with this headphone set especially for small devices like IPODS and the like.", "overall": 5.0, "summary": "Worth every penny", "unixReviewTime": 1242000000, "reviewTime": "05 11, 2009"}