{"reviewerID": "A2DJGZP9NFJDZB", "asin": "B00001P4ZH", "reviewerName": "Jiri Krecek", "helpful": [1, 1], "reviewtext": "Punchline:I have looked around and can't think of any over-the-ear headphones with a $35 price point which would sound better than Koss PortaPro's.FYI, there is a newer model which has a remote on its cable and supports iOS devices.I remember drooling over these way back in the day when one of my favorite European hi-fi magazines used to use these as a reference for all portable headphones. They deserved it. And although the crown had been taken off these by better headphones as the time went by, PortaPro's have still lot to offer and easily beat other competitors twice the price of these or more. I would not hesitate for a second to put PortaPro's above Dr. Dre's Beats (which are an over priced, mediocre sounding) phenomenon these days.Design:PortaPro's draw attention of onlookers as their signature design does look somewhat nerdy. :-) Fit is great, the temporal pads can adjust their pressure, hence alleviating the pressure put on your ears The bridge is self-adjusting consisting of two pieces sliding on top of each other, though, the plastic sleeves on top of the bridge can push into the top of your head and if you have less hair, you may feel it after awhile. Also, if you have long hair, or lots of it (not my problem), your hair could get snagged between the bridge pieces and get pulled.Cable is oxygen-free, has a 45 degree angled 3.5mm jack and splits to go into each side of the headphones. It is not replaceable, so if it breaks, you need new cans. Koss honors limited lifetime warranty, if you register.Sound:They sound as good as my AKG Q460, maybe with a touch more bottom end and a bit more of treble. Due to their construction, they do not isolate outside noise as well, so using listening to your tunes on the train or in the city with lots of ambient noise will make you crank the volume up. Beware, their bass is powerful, so treat your ear drums with some care.Listening to PortPro's at home or during a stroll in a park or quiet neighborhood is a joy.Treble, mids and bass are in a great balance, so these cans do not require much tinkering with EQ. I actually use the \"Flat\" equalizer setting on my iPod.Impedance is 60 Ohm, so you need to turn up the volume a notch or two when switching from a pair of standard 32 Ohm headphones to make PortaPro's sound at the same level of loudness.I bought them at K-Mart which was closing and they had them marked for $32.I will eventually buy the 6-pack of replacement foam ear pads.Included is a nice little faux leather pouch and can fold and fit into it very nicely, so good news for road warriors.", "overall": 5.0, "summary": "After decades on the market, they still hold their own", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}