{"reviewerID": "A16723ZETJAWIS", "asin": "1400532655", "reviewerName": "JMK \"jmk\"", "helpful": [6, 7], "reviewtext": "I had the original Nook, had a friend's Kindle for a couple weeks, and now have the Nook Color. Although it's a bit weird to be writing a review of it on Amazon, I felt that potential Kindle purchasers should understand their options.The Nook Color is, by far, the best eReader I've used (including the iPad). It's not perfect, but it almost is. The LCD screen is very easy to read, which surprised me since I was a big fan of e-ink and did not like long-term reading on the iPad. The lack of need for a night light is great, and the software it ships with is lightning fast and almost bug-free. Really, there is no lag when I'm using it and the functionality (once you spend 3 minutes learning it) is near-perfect.BN is quickly catching up to Amazon on content...frankly don't notice a difference anymore. Plus, you can side-load eBooks from Google and elsewhere.I know this...I will never go back to e-ink again and love this screen.I also LOVE the delivery of magazines on this thing. Really, it's better than the real magazine. You get full color reproduction of text and pics, and it gives you an Article View if you just want to read the article. It is a great way to get magazines and will be better as they get more publishers (right now, it's a decent list but it could be better).I also really like the multimedia support...I can load photos and pics on an Micro SD card and take my music with me. If I'm in a wifi area, I get full Pandora support! I wish it had 3G, but this is still great.Having said that, the Color is not perfect. First off, the weight, while acceptable, is SLIGHTLY too much. It won't cause strain like the iPad and is perfectly capable of being read in bed (you can lock out the gyro so the book doesn't flip Portrait=>Landscape), but it's not the unnoticeable weight of the Nook or Kindle (or paperback). Still way better than a hardcover though.Second, the screen, while great, is slightly tactile, not glass like you would be used to on an iPhone or high-end Android phone...this is nitpicky, but I noticed it.Third, no Flash support yet (and, while it is a great web-browser, it's not a laptop, iPad, or even like my HTC Evo). This, and the lack of pinch-zoom multi-touch, affects my enjoyment of the web brower (note: you can zoom, just not pinch-zoom). UPDATE: Pinch Zoom is here! It's very good, but not great, implementation. Makes the browser that much better!Fourth, the newspaper delivery, while acceptable and similar to the original Nook/Kindle, is not good enough. Frankly, it's easier to read the web pages of the papers than on this and pales in comparison to the magazine delivery, which really is SUPERB!Finally, and most importantly, is the battery. This is not like an e0ink reader. To give you an idea, the other day, I started out with a full charge and I read around 600 pages of a book and did some light browsing. I did not use music or Pandora and did not pay any games. At the end of the day, I had to charge it again. This was about 7 or 8 hours of use. That's OK with me but it ain't the type of thing that you can go on a three day road trip without your chord like the Kindle or original Nook.Anyway, it looks like my cons are longer than the pros, but really, this is a great product. I can't wait to see Amazon's response and appreciate the (hopefully) friendly competition that this represents!", "overall": 5.0, "summary": "Wow - what an eReader is meant to be!", "unixReviewTime": 1293667200, "reviewTime": "12 30, 2010"}