{"reviewerID": "A1NAAI0SBO3FBA", "asin": "B00001P4ZH", "reviewerName": "J. Metcalf", "helpful": [2, 2], "reviewtext": "I had a pair of these (Best Buy edition with cloth-covered cable & updated styling, not anniversary) years ago. Those were misplaced, but I remembered them fondly. I switched to Bluetooth behind-the-neck models for awhile (Motorola over-ear) and those were great, but I forgot how much sound-quality was sacrificed by the switch. Had to buy new ones after my Motorolas were stolen, so I came back to the cord, a little reluctantly since I use them actively.Glad I went back. The clarity is fantastic. Comfort-wise, I do have to toggle the firmness down to light every time I put them on (and that's somewhat annoying) but the convenience of rolling them up eclipses that. The cord is on the shorter end at four feet, which I appreciate- I've never seen the need for long cords on headphones. If I need to use them at a desktop or something I'll grab an extender. The pouch is gimmicky and a touch small, but serves the purpose- I'll probably put them in something else. The headband can catch longer hair, but I wear a buzz, so that's not a problem. They're even more comfortable than similar models while laying down to sleep. Some people complain about the style, but I've always loved it. They're easier to wear underneath a knit hat, or in conjunction with sunglasses. The design is eternal for a reason.You really can't do better at sub-$100. If your hair is longer, wrap electrical tape around the band- it won't collapse anymore, but you won't rip your hair out. If the stock pads don't satisfy, get some Grado bowl replacements (but the stock pads are fine.) If they break, send them into Koss for a replacement, $6 S&H.; The new model has an angled plug- not right-angle, but not straight either, which I find convenient for preventing cable-breakage but might not work with some cases.A testament to how good these headphones are- my very picky grandfather has gone through several different models of headphones. After he tried my new set on once, I had to order another pair the next day.", "overall": 5.0, "summary": "Reliable, Clear, Comfortable", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}