{"reviewerID": "A1Q9NE8OY1XD5J", "asin": "B00001P4ZH", "reviewerName": "John", "helpful": [4, 4], "reviewtext": "I've had the Koss PortaPro's for about four months now and I decided it was time to give them the review they deserved.I mainly used standard Sony studio monitor headphones for personal music listening when I'm on my desktop computer or laptop, and I would use earbuds with my iPod on the go or in bed at night. I decided I wanted to try these headphones considering the golden reviews they've been getting.When I received them they were a lot smaller than I thought they would be, but they fit my head perfectly and they are very comfortable. I can't even feel them after a while. They do require a little adjusting after some time but my ears don't feel sore after long listening sessions.They sound great and they look great, too. Some people might think they look too wild/retro/geeky, but that's what I like about them -- they are unique in their design. They don't look bad to me at all.They have an extremely clean and crystal clear sound. The highs are crisp, the mids are warm, full, and natural, and the lows are tight, deep, and full-sounding. They do have a little bit of extra bass, but that's no problem for me. I can just turn off the EQ on my computer audio player and they sound perfect. I always have the EQ off on my iPod so they sound just fine there, too. The extra bass really isn't that bad at all. It shouldn't affect your buying choice with these headphones.Yes, they are flimsy and you have to be somewhat gentle with them, but they are surprisingly durable. I've fallen asleep at night with these headphones on and when I wake up finding them near my pillow off my head, I'm worried they had been destroyed. To my surprise, I find no bends or any signs of stress on them. The ear pieces don't even fall off either, and those are held on with just a little plastic clip it looks like. (They pivot to fit the shape and position of your ears.)The only cons I have about these headphones is the somewhat short cable length. It's 4ft. long, but I sometimes find myself accidently yanking on them with my arms when I'm not careful. That's fine though, as I just use another 4ft. extension cable I found. I also have to adjust the headband to almost it's widest when I put them on. I wish there was some type of locking mechanism on the headband.These have become my standard headphones for at-home and on-the-go listening. Overall, these are great headphones and I will definitely choose these for the rest of my life, or until they stop making them.", "overall": 5.0, "summary": "Best headphones I can find", "unixReviewTime": 1332201600, "reviewTime": "03 20, 2012"}