{"reviewerID": "ADE5RJ2I12LZ6", "asin": "1400532655", "reviewerName": "Jose", "helpful": [11, 17], "reviewtext": "Bought mine a few days ago and returned. It is an ok device but does not truly shine as an ereader and I will expand on it shortly.1st, this is more a hybrid device than an ereader. An ereader basically is for reading documents in an electronic format. Examples of good ereaders: Kindle (of course), Nook 1st generation and Sony. Nook Color, besides allowing you to read, let you browse internet, listen music, play some games and much more tablet oriented stuff. Of course, there is nothing wrong on that until you start thinking about how important color and internet are for just reading a simple book.So, what's cool or nice:-Internet.Full color internet experience, with nice virtual keyboard and ok browser. Touching the screen and keyboard is like an iPad or similar tablets, but is comfortable enough for short emails or using Wikipedia or Google.-PDF supportWith Nook Color not only you can read PDFs in a nice full color screen but you can expand or zoom in at will, move along pages with a simple touch or even rotate and read in landspace mode. This feature is really amazing and the selling point if reading PDFs is your only or most important task.-Full color screenPretty obvious. If you like magazines or would like to get electronic subscriptions of any of them, look no further. The resolution, colors and screen is perfect, a real pleasure to read using a NC. Depending of the magazine you can also extract or read the text or article portion only, leaving images apart.BUT!... not everything is perfect ...-No landscape mode for booksYou have landscape mode while reading PDFs but not while reading regular ePub books. This was a real surprise to me, a bad one! Landscape mode allows you to rotate and read poetry or technical books without cutting the paragraph or breaking lines. With no Landscape mode you are forced to read every book \"as is\" and for a hybrid table which costs more than $200.00, in my opinion, it is not acceptable. My Kindle 3 rotates and it's 50% cheaper!-LCD screenI must admit this device has less glare issues than iPad or Galaxy, but if you have read using eink technology you would not go back and change to LCD again. Reading on a Nook Color for several hours is not easy for your eyes. And forget about using it at your pool or outdoors, unless is cloudy or you find the perfect angle; the glare will bother you while reading anyway. Indoor is a different story but it created some eye strain on me anyway, specially after long reading sessions.-HeavyFor serious readers (those who read novels, fiction books, technical books) or more than 2 or 3 weeks per month, please think again before buying. With about 18oz your hands and wrist will start complaining soon and if you don't have a desk or something to put your NC on, your choices are using your tummy, chest, lap or knee as additional support. A deal breaker. Being a Kindle 3 owner I know what I'm talking about. You can hold a Kindle 3 with one hand and read for hours with little or no problems at all.-BatteryOnly 8 hrs of continue use, average. I bought it a Tuesday, read for about 5 hrs that day, went to bed (leave it on but in sleeping mode). Next day morning turned it on, used it 1 more hour and soon after that the device was at 16% of battery life. (I barely used internet and brightness was at minimum) Another important point about battery and charge is that the Nook Color must be charged via wall, not USB or computer unless screen is off, which means you must forget about using the device during the charging process. The adapter is also proprietary so you can't use your Nook 1st gen adapter or the one some Androids use, I don't like that, I don't like proprietary stuff. The more standard, the more common, the better to replace or find.-No zoom or ability to enlarge imagesAn image with wrapping text around in that cool book? If you can't read it or maybe is too small, then sorry...you're out of luck. You have (at the moment of this review) no way to click, expand or enlarge that image. If you read mostly novels this means nothing to you. But if you read technical books with some images or illustrations on it, the size will be so small that is basically useless and not readable at all. I can't believe this simple feature is absent and I can only hope for a future fix via firmware-Android based but not full access to Android marketShame on you B&N.; This device could be a real hit if was not so closed or locked. As usual, this device will be hacked for those with brave hearts or basic computer skills (actually, it has been) but warranty will not be honored and it's a hassle to keep it up to date after official B&N; firmware upgrades, in case you hacked or rooted the device; also you won't be able to read books in-store if you root it. While B&N; keeps selling the unit without Android Market or a restricted version of it, this device will be like having a Magnum revolver in your hands without any bullets. So much power with Android/Linux but you just can't use it.-No \"read me\" featureFor a $200.00 tablet, I would expect this feature. The Kindle it's not so powerful in terms of hardware or processor and it reads the English books for you.SummaryIf you read a lot, portability and battery life are important for you, forget about Nook Color. If you are a casual reader, looking for a fun device and distractions (Internet, Games, etc) Nook color will fit your bill. Just keep in mind that Nook Color is not a true ereader though, but more like a tablet with reading abilities; if you are aware of that and eye strain is not a concern, this can be a great buy.For now, I will pass. My Kindle 3 is simpler and lighter and does very good what it suppose to do: let me read (or read for me) my favorite books. Most novels and technical books are not in color so I don't need a tablet with Internet access to enjoy them, why bother then?", "overall": 3.0, "summary": "Good for casual reading. Not better than a Kindle as a true ereader device", "unixReviewTime": 1294358400, "reviewTime": "01 7, 2011"}