{"reviewerID": "AIE03GJ95JW3Z", "asin": "B00001P4ZH", "reviewerName": "Kiko N.", "helpful": [5, 5], "reviewtext": "28 years. 28 years and counting. This is how long since the Koss PortaPro was introduced, and to this day, they still roll off the production line virtually unchanged since 1984. Talk about market endurance and lasting appeal. This headphone model trudged through and survived the ever evolving portable music industry, from the cassette Walkman, to the era of MP3 players and the iPod and now, the streaming era. It's baffling to imagine how one seemingly unassuming product could accomplish such a feat.One probable cause is the quality to price ratio. The PortaPros have gone up in price over the years, but still, currently at $40, they still remain a great value in headphones because of their unrivaled sound quality at this price point. Koss, for the most part, is known more for their budget headphones but the PortaPro is one audiophile secret that the masses need to know about. These pump out sound so decent, they compare well enough against headphones way beyond  their price range! In fact, I like their sound signature so much that I use them as my starting reference headphones to analyze other sets. They are the ultimate beginner audiophile headphones.So what is it about these cans that make them so great? Why are they revered by fans all over, sparking a rather vocal cult following?Seeing them for the first time, you might not even dare venture to try them on. They look like light, flimsy, cheap 80's headsets. (Which is in a sense, what they really are.) Some may even argue vainly that they are so ugly and hideous, it will be horrifying to be caught dead with them hugging your noggin. ( I find them charmingly futuristic in a retro kind of way, though. Like how sci-fi movies in the 80's imagine what future thingies will look like.)  There's a minimalist no-frills commitment to these headphones' presentation. See, there's just this mere sliding metal headband on top attached to plastic mounts that support two thin, even more plastic, grilled sound drivers, thinly wired, with black foam padding, terminating into a 3.5 mm 45 degree jack. But that same plastic mount gives the PortaPros their unique iconic look and character. It's called the ComfortZone slider and together with the metal accents, it lends the PortaPros that RoboCop/Terminator aesthetic. It was probably a gimmick back in the day because the ComfortZone settings (Light to Firm) hardly do anything for me except point the drivers outward on the light setting, resting the foams on my temples. The PortaPros, therefore, are known and remembered for this look and Koss was smart not to tinker with something that is iconic. And you don't get the PortaPros for their ruggedness or luxurious build quality. They feel so utilitarian they could be the headphones communists will finally distribute to the proletariat. They feel so delicate and fragile that Koss was kind enough to give a lifetime warranty! So basically, if you buy a PortaPro now, you are set for life.At the end of the day, you get the PortaPros because of their sound characteristics. These would never have achieved their legendary status if not for their aural properties. This is why we obsess over headphones anyway. They are not a flash in the pan fad nor are they glossed over by celebrity marketing. These are honest and straight-forward consumer products endorsed by the same consumers themselves.What you get with the PortaPros is surprising clarity and detail, you can't believe a budget headphone is actually piping it out. The drivers on these things are awesome for their price and size but they are not perfect, of course.The high end detailing sparkles with this set although treble is somewhat grainy. Bass is substantial and not overpowering but, however, could get loose in the higher bass frequencies. This low end bleeds to the the lower mids rendering it with a slight nasality. The proper mid frequencies are forward and present but they lack smoothness. Technically, with these faults, you could argue that these shouldn't sound good, but all in all, when you combine these traits, it's actually a pleasurable listening experience.I think, coupled with their specific sound signature, what makes these portable sets shine is their soundstage and separation. Since they are technically open back sets, the soundstage is unconstrained by resonance, giving them this feathery, airy feel.  Instrument separation, as a consequence, is remarkably even and it fleshes detail out. Of course, there a lot of expensive high end sets that could do this better, but if you are upgrading from entry level sets near the PortaPro's price point then the sound difference will be life changing. Like I said, these could rival or outperform headphones twice or triple their price. Some people compare the PortaPros to another open back can, the Grado Prestige Series SR80i Stereo Headphone or theGrado Prestige Series SR-60i Padded Headphones, but nothing could be more different. These Grados are excellent and extremely detailed but they skew more towards the bright treble side of things which could sometimes be too harsh for some people. The PortaPros are tuned more as balanced sets, if not bass focused, what with their slightly forward mids.  Both these Grados and the PortaPros are brilliant entry-level sets , although the SR80i are twice as expensive. I use the PortaPros, appropriately enough,  more for 80's synth pop, rock and new wave while I prefer the Grados for acoustic guitar recordings, and  if you must, do get both.So in summary, the iconic PortaPros are a 20th century wonder for their longevity and enduring appeal. Their price to sound quality and their minimalist utilitarianism is probably the main reason why they have such a following. If you dig that retro chic look and you want a quick entry to quality sound without breaking the bank, then get yourself the PortaPros now!", "overall": 5.0, "summary": "Koss PortaPro headphones: 20th Century Minimalist Masterpieces?", "unixReviewTime": 1335398400, "reviewTime": "04 26, 2012"}