{"reviewerID": "AQMUXDDCLJSSV", "asin": "1400532655", "reviewerName": "J. Peplinski", "helpful": [383, 393], "reviewtext": "Last year my husband asked me if I wanted a Kindle, because I love to read all the time and I try to be eco-friendly when possible.  I was intrigued, but my biggest weakness is magazines and I didn't like the availability or look of them on the Kindle.  When the iPad came out, I was blown away by the beauty of it, but felt like for a few dollars more I could just get a whole new laptop and it would be almost the same size.  For travel, the iPad seemed to big and fragile for me; I need to be able to jam all my toys into my backpack and not worry about them.When I stumbled onto the Nook Color, I absolutely flipped my wig and couldn't wait to get one!  Full color magazines, that look just like they do on the newsstand!  This could single-handedly save the rain forests - I seriously buy a LOT of magazines.  I also save them forever because you never know when you might want that one article or photo again, which drives my husband crazy.  So perhaps the Nook Color can save my marriage as well!  That's a lot of expectation to put on this adorable little device, but I think it's up to the challenge.Santa decided to come early to our house, so I just started playing with the NC a few days ago, and it is my first e-reader.  It was almost fully charged right out of the box, so I was able to start playing with it in less than an hour (it says you can use it while it is plugged in, but they keypad is VERY oversensitive when plugged in so I don't recommend it).  It easily connected to my home wifi and linked to the Barnes & Noble account I had set up earlier that day.  If you don't have home wifi, you might have to visit a public wifi location in order to activate it.  I recommend setting up a B&N; account beforehand if you intend to purchase anything from there, as it makes the first-time Nook use very smooth and enjoyable.BOOKS: There are many many books available from a variety of online sources, check the product details for formats (please note it does NOT support Kindle format).  I understand it's also easy to download books from your local public library, though I haven't tried that yet.  The B&N; Shop function within the Nook itself is the easiest interface but certainly not the only option.  While reading, it's very easy to adjust the font, screen brightness, and more to make it as comfortable as possible on the eyes.  At night I turn the brightness all the way down and find it very comfortable for my eyes while reading in bed.  I've read for hours on end without any sort of headache.  I haven't used the highlight, look-up, or share functions very much yet, but they're super easy to incorporate if you enjoy that sort of thing.  Page turning is an intuitive flip of the finger, or you can tap the side of the screen to move forward or back.CHILDREN'S BOOKS: The color on these looks amazing, and the \"read to me\" feature is wonderful for little ones learning to read on their own.  I imagine this would be great fun for a kid stuck in the back seat of a car for a long trip too!  There aren't a ton of Read to Me books available yet but they are adding more every week.  I don't even have kids but these are pretty awesome.MAGAZINES: Obviously this was a major feature for me!  The appearance of the magazines is absolutely gorgeous, the text and photos are clear and sharp.  You can use the \"finger pinch\" method on the touchscreen to zoom in and out, or you can use the \"Article View\" feature to pull out just the text of each page at a pleasant reading size.  The magazine includes every single page that you'd find on the newsstand, including advertisements, which to me is a benefit because I sometimes enjoy the photography and trends those provide.  Magazines can be read in portrait or landscape format, and you can flip through thumbnails at the bottom of the page to reach a particular article.  Most of the currently available magazines offer a single-issue purchase or a 14-day free trial, then bill you monthly for as long as you want to receive issues.  Subscriptions are very easy to manage so canceling is not complicated.  So far there are about 80 magazines available, and the number seems to be increasing regularly.NEWSPAPERS and PDF's: I haven't tried these yet, though some have reported formatting that make certain ones difficult to read.  The ones purchased directly through the Nook store are more likely to be formatted appropriately for the device and easier to read.  Better PDF support is likely to come in a future firmware update, though a lot of it depends on how the original publisher sets up the file.INTERNET: You do need a wifi connection to go online; 3G is unlikely to be available for the Nook Color unless you also purchase an accompanying data plan.  So far most web pages look crisp and beautiful, but are not as fully functional as on a laptop or computer.  Flash functionality is not available yet (but is planned) and a lot of people are experiencing difficulty with email and other text box typing.  I believe this will be fixed very soon, but for now the web is more of a \"read-only\" experience.MUSIC: You can load your own music or use the included Pandora app to link to your Pandora account.  The speaker isn't great so headphones would come in handy.  I'm extremely in love with my new iPod Nano so I will probably strap that on while reading rather than use this feature.VIDEO: Our first try produced some choppy playback, but I think the processor was very busy setting up the hardware because we had just gotten it out of the box.  After that, it played everything perfectly with jaw-dropping video quality!  It will play videos in MP4 format, so get yourself a converter and a microSD card and load it up for your next trip!  Apparently videos can also be side-loaded through the mini-USB cord.  I've only tried it on the card; it reads directly from the card with no problems.OTHER: You can add your own photos to use as background, or just to show friends.  It comes pre-loaded with a few games (sudoku, crossword, and chess) which work well and are fun.  \"Lend Me\" is an exclusive feature that allows you to swap books with other Nook users, and you can find groups of folks online who will swap with you if none of your friends have a Nook.  It uses the android operating system, and an app store is scheduled to open sometime in early 2011 so there will be much much more available in the coming months.I'm the type of person who doesn't need my phone to be a camera, my iPod to be a dvd player, or my e-reader to be a laptop.  The Nook Color does a WONDERFUL job as an e-reader of not only books, but also magazines and newspapers, and it has some other fun bells and whistles.  It does what it's supposed to do very well and the additional features make it a great value for the price.  I would give it a million stars if I could!", "overall": 5.0, "summary": "Just what I've been waiting for!!", "unixReviewTime": 1291680000, "reviewTime": "12 7, 2010"}