{"reviewerID": "A356RFKNIG043B", "asin": "B00001P4ZH", "reviewerName": "K. Swanson", "helpful": [8, 8], "reviewtext": "5.5 starsFor my 200th review, I thought I'd sing the praises of one of the most useful and wonderful things I've ever owned, the PortaPro. I got these shortly after they came out, as I always longed for bass in my early Aiwa walkman (best of breed back then). These thangs changed my life!I still love music deeply, but back in school it was everything to me, my solace and balm and ecstatic release, hours and hours every day. I still wear mine daily while running the dog, walking the dog, and during various non-dog activities as well. They have tremendously balanced sound, lots of bass but very open and tight bass, not sloppy. The highs are clean and never harsh, the mids smooth and present. From Bach to the Beatles to Metallica to Charlie Parker, they deliver musical sound in a pleasingly full sound spectrum, top to bottom.For the money they are a miracle! They turn any mp3 player into a real sound machine, and BLOW AWAY any of the in-ear phones except for the thousand dollar customs (go to the HeadRoom online if you want perfect sound...they sell these alongside the best cans in the world, say no more). They deliver a surprisingly real soundstage and plenty of truly musical detail.Add to that two great features. They fold up easily and fit in your pocket (make sure to get the folding ones, worth the extra few bucks for sure), making them a perfect companion to tiny mp3 players (they are a perfect match with my Muvo 2gb player, such sound from such tiny devices!).But THE best feature of the PortaPros is the inestimable LIFETIME guarantee!! And they ain't whistlin' Dixie, folks, they mean it. I would know, as I've bought maybe four of these in the last 20 years, but I've owned about 14 new pairs total! Whenever the cords wear out or pull out of the ear (can happen, it's only thin rubber and wire, happens now and then when you're mountain climbing etc), I send them back to Koss with a six-dollar check (only gone up one buck in 20 years) and in a week I get a BRAND NEW pair. If that ain't taking care of the customer, what is?So, for coming through on their promises, and for making a truly great-sounding and very cheap-for-the-quality headphone, I give Koss total props and praise for this product, one of the best values I've ever encountered as a music uberlover. This and a Muvo 2gb player will set you back only a hundred bucks and then give you so much musical pleasure everywhere you go. I have enjoyed my PortaPros on mountain tops, inside the Louvre, Prado, MOMA, etc, by the sea, on ski slopes, on trains in the high alps with views to die for as Beethoven's Sixth took me to heaven, in the subways and busses of dozens of lands, in front of literally thousands of sunsets from Big Sur hills to Jamaican beaches to Mallorcan cliffs to Norwegian fjords and so on for twenty-plus years.I can only imagine how gratifying it must be for the spirits of the great composers to know that their music can now be heard in good sound anyplace on the planet. If we've achieved one useful thing as a species in the last thirty years, this is it: great portable sound that turns any post office line, etc from a nightmare into a dream.In fact, now that I think of it, no product I've ever purchased has brought me this many hours of joy, except perhaps some of my guitars. The Pros were 25 bucks in the mid-80s and are now only 35; with inflation it should be far more. Thank you Koss for proving that some companies still know what value is. This is a bargain of the highest degree. Whoever invented these, I LOVE you!Buy some for a friend; I have, many many times. And make sure to buy some for yourself; your life will become a lot sweeter, especially if you know how to let music take you far beyond this mortal coil.My highest recommendation.", "overall": 5.0, "summary": "Have used these daily for over 20 years", "unixReviewTime": 1206403200, "reviewTime": "03 25, 2008"}