{"reviewerID": "A3OKH5G69MS8D9", "asin": "1400532655", "reviewerName": "JRH \"j5094\"", "helpful": [7, 8], "reviewtext": "I agree with the other positive reviews. The color nook is an excellent reading machine, much better than either the Kindle or the e-ink B&W nook. Using the color Nook is totally intuitive with only a few positive surprises at some unexpected capabilities. The battery life is around 8 hours, so you will need to have your special recharging cord, which comecolor s with the Nook, handy. There are small imperfections in the Nook operating system that will get corrected as Barnes and Noble releases updates. The same was true with the Kindle and B&W Nook when first released. The key to a good reading experience with the color Nook is to turn the brightness down, way down. That way eye fatigue is minimal, similar to the e-ink B&W readers with similar brightness. Even with the brightness down, the contrast is excellent and the letters clear. When browsing the web, you might want to turn the brightness up a bit to beautifully display all those colors. The web browser is excellent. It works for email, especially Google mail.  The trick with the power limitations is to keep the brightness down when using the Nook as a reader and turn the internet off. Only turn the internet on when browsing or shopping. That way, when you put it down at night, the power level will be the same in the morning as it was when you went to sleep. Costing only $249 (Dec 2010) at Barnes and Noble, it's affordable and useful, especially if you travel.  The minus 1 star is for the few little glitches in the 1.0 operating system (based on Android 2.2), for the 8 hour battery life, and for the current lack of Apps. For what it is supposed to do, it does it well; it's better than an i-Pad (smaller, lighter, and far less costly). Upgrades and Apps will follow, making an excellent device even better.", "overall": 4.0, "summary": "Color Nook 1.0", "unixReviewTime": 1292803200, "reviewTime": "12 20, 2010"}