{"reviewerID": "A140SPVDYIRXZA", "asin": "B00001P4ZH", "reviewerName": "M5000", "helpful": [1, 1], "reviewtext": "I had a friend order this for me a while back from a site and I must say they're still working great. Excellent, audiophile-quality headphones for a decent price. So far, they've held up incredibly well over the year or so I've had them. They're very light and they haven't fallen apart or cracked anywhere at all, but still glad to have the KOSS warranty to replace them if I need to. The carrying case is a bit small so do watch out for that, but they will fit with a bit of finagling. I am a 19 year old college student, so I'm on the go a lot. I keep them in my laptop bag and they fit right in. If I decide I want to be a tool and wear them around my neck, they're nice because they automatically adjust to their smallest headband size, so they fit around the neck more like a choker necklace. I also love getting looks from people. Some comments include:\"I like your headphones.\"\"Those are some wacky ass headphones man.\"\"Those are nice how much did they cost.\"\"They sound amazing.\"et cetera.Pros:-I personally love the 80's styling.-Fold really small and are very portable. (Duh)-Come with a carrying case that feels very high quality and protects them from me.-The ear cushions themselves do not feel like the cheap foam that I was expecting, they're actually closer to Tempurpedic mattress foam, but a bit less squishy.-They (used to) automatically adjust to your head size without even having to touch them. I'll explain below.-Of course, the best thing, they sound great.Cons:-They fold small, but not flat. The headphones are still as thick, when folded, as the diameter of the ear pieces and such. I really wish they folded flat, that would make these truly great.-They don't FEEL all that well made. (But have held up thus far)-Over the course of the year or so I've had them, the metal headband part has bent slightly, but I imagine it's from the times I've tried to fold them up too small, so be aware of that, I'll explain below.-They will make your ears ache after a while (an hour or so).Meh:-I don't like how small the carrying case is, if it wasn't so well made, I'd think I was going to rip the seams or something when putting my 'phones away. Actually, it's not the case itself that's too small, as I can fit my MP3 player in the bag as well, but the opening. It doesn't open very wide. Be careful not to snag anything when putting them away.-Price is pretty cheap, but not exceptional, but I can't complain.-They don't noise cancel, but they're not noise cancelling headphones. I put this here because it's both good and bad. I like hearing my music in peace, but I also like being able to talk to my friends without having to remove my left earpiece from my ear. So they're okay for that.-They have a comfort setting on the sides, it's a switch you have to work. No, it is not an electronic switch for \"bass boost\" or anything like that, so don't get all excited. It's a mechanical switch that basically pushes the pieces against your head tighter. If you have it on the light setting and you move/fold the 'phones inward though, it'll automatically jump to the firm setting I think. It's kinda gimmicky, but it does adjust the tension SLIGHTLY. This will not prevent them from hurting your ears after a long period.So, as you can see, my cons and such are mostly about certain \"bonus\" features of the headphones. As a pair of headphones, they're the best I've ever had.Okay, so as I wrote above, there are two things I have to elaborate on:-Self adjustment: When I first bought these headphones, I could hold one side with one hand and simply lower them onto my head, and they would self adjust like some piece of alien technology. Neat. Well, it's been a while and, while I do my best to take care of my technology, all the folding/unfolding of them, due to the nature of the design, has bent the headband slightly out of the almost-perfect circle it used to be in. It does NOT look any different aesthetically, but it inhibits the little self-adjusting magical fairy gnomes from doing their job as well as they did originally. And by \"little self-adjusting magical fairy gnomes,\" I mean \"those black things on the metal headband that guide it through.\" Anyhow, not a huge deal, as it's still very easy to adjust.-Folding the headphones: As I've said above, the constant folding/unfolding of the headphones will (if you're not careful and you accidentally and repeatedly fold them up too tight without knowing) bend the metal headband to the point where it won't self-adjust as easily as it originally did. So, I'm going to help you figure out how to fold them, so you can avoid bending your pair on accident. Okay, so, it's pretty easy to do. The large plastic black pieces that hold the headphones fold inward. Fold them as if you were pushing them into your ears. They will swing into the center of the arc of the headphones about the little piece with the oval-shaped head cushions. Now, on each side of the hinge area, there is a loop and a hook. I don't remember which side is which, but you'll see it. It's the end of the metal headband. Hook the ends into the ends, and you'll have a nice neat circle. Now, you can move the little black slider pieces toward where you just hooked the headband to itself, but DO NOT GO TOO TIGHT. This is how you will bend them. I would say you can slide them about an inch and a half away from the hinge where the earpieces fold in. Now you should be good to go and they'll stay nice and folded.Anyhow, that's about all I have to say. These are well worth the money. I don't use them at home, because I have larger, more comfy headphones for that, but if I'm out? This is all I use. I generally hate earbuds, I always have, so this is how I listen to my music if I go out anywhere.", "overall": 5.0, "summary": "Amazing headphones! Still working great!", "unixReviewTime": 1359072000, "reviewTime": "01 25, 2013"}