{"reviewerID": "A2Q7QOQTWLLQMA", "asin": "1400532655", "reviewerName": "justsayyes", "helpful": [5, 5], "reviewtext": "I should preface this review by stating that I'm predisposed to liking tech gadgets that are a bit geeky, but do appreciate good industrial and UI design.The NC is really a great color eReader that also happens to have the makings of a terrific, Android based tablet.  BN literally buries the Android OS under a very thick custom UI and turns off many Android features.  This thick customized layer is what make the NC a great eReader, but a not so great a tablet. So while it is locked down, it does what its meant to do very well.One CAN get to non-BN eBooks in either the ePub or Adobe PDF format. Either format works, looks, and reads very well, easily as good as the best the market has to offer in terms of an eBook reading app.  The fact that BN chooses to bury the location of the downloaded non-BN content AND prevents one from creating shortcuts to either the book file or folder, placing said free books on the book shelf, or even listing them in your list of books is an annoyance to the tolerant and tech savvy.  To non-techies and those less tolerant of mucking about with a gadget, e.g., Grandma, it'd be a showstopper.  But then again, would such a user even KNOW how to get to free eBooks?Movies, again well-hidden in the file system, look great, but BN has capped the max resolution below the abilities of the screen AND the stock player is finicky about format.  For instance, my ripped for iPod Touch movies play fine.  My ripped for Droid Incredible movies aren't playable.  This despite both are MV4 files with AAC soundtracks.  The latter are higher resolution and bit rate so that's the issue.  Again, annoying, but not a real problem.The web browser is just fine.  Pretty much a stock Android browser so fast enough, compatible enough messing around, but if I were going to really do some research, I'd use my computer.With Android 2.2 coming in January, and a BN 'approved' Android market, it'll be an amazingly capable tablet for the money.And that is what one has to remember, it's an exceptional value given the hardware (fast processor/GPU combination, GREAT IPS LCD screen with better color/resolution then an iPad), 512MB RAM, expandable storage, great build quality), and has the best eReader app bar none.  Once Android 2.2 is added with some access to at least a few other apps like email, better browser, and a more format flexible music/video player the value will be simply unassailable...at the price.Pros:Great screen - overall looks, color quality, text quality, adjustabilityeReader UIMagazine format is excellentNewspaper and magazine subscriptions are month to monthBuild qualityIndustrial design - it actually sit flat on a table unlike the iWobleMicroSD supportForm factor - fits MANY of the now discontinued or about to be discontinued Amazon Kindle 2 cases!Battery life (for such a lightweight LCD based device in its size range)Full Android experience just a hack awayUnderlying processor/GPU/RAM is quite powerful though not tops, but more then capable of moving to Android 2.2 and possibly even GingerbreadCan read library eBooks if your local library carries themCons:THICK BN UI if you really want the tablet partsUI takes a few minutes to learnBluetooth not enabled (though it may be Bluetooth ready)No microphone (and therefore no Skype down the road unless the headphone jack can be used like early generation iPod Touches)Will need to hack if the BN Nook Market does not have what you want in terms of appsBN prices their books too highBN magazine subscriptions can be high, though some are a good valueNo camerasRecommended to the magazine/newspaper reader especially.  Best of the LCD eReaders, period. Great value in an Android Tablet.", "overall": 4.0, "summary": "Nice eReader/Tablet combination", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}