{"reviewerID": "A3IWSCI3KCL041", "asin": "1400532655", "reviewerName": "Kat", "helpful": [18, 18], "reviewtext": "First off, for those of you buying this product expecting the e-ink experience, you are wrong.  This isn't an e-ink screen, if that is what you are looking for, go with (a) the original nook, (b) the kindle, or (c) any of the other e-ink dedicated e-readers on the market.This iteration of the nook is marketed towards certain select categories of readers:-The Magazine reader-Students with text books that have graphics-Childrens' books with lots of pictures-Comic book readersIf you notice, these are categories of readers that benefit from the ability of the reader to handle color graphics, which is something e-ink can't yet do!PRICEFor the price, you are getting an android tablet with limited functionality, though, with some technical knowledge, it is possible to unlock this device to be able to fully take advantage of the android market (though it may void your warranty, so do it at your own risk).  Similarly sized android tablets go for prices starting at double the price of the nook color, but they come with full functionality.  Another device this has been compared to is the iPad- which runs at about twice the price as well for the very base model.  On the price point, you are definitely getting a decent deal, though, you are sacrificing some of the functionality for the the reduced cost.Also note, you are not getting 3G access or any other cellular service to access the market- unlike the original nook, that came with the free mobile access to be able to make purchases from the nook market on the go.  The likely reason for the lack of mobile access is due to the fact that this device runs a lot faster and features a full web browser- this increases the speed and easy of the user to access web content- which would be undesirable to any phone service that hosts access because it would reduce the service that their paying customers get.  Instead of mobile data service, users have the option of accessing the BN market and the full internet through wireless.  With today's cell phone technology, many phones are able to be set up as wireless hotspots that users can use to get access on the go- when they are away from their home network.  Overall, this isn't a big deal to me, but I am sure some original nook users depend on that free mobile service to get access to the BN market, so this would be a draw back for you for sure.WEIGHTHonestly, this device does run a little on the heavy side, however, I do believe that it is slightly lighter than it's predecessor.  Still, for the e-reader market, it is heavy.  For the tablet market, it is a little more reasonable.  The weight is a sacrifice, but as long as you aren't trying to read while laying on your back, you should be ok.USER FRIENDLINESS AND EXTRA FEATURESI find this device to be quite simple almost immediately.  Every function that I have looked for has been where I expect it to be and everything has worked smoothly for me.  The page controls while you read work great, and I love that they now give you the option to tap to turn the page rather than having to swipe like you did with the last version of the nook.The full web is pretty easy to use once you get used to typing on a touch screen keyboard (which is always annoying).This device also integrates with your facebook, twitter, and google accounts.  This is great for the avid readers that want to be plugged into their social media.Another feature that is nice to have on the reader is Pandora- it is a nice added bonus to have internet radio available on the reader.One thing I wish this device had was access to android market, but I guess you can't have everything.OVERALLI like this tablet.  I think it was a good buy and I would buy another one if this one broke.  For the price, you are getting an underpowered tablet, but it still has access to the full internet- which you can use multiple windows in.  It is primarily a reader, which makes me wish it were as easy on the eyes as e-ink, but for the market it is being geared towards, you can't really complain about that!", "overall": 4.0, "summary": "Excellent value for what it is- a reader with an LCD", "unixReviewTime": 1298246400, "reviewTime": "02 21, 2011"}