{"reviewerID": "A2SEQUFN8W7D07", "asin": "B00001P4ZH", "reviewerName": "Michael", "helpful": [1, 1], "reviewtext": "Just unboxed these today and started listening to them, and my first impression is that they're quite possibly the simplest and most functional I've ever used. No frills, no sexy designs, no gimmicks, no extra features, just GREAT sound and a fantastic, functional design that has withstood the test of time. I read the reviews that others gave and I thought \"they can't be THAT good,\" but for the price, I didn't have much to lose.Pros-Adjustable earpieces work surprisingly well; basically, it just gives you the ability to change how much pressure the headphones put on your ears. I find that my ears get sore with most headphones, but these are very comfortable.-The adjustable headband will fit any head size. I haven't got my hair caught in it yet.-They fold up for greater portability, and come with a very stylish leather bag (probably fake leather, not sure).-The sound is fantastic, better than anything in this price range. Clear mids and highs, and decent bass that doesn't sound distorted when I crank it.Cons-No manual/directions. They weren't that hard to figure out, but a simple sheet of paper with directions would have been nice. It took me a couple minutes to find out that you need to extend the headband, then clip together the earpieces, then retract the headband to make them small enough to fit in the bag.-I'm sure the foam earpiece covers will wear out, but luckily they sell cheap replacements.-The leather bag is quite small, and the headphones barely fit inside.Overall, great headphones. They do what they do, and nothing more. Perfect.**UPDATE, ONE YEAR LATER**: I accidentally pulled the cord out of my headphones. I shipped them to Koss and they sent me back a brand new pair for free (but I had to pay $9 for return shipping). No nonsense or forms to fill out, just a new pair of headphones in about a week. Koss, you've gained a lifelong customer.", "overall": 5.0, "summary": "Hi-fi sound, comfortable, totally unfashionable, and cheap with a lifetime warranty. Best headphones in this price range by far.", "unixReviewTime": 1346889600, "reviewTime": "09 6, 2012"}