{"reviewerID": "A1DBDCQASEIMDW", "asin": "B00001P4ZH", "reviewerName": "museken", "helpful": [1, 1], "reviewtext": "I bought the Koss Porta and the Panasonic-RP-DJS400because my Grado I80 poofed into disintegration. I'm poor so who cares. Anyway. Lets go. The Koss Portapros are great if you are using an I pod such device. The sound they give is very clear and crisp. I actually hooked them up to my Onyko 110 Rms surround sound system at 70 volume level and they did not blow they did crackle but these are not a stereo headphone but close.The Koss PortaPro is the best lightweight headphone for hearing all the great variety of pings and pongs with booms for the money. The displacement with these is incredible. The sound comes in so clear and uniform you almost think your in the studio but not quite. They are worth it.I bought the Pana...screw it look above.. ok.. These are great head phones the song displacement is no where near as good as the Koss. Koss has a lot higher range than the Panasonic. The Panasonic I think were designed to give a bigger bass with less treble in the high notes but they sound the best at the highest volume. I personally like that. You listen to music loud to get into it. So you have to listen to these cans loud to enjoy them. They are very good and better than AKG M80 MK11.. for the price(10 bucks cheaper that the Koss).So whos the best.The Koss Portapro got it down in the sound department and the construction is very good. Koss also stood up to my Stereo.The Panasonic sound muffled compared to the Koss but not that much. Panasonic also can be played on your stereo and they vibrate with bass on your head..this can be annoying though. The Panasonic are built though wires won't fall out and you can depend on them on a 110 rms system to deliver the better than paid price for the sound. They are ok no Sennheiser or Grado , Sony Mdr  sound quality.I choose the Koss for my Ipods and laptops... But I choose the Panasonic for a pretty good home surround sound system.  These are 2 different headphones. One is used for ipods and laptops the other is designed for everything. You like sound get Koss. You want everything with a lack in areas get the Panasonic. They are both constructed by someone who thought about the design. Boy is that important.", "overall": 4.0, "summary": "Good phones for an Ipod device", "unixReviewTime": 1325289600, "reviewTime": "12 31, 2011"}