{"reviewerID": "AC84VPM3281GV", "asin": "B00001P4ZH", "reviewerName": "Nando", "helpful": [1, 1], "reviewtext": "I got a pair of sportapros, KSC75s and these to see how the sound is in each of them when they are supposed to have the same driver. And to be fair, I was confused. Each headset has it's own distinct feature and advantage. Very frankly speaking, the portapro's price is what I believe Koss cashing in on the hype, since frankly speaking I do not see the 50% increase in any way.That being said, the portapros do sound the best of the lot, because it feels like it has a slightly wider soundstage. I guess that is since the sportapros have a solid plastic plate almost covering the speakers, hence kind of \"closing\" it up a bit. The KSC75 have it in them to sound as good as these two, but the lack of any pressure to hold the speakers closer to the ear result in most of the sound leaking out, hence the huge drop in bass. Press the speakers close to the ears with your hand and you'll get what I mean.Comfortwise, I would say the KSC75s win by a mile. You won't even feel that you have a pair of earphones on. The pads are good, comfy, and the same for all the three, but here the lack of pressure on the ears plays to the advantage of the KSC75s.Sportapros definitely look odd. The KSC75s look uglier. Love the design idea of the sportapro though, the conversion to a behind-the-head fit is genius, and definitely a worthy option given the metal band of both sportapro and portapro being always hungry for the hair follicles around it. The portas and the sportas both come with a nice faux leather pouch, in which you can curl both of them in to a cute little ball and toss in. the sportas came with a nice gold plated 3.5cm to 1/4\" adapter as well. Packaging wise, portapro is miles aahead of the rest (well they are almost twice as expensive as the sportapros!!). The KSC75s do not have any bells and whistles in the pack, but then again it's almost 1/3rd the price of portas.The only concern in any of the three headphones was the adapter of the KSC75s, which do not have any protective ridging for the wires coming out of it, make me skeptical about the longevity of the connection.The KSC75s are the best bang for the buck definitely. But again, even the most expensive PortaPro is less than half the price of it's closest competitor from another company.But seriously kudos to Koss for making some of the best headphones I've heard in my life and at prices the others can only go green on.", "overall": 5.0, "summary": "Comparison between PortaPro, SportaPro and KSC75", "unixReviewTime": 1361404800, "reviewTime": "02 21, 2013"}