{"reviewerID": "AOOZR8IN9NYTA", "asin": "B00001P4ZH", "reviewerName": "Nils Valentin", "helpful": [1, 1], "reviewtext": "I bougt my KOSS Porta Pro in 1992 for usage on a Walkman.The day I bought it I believe must have changed my life ;-)Up to now (16 years !!) I did not find any portable headphone that delivers more sound.What makes this headphone so special is the dynamic it reproduces.The bass and treble that comes from this tiny package sounds like you are in front of a speakerwall.There are no words to describe the atmosphere it creates.When listening to classic music concerts its like you are there.When listening to a singer its like the stage is in front of you.When listening to pop, rock, disco, dancefloor, techno - you name it - it delivers the pump you would expect from BIG speakers.The clear vibrant trebles and the full deep bass it produces are just stunning.I still remember the first time I used those, the sound was so amazing it gave me this warm fuzzy feeling in the upper stomach area and left me speechless for a moment.Note that over time the earpads and the pads which are supposed to hold the headphone in place will wear out and eventually come off. This can be a major turnoff when you want to go jogging with it.I dont recommend wearing them long time or when you want to sleep (because of the pressure on the ears).The little blue \"comfortzone\" switch is supposed to set how firm the headphone is attached to your head. I don't think that's working as advertised, whatever the settings it didn't feel any different for me. The headphone is very light and foldable. When folded they are the size of a small apple.The headphone comes with a softcase.Summary:The speakers are not as compact as in-ear plugs but definitely have a better form factor than most pro headphones.The fact that mine are worn out after many years of usage but still used confirms that the sound itself is well worth the price.When listening - especially first time - be prepared to be left speechless. As mentioned above they have a few short comings (which product doesnt ?) but it is still a product with well deserved 5 Stars !!", "overall": 5.0, "summary": "Portable sound quality !!", "unixReviewTime": 1224288000, "reviewTime": "10 18, 2008"}