{"reviewerID": "ART6PY1KQ0CR7", "asin": "B00001P4ZH", "reviewerName": "Nuclear Avenger", "helpful": [1, 1], "reviewtext": "I bought these after comparing multiple different headphones.  I was going to choose other headphones although the review on cnet changed my opinion.  There are really only two upsides to these headphones.  1)  They sound good, particularly in the low frequencies, and 2) they fold up small.  So what are the downsides?  1)  Any time you take them off they shrink back down to their original size.  You have to readjust them every time, which gets annoying fast.  2)  The things looks hideously ugly.  3)  Even though they have a setting to control how hard it squeezes you head, the pad above the speaker part rests on the side of your head and it will soon start digging into the side of your mellon.  Admittedly I have a larger than normal head, but these were very uncomfortable to wear for extended periods of time.  I finally fixed this problem by bending the metal band out (a lot).  This modification made it so they don't fold up as small anymore.  4)  There is a hook above the right ear that you use to latch the headphones closed when stored.  This hook rubs on my ear if I'm not careful, which very quickly causes pain to the top of my ear.  5)  If the band adjusts while you are wearing the headphones there is a good chance it will suck your hair into the band which isn't a problem until you try to remove them, which quickly becomes unpleasant when you realize what has happened.  As a note, my hair isn't long, in fact I keep it with a military type crew cut, so this is a problem for anyone with head hair, regardless of length.Overall, given the choice to go back in time, I would have selected different headphones.  I got these on sale, and the price is pretty good, however they just aren't very comfortable.  Bending the top band helps, but then they don't fold up as small.  They do sound really good, but they also don't block out outside noises.", "overall": 3.0, "summary": "sound great but...", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}