{"reviewerID": "A1WKUY7T0EM0GM", "asin": "1400532655", "reviewerName": "Krystal James \"genie\"", "helpful": [4, 4], "reviewtext": "High Points:-Very Responsive Touch Screen-Touch screen is easy on the eyes even though it's back lit-Page Turning (very fast, instant, and seamless - no flashing or delay - my favorite feature)-Very organized menu-Decent sound quality-Physical home screen button (very useful)-Free eBook Fridays curtesy of Barnes & Noble-eLend technology from your local library (if they offer this service, mine does, it's a very nice feature to have, only reason why I chose a Nook over a Kindle)-The kids books are fun to read on this-The internet browsing experience is quite nice. Web pages load quickly-The interface and device are both very beautiful-Great accessories available for item-Great Size - fits easily in my hand-Back Lit display is very very nice to have - no need for a flashlight - can read in the dark)-Very easy to book mark pages-Playing games on this are a lot more fun than playing games on the original Nook (thanks to the touchscreen)-Barnes & Noble eBook store is quite nice and easy to browse-The on-screen keyboard is also niceLower Points:-BATTERY LIFE (if I used the internet at all, I'm lucky if it lasts through the day on a full charge - with the internet off, it still only last about 3 days if you use it everyday - the standby battery life (with the device in sleep mode-not off) is pretty good though.-No physical page turning button - sometimes I advance or flip backwards by accident-Weight (not a deal breaker, you get used to it, but it could be a lot lighter)Conclusion:I love love Love my NookColor. I take it with me everywhere I go. There's no 3g option that I'm aware of, but I only browse the internet with I'm at home anyway. The battery doesn't last long enough for you be connected to the internet too often anyway. There is no cool page turning animation like on an ipad, it just changes instantly to the next page, which is still a great feature on this item. It's not so great as a tablet though. The internet browser is great, but there is no flash support (not for the ipad either though) and there are few apps. That is not important to me as I'm using this as an eReader and occasionally play the included games on it when I'm bored (sodoku, crossword, chess). I like that you can play music and listen to it in the background. When connected to the internet, the Pandora Radio app is nice to have in the background, though I've found it rather difficult to turn off when I'm done with it.I highly recommend this to anyone who wants an eReader and doesn't care if they have to charge it back up every few days.", "overall": 5.0, "summary": "NookColor - Great eReader, Not So Great Tablet", "unixReviewTime": 1303603200, "reviewTime": "04 24, 2011"}