{"reviewerID": "A3P2RMAC6YQ51V", "asin": "B00001P4ZH", "reviewerName": "P. Maurer", "helpful": [5, 5], "reviewtext": "I've had a terrible time finding headphones that I can wear for more than 5 minutes. First, I wear glasses, so that rules out a lot of \"over the ear\" headphones because it pushes the frames right into the sides of my head. The alternative, then, would be to use earbuds. I can't use earbuds though, because the insides of my ears are extremely sensitive due to multiple infections as a child. I didn't think I had an alternative. Fortunately, I came across these.For comfort, these things are a dream. I actually forget that I'm wearing them sometimes, which is a first for any headset I've owned. The pressure is applied above the ears as much as I'd like (it's adjustable) and I can change how much pressure is on my ears and the side of my head.Durability-wise, they *seem* to be fragile--specifically, the part where the speakers connect to the headphone frame--however I've often stuffed them in my coat pockets (yes, they're that small when folded up) where they've been squished against my shoulder bag and I've dropped them several times. It's all part of being a klutz. I have yet to do any damage to them, however. That's more than I can say about my portable MP3 player.Complaints: The bag seems a bit small, even with the \"correct\" way you put them in. I would've liked it if they made the opening a touch bigger so you could slip them in and out more easily. I've stopped using it altogether, but I use them every day for at least an hour so it doesn't matter too much for me.As for quality of sound, they've been excellent for me. I listen to a wide variety of classical, rock, and world music, and it's handled all of them quite well. I don't know how this would compare to, say, a $100+ headset, but for the price listed or under I think it'd have to be the best out there. For comfort, I'm not sure if these can be beat.", "overall": 5.0, "summary": "If you seek comfort above all, this is an excellent choice", "unixReviewTime": 1168300800, "reviewTime": "01 9, 2007"}