{"reviewerID": "A32LX4XJ2LU740", "asin": "B00001P4ZH", "reviewerName": "PositiveLogic \"Looking for Positive, Not Fear...", "helpful": [4, 5], "reviewtext": "I have been a Portapro enthusiast for the past 4+ years. You've already read the hundreds rave reviews of the Portapro's phenomenal sound and being that I am in agreement with them all, I have little to add. I have several head phones from different manufacturers such as AKG, Sony, and Sennheiser and these beat all the more expensive open air and closed air headphones I have. The only headphones that are better are in-ear variety which I use conditions with a lot external noise such as on planes and working out at the gym.However, recently I have fallen out of love with my Portapros and I think there are a lot of Portapro users who are in the closet about this particular design flaw that I'm about to elaborate on. First of all, let me explain that I have several mp3 players. Recently, I acquired mp3 players with large amounts of flash memory (16gb). Because of the long battery life inherent in these players (25 to 30 hours), I'm pretty much listening to them all day long, along with my Portapros. I wear these instead of the better sounding isolation earbuds because I need to hear the phone and be able to talk to people while wearing them.With my extended hours of usage, I've been noticing that when I remove my Portapros, about 7 times out of 10 they pull at least one of my hairs out. I have developed a method of slow removal combined with pushing together adjustable metal frame that reduces the instance of this. This acts to release any hairs that have been captured by the sliding mechanism. However, because many times, I have to answer the phone quickly, I find myself having to pull off the Portapros at more normal speed -- and this results in too many instances of unauthorized hair removal.Because of the great sound of the Portapro, I have been will to put up with it...until last night.Last night I was at Office Depot and on a whim I purchased the Sony MDR-E828LP Fontopia Earbuds (with the wind-up case) for about 10 bucks. These are the most generic basic earbuds that Sony makes. Over the years, I have owned several of these and my experience with them was that these were entry-level headphones with entry-level sound. But when I plugged them in, I was in for a pleasant shock. These sounded great. They must of done some design improvements since I last tried them. Excellent full spectrum sound for metal, jazz, classical -- everything I listen to. Tight, natural bass response that, in my opinion, is at least 97% of the greatness of the Portapro -- all for a measly 10 bucks. Better sounding than the other headphones I have that cost several times as much.Long story short...I've switched to Sony Fontopia's for the time being. The fact that they're not \"in the ear\" allows me to hear the phone and talk to people. But best of all -- no hair pulling.I still like the Portapros for their sound. In fact a week ago, I wrote an email to Koss explaining the problem and they politely explained they were working a solution that didn't compromise the positive qualities of the current design.That's cool. I'll be waiting. For now, I've hung up my Portapros. If there are other folks out there who have a problem with hair pulling like I did, the Sony Fontopia are a nice alternative for the being.Revision 2/28/2011In recent months, I've migrated back to using my Portapros. I'm just more careful when I take them off. There's nothing else like the sound on these babies. While I hope you guys fix the hair pulling, you're back to 5 stars.", "overall": 5.0, "summary": "I'm back...the sound can't be beat!!!", "unixReviewTime": 1265500800, "reviewTime": "02 7, 2010"}