{"reviewerID": "A1JRB7WNDFJSZP", "asin": "B00001P4ZH", "reviewerName": "R. Davidson", "helpful": [1, 1], "reviewtext": "I want to like these headphones.  I bought a pair of SportaPros and wanted a second pair, tried the PortaPros as they seemed to get slightly better reviews.  Now I am wondering - what are people listening to?  The SportaPros sound so much better than the PortaPros that I have to believe something is wrong.  No depth or layering or punchiness to the PortaPros.  Portas are mostly defined by over-response in the treble range.  I'm getting sound out of both earpieces so there is not a missing channel.I've heard all about the \"burn-in\" for headphones, but the Sporta's haven't needed that and I'm not sure how much time to waste on these Porta's.  I also own a pair of Sennheiser HD238 which beat the heck out of the PortaPros but are somewhat on a par with the SportaPros.  Now the Senns seem to be sounding better with more use as I did not like them as well out of the box, but do now.  Or my ears are getting \"burnt-in\" to their sound as I think happens also.Is there something wrong with my PortaPros?  I have no idea why there would be such dramatically poor quality in a product which most people seem to rate higher or on a par with the other phones I have.** Update 1/28/11 - another thing with these phones - the channels are reversed!  Listening to \"All I've Gotta Do\" by the Beatles (old stereo, music one side vocals the other) I have 3 sets of headphones where the vocals are right channel and the music is from the left channel.  On these, it is reversed (and yes I do know how to put them on, triple checked etc).  WTH is the deal with these?** Another update - A1 Accessories is sending me a replacement pair today even though I've already lost all my original packaging and stuff.  So many thanks to them for so far great customer service.  I'll post on the new ones when they arrive.** Update 1/31/11.  Quick service from A1 Accessories to replace my headphones and now the sound is much better.  Now I can compare these to my other phones and the sound is definitely comparable (and channels are no longer switched).  I am finding that the Firm - Light settings are very touchy.  They don't want to stay on the \"Light\" setting easily but that is a minor problem.  I am now much happier and have changed my stars review to reflect this.", "overall": 5.0, "summary": "Did I get a bad pair??  Apparently so...", "unixReviewTime": 1295481600, "reviewTime": "01 20, 2011"}