{"reviewerID": "A3VI7503NDDODN", "asin": "1400532655", "reviewerName": "Lisa M. Scolaro \"Sympathetic Mom\"", "helpful": [4, 4], "reviewtext": "REVIEW....Part 2:Loved my Nook Color before the new software updates and app additions...but now!!  WOW!! I own a Motorola Xoom Tablet and have only had it for about a month.  If these updates had come a month earlier I may never have purchased the Xoom, but with that said, and now that I have both, their are differences that I'm glad to own both.Nook Color for the value:emailgamesadobe flash (you tube and much more)musicreading (books and magazines with brilliant color) prefer the Nook for reading bookssurfing the internetsize (easy to hold)and for women it fits in my handbagVersus...Motorola Xoom:emailgamesadobe flash (you tube and much more)sharper picture when viewing movies/videosmusicreading (from kindle and nook downloads to the Xoom with their apps)surfing the internetsize (being larger for a better viewing experience) it won't fit in my handbag (but that's mine)quality is amazingmuch more....There are many many things similar to the Nook versus Xoom or Ipad but the value of the Nook Color over the others isthe best and for your average user who just wants to surf the net, view videos, read your email, listen to music andplay (at the moment limited games) and to read books (size for holding to read is perfect) the Nook Color is the BEST valueand it won't disappoint.1st review:Received my NookColor for Christmas and waited until now to write my review.  I wanted to make sure what I write will help others.  Take this device for what it is....a e-reader and not a tablet.  I love it for reading ebooks and emagazines.  A perfect size for books and just a little too small for magazines but if you have patience you can make any page larger just by pinching your fingers open.The color of photos are amazing and beautiful.  I can view just about any website, but not videos from flash.  Again this is not a tablet. But I can view many Youtube videos.  I have downloaded my own photos and they look great.I cannot open my emails from my carrier (comcast), not sure why. The website...but not the individual emails from my contacts.The touchscreen is pretty sensitive and sometimes I end up having to do things twice.I gave my review four stars only...because of my email restrictions and the sensitivity of the touchscreen.Overall I do love the size and the many things you can do with the NookColor.FYI...I typed this review on my NookColor...", "overall": 5.0, "summary": "GENIUS!!....for only $249.00", "unixReviewTime": 1298851200, "reviewTime": "02 28, 2011"}