{"reviewerID": "A3F0HJLB79JQJ4", "asin": "B00001P4ZH", "reviewerName": "R H", "helpful": [4, 4], "reviewtext": "I'm admittedly sort-of a brand-whore when it comes to sound. I like my Klipsch, Sennheiser, Grados, etc. I dislike BOSE for the cheap materials, over-marketing business model. I'm annoyed by Beats headphones that are just Monster headphones with Dr. Dre's name and over-boosted bass tones - but sold in awesome bright colors. Hey, I respect that Beats is bringing attention back to cans, I really do, but they're not good sounding headphones.I have a nice pair of Sennheiser noise-cancelling headphones I can't always wear due to headaches from the noise cancelling feature. Also if I'm doing activities, the Sennheisers are huge and cumbersome, not practical if I'm running, washing my car, or otherwise moving about quickly. I have a great pair of Klipsch earbuds, and those are fantastic for running. But they have poor bass response.The Koss PortaPros are fantastic, almost mixing the best of both and leaving out the extras. It does not sound as nice as the either of the above mind you, but you won't be left complaining. The bass response will destroy those of any earbud-style headphone, but you know that. Koss' drivers are more than capable of handling the meager power they receive, and they do well to replicate bass from an on-the-ear design.The downside? Yes, the looks. Hey, they're not bright-colored pastels that scream \"LOOK AT ME!\" In fact, they are ugly and say \"stay the hell AWAY from me!\" but if you're not buying headphones for the image (and you really shouldn't be), then you shouldn't care. They look dorky for a reason, though: each side has a switch that allows you to set firmness, allowing the buds to \"flex\" outward. This makes for very comfortable wearing. So if you're not trying to impress the kids at your high school and instead want to save some money and get good sound, check out the Koss PortaPros.The best part is they're so inexpensive, if they ever do break or get lost, stolen, etc.... you don't care.  If my brother lost his Dres, he'd kill somebody. But my PortaPros? It's $25 bucks man. I just go order another. :D", "overall": 5.0, "summary": "Above-average headphones at a below-average price", "unixReviewTime": 1387756800, "reviewTime": "12 23, 2013"}