{"reviewerID": "A6FIAB28IS79", "asin": "B00001P4ZH", "reviewerName": "Samuel Chell", "helpful": [7, 7], "reviewtext": "Having recently sold my Sony MDR-V6 headphones (good cans but no longer practical for my purposes), I succumbed to the frequent hype surrounding the Koss PortaPros and ordered a pair, as a back-up to my Sennheiser PX100s and, if necessary, as a replacement.They certainly are no replacement, and I have yet to decide whether to keep them as a back-up.  Headphone judgments can be highly subjective, but here's one consumer's observations:1.  The PortaPros have a reputation as \"retro-stylish\" but providing cutting-edge, compensating sound quality.  My first impression upon wearing them, even before connecting them to a CD player, was that the comfort level is not equal to the PX100s.  I was highly conscious of an awkward tin band around my head and frankly baffled by the resistant 3-level \"Comfort Zone\" switch.  Admittedly, the initial sense of discomfort dissipated once the sounds of my player were picked up by the headphones.  They're indeed high efficiency (demanding less volume than the PX100s), producing an open, \"non-canned\" and transparent sound in the mid-range and offering  impressive detailing of the acoustic double bass on the low end as well as the drummer's ride cymbal on the upper end.2.  I began doing numerous A-B comparisons, noting that the PortaPros were immediately more arresting, producing bright, \"forward\" and \"instant\" reproduction of all frequencies, at times making me wonder if the PX100s weren't just a trifle muddy.  But soon the PortaPros began to sound slightly \"edgy\" and \"aggressive\"-- less balanced in their overall sound compared to the ever-pleasing Sennheisers.  Then an Achilles heel became unmistakable on a CD on which the PortaPros began to break up on the notes of the double bass unless I backed off on the volume by 50%.  With the PX100s the same CD produced only the slightest hint of distortion, which vanished when I cut back on the volume by a mere 10%.  Soon I wearied of the comparison: the PX100s had won the argument, and rather convincingly at that.  They're slightly more cumbersome to fold up and reinsert in their hard case than the PortaPro's (at least without practice), but that slight downside had never seemed more insignificant.3.  Neither of the above headphones would be ideal for monitoring or DJ work near a microphone,  the PortaPros more so because of their extreme sensitivity, which would certainly invite feedback.  For that sort of work, I depend on the largely overlooked Koss UR40s.  For comfort, frequency range, balance, and long-term wearability I would take these full-sized (but extremely lightweight) headphones over not only the PortaPro and PX100 but the Sony phones mentioned above. The UR40s handled the overly \"hot\" bass with absolutely no incident or rollback requirement.  Their weakness is shoddy workmanship (I'm on my 2nd pair): the head webbing came detached after a couple of months' use and the conducting wire is both excessively thin and short.  (If you purchase either Koss, be sure to save all of the order materials to be able to avail yourself of Koss' famous lifetime guarantee).", "overall": 3.0, "summary": "Koss PortaPro vs. Sennheiser PX100 vs. Koss UR40", "unixReviewTime": 1237507200, "reviewTime": "03 20, 2009"}