{"reviewerID": "A3UI6CTFWL721L", "asin": "B00001P4ZH", "reviewerName": "S. Naimpally \"avid music and movie fan\"", "helpful": [17, 18], "reviewtext": "These headphones are an amazing value and very well designed. The headphones are small, yet the design is such that they firmly yet comfortably fit on your head. There is a small button allowing adjustment of how much pressure is exerted. The drivers are nicely padded and there are pads that sit on the temple, ensuring that the drivers sit parallel to the ears.The sound is superb, especially considering the size of the phones. The bass extension is very good and satisfying, much better than comparably sized phones. The overall sound is neutral and non-fatiguing so that you can listen to them for hours at a time without getting tired.One thing to note is that headphones typically are \"open\" or \"closed\" design. A closed design uses heavy pads to block out external noise and are meant for use in noisy environments. Open headphones, like the Koss PortaPros, are designed for use in quiet environments. So if you want phones for use in the subway or the airplane, these are not designed for that type of use.Another very important feature of Koss phones is the lifetime warranty. I have had my Koss PortaPros for over 10 years now. I have accidently snagged the wires and ripped one out. I sent them back to Koss with a check to cover the nominal shipping and handling charge(see their website for details), and they promptly refurbished my headphones, and even put on new pads to replace my old pads! Other manufaturers would have forced me to buy a new pair of phones. So if you expect your phones to take some punishment during use, the lifetime warranty is a big plus.Those interested in small, open style phones may also want to check out the Sennheiser PX100, which delivers similar performance, though the PX100 has less prominent bass and more mid-range; the typical Sennheiser sound. Both are excellent values but in my mind, the extra bass output and lifetime warranty make the Koss phones a slightly better deal.", "overall": 5.0, "summary": "Excellent headphones for portable electronics", "unixReviewTime": 1128384000, "reviewTime": "10 4, 2005"}