{"reviewerID": "A35TD8QAUMV0DB", "asin": "B00001P4ZH", "reviewerName": "Stephen G.", "helpful": [40, 44], "reviewtext": "Take what other reviewers have said about these headphones, believe them, and then multiply it by 100. I received a pair of Koss UR-20s as a gift years ago and loved them  so naturally I looked to Koss again when replacing my portable/on-the-go headphones. After buying a pair of KSC-55s, which sounded great but were uncomfortable for me personally, I hopped on Amazon and found everyone raving about the PortaPros. I figured they were good, especially considering that the design seems unchanged since the 1980s (which has to mean something), but I also figured that this was one of those things that was just too good to be true. However, these are bar-none the most amazing headphones I have ever put on my head. Listening to some of my favorite songs for the first time was one of those 'wow' moments where you realize you have found something that changes your expectations completely. The bar will be raised the instant you hear the bass response and incredible acoustic qualities of these light, comfortable headphones.I don't know what I'm impressed with the most: the amazing bass, the excellent stereo division, or how loud they can get! These things are just as amazing as most of the reviews show them to be and then a lot more... I was worried about the eighties styling, but in person they don't look bad at all. I hate headphones that scream for attention, but these don't look like that when you have them on and I have already been wearing them in public (something I didn't think I would do after only seeing the picture of them online). And even if they're a bit outdated in appearance, the design is so functional you won't even give looks a second thought after you put them on.One thing is for sure: these things have plenty of bass! Not too much (not \"boomy\"), but they seem properly tuned for listening to things without \"bass booster\" turned on, which I like. Even with the bass settings adjusted high, the bass remains clear and crisp. I'm not sure how much power these can handle without damaging them, but I listen to them very loud and they do not sound distorted or stressed at all. After a few days my left speaker began making some weird noises and it ended up being a hair stuck inside the headphones that I cleared out with canned air. Something important to consider is that these are very open and airy headphones and the treble carries very well outside the headphones (so someone nearby could definitely hear what you're listening to if you have the volume up loud).Others have mentioned that they felt the headphones were too tight feeling, but I have a very large head and they fit me without a problem. However, if I will be wearing them for an extended period of time I always set them to the \"Light\" setting on the comfortZone control (which divides the side pressure of  the headphones with your temples rather than just on your ears).I already had headphones I was pleased with (Sony MDR-G52s and Koss UR-20s) but I wanted a set of small, portable headphones for use with my laptop and these are perfect. The folding design isn't something I necessarily wanted, but it is nice. The carrying case they come with (a leatherette bag) is a slightly tight fit and I probably won't end up using it much since it is not a hard case that would protect them from shock or crushing. Some others have mentioned that they feel delicate or are easily broken, but compared to other small headphones I have had they seem very well built and equally strong considering their light weight.While I wouldn't say these are bad things about the PortaPros, it is worth mentioning that the headband is metal and will occasionally snag a hair as you adjust it on your head, and that they don't fold down as small as you might think they would so don't expect to put them in your pants pocket or something. Considering these are the worst things I can come up with to say about the PortaPros, they are nearly perfect in my book.I can't say enough good things about these PortaPros! They're simply amazing. These are the first headphones (or speakers) I've had that sound absolutely awesome without adjusting the equalizer or pumping up the bass. They sound good on everything from R&amp;B to Country and everything in-between. I've been especially impressed that they pull the bass and highs out of a song without getting that shrill, tinny treble that plagues so many headphones. If there ever was a question about the quality of Koss stereophones in my mind, these PortaPros have put it to rest and made me into a lifetime customer! If you're like me you'll wish you had discovered these legendary headphones (haha! how often is that said?) years ago...", "overall": 5.0, "summary": "You won't believe your ears", "unixReviewTime": 1083369600, "reviewTime": "05 1, 2004"}