{"reviewerID": "A3JN3KKON08QBM", "asin": "B00001P4ZH", "reviewerName": "Steven Hendley", "helpful": [1, 1], "reviewtext": "I bought these headphones after my Koss earbuds finally developed a short after many years of use. I stayed with Koss because I had been very satisfied with these earbuds as a significant improvement over the apple earbuds for an ipod. And I was hoping for a bit of an upgrade with these headphones. But I didn't expect this significant an upgrade. When I first listened to them I was a bit overwhelmed by the bass. I had some concerns with an overly heavy bass because of some reviews mentioned this. But the more I listened, the more I loved it. I was simply hearing the bass in a way I had been missing with my earbuds. And I mostly listen to jazz with these headphones so it's not like I'm looking for a heavy rock bass here. I was just very happy to hear the bass as well defined as it was with these headphones (right now Gary Smulyan's baritone sax sounds amazingly full!).. And the rest of the sound is excellent as well. My only regret now is I'm getting used to this much bigger sound so I'm less blown away by what I'm hearing than when I first made the upgrade. But I have only to listen to some earbuds to get that &#34;wow!&#34; feeling again.Another feature which attracted me to these headphones which didn't dissapoint is their portability. I like to take my earbuds/headhones with me when I travel and don't want to lug big headhones around which take up a lot of space. These headphones fold up into a kind of ball which almost fits in the palm of my hand. And they're very comfortable to wear. The &#34;comfort zone&#34; settings come in very handy. Moving the setting from &#34;firm&#34; to &#34;light&#34; makes a difference you can easily notice in how the headphones feel. I find that I prefer the setting right between the extremes (there are three settings in all).So, unless you've got something against '80s style and are concerned that you're just going to look too wierd with these things on, they are the perfect listening device to use with an ipod (or, at least, that's what I use them with) that combines great sound and portability.", "overall": 5.0, "summary": "Best headphones since sliced bread!", "unixReviewTime": 1361750400, "reviewTime": "02 25, 2013"}