{"reviewerID": "A2VV9CK8ZN1DQQ", "asin": "B00001P4ZH", "reviewerName": "Techie Camp Director", "helpful": [5, 5], "reviewtext": "I am most certainly not an audiophile but these headphones came highly recommended not only from other sites but from other people I know. They are a classic design from the eighties which is now nouveau chic again.I am a heavy heavy tech user and like to use high quality items and I demand a lot from them.With that said these are my new favorite headphones (the one's that travel with me everywhere).I was skeptical even after reading all the reviews, thinking \"How could something so reasonably priced really be as good as all of these reviews suggest.\" Well they can be and are, consider my doubts banished as I was pleasantly surprised. The reviews are correct, this is Koss' masterpiece, homerun, the epitome of what Koss represents.I have a pair of Bose Triport Headphones and Senneheiser PX200's both of which are excellent headphones....and these Porta Pros are commandingly better (the Triports are \"warmer\" and the Senneheisers crisper, but I like the sound of these best as they are the cleanest clearest balance of warmth & crispness).They are light weight, foldable, exceptionally comfortable and of coarse the sound quality is excellent.Actually, I cannot say enough about the sound quality, it is well balanced, full, hits the highs, lows and everything in between accurately. They produce clean scratch that pristine audio that is a pleasure to listen to. I find myself searching out music that can challenge or push these and they just keep on producing beautiful music to my ears.Essentially they are awesome. (period) They sound and function better than headphones easily two or three times their price, look cool if you're into retro and they are dirt cheap.CONCERNS:The only concerns if any are that the part that connects the earpiece to the headphone part doesn't seem very robust and may break eventually(though I haven't had any issues). Some may find that the metal headband might catch on their hair (something else I haven't had an issue with, though I have short hair) and finally, the foam pads over the earphones sort of scream I'm cheap and I will wear out on you. In defense of them, it does keep with the whole retro thing, it's really comfortable, it's easily replaceable, and they are in fact inexpensive, essentially who cares. Many of these small things have been ever so slightly adjusted on the Anniversary Edition of these gorgeous nearly perfect headphones (but for twice the price I wouldn't bother). Oh and Koss has an included lifetime warranty for the life of the product, ridiculous!(amazing) For me this tosses basically all of the concerns out the window.Conclusion:-Beautiful design and function (form and function married beautifully, just one of those products that is right on, balanced, perfect in most ways) Clearly the designers got it and knew what they were doing when they made these.-Koss' famous lifetime warranty.-Worth every penny, I would feel good about paying twice the price and wouldn't bat an eye. Awesome part is you don't have to. I would buy them again, for myself or others.", "overall": 5.0, "summary": "Maybe the best Bang for your Buck Headphones Ever.", "unixReviewTime": 1260662400, "reviewTime": "12 13, 2009"}