{"reviewerID": "A13OA6RAGTF183", "asin": "1400532655", "reviewerName": "M. Prince \"No second chances\"", "helpful": [5, 5], "reviewtext": "I went into the tablet market for two reasons: (1) I read mostly inside in the evenings and was tired of needing a book light for the e-ink reader and (2) I wanted to consolidate my travel electronics from phone + ereader + notebook.  The prices of straight tablets were outrageous to me when my primary purpose was to eliminate taking the laptop along to be able to review email and do moderate web browsing on a decent sized screen (the phone was way too small).  After reading several reviews and recommendations, I settled on a used Nook Color for both price and performance.  I have not been disappointed.  I have rooted my device for a full blown Android experience and a far superior web browser but rooting is not needed for the basics. I'm just someone who likes to tinker.Everyone needs to understand, this is an e-reader first and a tablet second even when rooted.  At $200, you cannot expect what you would get with a $500-$600 device.  But, it does what it is intended to do quite well.  At 7 inches the screen is comparable size to most e-readers and that was important to me for portability.  I simply swapped the e-ink reader for the Nook Color and it still fit perfectly in my purse.  The Nook Color is also really good for reviewing emails and smooth web browsing.  My rooted device has an overclocked processor so I have no problems with speed.  It's perfect for quickly reaching out to the web to check the latest news, weather, etc. and then get right back to reading my books.  I haven't had many problems running other Android tablet applications and have found that the problems I have had seem to be common problems with the applications themselves.If you want a premium e-reader, this is a super nice product at a great price.  If you're looking for a budget tablet without all of the bells and whistles (camera, gps, microphone) but that will handle the basics of email, web browsing, Netflix, Hulu Plus, and other consumption tasks, this is more than adequate and enjoys much more favorable reviews than similarly priced tablets (with the exceptions of the Kindle Fire and its own successor the Nook Tablet).  The bottom line with this little marvel is to keep your expectations in line with what you're paying for and what you're not paying for. If you expect a $200 version of the standard bearer (i.e IPad), then you'll be very happy.  If, however, you're expecting a $200 equivalent, then look elsewhere.", "overall": 4.0, "summary": "Great as a backlit ereader and more than adequate as a tablet", "unixReviewTime": 1324512000, "reviewTime": "12 22, 2011"}