{"reviewerID": "ARM4MTNZK1975", "asin": "B00001P4ZH", "reviewerName": "W. Downs", "helpful": [2, 2], "reviewtext": "I've owned many different headphones before, including aSony MDR-V6 Monitor Series Headphones with CCAW Voice Coil(an incredible headset in its own right) and listened to some high end sets that friends have including a set of AKG K701 Studio Headphones, and these are, easily, my favorite. I will always love my Sony MDR-V6, but due to a recent change in my listening needs, I needed a pair of open cans, portability being a huge plus. I considered the Grado Prestige Series SR80i Stereo Headphone but those didn't really look very comfortable, and aren't particularly portable. I gave these a shot, and considering their price and heritage, why the heck not?I have absolutely nothing but praise to say for these cans. They are amazingly comfortable, probably the most comfortable set of cans I own. The ComfortZone system really works, and allows you to balance pressure between the ear pads and head pads. Why Koss or another company hasn't implemented this system in newer sets is beyond me, it allows you to releive the pressure on your ears when your just kicking back and listening, or increase the pressure when you're moving around. Of course, these aren't sport phones and are less than optimal when you're very active, for that I would recommend the less comfortable but acoustically similarKoss KSC75 Portable Stereophone Headphones. I haven't found the headband to be uncomfortable at all, but I do have quite the thick dome of hair protecting it. You might think this would cause the hair pinching problem some have complained about, but I haven't had that problem yet. The portability is respectable, they do fold up into, as someone says, a pokey baseball. The case is pretty worthless and too small, but whatever, its really not necessary. The looks, well, are subjective. I think they're very unique and in a way personify the anti-\"Beats by Dr. Dre\" look, which in my book is a great thing, but most normal people might not agree. Who cares what they think :)And of course, the most important aspect, the sound quality. I find these sound absolutely excellent. The response is geared more towards listening pleasure and not flat response, so these won't be any good at studio monitoring or mixing, but they also don't need a ton of EQ adjustments to make listening enjoyable, unlike my V-6's. Personally I only bring up the extreme lows and highs just a little bit, and they sound great like that. Very detailed, bright, punchy, and excellent response across the entire spectrum, except for the extremely low end of the spectrum. To get solid response in the sub-20Hz region, you're probably going to have to find a closed set or a set with larger drivers. It just comes down to the limitations of physics at that point. Other than that, the sound is amazing, there's really nothing else to say. Just make sure to give them a good long break-in period.A word of warning I should mention, is not all of them come from the factory in perfect working condition. The first set I had poor bass in the left channel, in about the sub-100Hz range. This is one of those defects that's hard to detect since bass isn't directional, and for awhile I though maybe I was going crazy. I was able to isolate this by listening to each side individually (by pulling the other away from my head) and was able to deduce the problem with the left channel perfectly using that method. Amazon was great about the replacement, and my new set is perfect.My only criticism about these cans would be the way Koss packs them. They wrap the chord up so tight I doubt the kinks will ever fully come out. I observed the same quirk with the KSC-75, Koss needs to either start wrapping the chords less tight or use a more pliable rubber in the chords. This annoyance is really the only indicator of how affordable these really are. Replacing the chords with a better quality set would probably be a worthwhile mod, and one I'm considering doing. Then again, that would probably void the excellent lifetime warranty.Overall, these are an amazing set of cans. There really is no excuse whatsoever not to give them a try; they've been made the same way for over 25 years, and once you use them, you realize why they shouldn't ever change a thing. They're a true legend, and even if the price was double what it is, they would still easily be worth the money. Recommended without any reservation whatsoever.Oh and a note about the photos, the actual plug is a gold-plated straight plug, unlike the steel right-angle plug in the picture. The 1/8\" to 1/4\" adapter is entirely gold-plated as well.", "overall": 5.0, "summary": "Incredible, My New Favorite Headphones", "unixReviewTime": 1297123200, "reviewTime": "02 8, 2011"}