{"reviewerID": "A3V1YKHR8W22X2", "asin": "1400532655", "reviewerName": "M. Sims \"m.sims\"", "helpful": [0, 0], "reviewtext": "I was looking for a e-reader for our 13 year old's birthday this past October.  After researching the popular e-readers i.e. the Kindle Fire, I went with the Nook Color for one simple reason; the ability to Root it and turn it into an Android tablet, for a lot less! (It also takes a macroSD card). While you can find the Kindle rooted too, I found the Nook Color rooted was more readily available and more affordable. Since I was purchasing for a teen I  did not want to get a new or more expensive model.We purchased one that was already rooted to cyanogenmod 7.  You can also purchase an macro SD card here or on Ebay that is rooted for you if you already own a Nook Color.We connected it to our home wi-fi and Viola, she can do everything i.e. text free, download games and unlimited apps from the Market. The rooted Nook Color can do everything a tablet can do except for make or receive phone/video calls.Note, all rooted Nook Colors are not the same version.  We purchased one for our son for this Christmas and I did not notice it was not cyanogenmod 7.  This is relevant as it did not possess full access to all of the apps on the Google Play (or Android market) as our daughter's does.  You can update the Root software and I did that but I did not notice a change in its ability to download the other apps. But honestly, I was tired at that point and gave it to our son on Christmas as it was good otherwise and I doubt he would notice. LolThis model is perfect for my teens, but I am thinking about the Kindle Fire HD for myself because it has a good camera and I love photography.P.S. I also purchased a silicone case in yellow and it brightens up the dark tablet a lot.  (I purchased both Nook Color e-readers used for $66 and $87 each on Ebay.)", "overall": 4.0, "summary": "Turn your Nook Color into a Tablet!", "unixReviewTime": 1356825600, "reviewTime": "12 30, 2012"}