{"reviewerID": "A3PA7TV6E4NAE6", "asin": "B00001P4ZR", "reviewerName": "Bubo", "helpful": [29, 38], "reviewtext": "KOSS R80 REVIEWWhen my 30 year old high-end headphones died a few months ago, I went on the hunt for a replacement pair.In all things, my preference is to buy American made, or at least American designed and owned, so I looked first at Koss. Bose and several others qualify too.I have a bunch of very high end speakers and amplifiers rounding out at $8K for my primary system, so my ears are spoiled. See my review of AKG 702 headphones for listing of my test system and CDs. I bought the AKGs for best sound quality available for less than $1000Akg K702 Reference Class Open-Back HeadphoneMY REQUIREMENTS WERE:* Fits big noggin* Comfortable for hours of use* sounds great* less than $400* eliminates noise from dishwasher, vacuum and significant other when I am listening* For use at home in my favorite chair* No leakage so my daughter can sit next to me reading or doing her homeworkREQUIREMENTS TRANSLATED INTO FEATURES:* Over the ear cups that completely encase the ear* Adjustable headband that fits big heads, not giant* Sling configuration headbands are the best for long wearing comfort and rest on the head as opposed to clamping on the head and ears. If you move around a lot with headphones on, slings are not for you.* Closed cans, to isolate outside sounds. No leakage in or out* Long straight cable, preferably replaceableKOSS R80 REVIEWWhy R80:Same drivers as highly acclaimed Koss Porta Pro open headphones, replaceable cord, closed cans, US company made in Korea, adjustable headband, familiar name from the old days who made Audiophile quality headphones. Available straight or coiled cord.PROS* Semi sling adjustable headband* Closed cans and ear pad do eliminate leakage* Sound quality is good but not great, if the AKG 702s are a 99% of perfection, these are an 85-90%* Price, these are very affordable headphones that should last a long time* Build quality appears to be good, time is the best judge for reliability* The drivers should last forever* Replaceable ear pads and cordsCONS* Fit is good for medium and small noggins, a bit tight for my large noggin.* Closed cans and ear pads do not breath and can get very hot with a tight fit, it may be the material the ear pads are made of, possibly Koss could add some venting to the closed cans to alleviate the heat buildup*  Sound quality is good, not great; but for the price, 1 tenth of the AKGs, hard to argue with*  Sound stage is a bit narrow compared to AKG 702s and Audio Technica open and closed 700s, both 3x to 4x more money. Narrow sound stage may be a result of the closed can damping implementation and the materiel in the padsSUMMARYIn reading the other Koss reviews, if you are looking for stationary listening affordable Koss headphones, the UR40 open backs may be a very good option since they both breath and allow the drivers to move freely without damping concerns. Leakage would be a factor, but the sound stage should be bigger and heat gone.Koss UR40 Collapsible Over-Ear HeadphonesMy impression is that that from a design point of view the R80 was a good first effort by the Koss designers who should follow up by moving the R80 drivers and replaceable cord config to the R20 sling and bigger rounded ear pads configuration and offer the R80 in open and closed back cans like the AT 700. If the sling and ear pad materials on the R20 config can be significantly upgraded for a few bucks the designers should do it. Until Koss addresses the heat build up issue, they will always be at a significant disadvantage with an easily correctable problem. Koss should benchmark their Ur20, UR 40 and R80 vs the AT 700 for fit and comfort and continue to use their existing high-volume highly-acclaimed drivers.closed canClosed-back dynamic audiophile headphones, 53 mm drivers with neodymium magnet systems, 3.5 mm connector w/ 1/4\" adapteropen canAudio Technica ATH-AD700 Open-air Dynamic Audiophile Headphones with 53mm Drivers with Neodymium Magnet SystemsKoss needs to decide the target market customer for each product and clearly state the applications on their web site, commerce sites and packaging, otherwise one is left guessing what the Koss designers were thinking when they designed the unit.Simply buying the units to see what they sound like and how they fit is both expensive and time consuming. Head size recommendations would be giant plus on their web site. There must be several attractive people already working at Koss that could model their headphones on their web site with different views showing the connected equipment and applications, the cost to Koss for providing more and better photos would be $zero.  Alternatively, Koss could go all out and pay a professional photographer a few hundred for a photo shoot using Koss employees wearing the headphones and jacked into the target equipment like: i-pod, chair next to expensive stereo, next to sampling kiosk in store, sitting in an airplane pilots seat, ham radio etc.In the end, I gave the R80s to my 10 year old since her head is smaller than mine, the clamping is not as tight resulting in less heat buildup. For listening to her I-pod nano, Nintendo game and pc applications the headphones are perfect. They are her early Christmas gift. I had planned to use them with my PC but too tight and too hot, stereo and movie listening was a long shot based on the drivers that didn't work out.RECOMMENDATIONIf your head isn't big, and you are looking for some good-sounding inexpensive-headphones this might be the pair for you for all stationary applications including sitting at your work cube jacked in. Noise isolation is good. Cans don't fold and they are not echo-noise canceling so using them on the commuter train or airplane may not work. If you wear them walking around the neighborhood, make sure you have great insurance since you would be likely to walk in front of a car or truck.", "overall": 3.0, "summary": "R-80 could be so much more with a little work", "unixReviewTime": 1258588800, "reviewTime": "11 19, 2009"}