{"reviewerID": "A160H0YEDV1DA0", "asin": "1400532655", "reviewerName": "PC", "helpful": [7, 7], "reviewtext": "A syndicated consumer advocate has a saying: \"I am willing to pay less for less.\"  So am I.  I actually bought the Nook Color (NC) more for its tablet features than its e-book features.  I considered several tablets for at least double the price, but when the new Android OS was released for the NC, I decided to try it out.  I personally have not been disappointed.Here is what it doesn't have: camera, USB accessory support, fast processor, robust app forum, 3G model, and long battery life.  But as I said I am willing to pay less for less.  I primarily wanted it for basic web browsing (with Flash capability), movie playback, e-mail capability, and e-book capability.My experience has been great so far - I have had my NC for about six weeks.  I personally have had no problem with the web browser and it has met all of my needs.  Movie viewing has been fine and I have had no problems viewing them.  I use Handbrake to convert movies/videos to a format for the NC, and it works great.  I have several e-mail accounts I use for personal and business purposes, and the POP3 support the NC offers is perfect.  I am no longer tied to my PC, laptop, or confined to the small screen of a mobile phone.  As for the e-book reader, it's great as should be expected (My 8 year old daughter actually uses it for reading more than me.  I download books from the library for her, and she loves it.)  The notation, highlighting, and other reading tools are fine and it also has several options to customize the font and background color as well as the font size.Other reviewers have commented about crashes, but I have not had a single crash yet.  And I also don't think the stock Android OS is bad at all, but with this being my first experience with a tablet and Android OS, my expectations may have been lower than normal.  I am also hoping that the app market will improve over time.  I know I could root the OS, but for the time being I will just stick with what it came with.  To sum it up, I got what I paid for and am very happy (so far) with my NC", "overall": 5.0, "summary": "Nook Color", "unixReviewTime": 1306540800, "reviewTime": "05 28, 2011"}