{"reviewerID": "A3MUO47CT6EQF8", "asin": "B00001P4ZR", "reviewerName": "Real Raleigh Reviewer", "helpful": [0, 1], "reviewtext": "I have had these for several years and they have been subjected to steady use. I'm writing this review far, far in arrears.The sound quality is good. It's not a legitimate hi-fi listening experience but for general purposes they are good. The bass is not spectacular. It's present, but it's not what I'd call deep and rich. The treble is also good but not especially crisp. The sound quality is adequate. If you're accustomed to listening to hi-fi headphones, or a decent home system with a powered 10- or 12-inch sub, this doesn't hold up.I've had these for several years. They have been used for casual listening on the laptop, gaming, and to cover my ears while I'm mowing the lawn. So - a lot of sweat, a lot of wear and tear. They are pretty comfortable. This year the covering of the ear pads started to flake apart and peel off. There's a padded cloth beneath the plastic which is actually a lot more comfortable than the loose plastic cover, but it's going to get gross in a hurry if I keep using it for yard work / lawn mowing.Overall these are OK. OK sound, good durability. They are all plastic and pretty light, but hey, proof is in the pudding. These have lasted for years of heavy use. The drivers are still good. I've broken other pairs of headphones with no special abuse involved so this is pretty good durability. I can't say with certainty whether there are other offerings in the same price range with better durability or performance. Obviously, it would take years to do to another pair of headphones what I did to these, but overall, I'd say these are good. Not stellar. Not stellar sound. Not stellar durability. Pretty comfortable... maybe best-possible in that category. But they're not superior to a high-end pair of Sennheiser or Bose or Audio Technica headphones. They're just... good. If you want good, reliable headphones, good sound, good durability, for $40 or so, this is a good fit for you. If you expect lifelong durability or stellar, top-end audio quality and wonderful bass, this really won't do it for you.", "overall": 4.0, "summary": "Heavy use for several years, and...", "unixReviewTime": 1347667200, "reviewTime": "09 15, 2012"}