{"reviewerID": "AFM9LKET50RZ4", "asin": "1400532655", "reviewerName": "Rajendra S. Gondhalekar", "helpful": [12, 12], "reviewtext": "I was instantly the hero for my wife this Christmas, when I surprised her with a nook color under the tree. The device has great aesthetics, with a 7 inch IPS LCD display that is one of the most pleasing I've ever laid my eyes on, a thin and sleek profile, wonderful packaging, and nice support from Barnes and Noble, but that as Paul Harvey would say is only the beginning, this review is about the rest of the story.  At first glance this appears like just another eReader, but with a color screen for magazines and children's books swapped in for the normal eInk, but there is something different lurking beneath.  This device runs android 2.1 under the hood, heavily modified as it may be out of the box, and with that choice of operating system comes a potential access a world of hackery that is well beyond the reach of any other eReader.  In order to access this world you need to be willing to educate yourself a bit and root this device.  The process is actually quite simple (go to XDA-Developers forums or nookdevs.com Nook Color portal to read about it), and despite the dire warning disclaimers quite foolproof, and fully reversible (just in case you need warranty service).Once rooted, the device gains access to android market, where you can get thousands of apps, games, and tools for free (legally), or for a small purchase price.  Compared to the currently empty nook app store, the android market is bursting with exciting activity.  A rooted nook color gets access to the kindle app, so you can basically read all your amazon purchases on this device too.  Sony Reader app is coming soon from what I've heard, so you are probably going to get support for that store too.  Tied to the Kobo ecosystem, to borrow a phrase, there is an app for that.  Emulators for old game consoles are working nicely.  Playing Angry Birds on a 7 inch tablet is so much more fun than on a tiny 4 inch phone.  Stock browser lacks pinch to zoom, download Dolphin HD, and there you go.  Can't put app shortcuts and widgets on the home screen, home switcher and one of the freeware launchers (ADW is pretty nice) got your back.  A rooted nook color becomes something of a worthy competitor to the much more expensive iPad and Galaxy Tab.  Unlike real android phones and tablets, this does lack the physical menu, back, and search buttons, but a software softkey is installed upon rooting, so there are functional on-screen virtual equivalents to do the job.Don't get me wrong, there are some things that won't work, as nook color lacks a 3G radio, camera, or GPS.  The ROM is also a heavily modified version, so some abilities have been stripped out, and won't be available until a true custom ROM is available.  But more apps a likely to work than not due to a capable processor, ample storage packed underneath, and most importantly a talented and dedicated hacking community willing to experiment with their device and then educate others.  This is still early in the development life cycle of the nook color, so their are some rough edges to the process, some things will require resorting to the command line to fix.  Considering what you get for the money, this is probably the best handheld portable device on the market today.  An instant game changer without a doubt.", "overall": 5.0, "summary": "A great device if you are willing to hack a bit", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}