{"reviewerID": "A39LPV21N28L0D", "asin": "B00001P505", "reviewerName": "Andy Block", "helpful": [1, 1], "reviewtext": "For the price, heck, for 3 times the price, these sound great to me. If I were to rate these on sound alone I would put them in a class with $120 to $170 headphones. They have great bass, nice high highs and are clear and undistorted in most of the situations in which I use them. I could go on for pages about how much I like the sound and how they sound, to me, like much more expensive headphones. They are open style, which is not in vogue now with people who are discovering high fidelity headphones for use with a portable player, but they are very practical when you want to be able to hear your surroundings.The fit is good. But the headband is awkward. It consists of a pair of tightly curved metal bands that are bound by two plastic slide clips. You push the clips together to extend the bands apart from each other, thereby expanding the space between the earpieces. The system works and feels pretty durable to me, but it is clumsy. Or I am clumsy. Either way it is unusual. But when they are on, they stay in place, and for on-the-ear style headphones, they are quite comfortable to me. They are also very light as they are very thin, not padded (except on the earpieces) and small. These are actually really good on-ear headphones for someone who wants to jump in their headphones.I think their great advantage is their sound quality. They look and feel a little flimsy, but I think they aren't as flimsy as they look. But I don't think anyone is buying these for the look, unless they are doing it ironically. The quality of sound is the star here. I don't think they sound as good as $200 headphones, but that isn't bad, considering the fact they usually sell for around $24.For identical sound (as far as I am concerned) with a simpler and less expensive headband, I suggest the Koss KTXPRO1 at about $18. It is technically a different driver (titanium coated), but I cannot hear a difference and I find the headband easier to deal with.", "overall": 4.0, "summary": "great sound, stays on, a little awkward to use", "unixReviewTime": 1377561600, "reviewTime": "08 27, 2013"}