{"reviewerID": "A21EXYTX5JWPAU", "asin": "B00001P505", "reviewerName": "Christian G. Rivera", "helpful": [5, 5], "reviewtext": "The SportaPro has a dirty little secret.The Sportaro literally uses the same exact drivers and housing as the KSC35, but instead of attaching the KSC35's clips, they attached the SportaPro headband. Here's my head-fi review 'snippet' of the KSC-35 which IS the same as the Sportapro:KSC-35, the more mature Koss clip-on that was discontinued and then brought back (only on the Koss website), for a pretty hefty $45. I'd say it's hefty because it honestly should cost just slightly above the KSC75 range, not 3x as much. They sound very similar to the KSC75. However, they are fuller sounding, with fuller bass approaching full-sized type bass, and the mids/vocals are very rich and forward. Treble is also quite neutral for me, not being too smooth, and not too sparkly. I actually am quite fond of their treble. The KSC75's treble is harsher, grainier, and more fatiguing. The mids on the KSC75 are slightly laid back, while the KSC35 presents them up front and more fleshed out. In all honesty, you can say the difference between the KSC75 and KSC35 is like the difference between the K701 and Q701. One is brighter, drier, and thinner sounding, while the other is more natural, and fleshed out.All in all, it's a solid sounding headphone, that does work very well. Bass was strong but quick due to the open nature of the headphones, but slower than the KSC75. Based on sound alone, I'd say the KSC35 is a headphone you could use for hours without fatigue. Kind of like a smaller, more bassy HD650. Nice tonal balance that I don't think anyone would dislike.The Koss Sportapro houses the same drivers as the KSC35, for less than half the price. You can literally buy the Sportapro, snap off the drivers, and snap the KSC75/35 clips on to the Sportapro drivers, and you have a cheaper KSC35. Ideal solution is getting the Sportapro and KSC75, putting the KSC75 clips onto the Sportapro drivers. This will save you $10, give you BOTH the KSC35 and KSC75 as a spare, and give the most comfort, IMHO. Just make sure to bend the KSC75 clips to place the drivers closer to the ears, as stock form may place the drivers too far, losing bass and overall sound quality.The more popular alternative, is to buy the cheap Parts express headphone (http://www.amazon.com/Mini-Stereo-Lightweight-Headphones-feet/dp/B0002KQZJS/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1371458925&sr;=1-1&keywords;=parts+express+headphones), taking off the crappy drivers, and using the headband for the Koss drivers. I prefer the Koss clips rather than the Parts Express headband, but I'm in the minority.", "overall": 5.0, "summary": "The Sportapro has a dirty little secret.", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}