{"reviewerID": "A1GWS2NJ324IY1", "asin": "1400532655", "reviewerName": "RichardNYC", "helpful": [5, 12], "reviewtext": "I finally was convinced that I could enjoy an eBook reader, did my research, and settled on the Nook Color.  My goal was to be able to carry a few books around for pleasure, maybe even some business documents.  Even though I have an iPhone, I thought I would diversify and go after an Android based platform.  I figured that even if I decided to go with the iPad eventually I could use the Nook app on the iPad to read the books that I've bought.After a few weeks of using it, I'm close to handing it over to the kids or jailbreaking it for experimentation with Android, and getting an iPad.1) The quality is low.  The software is buggy, ironically one of the buggiest parts is trying to buy a book, where it more often than not hangs after a purchase with the download in limbo.  The battery charge socket seems to be flakey, so that often the unit gets confused about whether it is charging or now.2) Can't buy books when you're outside the US.  So, on an international business trip - when it'd be nice to pick up a few books for the plane or to pass time in a cafe - one can't buy a book.  That sucks.3) Although in theory I could load a bunch of PDF documents onto it for reading, the display is too small for them.  The interface for PDF documents, in terms of adjusting fonts, scrolling, is very limited.  Device is useless for this.4) The book selection is slim.  I don't think my tastes are that obscure, but I'm not interested in the mass market.  Forget pulling out old sci fi classics.  Forget getting a textbook.  And I find that some of the books that I would like to read are available for the Kindle but not the Nook.5) The iPhone Nook app is super buggy.  In theory it should let me sync, get my books on the iPhone too.  But the iPhone app just hangs and doesn't sync to my account, even after a reinstall.  If you read the reviews of the Nook app on the app store, they're all saying this.6) The App selection is slim.  Email doesn't work with outlook and there's no VPN support.Better to just get an iPad, clearly.", "overall": 2.0, "summary": "It's just OK", "unixReviewTime": 1305849600, "reviewTime": "05 20, 2011"}