{"reviewerID": "A2A2M8EGBY2FV0", "asin": "1400532655", "reviewerName": "Rudy \"rainmanva\"", "helpful": [0, 0], "reviewtext": "I purchased my nook color in june of 2012. i had been online looking at various e-readers and comparing the features. i finally decided on the Nook color.**pros**-beautiful screen-very responsive touch screen-excellent battery life (you must leave the wi-fi off unless you are using it)-good overall feel to the device..seems solid and fits nice in your hands.-pretty decent web browsing (youtube etc)-custom sized text sizes, (you can go from Small to very large)-expansion micro sd card slot, (supports up to 32gb) for music, documents etc, note you CANNNOT Store e-books purchased from bn.com on the card!**cons**-diffcult to read in direct sunlight, (due to the technology used for the color display)-books CAN Be expensive, but are generally slightly less than retail, no physical book means you don't have tons of read books cosuming space around your home.-nearly have to pay for ALL APPS, (angry birds, etc)-Wimpy single speaker that is HARD to hear even with volume turned all the way up- if no screen protector is put on this device, you will have greasy smudges and fingerprints galore. invest in a good screen protector i would suggest the 2X caseen Glareshatter. here is the link: [...]-sometimes the nook color will freeze, prompting you to restart.also, you will want to purchase a cover for the nook color to keep it from getting scratched, or banged up here is the link to the black moko case i have.[...]Considering what it does, it is a great device, its not a $800.00 ipad, so if you purchase this with the expectation of it functioning like an ipad YOU WILL BE DISAPPOINTED. this is a nice color e-reader with basic web browsing, email reading and sending capabilites, so if you wanna check your email and do some light web browising, this is for you. the battery life is amazing, but this is only true if you KEEP THE WIFI OFF. if your wifi is left on, and your not using it, battery life will be short. i only turn on wifi when im downloading a new book (takes about 30 seconds) and when im doing email or web browsing. the web browsing feature is ok, but no subsititue for your desktop or notebook. just keep this in mind.all in all, a good purchase, very pleased with my nook color!update 11/15/13*** e-reader seems to be performing well.if you LEAVE THE WIFI OFF you can get very long battery life.this device was great for its time, but since being released back in 2010 better things have come out.its fine for reading..but not much else.", "overall": 4.0, "summary": "pretty good device love it!", "unixReviewTime": 1343520000, "reviewTime": "07 29, 2012"}