{"reviewerID": "A2L7WYA5OENV03", "asin": "B00001P505", "reviewerName": "Reticuli", "helpful": [63, 68], "reviewtext": "Strait out of the packaging I hooked them up to my HDCD Denon player. Overall, they've got good highs and mids.  The 6khz treble region could be a little more pleasantly recessed than it is, but the high-end never gets  fatiguing at normal volumes - only when loud.  I must say that the bass is  a little exaggerated. It is noticeably overdone in the 30-80HZ region --  the lowest you can pretty much hear with headphones. This never *seems* to  muddle the mids, which is often a problem with bass-heavy phones. It  doesn't seem excessively boomy and there are oodles of low-end dynamics,  which I did not expect. They remind me a lot of the Denon 950's, but  without the Denon's tissy-fit highs. When I hooked them up to my Panasonic  361C portable, I was surprised even further. With Curve: Doppelganger, the  bass didn't seem even the slightest bit exaggerated. Unfortunately, when I  moved over to extreme low-end intensive music like Massive Attack:  Mezzanine, there was still a little too much bass, but slightly less than  on the Denon. Econoline Crush: The Devil You Know kind of had too much  bass, but most people would probably prefer it that way. Yet, on many CD's  bass is noticeably overdone.  Spatially, the SportaPros have a nice open  sound.The SportaPros fold up and this is where the other caveat comes  out. When using the headband behind your head, the little fold-up hook can  start rubbing against my head, behind my right ear. This only happens when  the band slides too far down, though. All Koss had to do was have the hook  facing the opposite direction to avoid this. They're still the most  comfortable headphones-that-press-on-the-ear that I've ever tried, and I do  love how they fold up; it returns them to a nice, taught shape. The Koss  has a good, short length of cord for portable use that also has a mute  button on it.I'll keep the SportaPros as a portable and bass-y  alternative. If used with bass turned down a tad, they would be even  better.P.S. Single-entry wires are not superior.  They allow out of  phase cross-talk to enter the opposite ear through the shared ground wire,  which is why audiophile headphones are almost always dual-entry.  The  classic Sony V6, for instance, has a cross-talk problem and is unsuitable  for binaural applications because of this.", "overall": 4.0, "summary": "Good For The Price", "unixReviewTime": 963360000, "reviewTime": "07 12, 2000"}