{"reviewerID": "A1R1B3C8CFK4CZ", "asin": "1400532655", "reviewerName": "S. Bernstein", "helpful": [3, 3], "reviewtext": "Not quite a full-fledged tablet, not a dedicated e-reader...and that's OK with me for $249!  I had my first two NookColors replaced, the first due to a SD card holder spring that failed after 90 days and the second due to an unresponsive touch screen and problems with powering on.  Customer service had me on the phone for about 45 minutes and took me through two factory re-sets before I finally convinced them to replace my second unit.  Note that all replacements of defective devices are re-furbished, not new.  Finally, I am experiencing what Barnes & Noble had in mind.  NookColor #3 works great and now that I have a unit with a touch screen that works as it should I am finally realizing what a great little machine this can be, with a really solid e-reader and nice add's like Pandora and other apps, as well as wi-fi web browsing that really works well for a function that is secondary to the NookColor's primary role as an e-reader.  I really appreciate being able to listen to any selection from my iTunes library straight off the SD Card while reading or surfing the web or playing around with a couple of the apps I bought. Standard quality MP4 video files play smoothly, and most were converted to that format via third party software on my PC (My VideoConverter). The app store is still under-developed and I really wish this had 3G capability so I'd have an excuse for taking it with me more often, but at such a low price compared to 3G tablets, I have become very enamored of this machine.  The questionable quality control, a screen that is reflective in bright light and the weight of the device with cover are my only complaints, and if I had not encountered the quality problems I mentioned this would have been a solid 4- or 5-Star review, especially considering the price vs. competing tablets (because it really is in the tablet category, especially with Android 2.2 froyo installed).", "overall": 3.0, "summary": "Great device when it works", "unixReviewTime": 1309219200, "reviewTime": "06 28, 2011"}