{"reviewerID": "AYR1AP117UBVQ", "asin": "B00001P584", "reviewerName": "Robert Bruce", "helpful": [17, 19], "reviewtext": "This product does not work. I purchased this product to replace a Faulting ADC 215 Equalizer. This was the only choice on the market. After getting the unit I was able to connect it quite simple in to my system. I have a DBX unit for my Reel To Reel and had to connect it directly to the Reel To Reel, not much of a problem. But then the problem started to unfold. First the buttons, They are confusing, and don't work half the time. Then I noticed that I could not monitor tape recording output from Three head Deck and DBX record monitoring. With the EQ connected to a deck that monitors it seem to short the input to the output, causing the input level control not to respond, not distortion but not good for you tape deck. After that I started tested a different configurations. I have a 2 Head deck, So I connected it to the EQ 200 and it worked okay, but still had problems with the buttons happened again. I then connected the Reel to Reel without DBX, direct bypass the monitor loop and it worked okay for the first few times, then all of a sudden I could not record on the Reel To Reel, the input controls didnot work and the signal to the meters were pegged, not good, then I losted the 2 head deck. Powered off everything and tried again. After several reset everything worked again. So I decided to give this unit one more try, by adding one piece at a time and testing one piece one piece at a time. I added the Three Head Deck (Teac V711), to Tape1, then tested, worked okay for a while and then things started not working. Remember this is just 1 TAPE DECK !!!!!! connected. Powered off all components and things went back to working. I said okay maybe it is me let me read the manual more closely. Figured out the button (Tape 1>2/Tape2&lt;1) button depends on the setting of the (Audio/Video) button and also the (Line/Tape) button so to listen to Tape Deck 1 you must have Tape1>2 + Audio/Video + Line/Tape LED Green. Okay that worked, only for about and hour and then same problem happen, input controls stop working and meter pegged and again this is just 1 TAPE DECK CONNECTED !!!!!.What I have found out after opening the unit and putting it on a Oscilloscope, I found that the contacts in the switches are very poorly made and are solider to close together and are causing electrical interference. When a button is depressed and testing the contacts on the Oscilloscope showed a little ambient noise -75dbm level, which is okay, but as you use the switch the noise level increases until it shorts, that is why when you power off and let the unit sit and power back on it works okay that is kind of a electrical discharge so to speak and the ambient noise is back to around -70 ~ -75dbm. The open circuit test fluctuated from inf to 10K ohm resistance. Closed circuit test revealed from 0 ~ 1 ohm resistance on average but fluctuated to inf at times. That why the sound cuts out and the input shorts to the output.So all in all the unit went back for a refund. Please don't buy this unit. It is low quality and poor craftsmanship that it will not last more than a month or so. It does not support tape monitoring, and don't try to connect a Three Head Deck it will short out your Deck. The buttons don't work and short constantly. Tape to Tape dubbing is limited to only monitoring source, THAT IS CORRECT, when dubbing you can only list to the source Tape and not the dubbing tape to insure that the deck is recording okay. This is a very poor design!!!", "overall": 1.0, "summary": "Please Read This Review it Will Same you Time.", "unixReviewTime": 1226880000, "reviewTime": "11 17, 2008"}