{"reviewerID": "AXW14DXA684N4", "asin": "B00001P584", "reviewerName": "Tuliproom", "helpful": [37, 39], "reviewtext": "I read another review on here complaining about the \"sticky buttons\" on the Audio Source EQ 200. After reading another review saying their unit worked fine with no button problems, I decided to take a chance, hoping that the other reviewer's button problem was an isolated incident. Wishful thinking. I've had the EQ 200 for about a week and the same problem showed up on mine. I was listening to an old album on my turntable when one of the stereo channels just cut out. At first I thought it might be a loose cable, or worse, a problem with the cartridge on my turntable. Then I remembered the review about the \"sticky buttons.\" Sure enough, I went to the EQ and jiggled the buttons, and the sound cut in and out as I did so. After jiggling them a few times the problem went away for a while, then it out of nowhere started acting up again. It's not so much that they \"stick,\" as it is that they just plain don't work properly. The have a \"cheap\" feel to them; all the switches appear to be mounted to a single flimsy bracket. When you press one switch you can see the adjacent ones move. Besides the fact they don't work, they are confusing and limited the way they are formatted. They don't let you monitor the tape deck's output when recording; something that should be a standard feature of an EQ. The buttons on my old Radio Shack/Optimus EQ made a lot more sense in how they operated for dubbing/monitoring. There are a couple other annoyances on the Audio Source, too. The analyzer display has no sensitivity adjustment; when I play my CD player, the display is just maxed out. You can adjust the display by turning down the input level knobs, but I only want to turn down the display, NOT the volume! The \"0\" line on the EQ should be a different color for easily identifying the relative position of the sliders, but it is simply white like all the lines, which makes it difficult to easily identify the center line. If I were keeping the unit, I would take care of this problem with a magic marker. There are also no scale markings on the input level control knobs, leaving you to guess as to when you have the left and right balanced. The sound quality seems decent when it works, but what good is a stereo component if the sound cuts out while you're listening to your music? The illuminated sliders and spectrum analyzer look neat, but hey, I don't buy a stereo component just for looks. Seeing as other people have complained of the same button issue, I'm sure Audio Source has to be aware of the problem. Obviously, they are not going to invest the resources to correct the problem on something as obsolete as a graphic equalizer. It's too bad, since this model seems to be pretty much the only EQ left on the market for a home stereo. The only other EQ I found other than professional models for rack-mount systems, was a TEAC model which doesn't have as many inputs as the Audio Source. I am returning the Audio Source for a full refund; no sense having them send me another one when undoubtedly it will have the same defect. I guess I will try my luck with the TEAC, either that or put up with the muddy sound my stereo has without an EQ. I will just have to do the old cable swapping routine if I want to do any dubbing with the TEAC.", "overall": 1.0, "summary": "JUNK", "unixReviewTime": 1170288000, "reviewTime": "02 1, 2007"}