{"reviewerID": "A2E7E9EWADK4S6", "asin": "B00001QEMF", "reviewerName": "Rosemary Thornton \"Niece of Murder Victim, Ad...", "helpful": [92, 98], "reviewtext": "But the fact is, I use the automatic setting 99.9% of the time. It is a nearly a fool-proof camera that takes perfect pictures almost every time. (I own the Canon Rebel G - very similar to the Canon 2000, but purchased in  1998)And I hate to confess this too, but...I take photos professionally.  (people pay me for my photos and they are published in the print media and  on the Internet)Shameful, I know, but it's true. With my little Canon  Rebel, I put the little thingie on the automatic setting, point, pause (let  the camera make its best decisions) and then shoot. I then drop the film  off at the local camera shop. (first few times, I had to take the whole  camera in because I wasn't sure how to unload and reload the film, although  that's pretty easy too)When I pick up the photos, they are just  beautiful. Now, I have had to learn some hard lessons about camera flash  and shadows, but that is hardly the camera's fault. Experience has taught  me a lot, there.In summary, I am not a camera person. I don't *want* to  be a camera person. But my Canon Rebel has paid for itself many times over  from the photos I've sold. It combines the best of modern electronics with  photographic excellence.And it has a dazzling display of options for  those who want to play with all the fancy features. But for me - I'm  sticking with the automatic thingie.I would highly recommend this camera  to others.THREE different people (that I know of) have bought this  camera, after watching me use it and then seeing the end results. (under  the &quot;good grief, if she can take good pictures, anybody can&quot;  philosophy.)They were all astonished that someone who knows so little  could take such incredible photos.Only downside - it is a delicate  camera. No forgiveness factor on dropping it. I use the STRAP faithfully.", "overall": 5.0, "summary": "I hate to admit how I use my Canon Rebel G (98 model) but...", "unixReviewTime": 957225600, "reviewTime": "05 2, 2000"}