{"reviewerID": "A2V0I904FH7ABY", "asin": "B00001QEMF", "reviewerName": "XNOR", "helpful": [21, 21], "reviewtext": "I have had this camera for about 4 yrs now - I take it on all my business travels.Whenever I get a chance to go out on on the weekends, I take this camera and my Sony camcorder in my backpack, roam the streets of the new city and shoot pictures.  The pictures that I shoot from this camera are just awesome - no matter whatever experiment I do with it.Most useful features:1. Aperture control with Depth of field preview- Lets to focus the foreground and blur the background2. Shutter speed control upto infinity- Lets you control the amount of time for which the shutter can be kept open3. It is pretty rugged, dont try dropping it :) I have used it to shoot pics from 'Maid of the mist' in Niagara falls and I almost thought that I was going to lose it.  But it worked liked a charmNegatives- Bulky, but you will get used to it, it always gets attention- Cost of developing film - What I do these days is to just get the photos on a CD, then develop only those photographs that are good.Why is this camera better than a Digital Camera ?- If you are spending $200 on a Digital Camera, I feel that the SLR is way far too ahead of any Digital camera in that price range- If you are spending $1000 on a Digital Camera, a Digital SLRs are very mature today - worth buying.Ideally, I would buy this SLR, take this whenever I really want to take good photographs, then I would also want to have a $100 Kodak Digital Camera for casual shots.  This would mean an ideal combination.If you are buying this SLR, you can also consider buying a Film/Photo scanners (available for less than $150 now) - which lets you scan the negatives/positives without even going for a cheap CD print.  From the reviews what I read on amazon, these scanners must be amazing.", "overall": 5.0, "summary": "Excellent Camera: Easily beats a Digital camera for its price", "unixReviewTime": 1126915200, "reviewTime": "09 17, 2005"}