{"reviewerID": "A2LUW64R1VY53N", "asin": "B00001QHP5", "reviewerName": "Mike H", "helpful": [11, 12], "reviewtext": "This 35mm is pretty much the perfect college kid film camera.  It wont spoon feed you when it comes to learning, which will really help you in the long run.  In the age of \"press this button and you're focused\", this camera is one of the few 35mm's left that doesn't have AF.  Also wont change exposure levels to what the camera suggests(such as AV or TV mode some cameras have), this gives you the freedom to be creative as some shots have a whole different mood if underexposed a stop or overexposed a bit.  As for manual focus, it's something you need to be able to do as a photographer.  Sometimes the computer in your camera just doesn't focus perfectly on that eye you want in focus, or for something as precise as macro photography which has very shallow depth you're going to need pinpoint accuracy that a computer can not do for you.This lens is great because it's like the vintage 35mm except you don't have to worry about the light meter or any other small part inside of it being broken.  Nor do you have to worry about the image quality.  The kit lens in this camera is very sharp.  It's a bit limiting considering it's f/3.5 so that rules out really low light(but grain can be good, unlike noise in digital; grain has an artistic quality), but considering the price and the quality of the whole kit it's great.Sure you can get a used one from the 70's or 80's for way cheaper, but chances are something is broken in that thing and you may not know until you've invested 2 hours developing the first roll in your class...So shell out a little bit extra and get this, it's worth it.edit 12-9-10:I still like this, shot some street photography with it since it's really compact compared to a big DSLR, but one big con I've found is build quality. It's got a lot of plastic, and I did drop it once which resulted in a huge dent. The silver parts look metal but they aren't, they're some sort of chrome paint covering more plastic. I don't baby my gear so this thing's starting to look kinda ugly.  It hasn't completely broken yet though.  I said the kit lens was sharp in my review, but really I now know it's not as good as I made it out to be, I recommend a used nikon e series 50mm 1.8 ais which can be had for cheap on the used market.", "overall": 5.0, "summary": "Great fully manual 35mm", "unixReviewTime": 1261958400, "reviewTime": "12 28, 2009"}