{"reviewerID": "A36CLMUHL8OBHJ", "asin": "1400532655", "reviewerName": "SEAN SEEBRAN", "helpful": [23, 25], "reviewtext": "I think that all international customers should be forewarned that Barnes and Noble prevents you from being able to purchase any books online from their bookstore, you will be sent emails stating that books can only be sold to customers \"physically\" residing in the United States. This is all despite having an international credit card accepted all over the United States (even by Barnes & Noble themselves as this is the same card that I used to pay for my B&N; membership) and despite even giving them my US postal and physical address where all of my packages would be signed for  by a real person.The thing that angers me the most is that I explained to Barnes & Noble (via phone) that I live in Trinidad and they said that it would not be a problem for me to purchase books, but after purchasing a Nook color plus additional items such as screen protectors, a leather case and a 32 gig Sandisk memory card (all bought on Amazon), I have not been able to purchase a single book.If International Customers are not welcome, there should at least be some type of warning on their website. I feel like I was ripped-off by Barnes & Noble, and the sad thing about it is that I bought it all as a birthday gift for my wife. Shame on Barnes & Noble, that sales rep lied to me just to make a sale, my money was good enough for them but I am not good enough for their product. Now I have this New Nook color with all of these extras just gathering dust.It is sad to see just how low some companies will stoop to make a dollar.The real slap in the face is that after registering the nook on the Barnes & Noble website for the purpose of purchasing books, they have no problem sending me offers week after week to purchase even more of their products but as far as I am concerned, they have lost this customer permanently.P.S. This review has nothing whatsoever to do with Amazon.com, my gripe is with Barnes & Noble for giving false information to secure a sale and caring nothing about International Customers.(UPDATE  UPDATE  UPDATE)In the interest of fairness to Barnes & Noble and giving you Amazon.com community 100% reliable information I decided to open an account with a bank that's based in the USA to see if B&N; would be able to access the funds from that account, I'm trying to find out whether it's a location issue or just a payment issue so we can all know for sure.I decided to try this little experiment because I just can't understand how I can gain access to sample books from B&N; but every time I try to purchase one there seems to be a problem, what makes this whole thing even more confusing is the e-mail that was sent by B&N; after I tried to purchase a Book via my Scotia Master Card (books can only be sold to customers \"physically\" residing in the United States).I now have a Bank Of America Visa Debit Card which I have not tried as yet, it is possible that the issue with Barnes & Noble is that they cannot access funds from my Scotia Master Card which is based in Trinidad so I will give the Bank Of America card a try seeing that it's based in the USA and if that does not work then the last resort will be to try using my Pay Pal account. I'll post an update as to whether it worked or not.(UPDATE  UPDATE  UPDATE)I'm sorry for taking so long but anyway, let us get on with it.  As I said before, every time I tried to purchase a book there seems to be a problem, what makes this whole thing even more confusing is the e-mail that was sent by B&N; after I tried to purchase a Book via my Scotia Master Card (books can only be sold to customers \"physically\" residing in the United States).Well I found out that IT IS POSSIBLE to purchase books on the Nook once you are using a US based card. I was not able to purchase books using my Scotia Master Card but I had no problem whatsoever when using my Bank of America Visa Card, so it definitely has nothing to do with our geographical location, or IP address. The only issue that I see here is the fact that not everyone has access to a US Bank Card but you may still have a chance with making purchases via PayPal.I have noticed that there are some US based sellers that have problems accessing funds from Trinidad based Credit Cards, some even have problems accessing funds from US based Cards although they are also in the US themselves, in cases like this I've found that the best payment method to avoid any headaches is via PayPal. I've never had any issue when paying via PayPal, even when other forms of payment could not work.I hope that this helps a little.", "overall": 1.0, "summary": "INTERNATIONAL CUSTOMERS BEWARE", "unixReviewTime": 1332374400, "reviewTime": "03 22, 2012"}