{"reviewerID": "A28B1DZ3CLMCYI", "asin": "B00001QHP5", "reviewerName": "Raz", "helpful": [7, 7], "reviewtext": "Like many online reviews and even Wikipedia describe this camera, the FM-10 is a entry level film camera. Still, even though it lacks any kind of automation and (more important IMHO) a ground-glass pentaprism viewfinder (extremely important for depth-of-field preview with lenses faster than f/2.8), I believe that this camera is as good as any other SLR film camera. Furthermore, I doubt that any beginner or even more serious amateur photographer who would choose film over digital, has a desire for high automation features in such a camera. The FM-10 (manufactured by Cosina in Japan and sold under the Nikon brand) has a built in light-meter that requires two small batteries (provided with the camera) and is operated by a separate button on the slightly upper left side of the lens. Operating the meter button does require a shift in what would be the most natural and safest left hand grip of the camera, so that holding the camera in a steady position while using the light meter button becomes a bit uncomfortable, but that probably only goes for people with smaller hands like myself. Since most modern light meters suffer from a  biased factory calibration (meaning they would fail the grey card test), I am yet to run some appropriate tests as to check the accuracy of this light meter's calibration. On the positive side (and the right side of the camera), the depth-of-field preview button/lever, although not useful through the entire aperture range as mentioned above, is in a comfortable position and does fulfill its purpose at apertures starting from f/4 up. Although built on a metallic frame, the camera's body is mostly plastic. Personally, I don't think it feels cheap (no squeaky noises during handling) but I do feel like exercising caution at all times when handling it or placing it on hard surfaces, and I will think twice before taking the camera out in the rain, mist or extreme cold weather (I wouldn't care with a 35 yrs. old Nikon F1), rolling in the dirt or sand for nature close ups, etc. The camera case, although not made of quality leather as you might expect from a Nikon camera (but again, this is NOT a Nikon built camera), does provide a reasonable level of protection, except maybe for the top edges of the camera, where the attempt to leave the strap hooks come thru, has left those areas exposed to dust and other possible external damaging factors. It is also a bit awkward to remove and put back on because its edges always rub harshly agains the focus ring of the lens, which in time might create marks or even damage, especially on a plastic built lens like the one that comes with the camera. I would suggest looking for an older (much tougher and better built) leather case. The lens that comes with the camera is rated one of Nikon's worst lenses (check out Ken Rockwell's reviews for more info), but that doesn't mean you cannot take any pictures at all with it. A lens choice is always a matter of personal taste, as well as an educated choice for some users. The day I ordered my FM-10, I have also ordered a Nikkor 50mm f/1.2 manual focus lens, a mechanical and optical masterpiece suitable only for fully manual film Nikon SLRs at an unbeatable price compared to similar lenses built for digital or automated cameras. I have removed the bundled lens without even removing the lens cap and replaced it with the 50mm (much heavier as it is all metal built). For those who are not willing to &#34;waste&#34; $6-700 on a new fixed lens, I would suggest the older Nikkor 70-200mm AIS lens. You probably won't be able to find a new one because they don't make them anymore (as opposed to the 50mm above that you can get brand new), but you should be able to find one online in very good condition, anywhere between $100 and $400 depending on the seller. I got one for $220 in mint condition on eBay. Remember, the lens is the most important part of your camera and the decisive factor in the overall quality of your pictures (apart of course from your aesthetic and artistic feel). It remains to be seen how the not-so-high-quality of this camera will hold over time, but unless you want to go for one of the much older, bulkier (but better built) genuine Nikon SLRs, then the FM-10 is a good choice for the money, even if I consider the lens completely useless (that's just me). The reason why I didn't go for an old Nikon is because I couldn't find one from a reliable source. All sellers claim their old Nikons to be in perfect or good condition, most of them actually being completely unaware of any possible problems. Unfortunately, the slightest mechanical issue in an old Nikon SLR is very hard to detect, even harder to fix or re-calibrate, and ultimately renders the camera unusable (i.e. a slight shift in exposure time). With the money I'd pay for a defective Nikon F1 (rated in good condition) and having it fixed, I'd get a new FM-10, a leather case and some lens filters. Overall, even if I don't feel the same confidence (yet) as I used to with my old Zenit 11, I am happy with my new purchase and will try to get the best of it for as long as I can. I hope this helps you make the right choice for you.", "overall": 4.0, "summary": "Good but not great", "unixReviewTime": 1353024000, "reviewTime": "11 16, 2012"}