{"reviewerID": "A2J9NEE5C5D2AU", "asin": "B00001RMCY", "reviewerName": "+++", "helpful": [0, 0], "reviewtext": "Commend added in December 2002: this review was written when 2 megapixel cameras were top of the line, and a 32 MB card costed over a hundred dollars. Now, the prices have dropped so much that the same review would be more applicable to a 128 or 256 MB card. - A.I.Nobody would argue that the more memory you have in your digital camera, the better. The question is what the reasonable compromise between the price of a memory card and its size is, and how to predict how much memory you actually need before you paid for it. I looked up some literature on the image compression techniques, and made some experiments with printing out pictures with different resolution and different compression ratios, and came to the following conclusions.Most cameras offer a choice between several picture resolutions and several image compression modes. Low resolution is good for on-screen viewing, while high resolution is better suited for printouts. It is not uncommon for digital photographers to take pictures at a resolution lower than the maximum allowed by their camera, although there seems to be no point of buying an expensive high-resolution camera to take low-resolution pictures. A probable reason for that is that their camera was shipped with a very small memory card and did not upgrade it yet. Unfortunately, high resolution images require lots of storage space: an uncompressed image taken by a 3 megapixel camera can be as large as 10 MB. JPEG compression, which is based on an algorithm specifically developed for image compressing helps to store large pictures in relatively small files. Specifically, JPEG compression algorithm divides an image into squares 8*8 pixels each, performes two-dimensional discrete cosine trasform of each of these squares, and compresses their frequency spectra by removing the high-frequency components or by decreasing their accuracy through a \"quantization\" procedure. While this review is not appropriate for a discussion of technical details of the JPEG algorithm, it is worth saying that JPEG analyzes each small \"brick\" of the image individually and adapts the level of smoothing/compressing to the image to be compressed. In fact, you determine not the size of the compressed image, but the level of its quality: the final size of the compressed file varies depending on each particular image. This \"adaptive\" nature of JPEG makes it very efficient: it takes advantage of the smoothness of monotonically colored parts of the image by achieving great compression ratios in those areas without significant losses in quality, and it is also good at rendering sharp contrasts in the image. Since JPEG standard was optimized to take into account the specifics of our perception of visual information (like mp3 compression of music files takes advantage of the way how we hear music), JPEG compressed pictures are almost undistinguishable from the originals up to the compression ratios of 1:8 to 1:12.Therefore, a combination of highest possible resolution of your camera with the \"fine\" (or \"best\") compression mode is a good choice for a digital photographer. If this combination of resolution and compression is used, a 32 MB memory card would be sufficient for about 36 pictures taken by a 3 megapixel camera, or for about 48 pictures taken by a 2 megapixel camera. This is equivalent to one or two rolls of film, which is not a lot, but usually suffices for a day of occasional shooting. Hence, it seems to me that a 32 MB memory card is a good buy for the most of us.Just the last comment: note that there are two types of memory, flash and SmartMedia. Check you camera manual which one you need. SmartMedia memory cards are slimmer, if I am not mistaken.", "overall": 4.0, "summary": "a good compromise between price and memory size", "unixReviewTime": 961113600, "reviewTime": "06 16, 2000"}