{"reviewerID": "A11D1KHM7DVOQK", "asin": "B00001W0D4", "reviewerName": "Person \"qazwsx34651\"", "helpful": [3, 3], "reviewtext": "I bought these earbuds for my CD player (at the time) because the ones I had before died on the right side. They were a pair of RCA behind the neck headphones I bought at Family Dollar for very cheap. I would buy another pair but now I have an iPod and want to buy mostly earbuds and clip headphones that are more portable. I was planning on buying a pair of Philips earbuds at Target because (I thought) these were dead on the right side and I dislike the iPod earbuds, but when I plugged these into my iPod they worked fine. After a break-in session they sound even better.Well, they are only ten bucks, so what can you expect? Not a ton, not a surround soundstage and great, powerful sound, but maybe something that has at least average sound, are comfortable, and will last a decent amount of time. And thatt's mostly what I got with these earbuds.They don't have stellar sound (that for some reason a ton of reviews rave about), but they have decent sound that's good enough for the money. Not a lot of bass, but some pairs at this price have barely any bass. The mids on this pair are emphazised (but not by a lot, props to Sony). And they do have a good, clean sound to them, so even if you are unhappy with the low end of these earbuds you at least have a good upper end.For other aspects of the earbuds, they are very comfortable and fit much better than the Apple earbuds, but feel better with the pads. I have already lost the pads but still fit fine and are still comfortable for long periods of time. Also, these are some durable headphones so far, and after a half-year of use they still put up nicely.Overall, not a bad pair of esrbuds for portables. Already got a better pair? Keep these for some useful back-ups. They don't have amazing sound, but are comfortable and last long enough to make them worth the price. 4 stars.NOTE: This is a waterproof version of the MDRE828LP earbuds. These would be a better deal if you are using them mostly outdoors.", "overall": 4.0, "summary": "Good Earbuds for the Portables", "unixReviewTime": 1167264000, "reviewTime": "12 28, 2006"}