{"reviewerID": "A3HPCRD9RX351S", "asin": "1400532655", "reviewerName": "Spudman", "helpful": [2, 3], "reviewtext": "It'll be gone soon, and I can't say I'll miss it. Our county library lends out e readers for patrons to try so I got on the list and after three months it was my turn to try the Kindle Color Nook. It doesn't overwhelmingly impress me though the color and clarity of the screen is as good as Our Kindle Fire's. Text on the screen is clear and turning the pages is easy. ONE advantage the Nook has over the Fire is that it shows page numbers instead of the Fire's percent of book read. Mrs. Spudman would prefer to have page numbers but has adapted to the percents.My wife and I are both comfortable navigating the Fire and barely had to refer to the owner's e manual. I don't like moving around on the Nook, and that may be solely because I'd become used to the ease of the Fire. Trying to surf the web on the Nook was very frustrating, and watching movies or video clips on the Nook was an ordeal with herky jerky motion, slow responses, and freezes. We watch free TV shows on the Kindle Fire with smooth enjoyment.The Fire was a gift to my wife from me. She loves it. If I were to buy a small device for reading, I'd prefer to  buy a tablet and download a reading program on it that enables book downloads. That method may preclude the ability to get free books (it does on the Kindle), but it's a circumstance I'd accept.In summary, the Color Nook is pretty good as a reader. Those with children might be intrigued by the animation capacity of the Nook on some children's books and the option to have the book read aloud by the Nook voice. As a web browser, the Nook , in my experience, doesn't work as well as the Fire does.In choosing between the two devices, I chose the Fire because I prefer the Amazon site to B&N;'s, like the vast number of Kindle books on Amazon, and was totally persuaded by the vast array of  free books, movies, and TV shows that come with Amazon prime.", "overall": 3.0, "summary": "A Little Nook e", "unixReviewTime": 1332028800, "reviewTime": "03 18, 2012"}