{"reviewerID": "A3MN5FMEN5Y4R9", "asin": "B00001W0DG", "reviewerName": "Stevan Eidson \"Steve-man\"", "helpful": [66, 75], "reviewtext": "Well, I embarked on finding a new set of travel headphones after my last long plane ride.  The earbuds just weren't hacking it, even though the pair I have are quite good.  The jet engine noise finally got to me.I have an old pair of Sony MDR-M77 headphones which are quite good, but I wanted something new.  So, I studied what was available and settled on the MDR-V500DJ headphones.  After purchasing a pair, I regret my choice and I am returning them.When I got these headphones, I immediately plugged them into my iPod and picked a favorite cut from XTC (Mayor of Simpleton).  As I listened to the song, I kept wondering what was wrong,  Then, it dawned on me, the treble was entirely muffled.  I grabbed the MDR-M77 and did a A-B test with several tracks.  Same result.  The MDR-V500DJ has little or no high-end.  Just as a sanity check, I grabbed my Sony MDR-V6 phones and did the same test.  I consider the MDR-V6 one of the best headphones ever made by the way.  Yeah, the bass was definitely richer than the MDR-M77, which seem bright in comparison, but both were much closer to what I expected than the MDR-V500DJ.I thought it might be the iPod, so picked a coupled of CDs (MFSL Dark Side of the Moon & Bernstein in Berlin-Beethoven Symphony no.9) to try in my portable CD player.  Same result.  While the MDR-M77 was the brighest of the three, the lack of high end on the MDR-V500DJ made neither CD sound good.  Once again, the MDR-V6 was the best and most balanced of the three.Still seeking the perfect lightweight headphones, I went to a local Magnolia Hi-Fi to try a better comparison.  I tried both noise cancelling models from Sony, several Sennheiser models, the MDR-V600, MDR-V500DJ, and MDR-V300.  First of all, forget the noise cancelling models.  None of them sounded as good as MDR-V500DJ.  The MDR-V600 was the best of them all and reminded me of the MDR-V6 (which I understand they replaced).  The MDR-V300 is definitely better than the MDR-500DJ by a long shot, and I would say the MDR-V300 is comparable to Sennheiser HD-212.  I am going to try them side-by-side at home soon.Although many of the Sennheiser phones sounded good, they seemed over-priced compared to the MDR-V600.  The only one that was close in price and quality was the HD-280.  By the way, the HD-280 was uncomfortable and put a lot of pressure on my head.Unless you like listening to bass only, do not buy the MDR-V500DJ headphones.", "overall": 2.0, "summary": "Muddled high-end for this price!? NO WAY!", "unixReviewTime": 1046476800, "reviewTime": "03 1, 2003"}