{"reviewerID": "A3T767O02CHFN1", "asin": "B00001W0DH", "reviewerName": "Andrew Hamada", "helpful": [4, 4], "reviewtext": "Anyone looking to purchase these headphones should note: they were designed and advertised for DJ use specifically.  And by DJ, I mean the live-performance variety, not the studio-technician variety.And, for DJs, these headphones are excellent.The actual physical configuration of the headphones is clearly designed for DJ use, with easily folding, individually rotating cups for single-side monitoring.  They are also designed to rest close to the ear which, although it may make your ears hot and uncomfortable if you use them for prolonged home listening, is ideal for DJs because they effectively cancel noise up to extremely high volumes (I've used these in both a small party and club setting, and have found the non-electronic cancellation to be more than adequate for both).The actual sound styling is typical of Sony, with the quality generally reflecting the price.  I listen to a variety of music through these: in addition to hip hop &amp; house for club use, i listen to various other electronica, various rock, lots of acoustic music and a ton of a capella.  The headphones perform admirably in all cases.  The bass is strong without being overbearing, the mids are balanced and the highs are clear without being ringy or piercing.Please note my initial admonition again, however: these headphones are designed for DJs.  For your money, you can probably find a better set for home use by Sennheiser, or similar, which aren't geared torward performance/studio use.  In addition, other reviewers are right: the headphones get uncomfortable after prolonged use (I found that after about 30 minutes to an hour of home use, I felt the need to take them off and massage my ears for a bit, as these fit tight and are a bit heavy).  The only reason I would ever recommend against these for DJs is if you plan on spinning for an extraordinarily extended period of time, because they are slightly heavier than the v600s and the extra weight, while usually unnoticable, can become an issue if you're spinning upwards of five or six hours.", "overall": 5.0, "summary": "great for DJs, for whom they are intended.", "unixReviewTime": 1041984000, "reviewTime": "01 8, 2003"}