{"reviewerID": "A1L34X2F3YTD7E", "asin": "B00001W0DH", "reviewerName": "S. Kim", "helpful": [14, 18], "reviewtext": "I've had my headphones for 3 years.  I'm an amature DJ and could only recommend these for DJ use.1st of all, the major complaint about these headphones are the cracks that appear on the swiveling brace.  Face it, it's plastic and it can break.  And it's not the best design for durability.  But it's not gonna happen to everybody.  As a matter of fact, a lot of record stores with turntable sampling stations will have these headphones out for use.  A local record shop in HB had about a dozen of these headphones out for years of careless use.  I think, most people end up sitting on or packing them in heavy luggage.  I can't see how you can just put these on top of your head and break them.2nd, they're not designed for audiophile sound quality at moderate volumes.  They're designed to monitor the next song while listening to blaring 15\" club speakers.  A device with mediocre output voltage will not move these 50mm drivers well enough to get good sound quality.  So stay away from iPods.  They're just not gonna drive these headphones really well.  Imagine hooking up two 12\" subwoofers to your car and trying to power them with your headunit.  It's not gonna happen.  Like I said, these are specifically designed for DJ's.  I use a Vestax PMC-05Pro2 mixer and I get crisp, studio monitor quality sound.  Very transparent and smooth lows.3rd, as for the 50mm drivers.. these headphones are designed for accurate and distortion free playback at loud volumes assuming you have a clear and strong output.  There are other headphones out there that have 50mm drivers that are designed for moderate volume levels.  A lot of it is going to depend on the sensitivity of the drivers.  Usually, lower sensitivity will handle louder volume levels better but a higher sensitivity unit will sound more accurate at lower levels.  So if you're not using headphones to monitor songs at a concert or at a club, go and spend your money on something else.", "overall": 5.0, "summary": "For DJ's Only...", "unixReviewTime": 1112572800, "reviewTime": "04 4, 2005"}