{"reviewerID": "AHY2KG32696ES", "asin": "B00001W0DH", "reviewerName": "SL", "helpful": [94, 105], "reviewtext": "Update:[ June 2011]After the swivel joints broke back in 2000 (around three years of use), I was able to easily put them back using super glue. Since then, I have purchased and used other headphones but still occasionally use the v700 headphones. It's definitely very worn out--the (replaceable) padding is cracked and the fit feels a bit loose--but, they still sound great and the joints have not broken off again. Yeah, after it was literally broken-in, they prove to stand strong with some glue on the joints--I've DJ'd with them, slept with them, and dropped them and I am  still using them with joy. It's been with me for over ten years! I got it a few years after I graduated from college (DJ'd with them) and now I am almost 40 with 2 kids and, I still use them! Amazing. Now, I will use them with care.{Original \"review\" from 2004]When I first purchased these headphones back in 1998,I would have given these earphones 5 stars. But after around 3 years of use, the swivels broke. The swivels are made of plastic, so the first place that falls apart is the swivel joint that connects to the cups. Both left and right joints are cracking after approximately three years of moderate use. Luckily, it is still functional even with the cracks. The problem is that it is now a bit looser so it falls off from my head even more frequently. And we all know that these earphones (including the v600) are notorious when it comes to the deterioration of the padding on the ear cups. I just wish that it would last just a bit longer. I have been looking to replace these and I found the new pioneer hdj-1000 to be a possibility. It sounds just as good, it is definitely lighter and stays on the head steadier; and even though the construction is similar in that it is plastic, the swivel joints are built differenly from the V700DJs which makes me think they knew about this SONY's problem and they have found a way to prevent the joints from cracking.", "overall": 5.0, "summary": "Great at first, but falls apart; then glued back on and going strong after 12 years of use!", "unixReviewTime": 1083542400, "reviewTime": "05 3, 2004"}