{"reviewerID": "A119IU67AHNE2W", "asin": "B00001W0DH", "reviewerName": "tearsinraine", "helpful": [5, 5], "reviewtext": "I just want to echo what a lot of reviewers have said...The sound is absolutely first rate!  Music no longer feels like it's around you, you're part of it.  Bass sounds absolutely crisp and clean, not muddled and washed out like some other headphones I've used.  Highs and midtones are well represented.  Pretty much perfect for any sort of music, be it electronic, rock, or classical.  I used to game with these headphones on my PC as well, which completely spoiled me.But like others have said, wear and tear seem to plague this pair of headphones.  I don't DJ, but I do use my headphones on a regular basis and my first pair eventually formed cracks near one of the earpiece joints which was the beginning of the end.  My second pair's demise was my own fault, having fallen asleep with them on and somehow twisting them in just the appropriate direction to break off a joint.Other than the joints, however, I'm pretty happy with the ear pads.  Given the amount of wear, the pads have held up quite well, where other cheaper headphones have eventually fallen apart due to heat and perspiration.Comfort-wise, I'd rate them a 4 out of 5.  They feel pretty much like what they look like.  Part of the great sound is because they pretty much cup your head pretty snugly and feel pretty comfortable for the first several hours.  However, after an extended period, your ears are ready for a break from being mashed to your head.  I don't rate them too badly on this, mainly because there are other similar-looking headphones which are pure orture compared to the Sonys.If you're looking for comfort, I would suggest the Bose Triport headphones which sells in a similar range or the more expensive Quiet Comfort 2 (which adds Noise Cancelling).  Although I can't speak for wear'n tear, I've tried out the Triports at my friends place and I currently own a pair of QC2 (mainly because I needed noise cancellation for work-related reasons), and these two pairs of headphones are unmatched for comfort.HOWEVER, for pure sound, I preferred the Sony's by far.  I'll probably pick up another pair of these Sony's soon, because writing about them make me miss them.So my bottom line?PROs:1) Sound - my favorite sounding pair to date by far!2) Portability - they fold up nicely and come with a travel pouch3) Comfort - reasonably comfortable for extended periods4) Durable Ear Pads5) Sound6) Sound7) Sound8) Sound9) Sound10) SoundCONs:1) Quick wear'n tear on the plastic joints, so careful with twisting the earpieces too much2) High price for such fragilityFor such an pricy pair, Sony should have constructed these headphones better, but at least for me, the sound is definitely worth it.", "overall": 4.0, "summary": "First-rate sound! Hard not to love'em.. even when they crack", "unixReviewTime": 1101254400, "reviewTime": "11 24, 2004"}