{"reviewerID": "ABQEDHBG91BBR", "asin": "B00001W0DH", "reviewerName": "There's No Stopping Space Vikings T. Edwards!", "helpful": [8, 10], "reviewtext": "This review is to address the issue of these headphones breaking, and only that, because quite frankly I could go on for days about how well these headphones work for DJing and everyday listening.  Stuff breaks, this is a fact of life.  Cars break, dishes break, and even people break, these headphones are no different.  Expecting them to last a lifetime because of the pricetag is simply naive.  There's also a difference between breaking beyond function and a simple annoying break like the plastic cracking.  These headphones will surely enough one day die completely as in loss of function, but up to that point they will begin to fall apart.  The swivel housings are the most common thing to break but from reading the reviews here on Amazon it is as if people have never heard of Duct Tape or they are so appalled by the idea of $100+ headphones breaking that they refuse to do anything but complain about it.  The Pioneer HDJ1000s break, the Senheisers break, and if you can find me headphones that don't break then I applaud your discovery of solid titanium headsets that don't exist.This all boils down to one thing and one thing only, how well do you treat your possesions?  If you're like me and you don't mangle everything you own then a $80-$150 pair of headphones is a safe investment, because it will last.  If you just play wild shows all the time, wear these skating/snowboarding, throw them in your backpack, or whatever then you're a moron to buy them and expect them to not break.  Nowhere in the description of this product does it say these things are as solid as a tank.  It states that they're flexible (they are), have a good bass range (they do), and they're comfortable (they are for me but that's a personal thing).Don't be deterred by reviews saying these things break, because everything does and every comparable set of headphones is equally flawed.  The HDJ1000s get loose sliding fixtures really quick, the Senheiser 280s sound overall better but they feel like a plastic toy and really aren't much better.  If you're a DJ your options are the V700s and HDJ1000s, there's a reason they're the industry standards.  They are time tested and proven.  If you aren't willing to buy a few good pairs of headphones then DJing is NOT the hobby for you because you WILL break your stuff MANY times, not just your headphones.Well there's my rant, these headphones do EXACTLY what they say they do and for that I give them a 5/5.", "overall": 5.0, "summary": "People will whine about anything...", "unixReviewTime": 1183939200, "reviewTime": "07 9, 2007"}