{"reviewerID": "A3LDPF5FMB782Z", "asin": "140053271X", "reviewerName": "Alan  Houston", "helpful": [4, 6], "reviewtext": "The new Nook \"Simple Touch\" is easy on my eyes for long reading sessions.  The Nook makes it easy to chose a font style, a font size, single spacing or double spacing...you can customize the appearance of the text to your needs.It is easy to read the Nook indoors with any decent room lighting, and easy to read outdoors in the shade.  It is July in Texas...so I have not tried using it in direct sunlight.The Nook is easy and comfortable to hold in one hand for extended periods of time.  Turning pages is easy with a light touch on the side of the screen or a press of the page button in the sideframe.The battery took a couple of full charge/discharge cycles to stabilize. At that point, it was using about 2% of the battery for each hour or two of reading.  Reading an hour or two hours a day and using the Wi-Fi an hour or two per week would result in 3 weeks or 4 weeks per charge.  In contrast, my color e-reader requires charging each day.Magazines look MUCH better on my color e-reader, but magazine text is very readable on the Nook.  The Nooks is at its best with a book with plain text, as illustrations, art, drawings, etc. look crude compared with a color e-reader.I have several books in paperback at home that I also have on the Nook.  Because I can increase font size and use double-spacing on the Nook, it is much easier to read on the Nook than in the paperback book.  My aging eyes feel much better after a couple hours with the Nook than after a couple hours straining to read the \"fine print\" that is typical of lower priced paperback books.If you want an e-reader primarily for magazines, you probably should buy the Nook Color or a small color tablet.  If you will be reading books, you will like the NOOK Simple Touch. Look around and compare price...the price of the Nook varies widely between stores.", "overall": 4.0, "summary": "A Nice E-Reader For Aging Eyes", "unixReviewTime": 1310515200, "reviewTime": "07 13, 2011"}