{"reviewerID": "A1FNBZLJI88MQJ", "asin": "B00001W0DI", "reviewerName": "Faye", "helpful": [0, 0], "reviewtext": "I bought the Sony MDR-V600 headphones about 3 seasons ago, and have loved them ever since. I bought them refurbished from Amazon.com at the time, and paid $70 for them (including shipping). Mind you, those were used, refurbished headphones, but they and their packaging looked like new and performed (and still perform) like new. I am baffled to see them being sold for $200 on Amazon now, even though their traditionally more expensive and higher quality siblings (the MDR-V6 and MDR7506) are offered for $130 and $100 less, respectively. If you were planning to spend the stated $200 on the Sony MDR-V600 headphones, do yourself a favor and try the MDR-V6 or MDR7506 instead.With that said, I love my V600s and have never regretted the purchase. The bass is subtle but still obviously present, while the highs can get painfully high when paired with my MacBook Pro (2012 model, which has a good on-board DAC in it). This is reflected in the advertised frequency range of 5-30,000 Hz, and it surprised me since in my experience, Sony headphones traditionally sound a bit heavy on the bass, and muffled. In comparison, these headphones produce super clear sound.Best of all, the V600s are *comfortable*! So much so that I can wear them for hours on end during study sessions and never get tired of wearing them. They work well with my old iPod Video (generation 5.5, 30GB) and different computers, which means the headphones don't use a lot of power.Verdict: if you can find these headphones for $60-70, it is a deal you should never pass up. I thought they sounded better and more accurate than a friend's AKG 702 (which was admittedly more comfortable and durable, but still). Those looking to spend $200 on headphones and are interested in the MDR-V600 should save themselves $100 and get the higher-quality V6 or MDR7506 instead.", "overall": 5.0, "summary": "Excellent $70 headphones!", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}