{"reviewerID": "AVE2J7PNE0L9C", "asin": "B00001W0DI", "reviewerName": "J. Parmelee", "helpful": [0, 1], "reviewtext": "I remember back in the summer of 2004 I was in the Muskegon, Michigan Best Buy and saw these headphones I bought them after hearing other headphones that were more expensive but went ahead and bought these because they looked durable and I've been satisfied with Sony's bookshelf speakers and figured that their headphones would sound even better. They were the first pair of V600s I've had. I thought the bass and vocals sounded really good but the treble was a little too thin and inaccurate in my opinion. They were still great headphones and I thought I couldn't find anything much better for the price or so it seemed back then. Then a couple of months later I was on vacation in New York  and accidently left these at a hotel and was disappointed that I lost these headphones. I went until January without decent headphones and then bought another pair of Sony V600s in Holland,Michigan but when I opened them at home I was disappointed that they weren't really the same. The cord was too thin compared to my original pair that was heavy duty and thicker. I had them for about 4 years until I got a cat and she chewed the wire right apart.I was pretty ticked off and gave up on this particular model of headphone and decided to save my money for the professional Sony MDR 7506 which I reasearced on different sites that said were  very durable and rugged headphones so I went ahead and bought those. I am a lot happier with the 7506 not just for their durability and thick cord but I also thought and still think they sound twice as good as the V600s (the treble sounds a lot better on the 7506s) for about 20 to 30 $ more and are a better pair.I keep a better eye on my cat and she hasn't even messed with my cords anymore.The V600s are decent headphones but the thin cord makes it so I just can't recommend them to anyone who owns a pet or little kids.", "overall": 3.0, "summary": "Decent sound but the new cord is too thin.", "unixReviewTime": 1118016000, "reviewTime": "06 6, 2005"}