{"reviewerID": "A3M1BNMWE8A633", "asin": "B00001W0DI", "reviewerName": "Kevin Hudson \"Kev50027\"", "helpful": [3, 9], "reviewtext": "These are the best headphones u can buy.  I got them, put them on on the way home and couldnt believe how amazing the sound is!!!  I have had nearly every headphone, been searching for the \"perfect\" headphone and i just found it!!!  They look really cool, use only a trickle of power for mp3 players, and give u great sound that covers youre ear unlike earbud or anything like that.  With these you get very very clear distinguishable sound from headphones that are light as a penny.  They are as comfortable as wearing a hat, and you bearly feel they r even on.  it is definitely worth the [price] compared to [price] headphones that break in a week.  And i get [price] a week so i value money alot!  BUY THESE HEADPHONES!!! they dont distort music, they just give it to you with awesome clarity and precision.  They sound so much better than even my awesome sony speakers!!Edit:I wrote this review many many years ago, and apologize for the awful grammar and spelling.  I still own these headphones, and they still sound great, but after becoming somewhat of an audiophile, I have noticed that these emphasize treble and bass.  They sound very punchy and clear because of this, so 90% of people will love them, however if you want to hear music without any extra bass or treble, you will have to get some more professional oriented headphones from Sennheiser or the very well known Sony models.The headphones are well made, but as with most headphones, the first thing to break down is the ear pads and head pad covering.  After so many years of use, the pleather material has seperated from the inside of the ear cups and head band.  This does not interfere with comfort at all, but they don't look as nice as they did when they were new.  That said, the drivers still work great, and sound quality is what it always was.I lent these headphones to a friend who was a fan of rap and other music (that I don't listen to) and he refused to give them back for 2 weeks, since he liked them so much.  If you don't mind getting headphones that are many many years old but still sound great for most ears, these are a great choice.  Please disregard my previous review, I was just happy to find headphones that sounded decent.", "overall": 4.0, "summary": "Great headphones, but not the most accurate or well built.", "unixReviewTime": 1031356800, "reviewTime": "09 7, 2002"}