{"reviewerID": "ALBRW4Q4GOTJ2", "asin": "B00001W0DI", "reviewerName": "Mr. P. Power", "helpful": [4, 7], "reviewtext": "Good \"overall\" headphones for the (cost sold here) and for first foray into a better sound from the standard issue.For the price they have a better than usual articulation in the sound but...I bought them at a mall ($100) to get me through a \"quick need\" situation And I expected a little more from Sony. I've had many other cheap & high end \"cans\" as well thus seeing both sides of the spectrum, For my money.Price wise these Sony MDR V600's are pretty decent for someone wanting a quiet (closed-ear) headphone for not too much money ($80 or so). Like all \"cans\" they will sound better after you break them in about 30hrs. or so.I've used/tried these on both my desk/top computer (taking out the speaker jack & plugging these in after unscrewing the 1/4\" jack supplied) & on my \"High End\" Stereo system.Pros: Fit snuggly, adjust well, not too heavy; They work well (for large cans) and loud on a fair/low amount of energy; Decent amount of \"presence\" and spacial deffiniton; They have clear sound that won't show the immperfections of some recordings; A nice touch, one cord feeds both ears/speakers on the left side; Design style folds up small for it's overall size. Nice Length/design to the cord.Cons: A Weak bass response that becomes muddled if pushed (loud) at all. Mid range response is loud yet sounds \"flat\". And highs that sound \"clipped\" and not really distinct.(These comments may be a little harsh for the price range but I'm trying to steer you towards somthing better if you are willing to spend a little more)Anyone really wanting to dramatically improve their lisenting experience, and using/needing headphones on a regualr basis should spend a little more money and buy any sennheiser or a grado product. For the money, these are excellent headphone alternatives for whatever additional amount (more than this) your willing to pay.All in all, not a bad product solid good plastic construction in design, not a stand out (in sound) either.And for the money seemingly average. My advice is to spend a bit more and get somthing that you will really notice the difference in and say wow! Than you will have somthing that will last you for years to come...", "overall": 3.0, "summary": "Great Entry Level Fir the Money / But", "unixReviewTime": 1172188800, "reviewTime": "02 23, 2007"}