{"reviewerID": "A2A3HDJXDN8W47", "asin": "140053271X", "reviewerName": "Bob Noble", "helpful": [5, 11], "reviewtext": "Here's my take on NST:  This is a very nice, but very limited reader.  I LOVE THE DISPLAY.  That's it.  A real home run?  Not quite...Quick summary is that they won't sell me any other unit with an LCD (I spend all day looking at one of those, I don't want another one for my fun-reading).  I might as well use my netbook or go all the way to a real tablet, and that won't be from B+N.Here are the problems with the whole Nook thing.(1) You can't use it for a PDF, magazine, or anything with graphics because YOU CANNOT ZOOM OR ROTATE. I have purchased some books with pictures and figures that you can't see.  Guess they want you to get the color tablet-like Nook, huh?  Nope, not going there (see above).(2) YOU CANNOT SHARE BOOKS. Yeah, yeah, they SAY you can, but that's VERY LIMITED and makes no sense.  (If the publishers trust them enough with their DRM to have the book at all, why can't you transfer the book to someone else using the same DRM?) I can get a paperback, read it, and share it forever.  Not so with Nook and you know it.(3) B+N (and everybody's) E-BOOKS COST THE SAME AS A NEW PAPERBACK, even though the seller didn't incur any cost of printing, shipping, inventory, etc.  But I can get a paperback for 25% off at my local Kroger grocery store for new releases and best sellers, or I can go down to the used book stores and find quite a few titles at 50% (or more) off list.  When everybody in my family has read that book, I can sell it to the used book store for 15% or 25% of list value.  That's a win-win.So, where's the advantage with a Nook other than it's cool?  Three strikes (it could get one more if you count fragility compared to a paperback book).  This whole e-reader thing is bravo-sierra at this point.That's my $0.02.  Just wish I had known this before I spent the hundred dollars.", "overall": 1.0, "summary": "In baseball, with 3 strikes, you'd be out", "unixReviewTime": 1332720000, "reviewTime": "03 26, 2012"}