{"reviewerID": "A39K7R4Y1ZD5SZ", "asin": "140053271X", "reviewerName": "cacalazani", "helpful": [507, 525], "reviewtext": "I purchased the Kindle (Wi-Fi) and the original Nook (the B&W; one) and tried them out during the return period. While there were things about the Kindle I really liked (features that other reviewers on the Kindle site had written), the one thing that made me choose the Nook was the ability to borrow and read ebooks from my local library. Haven't been back to the library since!Now here comes the Nook Simple Touch Reader (Nook STR). I got one via pre-order when they came out in early June.  It has the same e-ink Pearl screen as the Kindle, so the screen contrast is no longer an issue. And wow, has the user interface improved over the original Nook! (which I thought was clunky) The entire e-ink Pearl screen has full touchscreen capability. On both the Kindle and the original Nook, I felt myself wanting to touch the screen to select a book to read, instead of using the buttons (on the Kindle) or the LCD touchscreen (on the original Nook) to highlight and select the desired ebook. On the Nook STR, the Library screen shows icons for all the ebooks loaded in the device (both library and purchased). Touch the icon, and the ebook opens. Turning the page? Touch the screen on the right side of the page (to go forward) or the left side (to go back). Or swipe your finger across the screen as in flipping a physical book page. Or use the buttons built into the frame. Want to page quickly through a book? Hold down the page turning button. Need a word definition? Touch and hold on the word and a dictionary pops up. The user interface resembles that of an iPhone or iPad, with the icons, virtual keyboard and the physical home button. It even has the \"slide to unlock\" feature like the iPhone. The touchscreen on the Nook STR is infrared (it senses the heat of your finger, again like iPhone), so a light touch works just fine. I found that on the original Nook, sometimes it would take multiple touches on the LCD screen for the device to recognize a command.In response to the reviews about the touchscreen ceasing to respond, the pre-order Nook STR I had suffered from that problem.  The touchscreen would become slow to respond, and eventually quit working altogether.  A power cycle generally brought it back.  I started a thread on B&N;'s website about this and found many others having the problem.  I did take my Nook STR back to B&N; and they exchanged it.  Have had the replacement Nook ST for six weeks now and the problem hasn't returned.  So don't be spooked about buying one due to this problem - if it happens to you, exchange it.Going back to library books, I had to install Adobe Digital Editions onto my PC (my library had the link to download - free).  This software allows you to manage your ebooks on your Nook.The Nook STR is a good choice for seniors that may not have extensive computer skills.  Using the device is easy enough, but loading books from a library website (via Adobe Digital Editions) requires a few steps to complete.  If help is needed, it can be a positive relationship-building experience.One last plus - once you get your Nook STR, check the \"Shop\" tab to access B&Ns; website.  Every Friday B&N; offers a free book for download, and has discounts on other days of the week.", "overall": 5.0, "summary": "Simple (To Use) Touch Reader", "unixReviewTime": 1311465600, "reviewTime": "07 24, 2011"}