{"reviewerID": "A25ZRQBJFOIQNA", "asin": "B00001W0EQ", "reviewerName": "tellitlikeitis", "helpful": [0, 0], "reviewtext": "I love Plantronics headsets. The one I use for Skype and for my computer has worked flawlessly for over 9 years. The one that my boyfriend uses for his cell phone has worked flawlessly for the past three years on a daily basis. When I needed a headset for my Samsung Brightsides, and other cheaper brands were failing me, I decided to shell out money for the Plantronics Mobile Convertible Headest.The sound quality on this headset is clear without any fuzziness or distraction. However, and this is a huge however, even on the highest volume setting on both the phone and the headset, the person on the other end of the phone has a very, very quiet voice. You are constantly having to ask them to repeat what they said, and for me, that's a problem. I tried fooling with the settings. I have had everything from ear buds to headsets with the Brightside and the Plantronics Convertible Headset has the lowest sound of any of them.The convertible feature is nice. You can use it as an over the ear headset or a headband style headset. I was not interested in the over the ear headset offering, so I immediately made it into a headband style headset. The little &#34;ball&#34; that the headband attachment seats into is not very sturdy and the constant swivel makes it easy to break if you aren't careful. I do like the swivel motion, so that you can adjust the ear cushion to fit comfortably on your ear. One note about the headset in headband mode, even though the height adjusts, it doesn't adjust far, either that or I have a really tall head, because I couldn't get it to adjust high enough to fit comfortably near my ear, it was always slightly above.Another complaint about the headset is the side that does not have the cushion is a very weird shape with grooves, and I have long hair, every time I removed the headset, it would get caught in my hair. I put a spare headphone cushion over it, but there was nothing to keep it in place. I would literally have to yank my hair, or cut my hair around the headset to remove it from my head. This is while sitting in one place, with the headset placed on carefully and not adjusting it all day. I tried both with my hair down and with my hair in a pony tail and both ways the headset would get caught in my hair.This headset really defeats the hands free portion of a cell phone headset. You cannot answer a call without touching the answer button on your phone. If you are driving, or multi tasking, this can be a pain. I have a Samsung Brightside and I was having difficulties hanging up after a call, I would hit the end button, nothing would happen. I would hit the unlock button and then the end button, and nothing would happen. It was so frustrating. I eventually would have to remove the battery from the phone after every call and put it back in to end the call, not a whole lot of fun. This could have been eliminated had Plantronics added a simple hang up/answer button to this headset. I know it's not a difficult thing to add, because every headset and ear bud set I have ever owned has one, even ones that cost a third of the price.I had a lot of problems using these headsets with the Samsung Brightside, the sound would cut in and out and make it difficult to hear, the sound would have an echo to it, etc. I know the Samsung Brightside isn't a great phone, but I've had cheaper headsets with better quality with the Brightside then this headset produced.I did not try the over the ear mode, as I am not comfortable with that kind of attachment on my ear. Maybe if I wasn't dead stuck on a headset that goes over the head, headband style, I would have had more luck with this headset, but I doubt it. After three days of using one, the microphone snapped off. I decided to return both, while I could, to Verizon, and ask for a complete refund because this is definitely not what I thought I was purchasing.", "overall": 2.0, "summary": "Not The Worst Headset I've Ever Owned, But The Worst Plantronics Product I've Ever Owned!", "unixReviewTime": 1400284800, "reviewTime": "05 17, 2014"}