{"reviewerID": "A362UVNTN7KI68", "asin": "B00001WRSJ", "reviewerName": "Amazon Customer", "helpful": [5, 5], "reviewtext": "When I saw recently in SONY's on-line  store (store.sony.com/over-the-head/cat-27-catid-All-Over-Head-Headphones;pgid=m2lmcD9xx_pSRp3Bc5rNsKM_0000uLEOXrV1;sid=JA3P7quxLCbd7vj0oz9r6jO77TaBK2KKasjJt9Lj) that the MDR-V6 headphones have been re-issued as \"new\" in 2014, and that Amazon is an authorized dealer, I ordered a new pair to back up my original \"Made in Japan\" V6 cans that I've had forever as a recording engineer.The current ones are \"Made in Thailand\" and the box carries a 2014 copyright. The new 2014 version sounds close to my excellent Japanese originals that I used for monitoring/mixing/mastering in my recording studio. Evaluated using original lossless digital masters from my recording studio as the source, and measured against my studio reference AKG Austrian made K701s, I find the new V6 are not as well balanced across the audio spectrum as the K701 headphones. The 2014 V6 has a noticeable boost in the low bass - educated guess, about +4dB or +5dB centered broadly around 70Hz - making them a bit less suitable for studio work (monitoring/mixing/mastering) than the K701s, and about +2dB or +3dB higher in the low bass than my vintage MDR-V6 headphones were when new. The 2014 V6 has excellent mid and high range reproduction, has very good image placement/sound stage, and no audible distortion, but does not  reproduce the low end of my master recordings quite as faithfully due to the low bass boost.The fit of the new V6 for me is snug without being tight or uncomfortable. Leakage is minimal, if at all, at anything less than levels that will damage hearing; and the isolation from external sounds is very good. Fitment is good, and the stitching on the leather headband is well done. But physically they seem just a tad \"different\" somehow. The originals have the feel of solid construction. Although the new ones look to be put together well, they just don't give that same sense of being as solid and durable.Earpads look like the pleather that's been problematic in the past for flaking. Another minor gripe - the cable of the new headphones was so tightly packed into the box that the coils are deformed in several places - but I was able to get the cable back in shape.So I've knocked off one star because of my subjective feeling about the physical qualities, and being a bit less suitable for studio monitoring/mixing/mastering than the AKG K701s. I'd have to determine exactly where and how much low bass needs to be EQ'd down to use these as highly accurate reference cans. That shouldn't be with headphones billed as \"studio monitors\", and it's a departure from the signature of the original \"Made in Japan\" V6 headphones, which, when new, were essentially flat over the majority of the audio spectrum (+/- 3dB between 25Hz and 10kHz), as true studio monitor headphones should be.This 2014 version of the V6 is still very good for home listening enjoyment (they also sound darn good with my Samsung Galaxy S4 smartphone), but some may want to turn the bass control down a bit (about 3dB or so) on the sound source. Consider looking elsewhere if you need a tool to do critical, highly accurate analytic studio monitoring/mixing/mastering.", "overall": 4.0, "summary": "New 2014 version v. Old 1980s version", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"}