{"reviewerID": "A2XBKTBMLQRQAM", "asin": "B00001WRSJ", "reviewerName": "AmazonUser", "helpful": [4, 19], "reviewtext": "Several notes (mostly negative):1.  The cord is unbelievably heavy.  And the jack is massive.  It may very well be designed for durability, but these headphones are not portable in any sense.2.  The headband just is not well designed.  It is made of very wide metal, with a vinyl padded cover.  The headband bows out tremendously -- I mean like 2-3 inches wider than your head on either side, unless you play offensive line in the NFL.  This not only looks awkward; it feels awkward.  Essentially the headband makes contact only at the very center of the top of your head.  This might not be a huge deal, but the headphones are quite heavy (compared to, say, any Bose headphones), and so you feel the whole weight of the phones on the top of your head.3. The earpads feel pretty nice.  But when I switched back and forth between 2 Bose around-ear headphones and these, these ones were much more cramped around your ear.  So not terrible, but not all that roomy.4. The sound struck me as very bright.  The most treble I have ever heard from any headphone or full-size speaker.  On certain songs, this is a plus, but for most, it is a bit irritating.  [I listen to a wide variety of 60s-90s rock mostly -- from REM to Snoop Dogg to Bob Dylan to the Clash to Soundgarden to Stevie Ray Vaughn].  In head-to-head comparisons with other high-end headphones, I judged these to be very light in bass.  It's hard to say if they are deficient or the others are exaggerating the bass (I am not a wannabe audiophile), but to me, these headphones lack fullness.  On the plus side, I can hear cymbals and snare much more clearly than with most headphones.  But the botom line is that I need to set my equalizer to reduce treble and/or increase bass to enjoy my music.  And I am someone who rarely touches the tone settings on a stereo (preferring a neutral sound) and am particularly unlikely to feel the need to increase bass.5. They are not very loud.  Only a bit quieter than the Boses, but if you are using an Ipod, they really aren't quite loud enough in my opinion.  The Monster Beats headphones are much, much louder, if that is a concern for you.6. While they do not actively cancel noise, I found them to be quite good at isolation.  Ambient sound was significantly reduced, arguably more so than with the Boses.Overall, too big and heavy and uncomfortable.  I would possibly overlook these issues if the sound was incredible, but it lacks fullness in my opinion.  It might be very good for some kinds of vocals and music, but not for rock music.", "overall": 2.0, "summary": "Bulky, uncomfortable, and very bright", "unixReviewTime": 1243209600, "reviewTime": "05 25, 2009"}