{"reviewerID": "A1423HNZ15ZCQZ", "asin": "B00001WRSJ", "reviewerName": "Ananke", "helpful": [0, 0], "reviewtext": "I got this on Amazon One Day Sale event...These are great headphones, and in general great electronic equipment, reminding me of the Great SONY of the 80s, when they were making everything with great quality and absolute attention to details. The plastic is solid, the cables are soft and not sticky, the jacks are smooth, the inner steel spring is high quality and elastic and it has small marks to click and lock the headphones opening, L and R marks are different color and glued perfectly on their designated spots :), etc etc. small details, that are indication of how well a product was designed and made. These headphones are such a perfect product.I have very large head - for example, all my life I cannot find sunglasses wide enough to fit me. These headphones are elastic to stay firm, and open enough to fit me without causing any discomfort for several hours. Yesterday I used them non stop for 3 hours - they are not irritating, not heating, not making my ears sweat, etc. I don't think they are tight at all, as some other reviewers mentioned.The cord is long - definitely too long for portable/gym use. These are meant to be used in static condition, in a studio/room/desktop situation. Sitting in a rolling chair, one can move, turn, spin, without needing to take them off.Sound fidelity - great. These are sounding great, not colored, sensitive without pre-amp need. On par with everything that is not pro level and costs up to $300. Definitely worth the money.p.p. I have owned and used probably around 200 headphones, listening from vinyls, pro level studio magnetic rolls / those 64-track ones :) /, micro cassettes, CDs, Laser Disks, all kinds of computer format audio, so I know about electronics. These V-6 are worth the money.", "overall": 5.0, "summary": "These are great headphones, and in general great electronic equipment", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}