{"reviewerID": "ADXSJ9MBHM236", "asin": "B00001WRSJ", "reviewerName": "Barn", "helpful": [9, 10], "reviewtext": "This review is aimed at those with eyeglasses and whose ears get pinched between the eyeglass arms and the earphones. I do not like to block up my ears with ear plugs all day for health concerns. I have bought and used these:Sony MDR-CD230Sony MDR-V6Sony MDR-XD200My ears are not real fussy on quality, nearly all headphones give my ears a problem by pressing them against my eyeglass arms and this hurts, usually after 10-20 minutes of listening. My hatsize if about 7.25,my ears are pretty normal in size, I am middle aged. All three of these headphones I own are the best I have tried on or read reviews by eyeglass wearers over past 2 years. Headphones have a left and right side - the cord typically is attached to the left side, and the ear spaces, or cups, are oriented accordingly, to that the back of the ear lobe has more space to sit in than the front of the ear lobe. The sideways pressure (how hard they clamp onto your head) also is a secondary factor in whether my ears hurt. I wear wireframe glasses, and my use for headphones is background music while I program.$30 The CD230 is no longer available, that I could find (Fall 2006), and I've used them for 5 years. They hurt my ears after 3-4 hours of continual use, but are good before that. They have cloth covered ear cushions, and relatively deep ear lobe spaces. This feature in all earphone seems to be the primary feature that determines whether my ears hurt or not. If you can find these, and like cloth covered headphones, you won't be unhappy. The sideways pressure is light for me.$64 The V6 stands out for 2 things - richness and accuracy of the sound and blocking out outside office noises. Listening to classical music, not real loud, a co-worker can speak to my face and his voice is muffled pretty well. (Women's voices too). Overheard conversations are not overheard.I have used these occaisionally for a couple months and my ears/head get sore after 1-2 hours. The sideways pressure is noticeably more than the other two, but not excessive. They are well cushioned, with soft fake thin leather-like vinyl which I did not find causes sweating at all. But there is not a large space for the ear lobes to sit, and this is what causes pressure after a while to build up uncomfortably I am sure. If I did not have my eyeglasses on, then these are very comfortable.$26 The XD200 is a little lighter than the V6, it does not block out outside noises as well, which can be a benefit in the office because I can hear co-workers calling my name. The sideways pressure is light, the cushion is the same thickneess as the V6 but the ear space is much deeper for the earlobe, so for this reason it is the most comfortable of all headphones I've owned or tried. The cushions are covered in the thin leather-like vinyl like the V6 - this stuff feels like a paper much more than a plastic, it feels dry, not clammy. To my unprofessional ears the sound is great. If you wear eyeglasses, don't want to use ear plugs for hours at a stretch, then I think you will be happiest with the Sony MDR-XD200 headphones.", "overall": 5.0, "summary": "very good sound and noise blocking, not the best for eyeglasses", "unixReviewTime": 1168560000, "reviewTime": "01 12, 2007"}