{"reviewerID": "A1LHMSY3Q46PJS", "asin": "B00001WRSJ", "reviewerName": "Bob \"Bob in Big Bear Ca\"", "helpful": [0, 0], "reviewtext": "I've used more than a few headphones over the years, including some Sennheiser pro studio models. The Sennheiser' are typically uncomfortable after an hour or two, so if you plan to spend time at a board they can be painful, and depending on how long you where them the pain can last a day or two. The Sony V6 headset is very comfortable enough so that I've used them all night well actually all day and night without experiencing much discomfort, and the sound in my opinion is superior to anything I've tried recently. In the last few years I've switched to using earbuds for most of my casual listening and simply had forgotten how great a decent full size headset sounds.Over all, I've found this set to be very true reproducing recorded music, and are better than anything I've used in the sub $150.00 price range. One test I've used to compare sound reproduction in the past is to listen to a clean recording of a few acoustic instruments, especially the sound of a piano. If a headset can reproduce the timber and resonance of a full size piano they're usually a good bet. Being a acoustic string guy I also look at how well a set will reproduce the sound of a high end acoustic guitar, mandolin and violin. If they are accurate on those simple tests then I would grab them. This set does a fantastic job of reproducing the sound of everything I listen for with exceptional precision. I paid a lot more than a $100.00 for my Sennheiser' but this set sounds better and is much more comfortable to wear even for short periods of time.I would highly suggest anyone looking at these give them a try and see for yourselves just how good these sound. The range from 5 HZ-30 KHZ should be ample for anyone though the Bass is not exaggerated it is clean tight and powerful enough for myself anyway. Honestly these would be a very good choice for home studio or for casual listening, and if you've been spending hundreds on earbuds you have to give these a try.", "overall": 5.0, "summary": "Finally a headset that produces clear balanced sound well under $100.00", "unixReviewTime": 1340668800, "reviewTime": "06 26, 2012"}