{"reviewerID": "A36MHSUQIH1XJE", "asin": "B00001WRSJ", "reviewerName": "Brandon Hann", "helpful": [0, 0], "reviewtext": "I bought these because I was looking for a nice pair of headphones that sounded as good as the ones I remembered using as a kid when I had to listen to music through headphones while not disturbing my parents watching tv. Little did I know that Sony still makes the same model! That's right, some 18 years later, I now own my own pair of the exact same headphones. If the fact that Sony still makes the same headphones without any changes doesn't say enough about these, then nothing I say would do much justice, but I'll try anyway.I have a 24\" head and despite the other reviewers who have said these headphones fit too tightly, I bought them anyway. Once I got them I did notice they are a bit tight, but since I have no plans to sit in one spot for more than a few hours with these on, this is not a concern to me. Plus, in time I expect them to loosen up a bit simply through constant use. The padding on the ears are very nice, but I can see how wearing these for hours on end might get a bit annoying, but that would probably happen with anything you put on/in your ears.Once on, I can't think of any other headphones I've tried that sound as good. For my desktop speakers, I use aKlipsch ProMedia 2.1 THX Certified Computer Speaker System (Black)that sounds amazing when playing songs through iTunes or Pandora, so I needed something better than the Apple earphones I was using when I didn't want to blast out my roommates. The MDR-V6 headphones do just that. Of course they don't have the same punch as a floored subwoofer, but surprisingly, the bass in these headphones is quite noticeable.Until I bought these, I wasn't even really using the iTunes equalizer. Now as I change music, I change the EQ because the headphones make you hear sounds you've never heard before! I feel like going back through all my music just to see what I've been missing.", "overall": 5.0, "summary": "Hear things you've never heard before", "unixReviewTime": 1318204800, "reviewTime": "10 10, 2011"}