{"reviewerID": "A3DIEJHDPL4PUC", "asin": "B00001WRSJ", "reviewerName": "Brennard", "helpful": [3, 3], "reviewtext": "These are a great pair for the price, ~35 cheaper than the MDR7506I have just started listening to the V6s and have had the MDR7506s for a little over a year.Honestly, you get what you pay for most of the time, except for the MDR 7506 and V6 cans. They both are undeniable stars in the headphones scene.The difference between the V6 and MDR7506 is very small, but there is a difference, both in sound (maybe my V6s just need to break in, but I generally don't believe in the break in process for speakers)The MDR7506 from the very beginning were absolutely amazing. Very natural sounding, great ability to pick out little details in well recorded music. I loved listening to some of the Eagle's stuff on them, they have some crisp clean string sounds and well recorded drums. They are loose fitting on the ears somewhat, keeps your ears feeling free and comfortable. The cable is very good rubber, limber and returns to it's shape over a few minutes if left in a knot or stretched out.The V6s have an almost equally amazing sound, more bass response than the MDR7506. Seems that they lack (just very so slightly) the clarity of the MDR7506. Earpads are more of a matt finish and firmer than the 7506s. The cable on these is no doubt quality, and will last years under normal circumstances, but the 'nice' factor is not the same feel. The actual plug is just like that on the 7506, same screw on 1/4\" adapter, but the shell is nickel finished instead of black, and the contacts on the plug are nickel plated instead of gold plated. Nickel is actually preferable, against popular belief, because a majority of the jacks it will be plugged into in it's life will have nickel plated contacts, and dissimilar metals will corrode when touching. Not really a problem in a clean, dry studio, but the ideal thing is always to be kept in mind.In the end, if you're looking for good headphones for studio or engineering of some kind, go with the 7506, if you're doing an at home studio or just want bang for the buck to plug into your ipod, the V6s are where it's at.", "overall": 5.0, "summary": "VERY good headphones. Great value for studios.", "unixReviewTime": 1368662400, "reviewTime": "05 16, 2013"}