{"reviewerID": "A2O9JVPA8VZFXE", "asin": "B00001WRSJ", "reviewerName": "Brian Hawks \"Brian\"", "helpful": [0, 0], "reviewtext": "I originally bought these headphones to go with our digital piano, but my wife didn't see any need for them, so they became my computer headphones. Darn :DI want to start out by pointing out that these headphones have a very soft feel on the head, yet are firm enough to not fall off. Sound quality is extremely important to me, not just blasting bass or highs or anything. These have excellent fidelity. You can hear the highs, the lows, and the mids very clearly on this set, and one is not overpowered by the others. One thing I have noticed about lower-end headphones is the fact that when you have too many things going on in music (or games, or movies) some parts start to literally get lost as the headphones simply cannot handle that many streams simultaneously. These headphones do not have that problem. After reading the reviews from people who have enjoyed theirs for ten to twenty years, I look forward to a long relationship with these.I listen to a wide variety of music, and everything from Linkin Park to Mozart sounds great on these headphones, as well as a wide variety of PC games ranging from thrillers where hearing clearly is essential to survival, to FPS games with explosions and gunshots. I have noticed with these phones, I feel like I have my 5.1 system on, and have to take them off to ensure I am not being obnoxious to my neighbors, only to learn that it is simply the quality of the headphones that I am hearing. The same thing happened with our digital piano, I thought I was hearing the piano outside of my headphones as well as inside them, but that was not the case. Anyone who is disappointed by these either has ridiculous expectations, or they do not know what sound quality is.Update 2/15/2013So, I wanted to get on here and make another comment on the comfort and noise reduction. I have put them on when I sat down at my computer, only to realize an hour later I was still wearing them, and not listening to any music. They are comfortable enough to forget that they are on, and the are noise cancelling enough that they literally cut the noise levels in the room in half. I continue to love them.", "overall": 5.0, "summary": "Most comfortable headphones I have ever put on.", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}