{"reviewerID": "A24SCH81NLQW9A", "asin": "140053271X", "reviewerName": "David L. Williams", "helpful": [4, 6], "reviewtext": "First let me qualify my comments.  If you are looking for an all purpose ePad or IPAD alternative, buy another product!  That's clearly not what Barnes and Noble designed this unit for.  It's not intended to surf the web, check email, etc.  It is an eReader...PERIOD!Having said that, in my opinion, it is the best out there right now.  It is incredibly light weight - much lighter than even a typical paperback.  It is easy on the eyes for extended reading periods and can be read in basically every lighting situation you could read a real book.  The clarity is sharp but not overpowering on the eyes like an LCD type display is after a few hours.The battery life is insane.  If you turn off WIFI, which should be normal unless you are looking for another book, the battery doesn't need recharging for weeks on end.  Page turning is a simple touch to the left or right of the screen.  Assignable buttons are also provided for pagination but they require a rather firm press.  I found most of the time I don't use them.It has a very responsive touch screen for all your navigation.  I had a 1st generation Nook and this one is far easier to navigate through books which is a big plus for Bibles or Reference books.  It reads ePub format so more than half of what I read comes from the public library.It is not going to be great for color magazines and so on.  You will need a Nook Color or an ePad like Xoom or IPAD for that.  But the downside with those is that the LCD type display cannot be read in direct sunlight so good luck at the beach or pool.One nice feature I use now and then is the dictionary.  If you come across a word you are unfamiliar with you just touch it and up pops an option look it up.  I think Barnes and Noble has a winner here.", "overall": 5.0, "summary": "Great eReader in Every Respect", "unixReviewTime": 1310515200, "reviewTime": "07 13, 2011"}