{"reviewerID": "AUNJAQP3VECI5", "asin": "B00001WRSJ", "reviewerName": "Daniel Ahn", "helpful": [1, 1], "reviewtext": "Hello, This is my first review for the Sony MDR-V6 with CCAW Voice Coil.SoundFirst I would like to mention that these headphones sound pretty amazing. I've had bad headphones in the past that had terrible bass or treble, but for me its very well balanced. The only complaint about sound is that if you play any songs that has a lot of treble in it, it may not sound as comfortable in the high ranges. Some people mentioned about a &#34;boomy bass&#34; and I disagree. I think the bass is completely fine (I still need to go hear some hardcore bass drop of a dubstep though). I like bass a lot and I put my iPod with Bass Boost and it still sounds fine without being &#34;boomy&#34; or &#34;vibrating.&#34; I listened with my galaxy s4 and that sounded fine as well.ComfortSome people complained that the headband hurts while others say its comfortable. For me, It was pretty comfortable, but not as comfortable as I thought. At first, it's going to hurt the top of your head for a bit, but after you wear it for a couple of days the uncomfortable-ness goes away. Right now after 1 week, I don't complain about the headband at all. Just like any other over-ears it does get sweaty a bit, so don't wear it for too long unless you have air blowing in your face the whole time :P.BuildThe build is pretty solid, but the plastic on the sides makes it feel slightly cheap, but its not much to complain about. It's well built overall and it's portable which is a plus for me.AccessoriesIt comes with a bag that you can put your headphones in, which is pretty nice and unexpected. Also it comes with a 1/4&#34; screw on. Problem I had with this screw on is that when I took it back out, for whatever reason the 1/8&#34; connector bent in the middle slightly (maybe because I screwed it on too tight or something.) I just bent it back with the 1/4&#34; adapter putting it slightly in and bending it the other way and it was fine.OtherAnother thing I noticed was that the cable end doesn't really fit well into my s4 when it has its case on. I have to shove it in a little bit for it to go all the way in. Because it's also with a metal end(which makes it pretty solid instead of a cheap plastic one) I sometimes have problems connecting it to devices like the ipod and s4. But if you just give it a slight push then it should go all the way in. I wish the 1/8&#34; was a tiny bit longer so that it wouldn't have to be shoved in.Pros:- Great sound quality. For the most part balanced.- It's actually quite comfortable once you get used to it.- It's portable- It has the coiled wire so it doesn't tangle so easily- It comes with a convenient 1/4&#34; cable. I use it for my P-155 Yamaha Digital Piano.- It doesn't squish your ears, but isolates a lot of sound if you have sound running through the headphones.- Solid Metal endingCons:- High range in treble can get screechy (but that's if you go really high)- It is uncomfortable at first to the top of your head.- The wire is a little bit too long.- The metal end sometimes makes it uncomfortable to insert into devices like the iPod or your phone.tl;dr: it's very good product for headphones under $100.", "overall": 4.0, "summary": "Some really nice headphones for a reasonable price.", "unixReviewTime": 1371945600, "reviewTime": "06 23, 2013"}