{"reviewerID": "A5T08I564I0D5", "asin": "B00001WRSJ", "reviewerName": "DeeJaye6 \"- DeeJaye6\"", "helpful": [4, 4], "reviewtext": "Over 20 years ago, I had started working at Circuit City and I wanted to buy a good pair of headphones, especially since I got an employee discount of store cost.  :-)  I tried on all the headphones on the rack, not listening to anything; I just snapped my fingers and listened to how well each headphone muffled the sound.  The Sony MDR-V6 pair did the best job.  Based on that, I bought them.  Imagine my shock when I listened to them and realized that they gave me better sound than my actual speakers did!  Over the 20 years since then, the padding disintegrated, and in my last move, they got... um.  A bit crunched.  I was heartbroken, as I remember Sony replacing the V6 with a far lesser pair of V600 headphones.  They had (I thought) renamed the V6 and tripled the price.  Not so, apparently!  I found my current pair of V6s right here on Amazon for the exact price I'd paid for them (at cost, remember) back in 1987!! (9/20/13 Edit: I bought them for sixty dollars both times; I've seen them go 50% higher on Amazon, but as long as they are less than a hundred, they are still worth it.)If you have any desire to hear your music without distraction, if you want the headphones that professionals use, if you want to have sounds coming at you that you cannot even *hear* but more feel, then buy these headphones!The sound quality is unparalleled in its price range.  Even going double or triple the price does not guarantee you a better pair of headphones, but there are some at higher prices.  Point is, you don't need to go that high for top-quality 'phones.  The 10-foot cord may seem like overkill, but when you need to get up from your chair to close that window, or answer the phone you left on the cradle on the other side of the room, or to look out the front window to see whatever, you will appreciate not being tethered.  Those ten feet equal freedom of movement that couples with phenomenal sound.The phones even let you do that little thing you see professionals do in those shows, where they flip an earpiece over and hold it up to their ear without putting the band over their head!  Or, flip one *while* it's over your head to enable a friend to listen to what you're listening to!I have read some people saying that these phones are uncomfortable.  I cannot imagine how that is possible.  The padding is quite comfortable (if short-lived in the earpads), and they manage to be snug without being constricting.These are, of course, NOT headphones to be worn while exercising unless you really want your ear pads soaked in sweat.  But that aside, these honest-to-goodness studio monitors will faithfully reproduce any sound you can throw at them, and never give you distortion from having the music turned up too loud.  You may go deaf from it....  But it won't be distorted!  :-)", "overall": 5.0, "summary": "Quite Simply the Best Headphones for the Price", "unixReviewTime": 1253577600, "reviewTime": "09 22, 2009"}