{"reviewerID": "A21623VNZ5H1YE", "asin": "140053271X", "reviewerName": "Emma L", "helpful": [5, 5], "reviewtext": "I have had my nook simple touch for a few weeks now- I previously owned a Sony Reader pocket edition, and I own a iPad. This device fills a niche- if you want to annotate pdf documents or watch movies or any of those other things, get a tablet or the iPad or the kindle fire. This device is designed to read books, and it does a beautiful job at it. I purchased my Sony reader expecting to be able to add comments in it, but it was way too difficult, and ultimately I decided to purchase an iPad. Like the Sony reader, the nook can take notes but wouldn't be a great device to purchase for that purpose.It was pretty easy to set up- I didn't read the instruction manual, but I usually don't. I just followed the on screen instructions to connect it with my internet, my barnes and noble account, and then plugged it into my computer to sync it with library books. I had a bit of trouble connecting it with my internet, but that has happened with every new device I've purchased, so I think its my internet's fault, not the nook. I went through the steps a few times and then it started worked.I really like holding it to read- I generally read ridiculously thick books, so its nice to have something small and light to hold instead of a massive book that I have to prop up (and its so much nicer to read from than an iPad- the iPad is fine to read from, and i never seemed to feel screen fatigue, but it is way too heavy to hold with one hand). Initially I didn't realize that the two buttons on either side of the screen move the page forward or back, so I was touching the screen each time- the delay time is a bit longer that way, and it was annoying to have to use both hands. As soon as I realized that the buttons existed, the experience got even better.The battery life seems great- I charged it all the way up using my usb-to-outlet power adapter that I have for my iphone/ipad, and it worked great. I haven't had to charge it again, and I've been reading for about an hour each day.The one thing that surprised me and was frustrating for a few minutes was when I realized that I couldn't load my other epub books onto the nook because there wasn't enough room. The advertised size of the nook is 2gb, which is a ton of books, but it wasn't enough room for the books I've acquired through other sources- like google book downloads. A quick google search solved this problem- barnes and noble appropriates the majority of this space for content you purchase directly from barnes and noble. Fortunately there is an easy solution- there is a slot for a microSD card, and I happened to have a 2gb one lying around- plus they only cost about $5, if that. I popped it in, turned the device off and on, and I was ready to go again. Not a deal-killer by any means, but something to consider if you're planning to add your own epub library to your nook.Kindle vs. Nook- I haven't owned a kindle, only used it for a few minutes, but my personal opinion as I decided which to purchase was this: price was important (and I got a great black friday deal on the nook), and since they were about the same price I wanted to support the more open epub format, since you can load books from other sources. Yes, its possible to convert epub to kindle format but its an extra step that many people won't be interested in. I would have purchased the kindle with special offers, and hadn't thought much about it, but I've enjoyed the pictures of authors that show up on my nook screen, and would probably get annoyed by the commercials/make a point to put my nook in a case so I didn't have to see them.Durability- I haven't abused it by any stretch of the imagination- yet- but it did take a fall off a coffee table and didn't crack/break/show any sort of damageI'll update my review as I have more time to play with it in the next few months", "overall": 5.0, "summary": "Great purchase- you won't regret it", "unixReviewTime": 1323388800, "reviewTime": "12 9, 2011"}