{"reviewerID": "A2LAY11C7LCM2W", "asin": "B00001WRSJ", "reviewerName": "D. Wendel", "helpful": [139, 143], "reviewtext": "NOTE: These headphones are in every way the same as the MDR-7506's, well-loved headphones for studio work.  Even the replacement part #'s are exactly the same.  So this review is for either one (I bought both).Anyone who has been listening to music on normal street headphones will be blown away by these.  The first thing you notice is how soft and comfortable they are to wear - the earcups surround your ears, leaving no pressure on the ears themselves.  Then, when the music starts, you notice:1) background noise is blocked out2) bass is full and punchy, not muddy, boomy, or distorted3) every detail shines through4) the music is LOUD for the given volume settingHere are my comments on these four aspects:1) background noise is blocked outBecause these headphones surround your ears and are \"closed back,\" they really do diminish outside noise.  It's nothing like the Bose active noise-cancelling headphones, though - these ones just turn down the volume on outside noise rather than pulling the plug on it.  This is on purpose - many headphone designers feel that active noise cancellation discolors the sound too much.2) bass is full and punchy, not muddy, boomy, or distortedThe drivers are big on these, and the CCAW coils let them draw power when they need it without getting muddy.  If you do hear distortion, it's probably that your player can't dish up enough power, so try switching to a good amp.  My portable CD players works fine though, and I hear ipods do too.3) every detail shines throughThese headphones are really detailed, meaning they reproduce high mids and trebles well.  You will probably hear things you've never heard before like breaths, guitar fretboard noises, and string instruments.  However, this makes you feel like you're right in the middle of everything, and it can get tiring after an hour or two.4) the music is LOUD for the given volume settingThe impedance on these is lower than most headphones, which means that for a given voltage these will draw more current and hence sound louder.  However, power is power, and your battery only has so much of it.  So these don't necessarily extend battery life, they just give you more options for how quickly to use it.For comparison, I also own the Sennheiser HD 201, 280Pro, and 595.  All are more soothing (less bright) while retaining the detail.  The 201's don't match the bass or noise dampening of the V6's.  The 280Pro's don't have quite the same bass (still great!), are much less comfortable, but block noise better and sound sweeter.  The 595's are superior to the V6's in every way (bass accuracy, sweetness, comfort) except that they intentionally don't block out noise at all and require a good amp to sound their best.  (Plus they cost almost twice as much as the V6's.)In summary, you'd be hard pressed to find a better price/performance/comfort balance than the V6's.  Try the HD 201's first for classical or instrumental music (they only cost $20, so trust me, try them!), but if you want noise dampening and/or punchy bass, don't hesitate to grab a pair of these.", "overall": 4.0, "summary": "Great headphones", "unixReviewTime": 1162425600, "reviewTime": "11 2, 2006"}