{"reviewerID": "A2BMZRO0H7TFCS", "asin": "B00001WRSJ", "reviewerName": "Ed", "helpful": [11, 13], "reviewtext": "I did very well this past Christmas season.  I added theSennheiser HD-555and Sony MDR-V6 to my collection of headphones.  I intended to keep both because I was going to use them differently.  I got the Sennheiser HD-555 mainly for movies and the MDR-V6 for music.  Unfortunately, I had to send one of them back.PROS:- High quality build- Folds compactly- Fairly comfortable- Out of this world frequency range- Nice bass- Love the coiled cord- Includes carry pouchCONS:- Highs were harsh for meFirst off, I burned in both sets of headphones for about 2 straight days.  I then spent about 4 hours comparing both headphones with a variety of sources.  My intention wasn't to eliminate one but just to compare them since they were both nice headphones.Right away I noticed that the bass response on the MDR-V6 was much better.  Listening to rap, techno, trance, and synthpop was much more fun on the MDR-V6 than on the HD-555.  After a couple of hours, I started to notice I was turning the volume down on the MDR-V6 because it was causing discomfort.  However, I realized that it wasn't the volume, but that the highs in some of the music I was listening to were just harsh.  Too harsh.  The MDR-V6 is more than likely reproducing the highs accurately, but the trade-off is that some music was just too fatiguing to listen to.  Red Hot Chili Peppers just killed me!  If I hadn't been comparing them to the HD-555 I may not have noticed it.  I think I am in the minority of users who have an intolerance to those higher frequencies.  I was disappointed to have to send them back.  By the way, my source material were Lame VBR encoded MP3's, some FLAC encoded music files, and DVD movies.On the flip side, I felt that the actual physical comfort of the headband and ear cups were quite reasonable.  The pressure was not nearly as intense as theSennheiser HD-280 Pro.  The coiled cord, compact folding, carry pouch, and durability were all things I found to be very positive.I am not saying that the Sony MDR-V6 will be harsh for everyone.  I believe I actually have a heightened sensitivity to higher frequencies for some reason so it might just be me.  But if you get them and feel your ear drums ache, you may be experiencing the same issue I did.  A vast majority of users who have purchased them seem to have great success with them.  In fact, I recommend everyone at least try them.  They are an amazing deal on Amazon for legendary cans.", "overall": 3.0, "summary": "Harsh For My Ears, Maybe Not For Others", "unixReviewTime": 1262822400, "reviewTime": "01 7, 2010"}