{"reviewerID": "A193QPX2Z8K4HR", "asin": "B00001WRSJ", "reviewerName": "El Guapo", "helpful": [1, 3], "reviewtext": "Did research on headphones and have a few friends who are audiophiles (Dj's, gamer audiophiles and musicians). About this reviewers references.. Been listening to music since 1983.. have had my share of ear accessories - aiwa, sony, koss, sennhieser, random studio recording headphones (no idea what they were) and would say these mdr-v6's are good, but not great.. Sound clarity is definitely it's strength.  Everyone is going to have a personal opinion and mine is that these cans can be listened to for hours.  I'm shocked to have read that folks thought these were too bassy.  I'm on the other side of the fence.  I think however I'm all for basslines woven in with highs..  I suggest if anyone wants to test these cans should try their test on various media to get more out of their experience with these headphones.  So far they really can tell a poor mp3 over a larger audio file on itunes.  These are going to be used for personal enjoyment not for a professional studio.  I may try these cans on my dj friends equipment, but really don't want to take them anywhere but home.. yet these are transportable.About the comfort= my ears are small.. they are about 2 inches in height and 1.5 in width and fit right into the ear cushions.  Perfect. I can't hear a thing outside nor inside my room.  They do get a little warm, but not an uncomfortable type of heat.. more like these things are growing on your head! Snug fit definitely.. still new.Durability= yes these are questions I would've liked to have known before purchasing headphones.  I was hoping that the two elbows that hold the cans themselves would be solid steel or metal.. to my dismay they are those plastic (break this and you got to buy a new one) elbows.  I wouldn't mind finding a good pair of headphones that had a metal elbow that would hold them.. that is usually where they break/or get the wire pulled.  Hey there is an idea for a headphone maker!! Headphones that last.. but would probably be less business for them.. (they'd have my money and my friends).  Yes so just like many headphones if you sit on these flush.. you will probably break that part of the headphone.. haven't tried it yet though and not wanting to.In the end I am quite pleased with these headphones..  I guess the only coupe de grace would be durability/bass.  I would still like to test these headphones on dj equipment and other formats.*Just picked up some problems on the selling point of these headphones given the impedance rating on these phones they should sound good on my itunes :(  was listening to Deadmau5 with the track STROBE and the highs start to crack and pop.. now I'm starting to get a better feel for these headphones.  They sound good for (rock) sound tested Van Halen 1984.  I guess for the price you get something good not amazing. Listening now.. and not getting that tingly feeling you get when you're *embraced* by the mids *touched* by the highs and *rocked* by the bass..I think these are good for an overall good experience.. nothing mind/body altering.", "overall": 3.0, "summary": "Avid Listener= Journeyman Audiophile", "unixReviewTime": 1303516800, "reviewTime": "04 23, 2011"}