{"reviewerID": "A2L9EICT9AZ9AN", "asin": "B00001WRSJ", "reviewerName": "F-Rod", "helpful": [3, 3], "reviewtext": "Been kind of interested in adding another set of headphones to my collection. Mostly used for mostly music playback and some PC gaming. These headphones fit the bill. At their price, how can you beat these?Sound, these have a great sound. Just so you know where I'm coming from...I've been married to my Bose Triport headphones that I bought years ago. I paid $150 for those. Compared to those, soundwise, they're about even, with the edge going to the sturdier Sony's. The sound is excellent at the bottom, mid's and highs. I found the sound level to be even accross the sound field. Very flat. But flat in a good way, as these can produce very good lows, mids and highs. Not any one particular range dominated, which is perfect.Construction is without a doubt, excellent. These things will take a beating. The cushions are comfortable. I have a huge head and I found these to be fine. Not tight or uncomfortable.The only ding against this fine headset is the cord, it's long, thick and heavy. Not very portable. I wish there was a way to mod the wiring to put something like what Bose uses on these, then these would be PERFECT. I believe a different version of this headset has a more portable wire. 3.5mm jack is not compatible with iPhone's bumper case. Carrying case is thick and cheap looking.Overall, if you're a headset aficionado, I think you will appreciate these. A fine headset to add to the collection. Pass on the Beats by Dre, save money and enjoy.**UPDATE**10/21/2013**The cord was really getting to me, so I cut it. Big mistake. I was hoping to just splice the wiring and make the wire shorter, and manageable. When I went to cut the cord and strip the ends, I found these very thin wires. I believe they were L channel, R channel and ground. Well, when I went to touch the ends together and test, I got no audio whatsoever. GREAT, just killed a perfectly good set of headphones. Well, long story short, I was able to solder the ends together, insulate the solder with electrical tape and fix the headphones. Worked like a charm. I wouldn't recommend this to anyone. I lucked out. I thought this set was cooked for sure.", "overall": 4.0, "summary": "Great headphones", "unixReviewTime": 1375833600, "reviewTime": "08 7, 2013"}