{"reviewerID": "A2PNZBN5CNAHTR", "asin": "140053271X", "reviewerName": "g8er491 \"g8er491\"", "helpful": [1, 2], "reviewtext": "I bought this to replace a Sony PRS-300 that I thought was too heavy and too slow in the page turning.  Yes, the nook is quicker on the page turning and lighter but I am having too much trouble to appreciate faster and lighter.  I am having an infinite amount of trouble getting library books onto the nook - I've yet to succeed and the problems lie with adobe digital editions.  Why aren't nooks plug and play?  That's my first big problem.  I have no problem with my Sony and the library book I wanted is now on my Sony.  The second is that I like to read while I'm eating my lunch - ereader in left hand and fork in right.  It is not easy to change the page on the nook while eating - the bottom right corner is too far from my thumb and the bottom buttons are too high up the side.  The Sony has a set of buttons right in the bottom center, which is perfect placement.  I read the great reviews on the nook and for the price, I thought it was worth a try.  I'm also disappointed with the wifi registration requirement and wifi in general.  I don't need wifi on my ereader but it looks like they're all offering it now.  I also don't appreciate my registration info being used by B&N; as permission to start emailing me crap - I am already unsubscribed from that 'service'.  I'm definitely not happy with the nook and I'm going to save up my money to buy another Sony.**UPDATE 5/25/13**  I finally was able to download library books onto my nook but it was frustrating and time consuming; I finally found help online.  I have yet to discover a way to comfortably hold this book in my left hand and turn the page.  This was a very bad buy for me.  I bought a book-style cover for it and that was a waste of money as well as I find the cover just gets in the way.  I did not know how good I had it with the Sony PRS-300 and will continue to use my Sony instead of the nook.  I don't recommend the nook at all.", "overall": 2.0, "summary": "disappointed", "unixReviewTime": 1368748800, "reviewTime": "05 17, 2013"}