{"reviewerID": "A2K33VWYQC9C2W", "asin": "B00001WRSJ", "reviewerName": "jerry i h", "helpful": [0, 0], "reviewtext": "I did not know that Sony made headphones of this quality, and give this pair highest possible recommendation.Whenever you see words like \"professional quality\" or \"pro \"  or \"studio monitors\" in the product description, run in the other direction. 99% of the time, this is simply exaggeration by an ad copyist who has never been in a recording studio. The V6 is a happy exception, and certainly worth the price of admission.MONITORS?A genuine one must allow you to hear every last detail of the sound/voice/music:--the sound of the reverb of the radio studio--whether or not the announcer is using a pop and/or wind filter--how far from the mike the announcer's mouth is--what brand of mike is being used (for music, Neumann U87 or AKG have a distinctive sound)--mike placement in relation to a large chorus and/or symphony orchestra--acoustics/reverb-time of the performance venue--be able to hear individual tracks in a multi-track overdubYes, YesThere are not many headphones that meet these requirements, but the V6 certainly qualifies with flying colors, regardless of the cost. My old standard, AKG K340 Electrostatic/Dynamic, has long since given up the ghost, but these are a more than adequate substitution (besides, the K340 was a wee bit bright, but the V6 is much more flat).This is both good and bad: really good recordings will sound even better, but bad recordings will sound even worse.ERGONOMICSThe plug is solid aluminum rather than black plastic, but is straight rather than bent.The cord is long, and half of it is coiled, so you get plenty of running room, but is no good for on-the-go uses.Despite the conventional design, it is one of the lightest and most comfortable I have ever used. Many hours of non-stop usage is not unreasonable for this pair.The pads are large and surround your entire ear but are certainly not isolating. They are rather soft, and the material will wear out with time, so expect to replace them at some point (and the replacement pads ain't cheap).", "overall": 5.0, "summary": "Wow - real monitors", "unixReviewTime": 1349481600, "reviewTime": "10 6, 2012"}