{"reviewerID": "A3QNHDUBMA6WQM", "asin": "B00001WRSJ", "reviewerName": "John G.", "helpful": [2, 2], "reviewtext": "I first got a hold of my first pair of Sony MDR V6 Monitor Series Headphones in the late 90's.  Oddly enough, it cost about the same back then as it does today. The sound was phenomenal.  You actually had to lift the headphone to make sure the bass was not coming from the room.  Not that the base was unusually loud, it was just that is sounded so real.  These were studio quality headphones that were actually used in studios.  You would see these Sony headphones in practically every music video that was shot in a studio.Fast forward about 10 years, the headphone craze starts up. Every audio company want to break into the headphone market.  Sony adds newer models of headphone that still can't live up to the MDR V6's,  I decided that I wanted to replace the Sony MDR V6 headphones that had gotten lost long ago.  Used MDR V6 headphones were selling for over $150 if you could find them at all.  So I did a little research and found out that although there was a demand for these headsets, Sony had discontinued the MDR V6 line anyway. Luckily, the reason that I could not find the V6's was the when the headphones were first re-issued, they sold out immediately. Although I had to wait months, I finally got my replacement Sony MDR V6's.So what did I get for all this waiting?  I received a true studio tested headset that has a sound so clear that you wonder whether its actually coming from your headset.  Unlike some other headphones, the V6's did not artificially increase the treble or base.  These Sony's were designed to be studio reference headphones which required them to have a flat, unmodified sound.  In my opinion, these headphones are classics that arguably outperform newer and more expensive headphones.", "overall": 5.0, "summary": "So good that they brought back the Sony MDR V6 headphones after discontinuing  them.", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}