{"reviewerID": "A1EARN5PUVIF1S", "asin": "140053271X", "reviewerName": "Jerry P. Danzig", "helpful": [3, 3], "reviewtext": "This is the third ebook reader I've used and definitely the best.  The Franklin eBookman had nice hardware but dreadful firmware with more bugs than you would find in a swamp in summer.  The Ectaco Jetbook Lite had a number of glitches in its firmware as well, plus an extremely user-unfriendly upgrade method.I did encounter one major problem with this Nook Simple Touch -- the life of a battery charge was nowhere near the several weeks promised (with wifi off).  Fortunately, however, I called B&N; Customer Service, and they advised me to install the latest firmware, V1.0.1, which addresses the power issue.The upgrade proceeded easily and without glitches, and it seems to have solved the problem; though I haven't put the duration of a battery charge to the full test yet, the charge indicator is holding at 100% after a full day, including more than an hour of reading.  That compares very favorably to the 83% discharge rate I had been experiencing in just three days using the old firmware.  I will report back if the battery problem returns.Otherwise I prefer the Nook Simple Touch's ergonomics to the comparable Kindle.  The Nook's front is all screen, with no unnecessary keyboard keys.  Virtual keyboard keys appear onscreen when you need to search for something.  The unit fits nicely in the back pocket of my jeans or shorts, and it's trim and lightweight.There are convenient page turning buttons flanking the screen, making for easy one-handed operation in a subway.  You have a choice of font styles and sizes, and the screen is easy to read even under bright sunlight.  You can touch any word onscreen to get a quick dictionary definition (provided, I found, that the word isn't hyphenated and run on two lines).I like the ease with which you can download titles from the public library (you download to Adobe Digital Reader, which your library provides free, and then transfer the Epub books to your Nook with the USB cable provided).  The program recognized my Nook without any glitches.I also like being able to read any book for an hour a day FREE at the nearby B&N; store.Newbies should note that, in their apparent effort to keep the NST instructions short and simple, B&N; left out a few useful ones.  Notably: to close one book (so you can open another), press the Nook button below the screen (the thing that looks like an upside-down U) and enter \"library.\"  To lock the Nook immediately, without waiting for it to enter sleep mode, press the power button on the back briefly.  And to tell when the Nook has finished charging, wait for the little LED next to the USB input on the unit to turn from amber to green.So if you have been looking for an ebook reader offering great value and ergonomics, take a look at this Nook.  But make sure to upgrade to firmware V1.0.1 or higher!)UPDATE: Trust me to find the bugs in an ebook reader -- or perhaps they find me.  At any rate, I bought a copy of the American Heart Association Cookbook (7th Edition) and was dismayed to see some of the fractions describing quantities in recipes replaced by question marks!I emailed B&N; Customer Support, and they suggested that I try downloading the title again (which you do by archiving and unarchiving a title, whatever that means).  That didn't work, but I found that if I clicked the check box on the font selection screen marked \"Publisher's Default\" (or words to that effect), that seemed to solve the problem.  So if you're seeing question marks in any titles where numbers should be, try that solution!I sure love beta testing new products for these big companies -- NOT!", "overall": 5.0, "summary": "The Right Touch", "unixReviewTime": 1314489600, "reviewTime": "08 28, 2011"}