{"reviewerID": "A1VK3B8TFUUHM3", "asin": "B00001WRSJ", "reviewerName": "kcidybom", "helpful": [4, 4], "reviewtext": "I've owned every kind of on-the-head audio device from Koss electrostatics to el-cheapo convenience store earbuds, and I have finally found the perfect mix of style, comfort, value, and sonic accuracy.  It is difficult to believe (unless you've used these Sony's yourself) that any headphones can look so cool, be so comfortable, cost so little (relatively), and sound so good.  I listen to jazz, rock, reggae, classical, show tunes - pretty much anything, and no musical genre is shortchanged.  While high and middle notes are reproduced with exceptional quality and accuracy, it is absolutely amazing how well bass notes are rendered.  Listening to the double low C at the beginning of \"Also sprach Zarathustra\" is an experience not to be missed, and is especially remarkable because of the absolute lack of the doubling usually encountered with small diameter (relatively) acoustic transducers.  Breathtaking.  Buy 'em - you'll be glad you did.Update:  December 30, 2012Love these headphones, and it looks like I always will, but I have found a way to make them even better. Here is a review I wrote on improving the Sony MDR-V6 headphones:I bought these ear cushionsBeyerdynamic EDT 250 Velour Padded Earcushions for DT250, DT280, Sony MDR7506 and V6 Headphones (Pair)for my Sony MDR-V6 phones and could not be happier. The Sony cushions are certainly good, in fact are a cut well above average, but the Beyerdynamic's are still a clear step above even them. Wearing the Sony's with the original cushions for more than an hour left my ears a bit sore, especially at the very top and bottom where they were slightly pinched. The Beyerdynamics, however, allow me to wear the MDR's indefinitely with zero discomfort. I don't know if it's the slightly larger size of these cushions, or the material they're made from, but it's like wearing air - you simply don't notice their physical presence. And there is an additional benefit: for whatever reason, probably because of the superior seal these cushions make against your head, bass frequencies are enhanced over the already excellent bass produced by the Sony's. In fact, to make the expression of bass consistent with mid and high frequencies I found using an equalizer helpful. The lowered requirement for the headphone amp to produce bass frequencies allows it to reserve energy it can then use to support a wider, and more accurate, dynamic range. A win-win situation all because of better ear cushions!In an earlier review I read about how to install the Beyerdynamic ear cushions. Nevertheless, I approached the job with more than a little trepidation, worried that I'd end up with a pretty but non-functioning pile of junk. Not to worry though, a good tug removed the originals and installing the new was a pretty obvious procedure. Glad I did it! And yes, at least for the Sony headphones, toss the plastic flanges that come in the package. They might be needed for some other headphone model, but not the Sony MDR-V6's.", "overall": 5.0, "summary": "Wonderful Headphones", "unixReviewTime": 1351123200, "reviewTime": "10 25, 2012"}