{"reviewerID": "A3CRB5KQ3SPFYF", "asin": "B00001WRSJ", "reviewerName": "Ken H.", "helpful": [0, 0], "reviewtext": "As the good reviews state, these are classics.  Great value and sound great.  If you want full sound and don't want to pay a ton for the popular headphones of the day, these fit the bill perfectly.  Amazon was selling at an unbelievable price, so I jumped on them.I got them because I a don't really like earbuds, preferring headphone style as they stay put and sound better as a result.  That said, I returned these because the pleather material Sony uses on the parts that touch one's ear get very warm and cause the ears to sweat.  It ended up making my whole head feel warm.  I guess I am a hothead, but I don't know how people say they can wear them for 10 hours comfortably.  I could have gone to the trouble of buying the $24 beyerdynamic velour earpad replacements others suggested which are more comfortable and won't eventually flake off, but really had no interest in upgrading something brand new.  Sony should charge a bit more and make it right the first time.For now, I'll continue to use the no longer made Sony sports headphones I have had for 10 years which work for me much better than earbuds, stay cool and allow me to run or commute while wearing them all while sounding better than earbuds, though not quite as good as these did.  When they break, I'll cry since the style is no longer available and have to hope someone makes something reasonably priced, comfortable and full sounding at that point.Look, most people rave about these so don't let this review discourage you, as all headphones of this style may be hot and uncomfortable and may just not work for me.  The incrementally better sound is not worth the discomfort in my case.Mine went back within 24 hours and I lost the return shipping cost, but at least Amazon graciously took the return.", "overall": 2.0, "summary": "Great sound, not comfortable for me.", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}