{"reviewerID": "A76H3TUHMOA8K", "asin": "B00001WRSJ", "reviewerName": "ljc808", "helpful": [2, 2], "reviewtext": "I did not buy these here on Amazon due to discount I had with Sony, but purchase was made due to the high reviews given on this product. Let me say that Amazon reviewers never steered me wrong and they sure didn't on these either, for this price you can't beat the quality of sound these give out. The sound is so clean and natural and like the 7506 you hear sounds in even older music that you never heard before. The 7506 is a great set of headphones itself but I prefer these I think the bass on the V6 is better and for the price why not get both they still cheaper combined than Beats and Bose. I was in awe of the Studio Beats I bought them in December but since sold it due to the bleed coming out where everyone else around you can hear your music. Back in December these V6 was out of stock everywhere and now I know why but since late April and early May they are available everywhere but not cheaper than Amazon unless you can get a discount from someone else. Contrary on some reviews where they say the build quality or the comfort level is sub par I don't see that at all these are very well built and I don't baby them at all due to the price. I can wear these for hours and times I don't want to take these off due to the great sound I'm getting from my iPhone 4s or iPod classic. When I listen to my iPhone and the Tune in Radio app it just sounds awesome. I even got a spare Pearlstone pads just in case the original wears out or come off but no signs of that yet. I do like the fact that when I pump the volume on these no one else can hear my music it has a great seal on your ears. When I saw that these headphones been around for 20 plus years I knew these must be great and it didn't disappoint you cannot go wrong buying these just look at all the great reviews and if you look at the bad one you see why others just jump with comments on those guys but beware they are a lot fakes around so buy from Sony authorized sellers only.", "overall": 5.0, "summary": "Best For It's Price Bar None", "unixReviewTime": 1338940800, "reviewTime": "06 6, 2012"}