{"reviewerID": "A3GBTXO71DJ6GO", "asin": "140053271X", "reviewerName": "JoshM5683", "helpful": [1, 2], "reviewtext": "I don't read a ton so I didn't want to pay a huge premium for an e-reader.  I have an iPad but when I do read, sometimes staring at that screen for more than an hour can give me a headache.  It came down to this, the basic Kindle, and the new Kindle Paperwhite.  When I really thought about it, the Paperwhite was more than I really wanted to spend on something I would only use an hour or 2 a week.  I ultimately decided to get this because it could read epub files natively and didn't have to be converted to MOBI files which the Kindle uses.It wasn't quite as straight forward as I was expecting.  I initially thought it'd be like the iPad where you just drag the book into the Books section of iTunes and you're ready to go.  I dragged the books onto the Nook when it appeared on my desktop and nothing happened.  I found out you had to download ADE and set it up that way.  From there you have to add the books to ADE then add them to your Nook, not a huge deal, but a few extra steps compared to the iPad.I also noticed that scrolling between pages had a bit of delay compared to the iPad and that when you were trying to use the scroll bar to advance more than a few pages at a time, it wasn't the most accurate.  It also appears that page sync only works with content you purchase from them and not files you have already on your computer(I think the Kindle is the same way as well though).The reading experience is great though.  Its not too bright and easy on the eyes.  The Nook itself is pretty light so its not a hassle to hold it for awhile.  Library is also easy to scroll through once its on your device.Overall I am happy with it.  I mentioned its shortcomings, but they don't outweigh how easy it is to read and the overall reading experience.  From a reading standpoint I'd give it 5 stars, just some other things that popped up that aren't big deals, but noticable.  I'd recommend this to anyone like myself who doesn't do a ton of reading, but still wants a simple e-reader.  If you are a more serious reader, I'd probably spring for the Paperwhite.", "overall": 3.0, "summary": "Not bad, not great, but satisfied", "unixReviewTime": 1350345600, "reviewTime": "10 16, 2012"}