{"reviewerID": "A2FXX9VTD10J6C", "asin": "B00001WRSJ", "reviewerName": "Ludichris1", "helpful": [0, 0], "reviewtext": "First of all, I'd like to say, the packaging is very nifty with the red velvet.Now, second, the sound. At first, when I first tried it, it sounded weird on my film soundtracks because I wasn't used to it, but after getting used to it I wondered what the heck I had been listening to with my last headphones. These new headphones make songs from a month ago sound too good!Third, the the ease of use is flawless, except sometimes when you take them off and put them back on, you might have to spread the earcups out as they like to be together.Fourthly is the comfort. I was thinking of giving this a four star, but decided not to. The reason why, was because the COIL. Yes the coil. That long cord. If you late it hang down next to your chair, it sometimes causes to send a beat back to your headphones. Not a sound, but you feel it, and it's annoying-- so I try to keep my wire on top of the desk. I might coil it up later when I feel like it. Other than that, it's perfect, except it does kind of block out sound so, if someone is calling you, forget it >.&lt; lolEDIT after over a year of use:The sound quality is great! Sometimes the wire can get in the way because of its weight, but if you keep it on the desk, which is really easy to do, there is no problem. The earpads are comfortable too. But there is a problem with this device. Despite its pros, the earpads aren't very strong, and replacements are even worse, AND harder to put on. The earpads that came with the device lasted 6 months. This is good. However, replacement pads I bought didn't last long at all, 1-3 months usually (one or both earpads). I've had to buy like 6 replacement pads. I admit, I might not be putting them on EXACTLY right, which I intend to take every precaution when buying a deluxe version pair, but still, the internal gradual ripping of the material covering the inner foam just keeps happening. Like I said, when I get the deluxe pair, I will try my best to put it on perfectly, but I'm still hoping for the best.", "overall": 4.0, "summary": "It's about perfect :)", "unixReviewTime": 1313625600, "reviewTime": "08 18, 2011"}