{"reviewerID": "A1C60KQ8VJZBS5", "asin": "B00001WRSJ", "reviewerName": "Marktwain10 \"Marktwain10\"", "helpful": [0, 0], "reviewtext": "To begin, the sound on these is very detailed, and it will play your music like it is. If your music is a poorly recorded track, it will sound poorly recorded so I recommend feeding these \"studio monitor headphones\" the highest quality sound files you can. The bass can extend deep and low yet remain tight (not flabby), the mids are well balanced and have no artificial coloration to them, and the highs are all there. I auditioned these at a store before I bought them, and preferred them to the Audio Technica M-50's, Grado SR60's, Sennheiser 280's, and even some amped Sennheiser HD650's. And these Sony V6's don't need amping at all because can be easily driven by an ipod and get get really loud.I don't think these have a perfectly flat response, they are a little bass and treble heavy to my ears. I believe everyone's ears are different, and for me, I agree with the reviewers that say the treble can be harsh. And because of this, I could not crank the volume without the treble eventually becoming fatiguing. But since I still loved the sound and clarity of these, I tried to see if I could change this. I went to the craft store and bought some thin felt for a few cents, cut it to proper size and then placed it between the headphone drivers(speakers)and the ear pads. This cut down the harshness without changing anything else, and now I decided I will be keeping these.Another modification I had to do relates to my ears. My ears are big and poke out, and these headphones were very uncomfortable because they pushed on my ears to much, since they do have some clamping force for sound isolation. I found another simple solution for this: you cut some thin strips of cloth from a t-shirt and push them in the crevice under the pad that goes around your ears to give more space between your ear and the drivers, thus making them rest around your ears up against your head, and not ON your ears. You don't want to shove too much material in there or you start to lose some bass and could maybe tear the ear pads if you get too crazy. Just a half of an inch width by six inches long folded in half \"hot dog style\" worked great for me. I found I didn't need to upgrade to the Beyerdynamic pads after doing this, and now these are comfortable for hours and this saved me twenty four dollars. Since the headband has a metal spine through it, I was also successful in carefully bending it outward to provide less clamping force on my larger than normal head.The sound isolation on these is great, and I actually love the coiled cord which helps from keeping the cord ripped out of the headphone if it gets snagged on something. They are built very well, but I do not like the small wires exposed on the sides which I think makes them vulnerable to snag so I will have to be careful. I think these headphones are as good as you can get for $70, if you want better you are going to have to start spending a lot more money. Just make sure you buy from a refutable seller and make sure you don't buy fakes, which are out there in abundance. These headphones are great so I wrote this review- to let you know there potential and to show you how you can improve them with simple, non permanent mods if you are inclined to try them. I hope Sony never stops making these.", "overall": 5.0, "summary": "My favorite headphones, after a few small modifications", "unixReviewTime": 1371081600, "reviewTime": "06 13, 2013"}