{"reviewerID": "AJGIN15VFGXBG", "asin": "140053271X", "reviewerName": "K. Nguyen \"musicLover\"", "helpful": [1, 2], "reviewtext": "I have gone thru a lot of reviews of this eBook before ordering it, mainly due to its long battery life.Within a week, it got shipped home (excellent seller).However, the product itself is far from being a good eBook Reader.I have had two: one Kindle eBook reader (with keyboard) and one 10.2\" Android tablet that I used as a reader mainly.The Nook is cumbersome:THE BADS:1) the first thing it ask for is to read some kind of agreement, then click ACCEPT !!! (like I am installing a new software !!!)2) the second thing is to setup for a WIFI access, I have troubled to enter the password for my home wireless so it sits there for one day. Can't do anything until WIFI access is established.THE GOODS3) I went to a local B&N; store to get instant WIFI access which I did,THE BAD4) then create an account, enter my credit card number (why do I need to do this at this time). Should only ask when I first order something from B&N.;THE GOOD:5) now I can copy my eBook in PDF formats to it, this part is straightforward.THE BAD:6) I opened one of my PDF doc and it came up with a huge font size7) try to touch the screen to get to a menu allowing me to change font size, the menu appears, then quickly disappears. I was very frustated trying to get the menu display to stay there8) it took me a few mins before I can get the menu to be stable, then change to a smaller size. The text now reads fine. But the \"next page\" , \"previous page\" buttons are too hard to push, it takes a hard push to get it to work.9) I close the document and try to open another one, it won't open10) try to re-open the first one, not open eitherFrom this point on, it simply refused to open any document I have on it.11) I even convert one PDF to epub format (specifically target the Nook)  and load on it, does not open either. And the epub size is much larger than PDF size (i.e. I will have a lot less books on it).To me, this eBook is useless, so I am going to return it back today.And this is not due to (or lack of) my high tech proficiency (I develop firmware for \"firwmare operated\" gadgets by trade , really know how to use these \"Software/firmware\" operated gadgets quite well, have at least 5 GADGETS with very complicated functionalities at home, all of them require patient readings thru their thick manuals to operate / setup to my liking, no problem at all).I have written quite a lot of product reviews on Amazon, most of the gave good rating because these products are good.I feel really frustrated with this one, the first bad review I wrote.My older two eBook readers work right of the box. Just copy the documents to it and open to read them.I will NEVER buy these kinds of eBook readers anymore, not even the new Kindle as I heard they will show ads on the screen and the Kindle Fire will just immediately buy stuff from Amazon if I accidently click on some place, IT DOES NOT even show a confirmation screen (too greedy to make money) !!! I don't buy something to read these ads. Amazon and B & N are too greedy trying to push stuff on the users as they feel like, at the users expense.I will try to get a new Android tablet instead (for reading, and Internet browsing). Rather spend a few hundreds bugs to get a good product than a cheap one that does not work.Many users were lucky to get the ones that work (touch scree sensitivity seems to be the key here), I was not and don't want to try my luck with it again.", "overall": 1.0, "summary": "very clumsy not functional", "unixReviewTime": 1359936000, "reviewTime": "02 4, 2013"}