{"reviewerID": "A237680FOULTZ8", "asin": "B00001WRSJ", "reviewerName": "Michael", "helpful": [2, 2], "reviewtext": "I bought these to monitor vocals from a Sony M10 and boom mic during amateur filming, and to double as a portable set of cans for casual listening.When they first arrived I plugged them into my soundcard and listened for about an hour. I was satisfied but not thrilled the way that so many others have been. The V6's are legends but I didn't see what all the hype was about. I mean they sounded good for the price, but not to the degree I was anticipating. Bass is very good, treble is very sparkly and bright, but the mids are unacceptably recessed, and even at times sound hidden, or veiled. Treble was riddled with sibilance too, not good. Now, at home I typically listen to AD-700s which have incredible mid-range. Furthermore I understand that the V6's get better and better with burn-in. We shall see. At this point I was just meh about the V6's. Then I remembered what I really bought them for.I brought up some high-bitrate voice recordings that are stored on my PC. WOW. These cans have incredible detail. Very, very analytical. I auditioned almost everything in the low-end pro monitoring segment (i.e. Shure SRH440, ARK 8400, AT M40fs, etc. etc). For pure analytical work such as vocal tracking none come close except maybe the Shure's which are so bass shy that they are almost a non-consideration. So bottom line is if you are in the sub $100 segment for the same reasons as me then you want these. If you want JUST good phones for listening on a bus or in the library I'd get Audio Technica M40fs or M35 which are less power hungry, more comfy and have a slightly more engaging overall sound. But for a good multi-purpose headphone with no compromises in vocal detail and an impulse-buy price point these simply can't be beat, and after all these years.", "overall": 5.0, "summary": "Good for listening, amazing for tracking", "unixReviewTime": 1352592000, "reviewTime": "11 11, 2012"}