{"reviewerID": "A1ZM846Y7AUYD", "asin": "B00001WRSJ", "reviewerName": "M. Pickering", "helpful": [10, 10], "reviewtext": "Rumor has it that these Sony MDR-V6 headphones are being (or have already been) discontinued.  That is a shame because they are definately the best sounding headphones that I have ever owned (and I have owned many).  I have always been in the habbit of purchasing high-end headphones, which are usually heavy, very large, and typically make your ears uncomfortably hot after extended use.  After reading rave reviews for the Sony MDR-V6, over the past several years, I finally decided to give them a try for myself. After hearing that they were being discontinued I was afraid that I would not be able to find them anymore.  I was extremely happy to find them right here on [...], and for a GREAT price.Some of the primary reasons for my decision to purchase this model include the high sensitivity level (106dB/mW), the large 40mm drivers and the impressive 5-30,000 Hz frequency response.  The high sensitivity allows these headphones to be used with low powered devices, such as my iPod Touch.  Although these headphones sound best when plugged into a home stereo receiver, they still sound stunning when plugged into a portable MP3 player.  So if you desire a quality set of headphones, which can be used with virtually any audio device you may own, the Sony V6s are the perfect choice.  Deep bass, smooth and natural midrange, and crisp (yet not piercing), clean treble, these cans produce the widest frequency range that anyone could expect from headphones costing three times as much.  The V6s may not be perfect for those wanting bass enhancement.  The bass is definately deep with these phones but it is tight, rather than boomy and muddy sounding.These headphones are light (rated 230 g - which is about 1/2 lb) and comfortable to wear for hours at a time.  The clean, uncolored sound will make you soon prefer to listen to all of your music through these headphones rather than through full-sized speakers.  They do a pretty good job of blocking outside noise without entirely preventing you from hearing the phone ring (if you have the ringer set loud enough), the children calling you, or even hearing the doorbell ring.  The build quality is very good and I am expecting these phones to last me for many years to come.  They even come with a nice \"pleather\" case to hold them in when not in use.  The phones fold up nicely and fit in the case perfectly.  The 10 ft. coiled cord is rugged and well shielded, and there is an included adapter to convert the 3.5mm mini-plug to a full-sized 1/4\" plug.  I would highly recommend the Sony MDR-V6 headphones to anyone who is serious about listening to quality audio.  But don't wait long to order because I suspect that they will not be on the market much longer.", "overall": 5.0, "summary": "Get 'Em While You Can!", "unixReviewTime": 1193529600, "reviewTime": "10 28, 2007"}