{"reviewerID": "A1DBDCQASEIMDW", "asin": "B00001WRSJ", "reviewerName": "museken", "helpful": [0, 1], "reviewtext": "I'm reviewing this with no typing skill So my mistakes are present I'm human. Grammatical errors will occur and frankly I do not care.That's satire. actually I'm free response for Rolling Bone. Not Lance.I own Grado I80's, Sony MDR-V6, Sennheiser 505 HDS  and Able Planet 300b series for short.The Grados had me but the construction is junk. Don't under estimate this. they sound the best. Grados fall apart.1. The Mdr-v6 are Number 1 now. The Sony's are built better. They are now the best.2.  The Sennheisers are built, but lack the sound of the Grados or the MDRs.3. The Grados \"were\" the best but they need to call Stanley tools or someone so they can construct something that lasts.4. The Able planets were out of this world with a battery running. No other headphone needs a battery.  These phones are the best next to the Bose for noise cancelling and bargain.There is a problem with 3 of the headphones. The Grados are very weakly constructed. I had a whole can fall off.  I crazy glued the muff.  I mean can. No big deal(stronger than ever seriously).My opinion Grado, with my most respect should crazy glue the notch you put in to the cans to hold the phone to the set. The sound quality of Grados  are out of this world. Construction JUNK! Truth!I hooked the Sonys and the Sennheisers to an amp for my music. Not your stereo. a Guitar amp. They held up. understand these are not made for this.If your buying Sony ,Sennheiser or Grado and Able Planet. These all are great phones for your ears. If you want the package.  It's the SO IFSO IF:So If:  You are everyday person looking for the best head phone for your surround sound system. The Sony MDR-V6 are for you. They are EXCELLENT. If you could get over the cord. Buy a straight attachment for these.So If you are the every day Person looking for the best headphone in the market *\"Don't buy\"! \" *the Sony MRD-v6. Find something better. Then tell me for that price you got better!.  We,  are the poor peers for the great ears headphone.Loves the Only house! That's cheap for really top of the line music. Oh by the way. They are as good as the Grado. I mean that. Scary good.Tell me I'm wrong please.", "overall": 5.0, "summary": "Surprising.!", "unixReviewTime": 1319155200, "reviewTime": "10 21, 2011"}