{"reviewerID": "A3VJAU9FIDMB8N", "asin": "B00001WRSJ", "reviewerName": "Nghia Doan", "helpful": [1, 1], "reviewtext": "Like many here, I did a lot of research before purchasing the V6.  I considered the 7506 but I usually take good care of my electronics so I didn't want to pay the extra $15 for it.  Anyway, I just want to write a review as there are some questions that I wished were answered before purchasing. Before I start, I want to let people know that this is my first over the ear headphone.  I always use earbuds due to it portability.  I run with them so the V6 isn't ideal in that situation. Okay, now the review.The product:It is very well made, no cheap plastic parts.  The wires are long and good for sitting in one place to listen to your music, esp from a receiver.  If you have to walk around while holding your portable music player like my zune hd, then it can be a handful to hold bc you will need to carry the cord around along with your music player.  Not a big deal, but just a heads up if you are looking for something a little more portable and manageable.  I have been using this for a couple of days now and the earpieces hurt my ears after an hour of use.  People said it will get better.  I only hope so, but I bought a Beyerdynamic replacement because I heard it is more comfortable and that it will make the music even better too.  I also heard the original earpiece won't last very long.  My other complaint of the original earpiece, like others have stated, is that my ears get warm after 15 minutes of use and becomes sweaty.The music:I have used $30 sony earbuds and $60 klispch earbuds before and I have to say that this definitely sounds better.  The lows are deep, the mids are excellent, and the highs are very clear.  The biggest difference between this and my other earbuds is the clarity of the music, especially the vocal. I don't know if the earbud's small single driver or its proximity from inside the ear canal that is causing the sound to be muddy, but this over the ear headphones make the music sound more natural and clear.  I used to love a lot of bass in my music and I still do as I listen to Trance often. If you are looking for a headphone with booming overpowering bass, then this might not be for you.  I was a bit underwhelmed by the loudness of the bass when I first listened to Tiesto or Hip Hop music.  I am not saying that the bass isn't good, it is very good, very deep.  It's just not eardrum breaking. =P. For alternative, pop, and other music that emphasize vocals and a dynamic range of bass and treble, this headphone performs brilliantly.  You can hear all the different instrument being played very clearly. It actually made me fall in love with the vocal of one of my favorite female singer. ^_^ If your MP3 conversion isn't great, then you can hear all the crackles and static. I don't know if that is a good thing or bad.  One thing I noticed is that I needed to turn up the volume a little more compared to my earbuds to hear the music on the same loudness level.  I think perhaps portable music player like my zune HD requires a bit more power for the headphone compared to earbuds.  I usually listen to my zune HD at level of 18-20, but with the V6, I listen between 20-23. I love music and this headphone has taught me to appreciate it even more.  I have learned to love the quality of the music now, and not just the loudness of the bass.  As for noise cancellation, it does reduce outside noise by about 33% IMO but there is no noise cancellation, passive or active. You can hear outside noise without music turned on.Update after a month of use:Music still sounds great.  Only problem I have is that the earpiece is so uncomfortable.  They press against my ears and hurt a lot after an hour of use.  It also gets very sweaty too.  Please keep this in mind before deciding your purchase.", "overall": 4.0, "summary": "Excellent Headphones For $70!!!", "unixReviewTime": 1302825600, "reviewTime": "04 15, 2011"}