{"reviewerID": "A1WPFIZ8P3O86V", "asin": "B00001WRSJ", "reviewerName": "Phil in Magnolia \"Phil-i-am\"", "helpful": [4, 4], "reviewtext": "I've recently purchased the Sony MDR-V6 headphones, after purchasing Sony's very similar (but not identical - see below)Sony MDR7506 Professional Headphonejust a few months ago. My reason for purchasing a second pair (and getting both models) was because these V6's were very inexpensive at the time I ordered, and because I was curious to see if I could tell a difference between the two. In reading many of the reviews here on Amazon and elsewhere, I knew that the two are constructed very similarly but there were different opinions regarding both the differences (if any) and which has the superior sound.These are both headphones in the $100 and below price category, which seems like a reasonable price to pay for high quality sound. I do not like to listen to music using earbuds, I prefer this style of \"over-the-ear\" headphone. although it does take some getting used to. I also have very inexpensiveKoss KSC75 Portable Stereophone Headphonesfor occasions when I don't want to use my more expensive Sony's.I am very satisfied with the sound quality from these headphones (both models), and with the comfort. They are the first \"quality\" headphones that I have owned, and the level of detail in the sound, lack of distortion, and overall quality is simply superb. I am completely satisfied.Now, regarding both similarities and differences between the Sony MDR-7506 and Sony MDR-V6, here is what I have observed:- externally, they are almost identical in construction and appearance. The V6 has red stickers on each headphone \"for Digital\", and the 7506 has blue stickers \"Professional\". The phono jack for the V6 is silver metal (all metal), for the 7506 is gold (rubber and gold). Those are the only visible differences I am able to detect.- when I listen to the two headphones back to back, at the same volume level and with the same music, I can detect a slightly clearer treble and midrange from the 7506, and very slightly clearer sound. This is consistent with several of the other reviewers on Amazon for the 7506, who say they can detect a slightly better sound separation and more open sound for the 7506, with the V6's sounding a bit warmer. One reviewer also says that the internal grounding for the two headphones is different - the 7506 uses a separate internal ground for the left and right channels, where the V6 uses a single ground for both channels. (It seems to me that both grounds are going to the same place anyway, but maybe this contributes to a slightly different sound).- some reviewers state that the internal speaker drivers are different for the two headphones. However when I went to Sony's website to check the specifications for the two models, that is not what I found. And here is what the Wikipedia page states for these headphones: \"both models share the same part number for their driver, but the magnet therein is known to vary. The MDR-7506 was introduced with a samarium-cobalt magnet, as is currently used in the MDR-V6. However, at some point, the MDR-7506 switched to the slightly more powerful neodymium magnet. These changes were made without changing the driver part number.\"- The box for the 7506 states \"neodimium magnet\". The operating instructions included with the V6 state \"samarium cobalt magnet\". Possibly either or both of these are out of date (as Wiki states, they may make spec changes over time) - the 7506 box is copyright 1994, and the V6 copyright is 1996.- The 7506 box includes an exploded view and parts list, which is very nice to have. The V6 box does not.- Both headphones include a soft case for storing/carrying the headphones, and both include an adaptor plug so that the headphone can be used with either a stereo mini-plug or a normal size plug.UPDATE 7/22/13 and 7/30/13: The Sony MDR-V6 and MDR-7506 headphones have just recently been reviewed by CNET, with similar comments to my own regarding the small differences in sound quality. Both headphones receive a very high recommendation from CNET. See the MDR-7506 review at [...] and the MDR-V6 review at [...]According to the specifications on Sony's website (which should be up-to-date), the only difference between the two headphones is frequency response:- MDR-7506:- Neodymium magnet, 40.0 mm driver, 10-20kHz frequency response, 63 Ohm impedance, 106 dB/W/m sensitivity- MDR-V6:- Neodymium magnet, 40.0 mm driver, 5-30kHz frequency response, 63 Ohm impedance, 106 dB/W/m sensitivityI am not able to explain how Sony is claiming different frequency response for the two headphones if all of the other specs are identical, but this is what they are saying. And the two headphones do have slightly different sound.Although there is a slight difference between the 7506 and V6, the sound from both headphones is very neutral. The \"professional\" choice between the two seems to be the 7506, and it is the more expensive model. If you read other reviews you will find that the 7506's are commonly used by studio engineers, because they are designed to reproduce the sound just as it is, without adding emphasis to the bass as some other headphones are designed to do. At this point, for me they are both excellent, and for thirty bucks less I'd go with the V6 if I could have only one of the two.I've been using these headphones with theAudioengine D1 24-bit digital-to-audio converter, and I am extremely pleased with the quality of the sound.As a final comment, some owners of these headphones comment that the ear pads wear out over time, and some owners also prefer different ear pads for better comfort. I also purchased a pair ofBeyerdynamic EDT 250 Velour Padded Earcushionsfor this reason, and although I have not yet given them a try to compare them with the ear pads that come with the Sony headphones, I do like the fact that it is possible to fit different ear pads if desired in order to provide more comfort, as well as replace them when they have become worn (some owners use these headphones for many years).I notice that there are a very large number of reviewers for these headphones, many of them long-time owners who feel very strongly that these Sony headphones are the best. I'm just beginning to use them, but I have high hopes that they will be durable over time and that I will continue to be as satisfied with them as I am today.", "overall": 5.0, "summary": "Superb Headphones and Excellent Value (with comparison to Sony MDR-7506)", "unixReviewTime": 1369180800, "reviewTime": "05 22, 2013"}