{"reviewerID": "A1U4GOVZWL8ZTL", "asin": "B00001WRSJ", "reviewerName": "Richard J. \"Richard J.\"", "helpful": [1, 1], "reviewtext": "I bought the Sony MDR-V6 Monitor Series Headphones to replace my beyond redemption Sony MDR-V600 headphones that have been re-soldered numerous times and Krazy glued more time than I can count. The only thing missing was duct tape.  Regardless, they were about 5 years old and when I couldn't find replacement ear pads, I had two extra sets, I new it was time to replace them.Anyway, after doing a lot of research, reading one review after another until I was going blind I decided to by the MDR-V6's.  Price was a big consideration and at $72.00+ and having very good service with the MDR-v600 this became a logical choice.I've only used the headphones for about 6 hours and I'm very pleased with them.  Some reviews mentioned a weak base and I agree, but tweaking the EQ corrects that well enough for light jazz and rock-a-billy (I go back to early days).  However I've found that listening to classical, especially Baroque, the MDR-V6's shine. Unlike others, I don't have a problem with the treble.  I've found it to be very clean, for lack of a better word.  One thing I did find out very quickly is I have to knock the volume down another 8-10 Db.  These headphones are very loud.As far as comfort goes, well Sony missed the boat.  I don't find them to tight but the headband is lacking padding. If you have hair on top it may not be a problem, I don't.  The MDR-V600 had excellent padding and I salvaged that padding and attached it to the MDR-V6 with a bit of Scotch tape.  Looks weird but they at least they are comfortable now.I did knock off a star for the comfort level but the rating is 4.5.  I think they are an excellent buy and the sound is also excellent for my type of music, others who need heavy base may be disappointed.  Finally they ear pads are very soft and comfortable.", "overall": 4.0, "summary": "Sony MDR-V6 Monitor Series Headphones", "unixReviewTime": 1346284800, "reviewTime": "08 30, 2012"}