{"reviewerID": "A3TUQQWT7KRSEK", "asin": "B00001WRSJ", "reviewerName": "Robert A. Gilliam", "helpful": [1, 1], "reviewtext": "These Sony MDR-V6 headphones are very impressive. I've been using a pair of on-the-ear Sony MDR-84's with a frequency response of 10Hz to 24,000Hz that I got for $50 in the 1990's. The V6's are clearly better. Deeper and richer bass, significantly better clarity. The sound is precise and delicate. I can understand lyrics better with these phones. My Yamaha P-70 electric piano sounds much nicer too. It has excellent samples and I can hear a significant difference with the V6's compared to the 84's. Do note however, you need a quality source to hear this difference. Most portable MP3 players don't even take full advantage of my MDR-84's. I'm listening to my MSI 760GM-P35 motherboard with a Via chipset, a quality portable CD player, and my Yamaha piano.Some people scoff at the idea of headphones with a response to 30,000 hertz since most humans can't hear above 16,000 Hz. What they don't understand is that while the typical adult human can't hear a pure tone above 16kHz, headphones or speakers that can produce a 30kHz tone will sound more clear and precise at frequencies lower than 16kHz which we can hear. We can't hear the pure tone but we can hear sharp changes in lower frequencies, sharp changes that can only be produced by a speaker capable of 30kHz.Around-the-ear headphones are superior in two ways: (1) By putting pressure on the side of the head rather than the ear lobe they are far more comfortable, especially if you wear glasses. I can wear these for hours with no discomfort. And (2) they make a better seal around the ear which allows better bass.My only criticism is that there should be a label or at least a mention in the manual saying that the headphones may need a few hours of loud music to wear in, and until they do, one side or the other may have lower volume. At first I worried they were defective because the left side was significantly quieter. I imagine that many people have returned them as defective because of this.", "overall": 5.0, "summary": "Precise and Delicate Clarity", "unixReviewTime": 1365638400, "reviewTime": "04 11, 2013"}