{"reviewerID": "A18H3X0XGMD1K0", "asin": "B00001WRSJ", "reviewerName": "Rollin", "helpful": [3, 3], "reviewtext": "I have been searching for a pair of headphones or IEM earphones for more than six months. I ordered a pair of JH Audio JHj16 Pro custom IEMs for $1149, complete with an $80 visit to an audiologist for ear canal impressions. One fitted and the other did not. The sound was excellent in the one that sealed well but when ... The whole thing was a very bad experience and the IEMs were eventually returned after three attempts to get both to fit my ear canals.I then ordered a pair of Sennheiser HD 800 headphones  The sound was magnificent right out of the box but the hard ear pads were painful. Sennheiser customer service said they would soften with use but for $1500 for the HD 800s, I was not willing to chance it and returned them.Next came the Sennheiser IE 800 IEMs, again with excellent sound. However there was so much microfonics with any head movement, they too were returned.I tried the best Denon's flagship model at the time and found them to be uncomfortable. The same was true with a pair of $1600 Grados, also uncomfortable.I had given up until I found a pair of $110 IEMs and have been using them for a few months. After deciding to try headphones again, I ran across the Sony MDR-V6 headphones. They had good reviews and I ordered them.Today was the first day that I listened to music and TV with the MDR-V6s, They are quite comfortable but do not quite fit over my ears, well enough though.I do not classify myself as an audiophile but right out of the box, the MDR-V6s sound good. They will be &#34;burned in&#34; using music and pink noise during the next few months but they sound is very acceptable. They are well balanced over the frequency range with no discernible distortion. The base is very adequate even for me bass-head tendencies.They do not equal the HD 800s or the IE 800s but the MDR-V6s do not cost $1500 or even $1000, either. They have values in spades. Try them; I believe you'll like them, especially considering their remarkably low price.", "overall": 5.0, "summary": "Incredable value", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}