{"reviewerID": "A2ZLWZUP0D44SS", "asin": "B00001WRSJ", "reviewerName": "SD", "helpful": [0, 0], "reviewtext": "I have been using these headphones for only a few days. I can tell you that these headphones do sound great but for some reason require me to turn the volume really high to get sound out of them. This might just be how monitor headphones are though. But I wouldn't really know. Now on to the review. I plugged these into my Bose companion speakers and had to turn the volume more than halfway to get the normal amount of sound that I usually get from a regular pair of headphones. Now I know what you are thinking. This guy must be deaf if he has turn the volume that loud to hear something. But thats just not the case. Now I tried watching videos on youtube and listening to music on the computer and the volume was really low on them with volume turned up halfway on my Bose Companion Speakers. I also plugged these into to my Sony Walkman X Series to test the sound quality. I had to turn the volume all the way up to 19 to get surround sound. Now with the EX earbuds that came bundled with my walkman I only need to turn the volume up to 11 or 12 to get the same surround sound. Note that the volume limit on my walkman is only 30. So for me to have turn the volume up to 19 with the Sony MDR-V6 its already passed the AVS Limit which is the safe volume for listening to music. Like other reviews have stated before the headphones are extremely sensitive. This was especially noticeable to me when the volume on my walkman was 12 or below. The sound from the left and right side of the earpads would keep changing when I was walking around with it especially when the coil came in contact with something else. I was able to solve this problem though by turning the volume up to 19 on my walkman. The headphones them self are really light weight and comfortable to wear. The headphone cord itself is heavier than the pair of headphones. I would recommend these headphones if you were to just sit in one place and listen to them. But not if you are constantly moving around with them.", "overall": 3.0, "summary": "Pretty Good", "unixReviewTime": 1350086400, "reviewTime": "10 13, 2012"}