{"reviewerID": "A168SAOQWU7A63", "asin": "140053271X", "reviewerName": "Microdev \"IT Executive\"", "helpful": [3, 6], "reviewtext": "The device physically, is relatively good for the money.  There are many reviews on YouTube and other places that address that point.  The problem with the B&N; system is the fact that you must enter a 'default credit card' to be able to use or purchase any books.  If you were to buy this Nook for your young son or daughter, they would be able to purchase anything at the flick of a finger, and it would charge to your credit card 'for your convenience'.  Similarly, if anyone found your child's Nook, they too could purchase anything using your credit card information.I tried get creative and purchased a gift card for my child but although this can create a credit on the child's account, B&N; still requires a credit card to be on-file in order to 'unlock' the book.  By contrast, with the Kindle system, you simply buy a book through Amazon using any credit card (which does not have to stay active) and send it to an authorized device.  The Nook system, by comparison, is slow, clunky, and a massive security risk.If you setup the Nook and do not provide this credit card during setup, no books can be sent to the Nook wirelessly, they must be sync'ed with a cable tethered to a computer.  Since my 12 year-old daughter purchased this herself with her own money, I have no choice but to either tell her to eat the unit or use my credit card without any parental control.  Furthermore, it would appear that B&N; is entering into a contract with my minor daughter in this regard.  By opting out of this model, you are left with an utterly useless device.Why none of the other reviewers elaborate on this is beyond me.  I suppose if the device is owned by an adult this model would work, however if you are contemplating this as a gift for your child, I'd avoid any device related to B&N; altogether.I give them 2 starts for the hardware only but otherwise the device, in this case, is useless.  While you can delete your credit card from B&N;, the process is well hidden and you would need to add a card, order, download, sync, unlock, and then delete the card in order to get each purchase on the device.  Either that or hand your child your Visa and tell them to enjoy!  Now that's what I call convenience.", "overall": 2.0, "summary": "The device is okay, but the book service is not", "unixReviewTime": 1326499200, "reviewTime": "01 14, 2012"}