{"reviewerID": "AD73VMNYB8XVX", "asin": "B00001WRSJ", "reviewerName": "S. Lee \"spamination\"", "helpful": [4, 4], "reviewtext": "The 3 things that all great headphones have in common are: Durability; Sound Quality; Comfort.1) DURABILITY:  This may very well be the most important factor of headphones.  By definition, headphones are meant to be portable.  Everyone at one time or another has thrown their headphones into a backpack or laptop case.  Headphones generally need to be replaced only when they break or get misplaced.  The MDR-V6 are just about the most durable things I've ever seen.  It's classic Sony construction.  Mostly made of metal and thick in the vulnerable parts, these are built to last.  In addition, they collapse to a nice compact shape further enhancing portability and durability.  The coiled cord is also designed to last.  Think telephone cord.  So unless you have a pet who insists on chewing things, the cord will never be the reason you replace these.  Finally, they come with a bag for even more durability.  If you are even considering the Bose Triports, slap yourself sober now.  I can snap the Triports with 2 fingers.2) SOUND QUALITY:  The Sony Digital Line of headphones have been the standard for audio clarity for decades.  So if you're jaded by past experiences with non-Digital Line of Sony headphones, don't be.  These are on par with the newer High-Definition line of Sony Headphones.  Digital sound by nature is tinny.  But these headphones give equal clarity and attention to the low and mid frequencies.  I often listen to classical music, and woodwinds, bass and percussions glisten through these headphones.  I also use these for Hip-Hop, Rock, Pop, Jazz and everything under the sun except country.  These headphones excel across all genres.  Now with the obligatory comparison to the Bose Triports.  With Bose Triports, I have to REALLY exert myself to isolate instruments and sounds.  The MDR-V6 isolate sounds for you.  You can just sit back and enjoy the show.  In addition, Bose Triports sound like your listening underwater when compared to the MDR-V6s.  Once again, 1/2 the price, more than 2x the performance.  MDR-V6s dominate this category.3) COMFORT: These are on-the-ear heaphones.  NOT around-the-ear.  These require careful placement on your ears.  For maximum comfort, place as much of the pad directly on the fattest parts of your earlobe.  I know it sounds counter-intuitive, but place them a bit forward on your ears.  If placed properly, these are as comfortable as any set of headphones I've ever owned.  I have a REALLY big head, and these headphones with a tight headband give me no problems on even 7 hour flights.  Like any on-the-ear headphones, you will need to move them around to discover what is most comfortable for you, but once you find your sweet spot, these are as comfortable as you will ever need.Forget bang-for-the-buck.  These are great headphones no matter what price range your consider.  Sennheuser, Audio-Technica, Bose, or whatever brand you are considering...stop right here and click \"Add to Cart\".  You won't be disappointed.", "overall": 5.0, "summary": "Could not ask for more", "unixReviewTime": 1232582400, "reviewTime": "01 22, 2009"}