{"reviewerID": "A3DVM2YS59Z3ZF", "asin": "B00001WRSJ", "reviewerName": "Steve Sun", "helpful": [1, 1], "reviewtext": "After moving to Guam, I cannot find any decent Audio Store on this island! High-end audio store is out of the picture here! I decided to switch to computer-based music system and a pair of good headphone (fortunately, I am not addicted to high-end hype). By doing some homework, I found a very decently priced &#34;Audirvana Plus&#34; for AIFF playback. However, I still need a pair of decent headphone to complete my MacBookPro + Audirvana Plus music playback &#34;system&#34;. Please believe me, you do not want to have too much $$$ stuff in your apartment/house on this island; otherwise, you may find them &#34;all gone&#34; when you go home! That is why I target on a pair of headphone less than $100.Again, going on the internet, doing some Google search, I found this Sony MDR-V6. OK, the following is my 1 week impression on MDR-V6...1. Fresh out of the box, it sounds a bit harsh, and I felt sound fatigue after about 30 minutes of continuous listening. But, this is not the &#34;problem&#34; at all.2. I ran in this headphone by playing music into it continuously for 3 days, and the sound is much better now! I am expecting it will keep improving after about 1 to 3 month(s) to have both drivers settled. (Will update about this part later).3. The sound of this headphone is like what they are designed for. Almost no coloration.Before writing this review, I saw two extreme ends of reviews. Most people were using this pair of headphone for years, and some reviews are cursing Sony MDR-V6... The story may (very likely) be that Sony has discontinued this headphone in Japan, and the replaced model is MDR-CD900ST (V6 was the CD600ST). In Japan, all V6's are actually  &#34;imported&#34;! Sony actually moved the original production line of V6 to China, and later, to Thailand. Since I only own this headphone for one week, I really are not in the position to judge the QA of V6. Mine V6 is printed &#34;Made in Thailand&#34; on the box. Maybe few years later; if I still remember this review, I could provide more info about how long does mine V6 live.", "overall": 4.0, "summary": "Very good sounding headphone!", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"}