{"reviewerID": "AEGYIU4XJTYFN", "asin": "B00001WRSJ", "reviewerName": "Tim Lookingbill \"Digital Dude\"", "helpful": [12, 12], "reviewtext": "That pretty much sums up the audio dynamics of the incredible Sony MDR-V6 headphones. The reviews I've read on the web that mention reduced midrange are pretty much correct. I just didn't know having small sounding (not tinny) dead centered in your head lead vocals would be the result of it but it is. Same thing listening to DVD's.And this may be due to the different ways certain audio is recorded because Kenny Rankin's vocals on his \"Because of You\" CD sounded live and real due to it being recorded live in a hardwood floor concert stage and, in the words of Chesky Records...\"using minimalist miking techniques and without overdubbing or artificial enhancement to ensure the purest and most natural sound possible\". Another cause for the somewhat echoless disembodied vocals is the sound dampening foam within the ear pieces.Other than that if you like clean, accurate bass right down to near earthquake frequencies, the V6's will deliver with amazing clarity and with very little distortion. As an example about 5 minutes into Propellerhead's \"On Her Majesty's Secret Service\" during a quiet violin interlude there is a barely audible low resonant bass frequency that doesn't reproduce on my home theatre system with vented sub as well as off my Sony earbuds and other audio equipment. The V6 plays it perfectly without overpowering and muddying delicate detail. And Open Range's gunfight battle, the most realistic I've ever heard in any movie sounded exactly as it did in the theatre on the V6's.However, some live sounding jazz quartets like the ones recorded back in the '60's may loudly resonate very low upright string bass frequencies depending on how it was recorded as it did on some Julie London songs. It had me reaching quickly to adjust the bass on my 1973 Sansui 2000A amp before my ears bled.A noticeable hole exists in the upper midrange that creates that slight bass hum in human vocals talking on a mic is quite evident on the V6's. But that's what they were designed to do anyway and probably the reason why they're favored by radio DJ's and announcers.But hey, nothing's perfect, but for the money these are the best sounding headphones I've ever heard.", "overall": 4.0, "summary": "Toss your subwoofer if you don't mind small voices in your head.", "unixReviewTime": 1211846400, "reviewTime": "05 27, 2008"}