{"reviewerID": "A1JD6COKA3KCEG", "asin": "B00001WRSJ", "reviewerName": "Tim Witort \"TRW\"", "helpful": [1, 1], "reviewtext": "With over 1000 reviews on these why add yet another.  Aw, what the heck...I purchased my first pair of MDR-V6s when they first came out in the 80s.  You need to realize that a driver that could faithfully reproduce sound down to and BELOW 20Hz was unheard of in consumer audio at that time.  These phones stunned me when I was able to hear content on certain recordings that I had never heard before - mostly in the spectrum from 80Hz and down.  This was an unusual experience via headphones.  The clarity and truthfulness of the audio the MDR-V6s produce is stunning to those who value accurate audio reproduction.  Their ability to deliver very high volume levels without distortion is a joy (in moderation - doing this too often WILL result in hearing loss). They are even more stunning when one considers the price compared to the more esoteric audiophile phones available that can run 10 to 20 times more in price.I had that first pair of phones for about 12 years before someone stepped on the frame and snapped one of the driver's clean off.  I replaced them with a new pair which I still own.  They are pushing 15 years old now and still sound very good.  After an estimated 5000 hours of use, the ear pads are flaking off and the left driver had begun to occasionally break-up on high volume, low frequency content.  So I have ordered my third pair of these beauties over the course of almost 30 years.  Thank you, Sony, for continuing to manufacture this excellent product at an amazing price.A popular trend in headphone design today involves intentional gain manipulation over certain frequencies - mostly on the low end (Beats by Dr. Dre).  If they sound good to you, who am I to tell you different?  I personally enjoy hearing recordings as close to their original mix as possible.  The MDR-V6s do that extremely well.  When you can actually hear the full audio spectrum delivered with very little coloration, you might be surprised at how enjoyable some recordings are with little or no adjustments to the equalization.The only shortcoming on these phones is the fact that the wire that runs from the left ear cup up and over to the right ear cup is exposed where it travels over the stainless steel band on each side. This is a pretty small gauge wire and if you accidentally pulled on it when removing the earphones or pulling them out of a backpack, there is a possibility of the wire being damaged.  And if that wire is ever broken, it is basically impossible to repair.  Nearly all headphones use very fine stranded, coated wiring.  The coating makes it practically impossible to repair once broken.  It cannot be soldered or twisted together.  So if you are rough with your phones, consider this.If accuracy is important to you look no further.  Buy these, then buy a backup pair!", "overall": 5.0, "summary": "Super flat, pure sound phones", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}