{"reviewerID": "A2VHZWRA699KYR", "asin": "B00001WRSJ", "reviewerName": "Tristan944", "helpful": [2, 4], "reviewtext": "Ive listened to the Ultrasone HFI-780, Sony MDR-V6 (MDR-7506), Grado SR80i, and the Sennheiser HD598. The HD598 wins.The Ultrasone HFI-780 has absolutely terrible sibilance/sibilant. This is a common complaint with these cans. The 780 has better bass than the HD598, but the sibilance ruins these cans. Not even listenable.The Sony MDR-V6 (aka MDR-7506) are phenomenal cans, but rather boring. These are some of the most popular headphones ever made, for good reason. They do sound incredible, and they are inexpensive. Every sound is fantastic. However, it can be boring for people who are not used to it. People in the audio industry refer to them as flat, and flat is the perfect way to describe them. And some people love this sound, it grows on you after a while. The MDR-V6 are studio monitors, which mean they are primarily made to be used in a studio or with other professional applications where you can monitor how loud a particular sound is. These cans heavily emphasize the mids, and thats not necessarily a bad thing. Those who love acoustic music or love hearing vocals will prefer these over the HD598. Some treble and some &#34;hissing&#34; can be heard on occasion, but overall these are amazing headphones if you like flat sound. The bass is very nice and never muddles the midrange or treble. Isolation is actually really good. I do have a problem with the left side of the headphone. If I move my head at all, and I mean at all, a part of the headband makes a swearing sound. I fixed it by wrapping some material around it. An easy fix but I should not have had to do this. These cans provide excellent detail, but can also be unforgiving on recordings that are subpar. Overall, excellent phones and I highly recommend them to everyone.The Grado SR80i are another great set of headphones, but they are uncomfortable and dont appear to be made as well as the other headphones on this list. Overall they sound great. The bass is almost non-existent, like the HD598. The overall sound signature was not as clean as the MDR-V6. The MDR-V6 is just so clean and precise, very hard to beat. But the SR80i are still great headphones and I would probably prefer to listen to music and game with them more than the Sony's. The Grado's sound like what you are used to, which is not studio monitor headphones.Now the Sennheiser HD598. I have the least experience with these, but they are so good I dont need extensive experience. They are extremely comfortable, excellent sound reproduction, and excellent soundstage. I've listened to many gaming headphones in the $50 price range and these are several tiers above them in every way. Soundstage is so important in gaming, especially first person shooters. I use these with Battlefield 3 and they always accurately pinpoint all the sounds. Music is crystal clear and silky smooth. No sibilance or harshness ever hear. I do wish they had more bass, but the open nature of these cans makes these bass light. Well made and sound great for an affordable price.", "overall": 5.0, "summary": "Fantastic sound, relatively well made", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}