{"reviewerID": "A3LGGQRAIDW3Z2", "asin": "B00001WRSJ", "reviewerName": "Walter Garvey \"harp dad\"", "helpful": [3, 3], "reviewtext": "I've been using these since they first came out. I was a recording engineer at the time and a friend who was a boom man on movies turned me on to them. I have tried many other headphones over the years, but these have always been and continue to be the gold standard. Some may not find them as comfortable as other brands, but they get better over time and the sound quality is definitely worth the investment. When these first came out, they were put in Sony's consumer line but as does happen in audio, the pros got turned on to them and before long, they were outselling the headphones in Sony's pro line (who complained loudly :-o). Sony then introduced the 7506 into the pro line and charged more money for them ;-). I remember for a while it was hard to find the V6s. But apparently, so many professionals complained that eventually, Sony made the V6s available again. I don't use these to listen to my iPod for several reasons... number one, they are highly accurate. While that SOUNDS good, what it really means they are very flat in their response... no presence boost, no bass boost... zip, nada! That may make them seem \"dull\" when compared to other headphones but in essence, for a professional who is trying to capture audio accurately, it is a blessing. The second reason is, they are too big to fit in a pocket with your iPod. When done listening, I wrap my etymotics around my iPod and shove the whole thing in my coat pocket, no worries. Even if you fold these guys up, you'll have a tough time getting them in all but the largest pockets. One final thing I can add that has nothing to do with the use of the headphones per se, is the bag that comes with these is a POS. I learned early on that they rip, flake, and basically fall apart. When my first one disintegrated, that same movie sound man turned me onto the perfect replacement.... a Crown Royal bag. The headphones fit perfectly and 15 years later, I'm still using the same bag. Leave it to the liquor folks to outdo the audio manufacturers when it comes to quality packaging. :-D Enjoy... as I said, I have for over two decades now. Michael", "overall": 5.0, "summary": "Two decades of professional use", "unixReviewTime": 1276128000, "reviewTime": "06 10, 2010"}