{"reviewerID": "A2VIZTW4DMVVWK", "asin": "B00001WRSJ", "reviewerName": "WMWM", "helpful": [2, 2], "reviewtext": "First off, my initial impression of this headphone was astonishment. The build quality all the way down to the solid way the headphone clicks into place when you extend each side was superb. Also, the fit was very good, i am 5'11 with a muscular build, and they cover my ears fine.When i put them on, i immediately noticed how quiet everything was, even with music playing low volume, i couldn't even hear myself typing this review on my very loud razer blackwidow keyboard that clicks every time you strike a key.The V6 is an older design (more than 15 years old), and it shows. Persoanlly though, i like the design and the look. It's very different from the all-plastic designs common to other inexpensive Sony headphones. The headband is wrapped in pleather, with minimal padding. Length-adjustable metal strips attach the earpieces to the headband. The driver housings are of black metal, a plus. The cups are covered in crinkled pleather. The coiled cord is one meter long at rest, but extends to three, and attaches to the left earpiece. The plug is a mini; the 1/8\" adapter (included) screws on, to prevent accidental extraction. Both plug and adapter are nickel plated, rather than gold like the more expensive MDR 7506 (basically the same headphone with different stickers, gold plating on the jack, and an extended warranty), which is the only visible sign of the V6's relatively low price bracket. The V6 folds, in the manner of some of Sony's other headphones; that is, the ear pieces swing up under the band, to form a more compact package. After this treatment the V6 fits into the black pleather bag it comes with.Since the range is so large (5hz-30khz) you can hear everything, including the distortion of not well leveled sound. But that's whey these were made for the studio, and not really for personal listening. i am really glad that whenever i download songs, i make sure they are 192kbps or above. You can really hear any subtle nuances of instruments in the backround which is really an added plus. So if you get these headphones, make sure your music files are up to par.I cannot believe that that these headphones are under 100, and even further disbelief that i did not buy these earlier, they are one of the best headphones i have ever put on. Forget beats, go oldschool and get these studio monitors.Okay, these arnt all perfect, by now, my ears are getting a bit warm (lack of ventilation) but i guess that comes with any over ear headphones. Also, with thourough research, i found that the padding flakes off (the leather isnt real) BUT they can be replaced for under 20 bucks. Another padding that fits is the padding of Beyer DT-250 headphones which some say are a bit more comfortable, but i like these fine. These V6's last a very very long time, and is a great investment. I highly suggest it, you wont regret it.Also, a friend told me to let these play for a couple hours on high volume to \"break them in\". She also has these but for me, they play fine righto out of the box.", "overall": 5.0, "summary": "The best of the best, old school", "unixReviewTime": 1299110400, "reviewTime": "03 3, 2011"}