{"reviewerID": "A3BVSAZREDP9RH", "asin": "B00001WRSJ", "reviewerName": "WolfPup", "helpful": [4, 4], "reviewtext": "First off, I'm not an audiophile.  This will horrify some people, but I'm not all THAT picky when it comes to sound.  I'm happy listening to movies and TV through my TV's speakers (though to be fair, I always try to buy a TV with good sound).  I'm content with the headphones that come with my iPod-that sort of thing.So on the audio front, my opinion probably doesn't mean that much.  That said, I could instantly tell that the sound on these was far better than my iPod headphones.  It's as good as anything I can recall hearing.That's actually not why I bought these though.  I work in a very loud environment.  It seems to be over 70db, and I've long been concerned that it might be wrecking my hearing.  I've tried using the ear protection gear I wear while mowing, but it's just not comfortable for long periods.  I finally started wondering if a good pair of headphones that enclose your ears would help...And as it turns out, they do.  These cut a significant amount of noise out, to the point that I'm pretty sure they really are helpful for my hearing.  Not as much as the actual hearing protection stuff, but the difference in noise when I take them off after wearing them for a while is huge.I was also concerned about how comfortable these would be, given the mixed reviews in terms of comfort.  At least for me, these are very comfortable.  I've been wearing them every day, 8 hours a day, and have no complaints.  I can feel them if I think about it, but the cushioning is soft and comfortable, and to me they just feel like they're gripping my head lightly-not unlike how a hat feels, I guess.  (For the record, I wear glasses, and these don't interfere with them at all.)So at any rate, they seem very well built, they sound great to my ear, they're comfortable, and they seem to block a substantial amount of noise.  They're one of the few products that I can recommend wholeheartedly...Well, I guess just to nitpick, the size adjustments on the side don't always stay in the same spot from where they were when I took them off the previous day, but that's really no big deal.  They do HAVE size adjustments though, which is worth noting.  I have a big head-finding hats that fit is very, very hard, but these fit just fine, so I think they'd work for most people.", "overall": 5.0, "summary": "Fantastic-exactly what I was hoping they would be", "unixReviewTime": 1234828800, "reviewTime": "02 17, 2009"}