{"reviewerID": "A2QDSC731OQC3P", "asin": "140053271X", "reviewerName": "Nu Mantra", "helpful": [39, 44], "reviewtext": "Let me start off by saying that I am a fan of Amazon.com. In the past month alone, I have made at least 12 purchases.  I was browsing around just now and decided to see what Amazon.com customers thought of my newest electronic device.  I was thrilled to see the high rating, but disappointed to see the price; $40.00 more than the thing costs at B/N since its release last month.  Amazon, you need to do better here!Now to the product - This is my first e-reader and I am certain that I went with the best product for me.  As someone who buys a lot of books from Amazon, I would have preferred to have bought the Kindle,especially since Amazon has more of the types of books I read and for much cheaper than B/N, but I just do not appreciate those tiny buttons on the device.  I absolutely LOVE my Nook Simple Touch, and I use it for several hours every day.  B/N has Free Fridays - when you can download a featured book for free -, book share -with contacts on your device and social networks, and free reading of selected books when you are in B/N.  My understanding is that I can go to local libraries and even borrow my books using my Nook; This may or may not be any special news.The touch screen is a bit sensitive on the device, so if you prefer not to use it, they are also tactile \"buttons\" that will allow you to change pages.  The home screen shows the book you are currently reading and the page number you are on - a few other books in your library, and some suggested readings.  You can create shelves that you name on which to house your books by categories. They do not look like physical shelves, rather they are just a grouping of books.Without going into more technical stuff that you can read online, I will say that if you are new to e-reading and you enjoy touch screens -  AND YOU ARE LOOKING FOR A PRODUCT THAT SIMPLY ALLOWS YOU TO READ - Do not hesitate to go into a B/N and try this out.  Some people buy this expecting it to browse the web (although it does have a hidden browser that the techies are working to hack) - Play their audio files, when there is not headphone jack (Techies have discovered that it DOES have built-in bluetooth, however), and folks buy this and complain that they do not like how it does not display their magazines in color.  It is not meant to do that - it is meant to be solely an enjoyable easy-to-use reading device that does not give you a whole lot of options to be distracted from the task at hand, READING!This is why I bought it - Eventually, I will get a nook color - or a Kindle *color* if they come out with one, but for now, I thoroughly  enjoy my Nook, which has encouraged me to slow down and spend so much more time in the peaceful, leisurely act of reading. In my excitement, I am reading like 8 different books at once.  That is the great joy of having an e-reader - speaking to those who are, just as I used to be, resistant to the e-reading craze - there is no more lugging around a bag filled with books, and when I get tired of reading one, another book is just a couple of swipes away. I am learning about how to get all sorts of books for free or low cost, as well as learning how to take advantage of conversion and e-book management tools such as Calibre.  I am having a blast with this thing!Yesterday, I received a nice leather case for it that I purchased off Ebay for a great price.  Once again, I looked to Amazon.com first, but there simply were not good options.  I got a black leather Caseen case that also came with a screen protector for twenty bucks.", "overall": 5.0, "summary": "Really, Amazon? It only costs $139.00 at  B/N!", "unixReviewTime": 1310601600, "reviewTime": "07 14, 2011"}