{"reviewerID": "A16WND1BVJCQJV", "asin": "B00001ZT4H", "reviewerName": "Matt Eye \"Matthew\"", "helpful": [9, 10], "reviewtext": "The following was a consequence to reckon with (then came the digital age)...Sony CFS-W455 had the best internal microphone of any boom box, and too bad I once damaged the record side's tape door with a Koosh ball a dozen years ago... Soon got rid of it, but never forgot how great Sony's level of quality was for $80 at the local ACME store back then. Unfortunately, today, it is probably scarce as hen's teeth in the hope in finding one, if you are a fan of vintage recording equipment.Let's talk about the TCM-929. Its microphone is as sensitive as the boom box mentioned above, and it erases and records just as well on high bias and normal bias tape. The boom box had a silver-coated magnet erase head, whereas the shoebox TCM-929 has a black magnet erase head. (The story about identifying erase heads' capabilities is unique and personal.) Here are the pluses and minuses (and read my review on the TCM-200)...Pros:- Tape counter- Hyper-sensitive internal microphone (try external microphone for cleaner sound)- Erases and records almost equally on normal bias and high bias- Battery life nearly as long on NiMH batteries as on alkaline (Duracell or Energizer)- Well built- Runs on included household adapter (sound quality unaffected, unlike the TCM-200)- Great price for its features ($30 at the local Best Buy back in the day)Cons:- Would be more efficient (but maybe slightly more bulky) on 4 C batteries instead of 4 AA- Severe DC bias effect (distorted 'S' and 'T' sound, do we know)- Records below optimum on metal bias (partial erasure over previous recording)- Scratchy sound through speaker, especially after several years of use (a common problem with units of this league)This recorder won't fit in your pocket, but has a retractable handle, making it easier to carry. I would recommend this recorder, especially since I have owned it twice (the first one broken by experimentation in 1998 and the second one I still use regularly have had since 2000).", "overall": 3.0, "summary": "Best thing since Sony CFS-W455", "unixReviewTime": 1243123200, "reviewTime": "05 24, 2009"}