{"reviewerID": "A2R6RA8FRBS608", "asin": "B00001ZT4H", "reviewerName": "Matthew G. Sherwin", "helpful": [16, 16], "reviewtext": "The Sony TCM-929 Pressman Desktop Cassette Recorder with Automatic Shut-Off is a pretty good--maybe even very good--tape recorder in this price range. I like the fact that it takes the traditional old fashioned type of tape recorder and improves upon it. We get features like a microphone jack, a headphone jack--and there's even automatic shutoff for when we can't be there right at the exact minute the tape stops playing! The handle also makes for easy portability; this can be used to record just about any sound. Words, music, lectures and conversations, you name it.The buttons are easy to read and understand; there's practically no explanation needed for the five or six buttons in the front of the tape recorder that handle features including play, fast forward and rewind. The pause and eject buttons work reliably, too. Great! Just as Amazon notes, there is also a built-in microphone and speaker--but if you want a very clear voice recording there is a microphone jack so that people can get a very good recording of their thoughts right onto that cassette tape.It even comes with an AC adapter! If you need to carry this around and you can't plug it into an electrical outlet, just use the four AA batteries you'll need for roughly eight hours of usage. Of course, if you use strong batteries you may get up to nine or even ten hours usage; I think eight hours is slightly too short for what you'll get out of battery usage.One thing I must tell you--as I'm sure you can imagine, this isn't exactly the world's most durable tape recorder. After all, the price is very good for people in all income brackets. What does this mean? It means that I wouldn't bang it around or let small children play with it unsupervised. If dropped it could well break and that would be a shame. Handle with care for the maximum life of this tape recorder!Another caveat: although they say it records lectures well, I'm not sure just how well it will be able to record a professor's lecture unless you're rather close to the professor when they talk. This occurs simply because it's not capable of picking up voices and nuances of words from larger distances. I will have to take off one star for this to make this a four star review. Believe me, I tried to use this for my continuing education Spanish classes; and I was disappointed. I was not able to get a consistently clear recording of what the teacher had said. Good thing I took notes just in case this failed me on that score! One way to possibly get around this is to ask the teacher if you can place the tape recorder on their desk while they lecture; maybe that will work if your teacher doesn't mind.Overall, this is one fine tape recorder for everyday use and less demanding tasks like recording your own thoughts. It records especially well when you use a microphone that plugs into the machine instead of using the built in microphone. If you're looking for a good tape recorder in this price range and you don't need extremely heavy-duty features, this tape recorder is for you!", "overall": 4.0, "summary": "very good--but don't expect perfection...", "unixReviewTime": 1209513600, "reviewTime": "04 30, 2008"}