{"reviewerID": "A3L9NGPTBJBQEL", "asin": "140053271X", "reviewerName": "Po Po", "helpful": [3, 3], "reviewtext": "This is an update from my initial review.This Barnes & Noble Nook Simple Touch was advertised by BlueProton at Amazon as having been marked down from $249.99 to $68.99, so it certainly seemed like a great deal. It now seems like fraudulent advertising because I've since read that the MSRP is $79.99Initially I had serious problems with the Nook, and requested a refund. The seller, BlueProton, refused to take returns or give a refund for it, and directed me to Barnes & Noble who referred me back to the seller, stating  that the seller should refund it within 14 days; at that time  I'd only had it a few days. My Amazon A to Z claim ended with Amazon siding with the seller, BlueProton because their policy stated that they would not accept returns on Nooks - something I did not see when I initially read their policy!Because neither BlueProton nor Barnes & Noble would take responsibility for the defective product, and their attitude was \"Take the money and run!\", I'm giving the Nook a low review although later I found an update for the Nook which resolved the problems - with no help or information from either seller or Barnes & Noble!I now enjoy using the Nook which is so much easier and more comfortable to hold than regular books while reading,  and to carry back & forth to work each day or to travel with. I don't like the gray screen which requires you to face the Nook towards the light; and I don't like the glare on the screen from the sun or lights. I have to sit \"just so\" to read it - which somewhat defeats the idea of portability. Overall I do like it, but it needs improvement.My favorite use of the Nook is to borrow my local library's digital books using the free Overdrive Media Console software which allows you to select & save your library (ies) and to directly access the digital library from it on your PC, and then sideload (drag & drop)the borrowed books to your Nook; no more time wasted or trips through rush hour traffic to browse, borrow or return books downtown, and no more parking hassles! Most of my library's digital books are in ePub format which is the native format of the Nook. However, as other reviewers have stated, you can still borrow or buy Kindle or other formats of digital books and convert them to ePub via the free Calibre software. Borrowed library books can be returned automatically when the loan periods expire, or can be returned manually earlier if you decide not to finish the book during the loan period.Ordinarily I don't buy many fiction books because I rarely read any of them more than once. Additionally, due to the poor customer service from both Amazon (who owns Kindle) and Barnes & Noble (who owns Nook) I am determined to rarely buy any books from either of these companies, and will primarily download either their free books or the library's loan books. The companies want us to buy their ebooks, but won't take responsibility for their e-readers, so that infuriates me and alienates me for life.The pros: the low price; comfort; convenience; savings from being able to borrow library books instead of buying something you'll only read once; no clutter of physical books; easy loaning to friends with a guarantee that they will be returned in 14 days (automatic returns); ability to read multiple formats via conversion in free Calibre software. The Nook can also read your PDF files/documents from your PC or elsewhere, plus it can use your JPEG files of photos to use as your custom screensavers; the Nook will convert them to B&W.;The cons: PlueProton's and Barnes & Nobles's total lack of responsibility for their defective Nooks - why I gave the Nook such a low rating; Amazon's siding with Blue Proton's irresponsible returns policy; dreary gray screen which makes it difficult to read except in bright lighting; touch screen not as sensitive and responsive as it should be - often have to touch the screen a few times before getting a response.Over all I'm pleased with my Nook Simple Touch now that I managed to FIX IT BY MYSELF, but the companies' irresponsible policies have soured me towards them for life.", "overall": 2.0, "summary": "no responsibility from sellers for initially defective  new product", "unixReviewTime": 1361836800, "reviewTime": "02 26, 2013"}