{"reviewerID": "A8Z12UC2IMSTR", "asin": "B00001ZWTY", "reviewerName": "RDK", "helpful": [156, 163], "reviewtext": "Purchased a Sony PS-LX350H to replace 25 year-old Technics belt drive turntable. The Sony appears to be one of the few Reasonably High Quality options for an Audio (as opposed to &quot;DJ&quot;) turntable in the sub-$200 (or even sub-$300) price range.If it runs as long as the Technics, will be quite a buy - for now this must be considered a &quot;preliminary&quot; report(!).Out-of-box Picks: Looks good (&amp; matches other Sony components in system); appears to be solidly built (&amp; comparatively Heavy); gold-plated RCA plugs with removable cables (a nice feature! - although cables themselves do NOT have gold plating, they can easily be replaced); built-in strobe w/slider pitch control; platter/mat combo appear higher quality than Technics.Out-of-box Nits: Gee, manuals have gotten Cheap looking &amp; provide Sparse information! Where is the overhang guide? CHEAP &quot;no-name&quot; cartridge (conical, bonded diamond), NOT properly mounted in included headshell (overhang / alignment guide would be helpful...).Notes: this is &quot;manual&quot; turntable: you lower &amp; raise the tonearm manually. Not as nice as &quot;semi-automatic,&quot; where you lower but turntable raises at end of LP. Manual is OK for 'active listening' - but you won't want to forget about a playing LP. At least the arm lifter works well - smooth in operation &amp; easy to control.It also has an &quot;S&quot; shaped tone arm, which takes a standard mount cartridge. P-mount might be more convenient, but there is more choice avail in std mount - Plus, I have two fine cartridges, each mounted in own headshell (will use the Sony-provided cartridge to play Really Old LPs / children's records!)- AND, can use existing overhang/alignment tool.There is no built in phono amp/equalizer, an issue for many modern 'home theater' receivers. (But you can buy an off-board unit at moderate cost if needed.)How does it work? Just fine, thank-you - using one of my existing cartridges, played parts of several LPs &amp; was rewarded with crisp sound &amp; no obvious noise (at realistic, but still moderate, listening levels). May not sound any BETTER than the old Technics did at one time, but speed control appears spot on &amp; songs sound as they &quot;should&quot; (Subjective, of course!).Controls all appear to work with precision, and strobe marks are easy to read / adjust.  Two nits here: 1(Minor): Start/Stop button can be hit by mistake - but care should avoid; 2 (More Irritating): Anti-skate control is POORLY marked: you basically just ball-park it if setting between whole numbers. (Tracking force instructions are not intuitive - at least compared to Technics - but if you've done before will pose no problems.)These last two items are only of significant concern if you plan to switch cartridges on a routine basis (alas, something I traditionally do).Oh yes: The unit is taller than my Technics: so much so that there was no hope of using it with the supplied dust-cover. Unit is placed inside a cabinet, so cover not needed in this case, but might be an issue if your space is tight and you 'must' use dust-cover.Bottom line: only the poor markings on the anti-skate control are Truly disappointing, and then primarily because of usage within cabinet, AND personal preference of changing cartridges on a frequent basis. (Cabinet location makes Anti-skate setting doubly hard to confirm: if you can view from directly above, 'ballpark' will be Very Close, but placement within cabinet calls for flashlight &amp; mirror; will have to work in this!)The balance of the unit seems to work fine, and certainly sounds fine - which basically means that it doesn't add noise / speed inaccuracies, nor otherwise impede working of selected cartridge.To that extent, it is all that one could hope for, and looks good to boot.Other units considered included: new Technics belt drive; Music Hall; Stanton; Gemini, &amp; several others (at least &quot;looked at&quot; everything I could find in the sub-$500 range - though budget never called for exceeding $400...). If you eliminate the cheap &quot;impulse buy&quot; models - which includes some brand name items, such as the 'entry' Technics - and draw a fairly strict upper price point (say, under $300), there are not a lot of choices left. Now specify Standard Mount Cartridge, and focus upon basic Audio Performance and Controls - as opposed to &quot;DJ&quot; performance &amp; controls - and your choices really narrow. The Sony PS-LX350H is arguably the best among those that remain, although differing priorities could yield a different alternative.", "overall": 4.0, "summary": "Sony PS-LX350H - VG Consumer Turntable", "unixReviewTime": 1082332800, "reviewTime": "04 19, 2004"}