{"reviewerID": "AV5UHOOAXF5FN", "asin": "B00001ZWXA", "reviewerName": "N", "helpful": [1, 1], "reviewtext": "Sometimes you might wonder, \"you know, the USB cable that came with this cell phone/controller/hard drive/other things is not long enough; I could something to extend its reach.\"  I know where you are coming from, and I figured you would consider something like this.  Here, I bought one; here's my take on things.The cable came in a plastic bubble, tightly coiled around to fit in as small a plastic bubble as it possibly can.  The color is a little darker than you would see in the picture, but then you are not buying this because it looks pretty.  And it might look darker due to my room lighting.The build quality looks quite good.  While it does not have anything fancy like a woven sleeve or built-in LED, it feels as though it can handle years of service.  You can see, though, that the female side of the cable is not very protected; in fact, it looks like a mutated male part.  It is sturdy as well, trust me, but it would have been better if it were protected by the plastic that surrounded the lower part of the connector.  It might accumulate more debris and dirt than it would otherwise, but I have not used this long enough to go through such an endeavor and live to tell the tale.It works marvelously in conjunction with shorter cables.  I had a six-inch-long A to Mini B cable, which worked very well.  I also had a 3-foot cable of the same kind, so I tried that--but the cable did not let the signal go through.  There is a label on one end of the cable: \"Caution-do not exceed ten feet of total cable distance on low-speed device or sixteen feet on high speed devices.\"  This was USB 2.0 hard drive--a high speed device.  Sixteen feet was maximum length allowed, and this cable itself is 10 feet long, so any moderately long cable is going to strain the signal that tries to go to and from the device.It is a great product, but it puts a lot of the cables suddenly to the edge of usability.  I would recommend its use with shorter (3 feet and under) USB cables.  Otherwise, you might be better off getting a shorter extension cable, or an active USB cable likeTripp Lite U026-016 USB2.0 16-Feet Certified Active Extension Cable.", "overall": 4.0, "summary": "Works, but beware", "unixReviewTime": 1256169600, "reviewTime": "10 22, 2009"}