{"reviewerID": "A3Q5IRZ3ZJV4P3", "asin": "140053271X", "reviewerName": "Valueminded \"leadpedal2\"", "helpful": [3, 5], "reviewtext": "I bought the Nook Touch instead of the Kindle because it was on sale for $75, which is still alot to pay for something that can only be used to read books. I didn't realize that if you buy books from B&N;, you can only read them on your Nook, and not on anything else.  So even though you paid for them, those books really aren't your property.  You have no access to them if you don't use their products! Still, I liked the fact that it used ePub, and you had a variety of stores you could buy from and also that libraries have more ePub books available.  However, I just heard that their latest firmware update prevents you from reading any books except those bought from B&N.; If I had known this I never would have bought the Nook. It's as consumer un-friendly as you can get!  Really a nasty way to do business.  Amazon is different.  Once you buy a book, it is yours.  You can read it on any device. When it comes to buying books, Amazon is far easier to use and alot more consumer friendly.  The Kindle is by far a better choice of the two.I am returning the Nook after only a week, because this is a frustrating product that doesn't function like it is supposed to do.  There are simply too many glitches in how the touch screen works to be reliable. Here are the cons:  First, it often takes multiple touches to access anything.  You touch or swipe the screen, and nothing happens.  You try it again, and still nothing.  What a joke.  Second, pages turn mysteriously on their own and without warning, both forward and backward.  I am always losing my place when I try to read a book.  I've noticed that this happens almost every time you alter the angle of the Nook.  If you're reclining and turn to adjust the pillow, don't expect to return back to the same page you were on.  Third, the pop-up menu and dictionary are too easy to activate by accident.  If you hold the Nook too close to the screen, or at the top or bottom, the pop-up menu will appear or the dictionary will activate unintentionally.  This happens several times an hour.  You can't just simply sit down, relax and read unless you sit motionless in a chair and hold it on your lap. Last of all, it does not use a standard USB/micro USB cable. The USB connection to the computer is standard, but the micro USB connection to the Nook itself is NOT!  It is thinner and wider.  You can only use the cord provided with the Nook to connect to your computer to transfer files or charge the batteries.  You can't use the standard USB cord that works with all of your other electronic gadgets, like your digital camera or your portable hard drive.  So if you need a longer cord, or lose their cord, you're out of luck. Talk about a major inconvenience, one that makes zero sense!  Pros: I did like that it recharges in under 4 hours and that it has a very long battery life.", "overall": 2.0, "summary": "Not consumer friendly, full of glitches", "unixReviewTime": 1325203200, "reviewTime": "12 30, 2011"}