{"reviewerID": "ARXU3FESTWMJJ", "asin": "B0000206CT", "reviewerName": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "helpful": [44, 44], "reviewtext": "I decided to get this camcorder for the better picture (3CCD) and slew of excellent features versus some cheaper models. I have not had reason to regret my choice! I do action photography and have actually been able to capture some stills off it that are quite impressive. Nowhere near as colorful and crisp as my Canon SLR can give me, but quite useable. And without the cost and time of having to take a slew of photos, develop them, print them and scan them in. Don't be fooled by cameras that might offer more than 640x480 resolution...larger pictures don't do you much good if they aren't as good quality! These are almost as good as some digital cameras give you. In fact, I will be selling my digital camera off, as I don't really need it in addition to this camcorder and my regular camera.The camera is a little larger and heavier than some other digital camcorders, and it does not come with a memory stick included. Instead it includes a floppy disk adapter for capturing stills off your tapes. Neat to have, but not real useful in the field. Be sure you get the PC Card Adapater as well as a memory stick, this camera does not take them directly.I love the LCD screen, it will flip completely over and lay flat against the side facing out. Really nice for watching playbacks. It gives quite good sound and is nice and bright. The battery life is actually not bad at all, compared to a digital camera! But still worth getting an extended battery. Be careful about getting the highest life ones, they are quite big and heavy.Controls are pretty well placed and easy to use. I like having things like a neutral density filter turned on with a simple button push. Overall, the useability of this camera is very well-thought out and implemented. If you want a quality camcorder that will last you a long time, this is one of the best for the price you can get.", "overall": 5.0, "summary": "You can't go wrong with this one!", "unixReviewTime": 969494400, "reviewTime": "09 21, 2000"}