{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B000021YU8", "reviewerName": "magellan", "helpful": [17, 17], "reviewtext": "Recently I looked at over two dozen point-and-shoot models doing some research for a friend who wanted to buy a new compact camera to replace his 20-year old Nikon. Although we are really looking for a point and shoot with a short zoom capability (about 35mm-80mm) and so didn't pick this one since it is fixed focal length, I was impressed enough with it to want to make a few comments.First of all, none of the other two dozen models had a lens this fast, at F2.8. There were a couple that came close, but you'll find, especially with the point and shoot zoom models, that the fastest the lens will go is only F3.4 or 3.8. Many of them are F4.0 or more at the low end. So if you want at least F2.8 speed, this camera is about the only way to get it.There is one exception to this. You can buy a Rollei QZ35W for ten times the price and get an F2.8 lens also. For the extra money you also get a camera that weighs in at 18 oz. However, it has an amazing 1/8000th of a second top shutter speed, which ought to be fast enough to freeze an airplane propeller, not just a golf swing.Well, the Rollei is a great high-end point and shoot but it doesn't fit in your shirt pocket very easily at 18 oz., not to mention it will cost you a pile of green stuff.Two other things the Olympus has that the other models don't or usually don't have is there is no shutter lag. You hit the shutter button and there's no perceptible delay. The Yashica T4, although it has great optics, has this, and so do many of the other point and shoots out there. The problem can be prounounced enough to affect action shots. For example, you might take a picture of your child running across the living room floor only to find out that he wasn't even in the frame when the film was developed.The final thing that is nice about this camera is the \"weatherproof\" aspect. This doesn't mean waterproof, however, but a few drops of water won't hurt it.All in all a great little camera to take with you anymore.", "overall": 5.0, "summary": "Some special features", "unixReviewTime": 985824000, "reviewTime": "03 29, 2001"}