{"reviewerID": "A2JFOHC9W629IE", "asin": "B000021YU8", "reviewerName": "scott_from_dallas", "helpful": [23, 24], "reviewtext": "I've been shooting pictures since I was about 8, almost 30 years. I've owned several cameras, my first real one being a Canon AE-1 that I bought in high school. I upgraded to the EOS line in the early '90s and still shoot that line in film, but added medium format (Hasselblad) for portrait and wedding work (part time). Earlier this year, I got a digital and decided that I would invest a lot of time into that medium. But I wanted a film camera that, like my digital, had a good lens, was small and lightweight, and shot quality prints.I researched for several weeks all potential reviews on P&S; cameras. My wife has an older Pentax that was alright, but I had decided that the zoom lenses are often slow and not sharp enough. I debated between getting a Yashica P&S; off ebay, getting the newer zoom camera by the same maker, or getting this Olympus. I decided on the Olympus and am glad I did, though I'm sure the Yashicas are fine cameras.Working the camera is a snap. Open the lens cover, and shoot. I think the default setting is for fill flash, but the settings button cycles around -- so just use it for several rolls of film and get used to it. It does, however, reset to the default setting after you turn it off by closing the door on the lens, which is a minor problem. There's no need to wait for the lens to pop back in, since it is fixed focal length (though auto-focus -- keep in mind the difference).You may not believe me when I say this, but this camera will take better pictures in low light situations than all cameras except SLRs with the most expensive lenses. Having to use the rest of a roll of film and not particularly caring about picture quality, I took this camera to a recent night-time high school football game. Now football in Texas is big, and stadium lighting is pretty good, but it is never good for anything other than expensive, fast lenses, and fast film, right?Wrong. Well, partially wrong. This camera, armed with 200 (yes, that's 200 -- something I almost never shoot) film shot nighttime moderately lighted pictures that came out GREAT! The angle is wide, so the content leaves something to be desired, but this wide open apeture lens will definitely do the job when you need a fast, quality lens.There is a red eye reduction feature in the flash cycle, but I haven't tried it. My applications for this have been mainly outdoor, and the pics I've gotten are very sharp and as good as my SLR's. The guy I sold my AE-1 to won a national award with a pic he made with that camera. I recently asked him if he could do the same with this Olympus. He simply asked me when I wanted to bring it over!", "overall": 5.0, "summary": "Almost the perfect point and shoot", "unixReviewTime": 1066521600, "reviewTime": "10 19, 2003"}