{"reviewerID": "AMBP7V5ME7K13", "asin": "B000021YUL", "reviewerName": "LindyLou", "helpful": [60, 60], "reviewtext": "As so many others have noted, this is a GREAT camera for the money. It's loaded with features seen only on more expensive digital cameras (changeable ISO values, great low light capability, a true optical zoom lens with the ability to add 2X digital zoom on top...I could go on and on  about the *pros*.....there are so many!Here are the *cons* I've picked  up so far:1. Camera does eats its four AA alkaline batteries quickly,  especially if you use the LCD a lot. THE FIX: I purchased rechargeable 1400  mv NiMH Nexcells and a Maha C204F charger for under $40 online and neatly  solved this problem.2. Not the most intuitive menu and button system.  THE FIX: reading the manual before trying to use does help. A *quick guide*  sheet comes with the camera...keep it handy to figure out those features  you don't use often. Now I know how to use the features that are important  to me and don't have to refer to the manual any longer.2. Manual is  confusing with three languages/page. THE FIX: English is primarily on the  left-hand pages so look there first. Dog-ear the content index page so it's  easier to find what you are looking for later, and keep the one-page  &quot;quick guide&quot; that comes with the camera handy.4. If you are  going to take panoramic photos, ONLY THE ***OLYMPUS*** SmartMedia CARDS  WILL SUPPORT THIS FEATURE! If you purchase less-expensive brands like  SanDisk, you won't be able to take panoramas. THE FIX: Purchase Olympus  SmartMedia cards on auction sites or at bidding sites online...I bought my  Olympus 32 mb card for $45 under the Olympus website price.5. Slow photo  download rate. First of all, I didn't find the serial port download overly  slow, especially compared to other digital cameras. However, since camera  has to be on during the download, I recommend purchasing an AC Adapter  (doesn't have to be Olympus brand) to save on batteries. But if you're a  speed freak, then THE FIX: Purchase either the USB or FlashPath Floppy Disk  Adapter....either will speed up download time considerably.Bottom line  for me....best camera for the money, hands down! Buy one for yourself and  see!", "overall": 5.0, "summary": "Using for a month and LOVE IT!", "unixReviewTime": 949708800, "reviewTime": "02 5, 2000"}