{"reviewerID": "AXL5F6RXDQMEW", "asin": "1400532736", "reviewerName": "Amazon Customer \"review2u\"", "helpful": [5, 7], "reviewtext": "No stars. Be warned, potential B&N customer: if you have a problem with a defective brand-new, just-delivered Nook device, you're likely headed for Customer Service hell. Be prepared to meet with an army of know-nothing, apparently deceptive incompetents. Any merits of B&N's Nook products are offset by the company's Customer Service from hell. Today, trying to resolve the problem of having just received a Nook Simple Touch lemon, I've been lied to, hung up on, and received no help at all. The return call, promised by a supervisor at around six this evening, never came. So, around 4 hours later, I called back and spoke to another supervisor, identifying myself and asking for help. This call was disconnected on B&N's side, and that supervisor never called me back or emailed me to provide service.  I've also been advised that I'll have to wait quite a while for a replacement Nook, though I live in Manhattan and the site promises same-day Manhattan delivery. I'd read reviews on the B&N site and, I believe, on Amazon as well, about B&N's horrific so-called Customer Service. I can see now, from experience, that the horror stories are true. So if you buy a Nook from B&N and get a lemon, as can happen with any e-device, you're going to find yourself quite alone with your problem. Whatever the merits of the Kindle, I know from experience that Amazon Customer Service lives up to its name. B&N Customer Service is essentially an insult to customers. I don't work for either company. I'm just a customer with a brand-new defective Nook Simple Touch, and I can't get any help from B&N. So if you look at the numbers and see that Kindles far outsell Nooks, B&N's misnamed Customer Service is likely at least part of the reason.", "overall": 1.0, "summary": "Barnes and Noble Customer Service? Not happening.", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}