{"reviewerID": "A2Q89DEW2Y91A7", "asin": "B000021YUO", "reviewerName": "Cynthia Raxter \"If you never fail then you ne...", "helpful": [208, 209], "reviewtext": "A manual settings snob I was... my 20 year-old Minolta had a light leak.  Too late to get a repair before a trip to Alaska I bought a point and  shoot. I bought this brand because Olympus have glass lenses. But the  design is what really sold me: the camera is &quot;splashproof&quot;, the  lens cover ingenious, and the small, very lightweight oval fits in your  hand like it belongs there.It has trekked with me across Alaska,  Florida, fell in a fountain in Savannah, been on a beach too many times to  mention and has bounced off airport restroom floors more than once. It  survived being thrown 20 feet into the street when my bag was grabbed and  the camera flew out of it. It has gone fishing with me and even scooted off  the face of a glacier once.And you know what? Besides being more  durable than I could ever imagine, it takes great pictures.Two years  and 100 rolls of film later I have had 3 bad pictures. All because I was  taking low light shots without a tripod -- my hand jiggled the camera. Last  month, we were on the beach at midnight with a full moon out. I placed the  Olympus on stairs and set the timer so me tripping the shutter wouldn't  jiggle things. Beautiful shot of the ocean, the moon and unbeknownst to us  until the photos came back... a sea turtle coming ashore behind us.I  have taken the Olympus places I would of never taken the expensive (OK!!  OK: and clunky and heavy) Minolta. The Olympus fits in my pocket. It is not  an ordeal to get it out and determine the lighting, put on the right lens  or even to load the film.I miss the Minolta when I have a beautiful  sunset to shoot and know what it would look like with a polarizing filter  and ASA 100 film. And, when I was set up with it I could actually focus  faster than the autofocus on the Olympus. But three bad shots out of 3000?  I can stand a nanoseconds delay.", "overall": 5.0, "summary": "Excellent camera", "unixReviewTime": 968025600, "reviewTime": "09 4, 2000"}