{"reviewerID": "AYM76JWI220Z4", "asin": "B0000225BA", "reviewerName": "Victor H. Agresti \"remodeling-guy\"", "helpful": [7, 7], "reviewtext": "Reelcraft L-4545-123-3 Electric Cord Reel with 12/3-Gauge 45-Foot CordThis cord reel is designed and manufactured to be used in commercial settings such as automobile repair facilities, where it's used dozens of times every day, year in and year out.  Shops can't be bothered with the frustration or breakdown, of inferior cord reels.- every aspect of this reel is high quality; heavy steel, strong spring, powder-coat finish, large support bracket, design, and workmanship, etc.  As long as it's not abused, this product should last for decades.  By comparison, the cheap imports are mostly plastic to keep the price low -- some even have plastic internal parts that wear out or fail too easily.- simple to pull out the cord length needed, and stop on any \"click\".  When done, it rewinds with ease and authority every time.  You don't need to baby it for the last 10' to get it all on the reel - it just goes on.  The large rubber cord-stop can be easily moved so more, or less, cord hangs from the roller bracket.- the 45' 12/3 cord is rubber sheathed, so it stays soft and flexible even in cold weather.  Unlike less expensive reels that might use the smaller 14 gauge or even 16 gauge wire, the 12/3 cord is more than adequate for any 110 volt tool, or even multiple tools.  Top-of-the-line Hubbell brand plug and receptacle are used.- the 4' 12/3 pigtail should be long enough for most installations.  The right-angle fitting that protects where the pigtail goes into the unit, also keeps the cord close to the reel and out of the way.  If the combined draw via this cord will be greater than 15 amps, the pigtail needs to be plugged into a  receptacle that's on a 20 amp circuit.- this is the smallest commercial cord-reel of this length.  The reel itself is only 12\" in diameter and the unit projects a mere 13\" from the wall.- the roller bracket can be re-attached in any of 5 locations around the reel, for mounting on a wall, ceiling, bench, or wherever you want; so don't worry if the Amazon photo has it in the wrong place for your installation.  For example, refer to Customer Images for a different mounting location than Amazon's photo shows.- packing was excellent, with large molded plastic-wrapped foam blocks completely protecting the reel from damage.  Unsurprisingly, there was no shipping damage.There are other commercial-grade cord reels on the market, such as the Coxreel, but I don't see how theirs could be any better.  I also own a Grizzly H5695 12/3 cord reel, which costs 1/5 as much as this one, and is a terrific value.  However, comparing the Reelcraft to that Grizzly is like comparing a Milwaukee drill to a Ryobi drill.  Commercial quality versus homeowner quality.This is a lot to pay for a cord reel, but commercial grade reels are expensive.Highly recommended.", "overall": 5.0, "summary": "Supurb cord reel", "unixReviewTime": 1229990400, "reviewTime": "12 23, 2008"}