{"reviewerID": "APQQK1V695AUE", "asin": "B0000226IH", "reviewerName": "Ann E. Revelle", "helpful": [16, 16], "reviewtext": "Having owned the Sangean DT-110, the Sangean DT-200VX as well as the Sony SRF-37V, I can readily say that I like all three pocket radios very much. All three are PLL (Phase locked loop) digitally synthesized receivers.This is how they rank in my opinion:1) Best AM: Almost a tie between the SRF-37V and the DT-200VX.2) Best FM: Almost a tie between the DT-110 and the DT-200VX3) Radio controls: The DT-110 and the DT-200VX both have a stereo/monaural switch (bandwidth control) for detecting weaker FM stations whereas the SRF-37V has a DX/local RF (Radio frequency) gain switch for FM, TV and Weatherband signals. Personally I think that the stereo/mono switch is far superior to the DX/local switch for receiving the weaker FM signals (when set to mono and NOT to stereo). The DX/local switch on the other hand is much better for reception in large cities (when set to local and NOT DX) so that the RF gain of the unit is lowered when trying to receive very strong local signals on nearly the same frequency that strongly interfere with each other. Thus depending on where you live, work or play will ultimately determine which specific radio with which type of switch control you may want to purchase.All three have lock/hold switches for keeping the settings fixed except for the analog volume control switch. In addition, the lock switch on the DT-110 must be set to \"on\" when changing the batteries (you have up to 2 minutes which should be more than adequate) so that the presets won't be lost. The Sangean radios both have fine sounding deep bass boost switches whereas the Sony does not (it appears however that on the Sony a small amount of deep bass boost is always on and cannot be turned off). Also, the Sony is always in stereo mode for FM reception and sounds fine as well. All three radios sound the best with better earphones or earbuds than are supplied with the units which is not too surprising, but I found the Sony headphones adequate for most purposes. Also, all three receivers can achieve quite strong volume output levels before significant distortion occurs.4) All three radios are very well constructed with the Sony probably the most rugged design. The DT-200VX as well as the Sony have a hinged battery door (the Sony's door can be forced to come off however) and also seems well built, but a few people have talked about the DT-200VX breaking if it was dropped. The DT-110 does not have a hinged battery compartment at all, but it also seems to be well built. The DT-110 comes with a small, tightly fitting slip case with a belt clip attached to the case (in addition the specially designed case was constructed so that the radio can be completely operated very efficiently without ever taking it out of the case at all, except of course for changing the batteries). The Sony MRF-37V and the DT-200VX both have a removable belt clip that attaches to the radios and neither of them come with a case. Both the SRF-37V and the DT-110 fit very nicely however in the zippered Micro hard shell case, HS-5, by Sakar (available online or also available at many stores nationwide). This hard shell case is not very expensive, but also provides a great deal of protection against breakage if the units were dropped.5) Presets:DT-110: 24 total- 15 on FM, 6 on AM and 3 random (priority settings). Except for its 3 priority settings that require a single key press, it is a little harder (2 key presses, one with a time delay, instead of one on the Sony) to directly and quickly choose a loaded preset. However an automatic scan/seek capability, APS (automatic scanning for and loading presets and seeking sufficiently strong stations) can be used to either load presets for the first time or even scanning for previously chosen presets.DT-200VX: 19 total on any band in any order (called My Favorites), but they are found only in a forward progression without the ability to go in reverse. An APS procedure can also be used to setup presets on any band quickly and automatically.SRF-37V: 25 total- 5 on FM1 and 5 on FM2, 5 on AM, 5 on TV and 5 on Weatherband. It is extremely simple to setup presets and to retrieve them, but tuning is not an automatic procedure and requires single adjustments or the tunning button can of course be held down to speed up the scanning process.6) Power:DT-110: 2 AAA: up to 20 hrs on FM and 30 hrs on AM.DT-200VX: 2 AA: up to 30 - 40 hrsSRF-37V: 1 AAA: 31 on TV or Weatherband, up to 34 on FM and 54 on AM.7) The DT-110 (now under $35 at Amazon plus shipping, but is now as much as $50 elsewhere) and the DT-200VX (now under just $50 on Amazon including shipping) are much higher priced than the Sony (now under $29 plus shipping on Amazon) and have only 90 day warranties whereas the Sony has a limited one year warranty.8) Best overall: I live in a rural area in the high mountains of New Mexico so for my location the stereo/mono switch is superior for improving the weaker FM signals (see my note on this above). Thus, for my location and for working around computers and in heavy RF (radio frequency) noise environments (such as fluorescent lighting, electric motors, etc.) either indoors or outdoors, I really like the DT-110 the best for the great stability of the FM signals and its ability to detect weaker FM signals (it does not have a clock, but it does have a 90 minute automatic shutoff timer). I like the Sony SRF-37V the best outdoors and it is also mostly ok indoors (which comes with a clock, but no automatic shutoff). For all around use if you require a small speaker as well as earphone listening, probably the DT-200VX is the best (with both a clock and an automatic shutoff), but all Sangean pocket radios mute during automatic scanning and seeking which makes it much harder to find weaker stations on AM or FM very easily except using a manual and thus a more tedious search procedure.For more details, please also see my separate reviews of the DT-200VX and the SRF-37V.", "overall": 5.0, "summary": "Sangean DT-110: One fine pocket radio", "unixReviewTime": 1206057600, "reviewTime": "03 21, 2008"}