{"reviewerID": "ABDZCVPQVRPX5", "asin": "B0000226IH", "reviewerName": "Charles", "helpful": [3, 3], "reviewtext": "Great:  Reception, bass boostGood:  Sound quality, Priority Station key, Button Layout, Case/Belt ClipNeeds Improvement:  Could be smallerI think $40 for a radio is a reasonable price.  I was really looking for an audiophile radio for a higher price but could not find one.  I had an Aiwa CR-LD100 for a decade but lost it.  Very small, great sound.The Sangean DT-110 arrived on time with earphones, case with belt clip and manual.  You can auto-set station memory for AM and FM seperately.  It is easy to set and even swap stations in memory.  You can assign three stations to the priority button and access them quickly.I'm buying a radio, not earphones.  To test I used Klipsch Image X10 earphones.  The radio sounds great for the price range.  The bass boost is intelligently designed similar to the Super Linear Bass on the Aiwa.  It is not designed for dirt cheap earphones which is a good thing.I easily pick up powerful FM stations from 70 miles away.  The AM reception is such that I do not have to turn the radio to tune local AM stations.  There is no hiss on local stations and near hiss free on stations at a medium range.The buttons are designed ergonomically so that you can distinguish them by touch.  The Hold switch stops everything but the analog volume wheel.  The position of the wheel prevents unwanted changes.  The Hold switch also serves to preserve memory on battery changes.  Digital volume control is annoying when the steps in volume change are too large.  The analog wheel is an intelligent choice.I use Rayovac IC3 15 minute rechargeable batteries available on Amazon. They actually do recharge in 15 minutes with the Rayovac charger.  I have not had to recharge them after using the radio daily for a week. The batteries are about two years old.This radio is a little larger than I am accustomed to.  I haven't cracked it open.  It may be the AM antenna.  The Aiwa was smaller but did not have near the reception this radio offers.  The belt clip is a good compromise.For the price I am very pleased with the radio and recommend it.  I will continue looking for a smaller radio with high fidelity sound.", "overall": 5.0, "summary": "Great Radio", "unixReviewTime": 1215993600, "reviewTime": "07 14, 2008"}