{"reviewerID": "A3SHAOQ7FI3JLN", "asin": "B0000226IH", "reviewerName": "mattgb1 \"mattgb1\"", "helpful": [57, 63], "reviewtext": "This durable, amazing, practical, great-sounding radio has been with me non-stop for several months now, tagging along with me in my shirt pocket, coat pocket, jacket pocket, PANTS pocket, strapped to my belt, tied to my sleeve, dangling into a bag, clutched in my hand or just laying near me.I've worn out a dozen pairs of headphones along the way (in case you think I'm super-careful or anything), but the radio is totally unscathed.  It's the greatest.  It fits in my pocket, has amazing sound quality, and is every bit as good as it was on the day I bought it.buuuuuuuuut..............It's amazing how such a magnificent piece of electronic engineering can be rendered so user-unfriendly by poor interface design.I like the small size and excellent sound quality, but a few aspects of the ergonomics could be improved.For example, I like to switch rapidly between pre-set stations (as soon as a noisy commercial comes on, for example). This requires pressing two buttons instead of one -- as all of my previous el-cheapo walkmen could do easily -- so I'm a bit annoyed at that. The work-around is to use the \"priority\" settings, but it's limited to only 3.Yet I could live with that if only it functioned properly. I bought one and had to exchange it because the low-battery indicator didn't work. They sent me a new one and it had the SAME PROBLEM. Guess it must be a design flaw. So I simply have to accept the fact that it'll suddenly stop working without any warning whenever the batteries run out.But I thought \"no way, that can't be true\" so I contacted Sangean. They told me that the battery indicator light is only there to let you know that you've just removed the batteries (DUH!) and should replace them soon before the station settings disappear! Hey, tell me something I don't know, like the fact that the existing batteries are weak! When I told the Sangean guy that every single battery indicator in every single product I have ever owned was there to tell me that it's time to replace the batteries (and not a \"reminder\" that I just did so a second ago), he shrugged as if I were nuts.Second, I figured out that they must have made the left earpiece chord shorter so that you could easily tell them apart while running without having to read the fine print; however, they don't do anything to let you increase the slack on the chords (by sliding the wires apart), so the left side keeps popping out of my ear whenever I turn my head! The work-around, of course, is to go out and buy a 2-dollar pair of headphones and use that instead.When I asked him if Sangean intended to address any of these problems in the next model, he said \"no, but we'll be making it in lots of choices of colors!\" Ah, so good to see that they have their priorities sorted out. Ahem.Guess I'll keep this because I'm not finding anything better out there, and frankly, it does sound great.Aaaagh.And yet I still give it 5 stars, so you can imagine how happy I am with its qualities. (Sigh)", "overall": 5.0, "summary": "I LOVE this Radio !!!  -- but...", "unixReviewTime": 1014163200, "reviewTime": "02 20, 2002"}