{"reviewerID": "A1KY5G5FP31F2F", "asin": "B0000226L0", "reviewerName": "Richard L. Steiner", "helpful": [4, 4], "reviewtext": "The Sangean ATS-404 AM/FM Digital Shortwave World Band Receiver is a great little radio.  I have had mine for a bit over one month and really do like it.  However, it is somewhat larger and heavier than I thought it would be.  I bought it to take along on overseas trips, but I am afraid it is going to be too bulky for comfortably stuffing into my carry-on bag.  Oh well, the unit is going to be a lot of fun at other times.So far, I have not been troubled by the short battery life (20 hrs.) described in previous reviews.  I suppose that could be a problem under certain circumstances, but AA batteries are easy to replace anywhere in the world that has paved streets.I am a bit shy about describing my experience with the Sangean ATS-404 because several of the earlier reviews were apparently made by radio experts or aficionados much more knowledgeable than me.  I am just an ordinary guy that likes to listen to the radio once in awhile, but I do have some observations from my experience with it that might be helpful.First, the radio is touted to be an entry level shortwave unit.  I thought that shortwave stuff might be fun to play with, but I quickly found out that listening to most programs from Europe and elsewhere is silly because I am usually asleep when they are broadcast.  Nighttime is apparently best for shortwave reception. I find it best for sleeping. Further, the interesting shortwave broadcasts are hard to find among all of the bands and frequencies available.Yes, I admit it--I am in over my head with shortwave.  I even bought a book about shortwave radios that included programming schedules.  I am still confused.  I suppose a true shortwave fan might find this radio more usable in this area than I have so far.The radio has a great \"preset\" feature that I like and use all of the time.  Radio stations are easy to program in and to scan.  I enjoy the sleep feature, the dual time display and option to lock the radio for travel so it doesn't turn itself on in the airport like my last radio did.The AM and FM stations come very well and the digital tuning seems to be right on target every time. The Sangean-404 comes with an AC adapter which is nice, but it doesn't charge batteries in the radio.  There is a backlight for the display window, but it is sort of feeble and is almost useless except in complete darkness--like maybe a cave or a closet with the door closed.A set of low end ear buds is included along with a rubber-like envelope that serves as a case.  I haven't used either one yet.I think maybe this review sounds more negative than positive, but I didn't mean it to come out that way.  The Sangean-404 is a dandy radio, I use it every day and I do recommend it.", "overall": 4.0, "summary": "I like it, but...", "unixReviewTime": 1220659200, "reviewTime": "09 6, 2008"}