{"reviewerID": "A29G75YOG3SOW2", "asin": "B0000226QJ", "reviewerName": "Andrew Hildreth", "helpful": [78, 79], "reviewtext": "I've been listening to shortwave (or world band, as it's called now) for about 15 years, and am awash in multi-band radios. After some friends decided that there was room for just ONE more, I received the Sangean 606AP as a gift, and have been thanking them ever since. Like everything else, the Sangean has it's good and bad points. It's compact size is just right for the pocket on the motorcycle jacket. The audio quality, although non-adjustable, is very easy to listen to for extended periods of time, and greatly improves with a pair of stereo headphones. The F.M. band displays excellent stereo characteristics, and the sensitivity means capturing stations 75+ miles away is a common occurence. The mediumwave (A.M.) band is a little above average, with great daytime reception, and nighttime listening being almost too good - dozens of stations all coming in at once. Detuning the frequency by +1/-1 khz can usually help. I was blown away by the shortwave performance on a radio this size, and using the power adapter over the batteries, the performance increases greatly. The major stations sound like they are broadcasting from up the street, and sometimes I have to lower the antenna or toggle the local/DX switch to avoid overloading. Smaller stations can be called up quite well, and tuning up or down by 1 khz can help to remove some interference from nearby signals. A wide/narrow setting would be a great addition, as would SSB for grabbing some utility frequencies, but the plusses like low power consumption with a 9 step battery indicator, lighted display, dozens of easy-to-use presets,2 clocks, travel lock, +5/+1 tuning, and a nice travel case, make this a GREAT radio for globetrotting, or having the world on your nightstand. I highly recommend this radio to anyone wanting to fish into the fray of world band radio and come up with an excellent catch.", "overall": 5.0, "summary": "Small Wonder", "unixReviewTime": 984528000, "reviewTime": "03 14, 2001"}