{"reviewerID": "A2WVD0V1MKJ638", "asin": "B0000226QJ", "reviewerName": "Pickle Paul", "helpful": [34, 36], "reviewtext": "UPDATE FOR DECEMBER 2005 (MY EARLIER REVIEW WAS SOMETIME IN 2003 WHEN I PURCHASED THE UNIT)After two years of use, I am revising with the following comments and upgrading to 5 stars (IF I CAN FIGURE OUT HOW TO DO THAT EASILY) since I don't think you can rate something 4.5 stars yet.DURABILITY: I've carted it across 3 continents over the last few years. It's been shaken about quite a bit. Absolutely no problems.The AC adapter size/weight issue is not important. This unit is a  battery miser. I never carry the AC adapter. When you travel light, you don't want to carry ANY adapter and batteries last a long time and are cheap to replace. Shouldn't be an issue even if you're ecologically fanatical due to long use you get out of them.I still don't like the dim light, but overall the unit's been a workhorse, I must say.===Detailed analysis will follow if I have the time, but overall impression of quality, ergonomics, and design is very good. For those who primarily want a good travel radio, with the shortwave as a bonus, I have a few minor complaints.1) Light for frequency is not that bright (and display is a little small for us older folks who want to see the clock at night without groping for our glasses)2) Bigger problem is that the light goes off to save battery power.  What's wrong with that? Nothing if you are running on batteries, but when using the AC adaptor I would like the option of leaving the light on (like a clock radio) so you can wake up and see the time without groping in the dark for the display light switch.3) The power supply is dual voltage (good) and almost as heavy as the radio (bad). It does sag in a US outlet, but that is aesthetically annoying more than it is an actual problem.FM reception is excellent, I must say. Haven't played much with the SW yet.Written instructions are good and seriously, my overall impressions are very good. Clearly, much thought has gone into the \"radio\" aspects of this device. It is a little weak as a \"clock radio,\" which is a bit of a shame, but it does have very nice alarm (dual) and a gentle wakeup alarm that does seem very \"humane.\"It might have been more accurate to award this radio 4.5 stars.More later.", "overall": 4.0, "summary": "First Impressions From An Intense Engineer", "unixReviewTime": 1041552000, "reviewTime": "01 3, 2003"}