{"reviewerID": "A9E7XZEMW0K9V", "asin": "B0000228GF", "reviewerName": "Dan \"toujoursdan\"", "helpful": [5, 5], "reviewtext": "I bought this radio as a replacement for the Kaito KA11, which inexplicably stopped working in the AM/MW band and gave me concerns about Kaito's quality control.This is a basic shortwave/FM/AM radio, large enough to provide decent room-filling sound yet small and light enough to fit into a backpack. As I am going on a trip to Asia and will be going to places where shortwave radios are banned, it's also cheap enough to leave behind somewhere.There aren't many bells and whistles on this model: no exact frequency readout, no sleep timer, no alarm, no presets, no \"wide\" or \"narrow\" filter, no treble and bass settings, no external antenna jack, no tuning outside the basic FM/AM and shortwave broadcast bands; not even a carrying case. It has a headphone jack and input for A/C outlet and that's about it.I compared it to my Sony ICF-7600GR and found the sensitivity to be about equal. I was able to tune into the usual shortwave powerhouses: China Radio International, Radio Bulgaria, Radio Havana Cuba, Radio Canada International and VOA Africa service without much effort. The Sony obviously provides better selectability though; the Sangean had far more interference from adjacent stations. This Sangean, like all analogue models, also suffered from frequency drift and had to be re-tuned from time to time.Build quality is fair. It's light enough not to add much additional weight to my backpack, but as others have noted, the knobs are flimsy. Speaker quality is good. It's not too tinny sounding.If you're looking for a cheap, small, light travel radio, or a backup radio for emergencies, this is the radio for you. If you're interested in shortwave DXing (viz., listening to long distance stations as a hobby) this radio may be too limiting and frustrating. If you intend to give this radio heavy or rough usage, it may not last.", "overall": 3.0, "summary": "Basic radio", "unixReviewTime": 1297296000, "reviewTime": "02 10, 2011"}