{"reviewerID": "A11L90R7RWJA8H", "asin": "B0000228GF", "reviewerName": "Phil (San Diego, CA)", "helpful": [5, 6], "reviewtext": "Perhaps you want to dip a toe in the waters of shortwave radio listening. In my case, I wanted to give my kids a different perspective of the world around them than that which comes from the cliches and stereotypes presented on TV and in the movies. I'd had a decent Sangean shortwave a number of years ago but was hoping that as technology marches forward, decent functionality might be available in cheaper units.Right off the bat, let's discard AM (medium wave) and FM. Those are commonly available. I have no interest in introducing my kids to the red-faced belligerents who populate the AM band. There's no reason to listen to FM radio if someone has a decent CD collection for the car. Even though the SG-622 offers both AM and FM, I bought this solely for the shortwave.Taking a cue from other reviews here I expected that shortwave reception would be weak, but also expected that connecting this to the antenna that had been used with my component stereo system would significantly increase the number of listenable signals received. First I should say that without the external antenna this unit is a paperweight. Listening at night as I used to do with the better shortwave receiver, the only thing this picked up in multiple listening sessions was three or four religious broadcasts that probably are readily available on AM radio if the political blowhards haven't driven everybody else off the dial.Adding the external antenna from the component stereo did make a significant difference in reception. More signals were indeed detected. Unfortunately, the overwhelming majority of them were unlistenable. I'm not a shortwave enthusiast so I'm only speculating that what such listeners mean by \"sensitivity\" or \"selectivity\" is a radio's ability to home in on a signal while suppressing general static and noise. Most of the time when some kind of signal would be detected, the SG-622 delivered it as one chunk of coherent sound bobbing about in a sea of white noise. Sifting through band after band of unlistenable signals turned up a handful of broadcasts that were coherent but significantly noisy. No Radio Australia or Radio Moscow or english language broadcasts from points around the globe, but rather, mostly just the occasional foreign language broadcast peppered in with the already mentioned doctrinal teachings. In short, the effort required wasn't worth the parsimonious results delivered.It's probably a safe guess that \"drift\" means either a signal slightly changing frequencies or a receiver's inability to stay locked onto a fixed signal. With the SG-622 I found that signals repeatedly drifted, to where it was best if I kept one hand on the dial in an attempt to follow the signal's shifts one way or the other. Never had to do that with the shortwave receiver I'd used in the past.Listening to broadcasts from around the world can be a fascinating pastime, an activity to share with the kids. But if you want to stick a toe in those waters just to see how you like it, or how the kids take to it, without spending too much, this unit just isn't going to drum up any enthusiasm. It would be like buying a used Yugo to see if calling the tow truck from the side of the road inspires your teen to take up driving. This fails the effort/reward equation, this fails the cost/reward equation, and even when it lands a signal, it's the audio equivalent of watching a snowy TV screen. Don't abandon the idea of trying shortwave radio, but please, walk up the ladder to a better, higher priced model that will deliver enough listenability so that you or your kid can make an informed decision on pursuing this further.", "overall": 2.0, "summary": "Shortwave functionality is nearly worthless", "unixReviewTime": 1327104000, "reviewTime": "01 21, 2012"}