{"reviewerID": "APQQK1V695AUE", "asin": "B0000228GG", "reviewerName": "Ann E. Revelle", "helpful": [8, 8], "reviewtext": "First let me say that it is certainly NOT deaf at all on the extremely long whip as stated in many other reviews, but it is certainly better with either a passive (as supplied with the radio) or an active antenna attached (such as the Kaito KA33 or Kaito KA35).!Now on sale at Amazon for only $ 219.99, it is an excellent bargain (including shipping). I have only had my unit for two weeks, but overall I find it to be an excellent and very intuitive and much better sounding radio than the famous Sony ICF-SW7600GR (which I have also used for over a year) and I find the reception comparable, but the Sangean is much more intuitive and user friendly to operate even without the touted Sony synchronous detection circuit.The ability to be able to quickly change bands from lw to mw (am) to sw and to fm, etc. and in any order for example on the Sangean is an excellent feature set unlike the Sony ICF-SW7600GR where during automatic band scanning you will get \"stuck\" in a single band until the choice of am (this includes lw, mw and sw all in a single choice- For further details, please see my separate review of that Sony radio on Amazon) or fm is selected or unless a digital frequency is separated entered.UPDATE: January 19, 2009-This radio system is really fabulous and easily worth DOUBLE the cost of a new SONY ICF-SW7600GR for example. It certainly works better on a passive or active antenna system or on the included AC/DC adaptor as well, but it does work great even on the whip in my subjective opinion. The ability with the simple and very straightforward and easy to operate page system to be able to quickly pull out prerecorded station frequencies from numerous countries all over the world is a fabulous and very well implimented idea. Once all the numerous bells and whistles are understood by a beginner they could more easily enjoy this approach on this radio as well as on simpler introductory models as well (such as on the ATS-505 or ATS-606). They have even included the USB/LSB (Upper or lower side-band designators) and SSB (single-side band) in the prerecorded frequenices in the numerous list of available stations. Furthermore the system knows automatically and loads this detailed information in the detection algorithm as well. Anyway even without synchronous detection as on the SONY, I am definitely hooked on this new ATS-909AP Sangean. Try it, you will like it too! It is great fun to use and enjoy. Thanks very much  for helping me decide on this particular one Steve! What a birthday gift!!!I have only three very small criticisms so far and I will update this review as I continue to regularly use (see above) the ATS-909 on all of the available bands:1) The Sangean really needs a carrying handle to be installed either on the unit itself (there is not even a carrying strap) or one at least on the fine case that is provided. A friend of mine has one that he really loves and takes everywhere, but it is now held together with duct tape (and still works perfectly even after being repeatedly dropped).2) If the unit gets totally reset for some reason (I have only read about this problem), the unit will reverts to the Asian list of internal preset stations and has to be sent back to the Sangean factory to be reprogrammed. This process should be certainly be available instead using the computer link on the bottom of the Sangean as a software download on the internet just like upgrading a computer or PDA, cell phone BIOS or other such system.3) The switches on the right hand side of the ATS-909 unit are a little too small for easy and efficient operation of the radio. Fortunately the SSB (single side-band) switch is directly on the front of the unit and is very easy to control once the main tuning knob is put into the slow mode so that the BFO (beat frequency oscillator) can be readily adjusted to the position of zero beats, i.e., so that the voice transmissions sound (pun intended) completely normal.", "overall": 5.0, "summary": "Fabulous Sangean ATS-909 portable lw/mw (am) /sw radio", "unixReviewTime": 1230163200, "reviewTime": "12 25, 2008"}