{"reviewerID": "AUHT4M1W3G7PJ", "asin": "1400532736", "reviewerName": "Tedward \"Geek\"", "helpful": [8, 10], "reviewtext": "I'll be writing this review in stages, as I hit stopping points.Lightweight, nice screen, cute, low-profile buttons around the rim.  Touch screen is about as responsive as my iphone 4s.  Includes cable that has a standard USB a jack that plugs into just about everything: the computer, my hub, and the standard variety of wall worts and car chargers.This device is hard directed for \"easy setup\".  Too hard.  There should be a way to accept the TOU and get to using the device.  Forcing wifi setup and registration is just bad planning.Wifi - This is the stupidest thing about this device.  Once you charge it up, you turn it on, it asks for you to agree to terms, then it goes through wifi setup.  Note, you must HAVE wifi, AND connect to it successfully for the setup process to continue.  At this time, I'm stuck.  I'm in a town with limited wifi options, so it's not like I can just select a local hotspot.  Until i register the device, I have a brick.I have an old Netgear Router 802.11g&b; with wep and wpa protection.  The nook is capable of wpa2 security, but managed the wep and wpa security pretty nicely.  Strange thing was that I could get past the password, but it still would not connect to the internet (I checked the setup with my iPhone and everything worked fine).  Customer service had very few answers and only about 3 steps for me to take to fix the problem.  I tiered up to the supervisor and managed to pry out of her that the Nook runs on an 802.1x EAP network.  Upon googling it, this looks like the same network that causes a lot of android problems.  Next step is to hunt down a public wifi and try again.However: As soon as the thing charged and turned on, it showed up on my desktop and I was able to upload screensavers, books, documents, etc.  The device has a VERY small available memory, (about 250Mb), so text only books can be loaded, but not large PDFs (I bought this to enjoy the Modernist Cuisine series, 300Mb+ PDFs).  I had an old version of Calibre that worked right away.I'll change this review and maybe the two stars rating once I have something more than an expensive SD card reader to play with.UPDATE (after a stop at Denny's)Okay, sure enough, Once in a local restaurant with free wifi, I was able to connect, register and start using my nook.  I made sure I had a couple books on it when I left, so I was able to read a chapter before I paid the check.In good light, this screen is beautiful.  The characters are crisp and clear, it's easy to read, and you can make several screen adjustments including a limited list of fonts, size and margins.  In lower light, the dark grey on light grey screen gets tougher to read than, say, a printed sheet of paper.  Still, in my apt with only a 60 watt light illuminating the room, it's still pretty easy to read.You get two choices on how the side buttons function.  Personally, I like the lower one turning the page forward; because I tend to hold it in the lower corner, cupped in my hand.  However, you can swipe the screen to turn pages, too.The OS on the nook is a little simpler than, say the kindle fire.  And maybe that's why I like it better.  On this device, books are books are books.  They can be epubs, pdfs, purchased or uploaded, they all go the same place, and they all end up in the same list.  Nothing grinds my gears more than having to look 2-3 places for things based on where you bought them, or some other phantom difference established by the designers (or worse, the marketing department - I'm looking at you Kindle).  The down side to this that if you have a large ebook library, you are pretty much stuck using the search function.  There doesn't seem to be a way to organize books any other way. [checking online....] Oh crap, they have this whole \"shelf\" system built in.  Damn, scratch that organizational thing, I'll get back to ya there.Screen Savers.Forget about those fancy things on your PC, the nook's idea of a screen saver is to place a picture on the screen when it sleeps.  The default is a bunch of pictures of famous authors.  nice, you can also choose nature scenes.  But, remember I said that you could upload directly to the nook?  Well, here ya go. Create a folder with the name of your screen saver set, upload some 800x600 pics (jpg/png formats) in portrait mode and Voila! You have your own custom set.  I went to nook.com and downloaded a bunch of Str Trek Geeky stuff at first, but then realized I could just take a few snapshots and convert them to 16 greys myself.  Now I have a folder of a dozen of MY pictures as the screen saver.  Very nice.  Kinda like having an image viewer as well.Calibre.Getting calibre to work with the device once it was working was a complete breeze.  I bought a 16gb micro SD on sale and added it.  The card mounts on the desktop separately, but calibre is all tuned up to read them correctly.  So, when you put stuff on the device, you have the option of loading it in main memory or on the card.  Come to think of it, a series of small cards could be another way to organize as well.  Put your SF collection on this card, classics on that one, etc.  Fun.Oh, also, once I got the registration completed at Denny's I went into settings and disconnected the wifi.  It's been operating in that mode ever since.  So, only that first time is needed.Adding two more stars for all the juicy goodness.  I'll play around with it a while and see if we can get it to 5.  No real serious problems yet.UpdatePDFs - Okay, so pretty much everything else that displays pdfs tries to incorporate the formatting of the document.  This strange little device actually reads the text (easiest way to save formatting = text + format), and produces it in standard format.  It's a little disorienting but it makes for a much more consistent reading experience.Micro SDI think my real problem with this device was getting a huge SD card for this then thinking I had to fill it with a whole library.  Bah!  Granted, those 6 really large PDFs need some room, but I could have fit them all on a 2 Gb card and still had plenty of room to spare.  *sigh*  All that room meant I could have 100s of books on the device.  Think: Tim Taylor \" More Power!\" {grunt grunt}Shelves.  The device keeps track of the shelves internally, so it's not like a document you could edit outside the device and use your computer's search function to organize.  you MUST go through your entire library, no search functions, one book at a time to add to shelves.  Great if you know what you're looking for, but not all sets start with Lord of the Rings 1: ....If you buy this, don't get an external card right away.  the onboard memory can hold a lot of stuff.  Shorter onboard lists mean you have less stress with shelves and such.I won't be exploring the B&N; store for a while (a Long while).  I have a massive library to work through first.  So look elsewhere for those reviews.  I've heard the store is mighty nice though.No ads, easy to use, a joy to read.  This, my final entry sees that last star moving up the device.  Take heed of the speedbumps I've experienced and enjoy this cute little reader.  Now, I just need a case.....  :)ANOTHER UPDATE: Months later and I've read a small library on this thing.  It's a delight.  but I still find myself avoiding PDFs a lot because of the disorientation.  Also: to the 2 people who did NOT find this review helpful - Bite me.  Leave a comment.", "overall": 5.0, "summary": "Cute little reader", "unixReviewTime": 1380240000, "reviewTime": "09 27, 2013"}