{"reviewerID": "ACC1SLND21RI6", "asin": "B0000228GG", "reviewerName": "Breyel", "helpful": [0, 0], "reviewtext": "Is the Sangean ATS-909W the same as the Sangean ATS-909X? Specifications on the Sangean website indicate there are some similarities. Personally, I can only attest to the features and functionality of the former.As the owner of a Sangean ATS-909W, which was purchased in late 2010 with the wide (W) FM band (76 to 108 mHz), I suspect they are pretty much the same. Both dual conversion PLL models share the same frequency range, the same clock/dual time, the same Narrow/Wide filters, the same audio switches,  the same output jacks, the same USB/LSB in 40 Hz, the same EEPROM Memory Backup, the same 5-way tuning capability, the same 8-digit alphanumeric tagging of stations, and the same RDS readings for the FM band.Aside from the attractive and updated design, the Sangean ATS-909X features 406 memories as opposed to 307 on the ATS-909W. Power can now accommodate rechargeable NiCD batteries, which is a major improvement compared to the Sangean ATS-909W. Audio is boosted from 3 mW to 1.5 W when AC power is applied, much like my old Grundig Yacht Boy 500. An individual headphone amplifier is now featured. It has a  longer whip antenna, I suppose to address the poor reception the ATS-909W reportedly had off its whip. Weight and physical dimensions are  more or less the same.Performance? I would venture a guess and say they are probably about the same, considering they share pretty much the same processor and some internal configuration. My own experience with the Sangean ATS-909W is excellent. I find the ability to hear weak stations amidst the static on the short-wave bands is slightly better than my Grundig Satellit 750 Radio/Tecsun S-2000 and Grundig Satellit 500, but only when using the headphones. I hasten to add its lower floor noise is only better on certain frequencies; on some frequencies the Grundig Satellit 750/Tecsun S-2000 and Grundig Satellit 500 either equalled or outperformed it when utilising the same external antenna. I would say the Sangean ATS-909W has better filtering than the Grundig Satellit 750/Tecsun S-2000 when eliminating stronger adjacent stations. But then, the Grundig Satellit 500 blows away both due to its Synchronous Demodulator.As far as actual performance from my location in Malaysia, the Sangean ATS-909W matches the Grundig 750/Tecsun S-2000 in receiving short-wave stations in Tunisia, Morocco, Libya, Egypt, Israel, Chad, Darfur, South Sudan, Zimbabwe, Swaziland, South Africa, Eritrea, Ethiopia, Bahrain, Oman, Kuwait, Saudi Arabia, Iran, Turkey, Greece, Macedonia (northern Greece), Brazil, Cuba, USA (WWVH in Hawaii, WEWN in Alabama and WWCR in Tennessee, KNLS in Alaska), Canada, Ireland, UK, Sweden, Spain, Portugal, France, Ascension Island (Family Radio relay station), Holland, Germany, Vatican, Austria, Poland, Moldova, Serbia, Czech Republic, Slovakia, Bulgaria, Albania, Romania, Russia, Afghanistan, Kurdistan (northern Iraq), Pakistan, Sri Lanka, India, Tibet, China, Taiwan, Mongolia, North Korea, South Korea, Japan, Myanmar, Bangladesh, Thailand, Vietnam, Indonesia, Philippines, Solomon Islands, Guam, Pulau, Australia, New Zealand and Sarawak (Malaysia).Two negative issues often highlighted about the Sangean ATS-909W is the high battery consumption and deafness off the whip antenna. This definitely is the case with my radio. I generally use rechargeable batteries or AC power. The whip antenna is never used. Instead I have it hooked to an external 1/4 wave antenna, which is linked to about 15 meters of 50 ohm coaxial cable and fed through an MFJ-956 antenna tuner. The Sangean ATS-909X obviously addresses these issues with rechargeable batteries and a longer whip. And from the reviews I've read, a few owners of both radios have noticed an improvement.Overall, I am very much impressed with the Sangean ATS-909W. I use it regularly in my short-wave DXing and find it has been more than adequate when the other radios just couldn't handle the task at hand. It's not a top-end receiver, but for its price it is a powerful portable radio.", "overall": 5.0, "summary": "Is the Sangean ATS-909W the same as the Sangean ATS-909X?", "unixReviewTime": 1306368000, "reviewTime": "05 26, 2011"}