{"reviewerID": "A11ED8O95W2103", "asin": "B0000228GG", "reviewerName": "lighten_up_already2 \"lighten_up_already2\"", "helpful": [6, 9], "reviewtext": "First a disclaimer: I own the C.Crane \"Super 909\" and not the standard unit.I use this radio far more than any radio I own.  I have an office  that's partially below ground and a very difficult AM reception area.  I telecommute a lot and I listen to talk radio while I work, and this radio gets me through the day.One neat feature is the variable sensitivity knob on the left side of the radio lets me turn the sensitivity down and rotate the radio in order to determine the exact direction a weak AM signal is coming from.  This way I can position the radio for optimum reception.  Once in position I turn the sensitivity back up again.Here's one thing you might not have read about this radio in any other review: it's a great help with EBAY.That's right, those three separate timers on this unit combined the  military 24 hour clock allow me to look right at an auction end time (which is in 24 hour format), punch in a time about five minutes before that, and let the radio tell me when to get in front of my computer and get ready to win that auction.  And, I can set up to three different timers at the same time.  You don't need the \"super\" version to enjoy this feature.(Yes, I know that's probably not what the designers of this radio had in mind.)The downside is that the one thing this radio is supposed to excel in (especially the \"super\" version) it simply doesn't, at least not for me.I once ran a simple wire out of a cheap analogue SW portable down here in the basement and got a lot of SW stations from overseas, like Japan and Tiawan, but this radio can't pick up what that cheap radio could in the very same location and with a better antenna setup.  I don't get it.Also, the volume is broken or somehow doesn't work in such a way as to allow me to turn the volume down very quiet.  I actually have to run the volume a bit louder than I want because I can't turn it down.  I'm way too much of a cheapskate to pay to get this fixed.Finally, I actually bought this slightly used (but practically new, it was pristine), so I didn't pay full price.  If I had, and I was a real SW enthusiast, I would probably have been disappointed.So three stars because from my expreience it does not excel at what is supposed to be its specialty (and I've got the \"hot rodded\" version), and its a rather expensive radio.  Personally, I love it but I'm only using a fraction of the functionality that people typically buy a radio like this for.", "overall": 3.0, "summary": "My EBAY and talk radio buddy!", "unixReviewTime": 1143676800, "reviewTime": "03 30, 2006"}