{"reviewerID": "A2FKY5R4NSHJ93", "asin": "B0000228GG", "reviewerName": "Mark S. Deneen \"juicymusic\"", "helpful": [5, 7], "reviewtext": "25 years ago I had a cheap portable shortwave radio that never picked up a single station. So, when I bought this radio, I was optimistic, and yet skeptical about any results. So, I am a World Band newbie, and this seemed about the right amount of money to spend on a first radio. Here's the exciting news - within 2 minutes of unpacking this fine little radio, I was listening to Radio Havana, then Radio Netherlands, and then...well, you get the idea. Success was a matter of attaching the external wire antenna, hitting two buttons and turning up the volume, thanks to the pre-programmed stations in the memory - over 200 of them. In minutes I had been around the world and was now scanning the bands on my own. I'd call that instant gratification.Here's three things I really liked and I think will be attractive to a prospective purchaser. 1. Although the radio is complex with lots of features and buttons, the buttons make sense - the interface to use the radio is almost intuitive. You can't say that about most modern products with lots of buttons. 2. The tuning features are fantastic. You can directly enter a frequency using the 10-key pad, you can quickly choose a \"band\" to search manually, you can have the unit \"scan\" automatically and stop on strong stations, or you can manually rotate the tuning dial which has two granularities - fine and course. The tuning dial is detented and feels great. 3. The regular AM/FM performance is excellent. Using the auto-scan and store feature, the unit quickly found and stored all the best signal AM/FM stations. FM was clear, clean, stereo and sounded superb on headphones. And, I easily tuned my favorite AM station from 350 miles away.Here's what I did not like. 1. The volume knob is too sensitive at the bottom of the range. Cracking it open more than a hair was too loud on my headphones. 2. There are some tiny switches on the side (little used, I presume) which can only be operated with a pencil point, not a finger. 3) The display is an ugly green color which seems very old and archaic, although it was reasonable visible. 4) Setting the world time (UTC) seems impossible. I finally had to settle for setting local time to world time. I am not sure why that was so confusing. 5) The plastic case appears to be a bit delicate. This is not a radio you want to drop on the floor by accident.I can't speak for the technical performance about reception, gain, selectivity and such, because I am not experienced and this is my first radio. However, It easily tunes stations from around the world and I thought the sound quality was superb. It is easy to operate (I was even able to operate it in the dark) and brought satisfying results for about $225. I am enjoying it and feel it was a sound purchase.", "overall": 4.0, "summary": "A Shortwave Newbie Review", "unixReviewTime": 1170115200, "reviewTime": "01 30, 2007"}