{"reviewerID": "A1I3AJXVJ8PDS4", "asin": "B0000228GG", "reviewerName": "P. Blake", "helpful": [35, 35], "reviewtext": "I spent much time researching various makes and models of SW radios before making purchase of the Sangean ATS-909. I have had and/or currently own several radios, ranging from portable Sony&#65533;s, to very low cost China export models, to full blown Ham radios such as the desktop Yaesu 847. In short, I rate the Sangean ATS-909 5-Stars! It is uncomplicated and very easy to use after reading the brief manual and spending some time getting to know the radio. I simply love the 306 memories and the alpha-numeric tagging of stations. This is the primary reason I purchased the radio &#65533; I want pushbutton convenience to the stations I listen to the most &#65533; and I want to see the name of the station (which you can easily create).Performance wise, I rate the Sangean ATS-909 as follows: FM = 5-Stars. I live in the sticks, but even 30-mile away FM stations come in with relative ease (even with the antenna collapsed, although the antenna should be extended for clearest reception). AM = 4.5 Stars. All of the MW stations come in fine, and you should have no problem hearing all of your favorite stations, although there may be some noise on the weaker stations. As with ALL radios, for SW listening, you WILL need to steer clear of electrical noise sources such as lamp dimmers, motors, and other man-made sources of noise. Keep in mind that there will be very limited reception when indoors. This is true with all radios. When I moved outdoors and connected the included wire antenna, reception was strong on all SW bands. In fact, the wire antenna outperforms the whip antenna by a slight margin (it should, too, being 30-feet long!!!).The Sangean preloaded memories really make listening for a particular county or station a pleasure; it&#65533;s really cool to select which country you wish to listen to, and to further select from a list of stations from that country. The tonal quality and volume are more than adequate. The overall features of the Sangean ATS-909, compared with other radios, are simply superb. The overall build quality is excellent. This is a fine looking radio with a big, informative LCD display and great features. I have read on how this radio will quickly drain batteries, so I simply keep it connected to the wall transformer &#65533; no big deal.", "overall": 5.0, "summary": "Very Nice Multi-Purpose Radio", "unixReviewTime": 1059523200, "reviewTime": "07 30, 2003"}