{"reviewerID": "A2ZAIKFQ0LQ0WV", "asin": "B0000228GG", "reviewerName": "Store Hadji", "helpful": [11, 15], "reviewtext": "I've had a 909 for 10 years.  It's gotten several thousand hours of use, has fallen on the floor a few times, and is still going strong.It's very true that this radio is hard of hearing using its whip antenna.  It has inferior sensitivity.  I just bought a $20 analog SW radio which is vastly more sensitive.  You must add your own external antenna.  The reel antenna will do nicely.  After that, the 909 truly performs.  It can hear everything then.The speaker is also poor.  It has inferior sound.  Again, the $20 analog I bought has vastly superior sound to the 909.  The sound on the 909 is disappointing.  I only ever listen to it using headphones.The 909 has a tuning knob, which is much better than up/down buttons for tuning.  You can tune in 1 KHz increments.  That's fine for SW.The narrow/wide filters are okay.  Not great.  Using the narrow filter and tuning away from an interfering station can help with the interference.The tuning for SSB is unacceptable.  SSB should not sound like Donald Duck in a radio with this price.  If you rip off the display glass, you can adjust the BFO screw and almost get SSB to zero-beat.  I prefer the BFO knob on the YB 400PE to what the 909 has.  Poor SSB performer.The sound mutes when you tune.  That is bad.  I ripped my radio apart and modded the radio so it would not mute.The radio frequently beeps when you press buttons.  This is annoying.  I ripped my radio apart and removed the beep speaker.The memory function is very nice.  Nearly 30 pages of 9 memories each.  Most of them are preprogrammed and out of date.  You have to find a cheat online to bypass the memory lock so you can store your own countries and frequencies.Decent FM and MW reception.  MW DXers will not be disappointed.No DRM.  This is an old radio.  If you want DRM, you need to do another mod, buy a mixer/filter chip, pipe the signal into your computer, and decode it with the appropriate software.No synchronous detection.  At this price, the radio really should have had sync.  It makes a huge difference in terms of listenability.  Sync completely removes adjacent interference and fading distortion.  If you listen to SW you want it.  The 909 doesn't have it.I like the 909.  But I must suggest you get the Sony ICF-SW7600GR instead.  It is much cheaper.  It has much better sensitivity.  It has much better sound.  It has synchronous detection.  Or if your focus is SSB, get the Grundig Yacht Boy 400PE.  It is cheaper, has better sound, and zero-beats SSB.Sorry 909-lovers, but your radio is greatly outclassed by the competition.", "overall": 2.0, "summary": "Weak Reception and Poor Sound", "unixReviewTime": 1187481600, "reviewTime": "08 19, 2007"}