{"reviewerID": "ACSNZDXNUXSDB", "asin": "B0000228GG", "reviewerName": "Tim", "helpful": [12, 13], "reviewtext": "The Sangean ATS 909 is my very favorite radio.  And that's saying a lot, since I have quite a few different models.  The 909 is fairly easy to use, once you carefully study the manual a few times.  It's by no means a simple unit - having a number of bells and whistles - but the ergonomics seem to be quite sensible.Covering the shortwave band is as easy as it possibly could be, thanks to the key pad entry, scanner, tuning wheel, and memory presets.  I find this not to be the case with some popular shortwave radios, such as the RP2100/CCRadio-SW.The sensitivity and selectivity of the AM and shortwave bands are very good, even when only the whip antenna is used.  In fact, I've compared the AM reception with that of the CCRadio Plus, and found them to be nearly equal - the CCRadio Plus having only a slight edge.  However, the 909 aided by the Kaito KA35 active loop antenna is a superb combination, if you want the best reception.  On FM, I find the reception to be excellent as well.  And as for the shortwave band - twenty-nine pages of nine presets each, each page able to be titled by the user!  That's more than enough memory for an amateur.  The LSB and USB also perform very well, and allow you to listen to truck and Ham transmissions.The tone of the speaker is quite good for a radio of this small size, and probably better than many portables.  Some, though, may find it a bit flat on AM and shortwave.  It seems to sound best on the FM band.  I find it especially nice for classical music played at a soft to moderate volume.  An output on the left side of the radio allows you to run the signal through an external speaker system, for even better sound quality.The 909 rests on a small folding stand which pulls out from the back.  As an improvement on this, I would suggest using a plastic radio stand from Universal Radio.  This addition will hold the radio at an angle that's much easier for viewing the display, and will help to make the 909 a practical desk or bedside radio.  However, the numerals indicating the time of day (in 24-hour format, rather than 12) - although they are always displayed - are rather small for reading late at night.  At two in the morning, it's difficult to focus on such tiny digits hiding in an olive green lit display.  The beeper alarm is also rather soft.  If you're a heavy sleeper with less than perfect eyesight, this radio may not suffice for the bedside.Again, I've used quite a few different radios, and the 909 remains my favorite, alongside the CCRadio Plus.  I would rate it as an excellent all-round portable, the very best for sitting down late at night and running through the various bands until your wife says, \"Come to bed; it's late!\"  In fact, I have two (two 909's, that is, not two wives) - one being the \"Super\" 909.  I would highly recommend either version to any one who takes radio-listening seriously.  Of all the models I've used, the 909 is the easiest and most capable and enjoyable one.  And although it may not perfectly suffice as a bedside model, it makes an ideal desk radio, especially since its 8 1/2\" body takes up so little space.Finally, I've had my original 909 for since about 2004, and it has never given me any problems.  The digits in the display window work fine, as well as every other function on the radio.  From reading many other reviews, I'd say the consensus is that this radio is well built and durable.  Yes, it's expensive; but if radio is important to you, then the 909 will certainly be worth the price.  It's a means as useful as the internet - and far more convenient - for keeping informed in these worrisome times.[NOTE ON THE \"SUPER\" 909] After buying and liking very much the regular Sangean 909 radio, I learned of the \"Super\" 909 model, which costs an additional $100.  I carefully researced and considered this modified version for over a year before I finally decided to buy one.  After comparing the two, however, I have to pass on my opinion that the \"Super\" 909 may not be worth the inflated price.  The radio's sensitivity is admittedly improved, though not drastically.  The tone of the speaker is brighter and clearer, especially on AM and shortwave, but it's also more tinny than the original, while the bass response is in no way improved.All considered, this amounted to an expensive and unexpected disappointment, especially considering the glowing review I had read on a certain well-respected radio web site, which originally persuaded me to buy the Super model.  In fact, in some ways I actually like the older model's tone better; it's warmer, and better suited for music.  The most outstanding improvement is in the color of the display light, which is now a brilliant blue when the radio is plugged in, but faint blue when running on batteries.  Oh yes, I'm quite pleased with that modification.  But even in these environmentally correct times, I wouldn't spend $100 on a blasted light bulb!So, if you're tormenting over whether or not to spring for the \"Super\" 909, perhaps you should at least lower your expectations.  Like myself, you might like the older less expensive model just as well, or even better.[UPDATE] After using the \"Super\" 909 as a bedside radio, I have to correct my opinion of the neon blue light.  It may be beautiful in the daylight, but it's far too bright at night.  At 2 AM, this lighted window will simply burst you eyeballs.  And the last thing your eyes will be able to withstand in the wee hours of the morning is a focused search for the tiny digits that indicate the time, nevermind the even smaller alarm symbol.  In the end, the algae-green colored light that Sangean originally provides is the best and easiest way to view the display at all hours.[Second Update] Sangean has updated the 909 with the new \"909X\".", "overall": 5.0, "summary": "My Favorite Radio", "unixReviewTime": 1200960000, "reviewTime": "01 22, 2008"}