{"reviewerID": "A1DQHS7MOVYYYA", "asin": "1400599997", "reviewerName": "A. Boston", "helpful": [212, 215], "reviewtext": "MORE UPDATES at the bottom of my review!My review includes details of Kindle 3, the newest version! With the time period, I could still return my nook, but I'm still completely in love with it and don't want the kindle for the reasons below.I was one of those people who was averse to the idea of an e-reader for a long time. I liked the feel of a real book, I was in love with free books at the library, why would I start paying for them? Then, my library got \"overdrive\", which is e-books FREE from the library. Then one day soon after, I woke up and the urge for an e-reader was there. The Nook was my final choice. It took a lot of back and forth and research to get to this point. I bought and tried the Sony Touch reader, returned it, and went and got the Nook. I really honestly wanted the Kindle most, because I'm a loyalist. I love Amazon and felt really comfortable here if I decided to actually start purchasing books again. But below, I'll give you comparisons to the three big readers and the reasons I got the nook:- Nook(N) by barnes & noble- Kindle 3(K) by amazon.com- Sony Reader Touch(ST)1. My biggest decision maker was Epub. This is the format in which you can take ebooks out of the library, so I needed whatever I got to be Epub friendly.N: The Nook is epub friendly. As well as PDF, and many other formats.K: The Kindle won't use Epub, which was all I needed to know. It mainly uses it's own Amazon format,while it also uses PDF, mobi and a few others. It makes me feel like Amazon is being greedy, wanting us to only use and buy books from the amazon site. Don't they understand that I love my library?ST: Sony reader is Epub friendly. pretty much the same as the nook.2. PRICE!N: 149 with wifiST: 169 NO WIFIK: 139 with wifi(or 189 with wifi and free 3G)While kindle 3 is 10 dollars cheaper, it doesn't give me those free library books, so it really doesn't make any difference to me.*You can now lend some books from the Nook for 14 days to a friend with their new \"lend me\" technology. While this is in beta stages, and not ALL books are lendable. It depends on the agreement with the publisher. The other two you cannot lend at all.*The Nook has a replaceable, rechargable battery. So it'll last awhile, but when its dwindling, you can spend 30 bucks and put a new one in yourself. For the Kindles, they are sealed inside. People have said you can do it yourself, but you must be tech savvy. Or you can send it away to Amazon for about the cost of [...]+shipping charges and they'll replace it for you.*You can expand your memory on the Nook and on the Sony touch. The Kindle you cannot, though the Kindle will hold 3,500 books, don't know if you need more space then that?!*Nook has a fancy color touch screen at the bottom. While the Sony touch has a touch screen(the entire screen), it was slow to respond, very klunky and not very pretty. The kindle is loaded with buttons along the outside of the screen.* all three have a built in dictionary, which I think is just awesome.*The new kindle now meets with the nook on their slim width. People used to say the nook was more comfortable to hold because of the width, now the kindle will be as well.*Yet, the Nook is heavier by about 3 oz then the Kindle or Sony.*The Nook battery life lasts about 10 days with wifi off, the Sony has 14 days, and the new kindle is up to a month with wifi off(3 weeks with it on)This wasn't a big deal to me, and I was more interested in the other features the Nook DID have, like replaceable battery and expandable memory.*And you may be wondering, why did I purchase a Sony Touch, and then scamper back hours later to return it? Well. When I got it out of the box, it wasn't techy enough for me. It felt like a very basic, bare bones E-reader. And I already had in my head all the things you hear about the nook: books more expensive, and for some reason I thought it wasn't epub friendly. But the moment I had that Sony in my hand, I went to look at the nook more indepth online. The Sony online library was nothing in comparison to Kindle's Amazon.com or Nook's Barnes & Noble. One of my favorite reads recently was The Hunger Games by Suzanne Collins. It was nowhere to be found on Sony. That gave me a bad taste in my mouth.*In the past people have complained that Barnes & Noble is significantly more expensive then Amazon. I did some price comparisons of big titles, and found them most of the time to be exactly the same. I think Barnes & Noble might be trying to keep in line with Amazon to draw more readers(Like ME!) into getting the Nook.On the whole, the nook is everything I wanted. I've downloaded some free classics from google books, I've taken out library ebooks and it was REALLY easy! I even bought my first book(well, ebook) in a long time. Despite being a new release, it was under ten bucks. I also bought another book I've been meaning to read for years for under four dollars. The nook is comfortable to hold with one hand. I like the using the touch screen to \"swipe\" and turn pages. And tops on my list, I didn't feel horrificly guilty for buying it. One fifty is a reasonable price for such a fun new book reader.Update Oct '10: A software update is coming in Nov:\"dramatically increase page turn speed, customized B&N; Library organization and password protection. It also includes the ability to sync across all NOOK and all devices enabled with our free NOOK apps, by syncing your last page read. If you forget your NOOK at home, use the NOOK app for iPad, iPhone, iPod touch, Android smartphone or PC to pick up where you left off. And, the next time you pick up your NOOK, the Reading Now page will be updated and ready to go.Update Dec '10: The update was a pinch to install, and it has some stellar perks that make the nook even more loveable. The shelving option it a lot of fun for those people who like to organize. You can name a shelf anything you want. The only limit is your Barnes and Noble book will stay in their Barnes folder, while any other books you have will stay in My Documents. The page turn is very fast. I do read across multiple devices, but for most people that will be a great new feature.", "overall": 5.0, "summary": "Comparison: Nook vs. Kindle 3 vs. Sony Touch from a library book lover", "unixReviewTime": 1279584000, "reviewTime": "07 20, 2010"}