{"reviewerID": "A4WCZVA328QB4", "asin": "1400599997", "reviewerName": "Allen D. Reinecke", "helpful": [25, 25], "reviewtext": "UPDATE 6/3/10:  B&N; is offering a $50 gift card with every purchase from June 2 =>.  They will honor purchases up to two weeks prior to the launch of the promotion.  I bought mine 5/22 and my gift card arrives in 10 business days!  Now that's what I call a customer-focused company with excellent customer service.  Another and very important reason why nook beats Kindle.nook review:I did my research on e-readers and thought long and hard about the two main contenders - nook and Kindle.  I chose the nook.  Why?...1) It's design is future-proof (as far as anything is) because the hardware is designed such that software and firmware updates can make it more functional in the future.  Kindle requires new hardware. I just read a new one will be out in August '10, and no, no touch screen!2) Amazon (Kindle) is not a dedicated book store whose sole livelihood is books, like B&N; (nook).  Amazon has demonstrated this with its wrangling with publishers to the dismay of both the publishers and Amazon's customers3) Yes, the nook was rushed out last year but they are now already on V1.3 software, but it works well and has added features and corrected some early flaws.  The page turns are now quicker and very acceptable, especially compared with a real book page turn.  Whoever you are with, they will have some problems and features you do or don't like.  There are supposedly more books via B&N;, but never the books you actually want to read - Kindle has some missing for me as well as B&N.;B&N; will no doubt keep updating its software regularly and Amazon make you pay for new Kindles (and risk you not being able to read your e-books on the next version, like V1 to V2)E-book pricing is a little crazy right now as publishers seem to be trying to establish the \"value\" of e-books versus paperback/hardcover.  Some e-books are more expensive and some are changing prices weekly.  It's the same situation with both Kindle and nook from what I can tell.4) The touch screen is a nice feature (future-proofed hardware), but big fingers can hit the wrong selection occasionally.  It is comparable with the iTouch touchscreen performance IMHO.  Navigation is maybe more hassle than the Kindle as a result.  This also makes the nook smaller (no physical keyboard to worry about) and easier to hold, even though it is marginally heavier than the Kindle.5) The nook can be personalized with your own photos for wallpaper and screen-savers (wrong wording as it's just a picture for when the nook is in sleep mode - No burn-in with e-ink screens). You can add more storage in a nook with a micro SD card6) The Kindle battery lasts longer, but the nook is fine with the Wi-Fi turned off - about 10 hours.  The nook battery is user-replaceable and costs just $29, unlike the Kindle7) The nook extended warranty covers ANY accidental breakage/spillage for the full 2 years.8) A B&N; store is always nearby to get help in person and they currently offer a free book per week when you visit the store (in week 2 of 5 right now)9) Using independent free software available on the web (Calibre), I can convert and \"sideload\" documents and news feeds to my nook.  I have sideloaded web pages (originally saved as HTML), word documents and .pdf's, all in .epub format.  This is no doubt possible with Kindle too, but the nook is more than flexible for my needs.  I read USA Today and The BBC news feeds on my nook every day and they include B&W; photos and diagrams which are clearly readable.  Calibre has many more available.10) Using Sigil, again free software, I can modify e-books to add chapters or correct errors and sideload them to my nook.  Again, no doubt a possibility with Kindle, but I am not sure.11)  Nook is just the one size, no Kindle DX equivalent.  For my needs though, the small nook is \"back pocket\" sized (literally fitting in my back pocket) and is small enough to read but carry around.  I need reading glasses without exception to read and so can read at the smallest text size with no problem.12)  I'm not bothered about having a music player and the built-in speakers are not really capable as listening devices (tinny and low volume), but it's there and will no doubt allow for text-to-speech in a future software release, which will be useful.  The sound quality through headphones is good.I've had my nook a week and have read two books and many daily news articles.  It's comfortable to use, it's fun to use and while maybe a luxury we could all do without, I've read a couple free e-books that otherwise, I would never have done - and I have many more downloaded and ready in the wings.  It's actually now a hassle to read through a real paperback or hardcover.  :-)The choice is yours, but my choice was the nook and I think it was a good choice.UPDATE 6/2/10 - .PDF's on the nookI have found that .pdf books, especially with charts and diagrams (ie technical/text books) are problematic to read on the nook.  Interestingly the B&N; store personnel stated that they had never tried to read a .pdf on the nook - maybe just a way to avoid the issue??  However, the Kindle will no doubt have the same issue, unless you use the DX which is larger and so you can read .pdf's natively.If you read a native .pdf on the nook it is the whole page squeezed down to the 5\" screen - impossible to read.  If you use Calibre to convert the .pdf to .epub format, then the end result is variable.  Diagrams get screwed up or disappear and while text can be enlarged with the font size function, even the text formatting may or may not be acceptable.Either way, I have given up trying to read such books on my nook.  :-(I would not recommend the nook to anyone trying to use it for school where .pdf's are the only format available.  The problem is not nook/Kindle, but the way .pdf's are created.  They don't have the necessary information encoded to be able to convert them to other e-reader formats and retain their .pdf look.  If you are going to save any documents for conversion to .epub format, don't use .pdf.  I have found saving as .HTML renders a perfectly acceptable .epub file when converted, including diagrams and charts when archiving web pages, for example.See also my review of the JAVOedge Snake Skin Case for Barnes & Nobles Nook (Flip Style)", "overall": 4.0, "summary": "nook review", "unixReviewTime": 1275177600, "reviewTime": "05 30, 2010"}