{"reviewerID": "A26X7W5UM5QFT4", "asin": "B000023VW2", "reviewerName": "Grits", "helpful": [3, 4], "reviewtext": "This antenna is advertised as something people purchase along with the Sony ICF-SW7600GR AM/FM Shortwave World Band Receiver.  And the product description for that radio says there are two antennas included with the radio - a ferrite rod internally, and the little silver telescoping antenna on the top of the radio.  Nowhere does it say the external antenna comes in the box WITH the radio (it does).  So when I purchased that radio, I also purchased this antenna.  Though I never opened up the packaging and tried out the separately purchased Sangean antenna with the Sony radio, I have absolutely no doubt about its quality.  The antenna that came with the Sony receiver appears to be exactly the same antenna - just without the Sangean name on it.  Assuming it is (and I'd be very surprised if it isn't made in the same factory, even on the same assembly line), the antenna works great!  It's compact, long enough to significantly extend the capabilities of the radio, and stores easily out of the way when not in use.JUST DON'T buy this WITH the Sony ICF-SW7600GR AM/FM Shortwave World Band Receiver - that's already got one.  I see that this antenna has the same \"Frequently Bought Together\" buying \"suggestion\" that the receiver does.  Amazon took my Sangean antenna back without any hassle and credited my credit card quickly with an apology - AND a promise to take out the \"Frequently Bought Together\" suggestion on the product item pages.  It's highly misleading, to say the least.  So in that regard, I'm not impressed with Amazon for leaving that still up on both products (well over a month since purchase now).Got an OLD ICF-SW7600GR receiver that didn't come with this antenna back when you purchased yours?  By all means get it.  It's well worth the money.", "overall": 4.0, "summary": "But if purchased WITH Sony ICF-SW7600GR AM/FM Shortwave Receiver - it's 1-Star", "unixReviewTime": 1323216000, "reviewTime": "12 7, 2011"}