{"reviewerID": "A75MTT7XI4B02", "asin": "1400599997", "reviewerName": "Allen E. Nance \"Allen Nance\"", "helpful": [1, 1], "reviewtext": "MY WIFE ADORES THIS PRODUCT !!It was our household's first e-reader.There IS a little learning curve at first and expect to need a household pc to talk to it via a usb micro (not MINI) data cable WITH DATA capability (some usb cables are just charge-only) and if you get a used deal on one without a usb micro data+power ability, you are looking at up to $20.00 (unless you get one cheaper taking a risk on a crappier cable).---Only thing is it's hard for someone whose disabled with touching or vision issues to use... though you can increase font size, the rare occasion you have to type something out it's kinda small but that doesn't happen often on the nook itself.----She uses hers mainly to check things out from the Clark County Library District in Las Vegas.  Once we registered with the Library, we installed Adobe Digital Editions which is the digital rights management... that took some doing but once in place, you tell the ADE of the nook you have, authorize it, and then from that point on anytime you want to check out a library book you simply go to their site, check out the electronic version which comes into your computer where the ADE recognizes it and outputs it to your nook.After x amount of days...when the checkout time expires, the file disables itself and you either get another book from the library or re check-in/check-out the same one for another x days.It makes the public library a whole new experience and that's great because, guess what...your tax dollars paid for it !  and the author gets their cut too.....Win-win all around....We've never bought an e-book from barnes and noble yet, and you do have to register the nook with them at first though you don't have to put in a credit card, but that step is probably skippable it's just handy because if you want help from b&n; they'll want you to at least register the product with them..not a big deal and it's one-time during your initial set-up procedures (and that's the one time you need to use the aforementioned little hard to type on 'typewriter' display.Happy Nooking(P.S.  as a bad pun, I told my wife that if The 3 Stooges owned it, it would be a Nook-Nook-Nook... but I was frowned at.  Guess it's funnier if Curley is your favorite stooge.  I digress :)  )", "overall": 5.0, "summary": "FANTASTIC !  Wife loves it and it's great for public library use  !", "unixReviewTime": 1383350400, "reviewTime": "11 2, 2013"}