{"reviewerID": "A2V4T35IYF9G0V", "asin": "B000026D8E", "reviewerName": "Bearie Luv Amazon \"bearieamazon\"", "helpful": [23, 23], "reviewtext": "I'm in the IT industry and have had installed, swaped, formated hundreds of hard drives in my life. Hard drive failure is normal, and it's expected. What I've found out is that MTBF that manufacturers publish has very little correlation with reality, since reality is affected by factors such as temperature, handling, etc. What they publish is in a perfect laboratory environment-- not what people normally have at home. In my past, I have used Seagate, Maxtor, Western Digital, and Hitachi. Seagate has alway been high on my list because of their reliability and their 5 year warranty.Personally, reliability is a huge concern for me because I take tons of precious pictures of my family & baby and I cannot afford to lose them. That's why I always build RAID systems with different drives from different manufacturers, and in certain cases same manufacturer but with very different batches. After only 3 weeks, this drive failed. Since it was on a raid system, no big deal. I swapped in another drive, and it to Amazon. My other 750G failed after a year's use. That's 2 Seagate failures within 30 days of timespan-- not a good impression so far.Let's compare the latest Seagate with the latest Western Digital technologies. My Green 1T WD drives have been running for a few months without any problems so far. It's by far the quietest drives I've ever gotten, certainly much quieter than any of the Seagate Barracuda drives. It's also the most vibration free drives (Seagate is a bit noisier) and cool running-- heat shortens the lifespan of everything. The return policy for WD is much more hastle free-- you put in your credit card number and they'll hold the fees, and mail you a new drive immediately until you return the defective one, upon which they'll refund the credit card fees. Compare that to Seagate's return policy where they want to CHARGE you a set amount of cost if you want them to send you a replacement while you still have the defective drive.Seagate used to be well known for its quality in the early 90s. I used to trust them exclusively, but throughout the years their quality has decreased tremendously, and I no longer recommend using them. It happened to Maxtor in the early days when megabytes were a lot (Maxtor drives were notoriously bad in the 80s). I guess every good successful company, in their quest to drive up more and more profits, take shortcuts to make more money and eventually shoot them in the foot.Guess what, SlashDot has a headline \"Seagate Hard Drive Fiasco Grows.\" Ha! I am not surprised. Sorry, but Seagate is just not living up to its reputations anymore. Your 5 year warranty is useless when you can't recover precious data such as pictures of your family/baby. Regardless of how good a manufacturer is, I cannot emphasize how important it is to  building RAID-1, or at MINIMUM do thorough backups every once in a while. You'll be protecting hundreds of man-hours for your corporation (if this is for corporate use), and hundreds of tears for your family (for family use).", "overall": 1.0, "summary": "My last 750G Seagate lasted 0.9 years. This 1T Seagate lasted 3 weeks.", "unixReviewTime": 1232150400, "reviewTime": "01 17, 2009"}