{"reviewerID": "A33ZO4XGZ09MPG", "asin": "1400599997", "reviewerName": "CC \"Ciara\"", "helpful": [25, 25], "reviewtext": "So, I bought the nook a few weeks ago when the price cut went into action and was constantly going back and forth with the thoughts of buying this, or buying the kindle.I bought the device with 3G simply because it was only a little more, and I travel a lot and don't have house wi-fi. I remember when I used to scoff at the nook when walking into B&N; and can't believe I ever did that! I love the feel of being able to go into the bookstore, with my nook and feel connected to the actual store. I will admit you have to do your research (read forums, articles etc...) because the nook demo employees, are not going to know everything. Also you MUST read the 'manual' and follow it to a 'T' Don't take the reader out of the box and drain what little battery you have left because you're going to have battery issues (needing it to drain completely a few times and then fully charging it before the battery is at full capacity)A lot of people may think their nook is 'frozen' when actually the battery is drained, and when that happens the screen is set to whatever screen saver, book page etc you were on when it died. There's no 'power-down' it will just stop, and touchscreen will not be active, once you plug it up and charge it a little, it will be good again. Also the constant use of the touchscreen will drain the unit faster (obvious unfortunate fact)There are a lot of books available at the moment (depending what genre you read) especially for teen and sci-fi and fiction (my books), and I was surprised to see all of the 'lend me features' for a good portion of the books I was interested in. Also B&N; really listens to complaints and proves that with upgrades (faster page turning, less freezing etc.)Also even when there was a manufacturing error, they were quick to send out a new improved nook. Overall, I love this device, it's fun, its sleek with a solid feel, and it's open-ended for future updates.It may be for you, it may not. Do your research, read forums and reviews, go into the respective stores and hold and try the device.Pros:Removable/replaceable batteryReally crisp 'paper' and 'words'e-wish list for booksSD card slotAudio/ musicFree coupons, discounts, and food monthly via nooke pub librarygetting books from Sony ADELending featureConsBattery lasts an average of 7-8 daystouchscreen keyboard a bit small (if you're used to iphone/ipod)touchscreen may be over sensitive with accidental touchSmall price differences with kindle books (average of a dollar)", "overall": 5.0, "summary": "Read the Manual and Do your Research", "unixReviewTime": 1278892800, "reviewTime": "07 12, 2010"}