{"reviewerID": "A2ICT9A9NFH6X8", "asin": "1400599997", "reviewerName": "Confused at Work", "helpful": [3, 5], "reviewtext": "After what I thought was a thorough research between the Kindle, nook & Sony ereaders, I took the plunge & bought the nook. What appealled to me most were the web browser & ePub use to check out books from the library. However, after fully charging the nook, I took it with me for a weekend at the beach. I didn't bring the the charger because B&N; said battery would last up to 10 days with wireless off. Well, I found out the hard way, with wireless on, it barely a couple hours reading at night & in the afternoon by the beach. Oy, was I frustrated with nothing left to read & another night & afternoon left. Lesson learned: must bring charger everywhere! Lost 1 * for this.I'm not a fan of touch screens, still love my trusty push-button cellphone. So browsing the web was a pain for me, having to navigate around the screen with my finger. Page turning was fine, but I think I've overdone it since my finger began stinging from constant page-turning friction :0)). Scrolling down & up also frustrates me - most of the time I have to swipe several times to get it to move. Not to mention hitting the back button after book downloads - the response time was slow which made me think it didn't sense my touch, so I'd do it again & it goes back all the way to the main menu. Grrr! What a pain as I have to restart the store search & find the page again.B&N; samples are horrible! They give you 7 pages...but it's the cover, copyright, dedication page with only a paragraph of the actual story. Not enough to make me want to buy a book. The closest B&N; is 1 hour drive away so I couldn't take advantage of the cafe freebies or free reading in-store.After I discovered that I cannot organize books into folders, that was the final straw. I read novels with racy titles, my 10 y.o. son wanted to read his classics on the nook but I didn't want to lend it to him because he would see all my books & potentially read them. This is a biggie for me so lost another *.Features I'm happy with: I was able to check-out books from my library & I was able to put my pdf books on the nook. Yey! Unfortunately, my library just got into ebooks & have only a handfull of books so it'll be a while until I can fully take advantage of this feature.Well, these are my personal experiences with which I now realize that I didn't do a thorough reasearch as I first thought, LOL. My fault...but I still like my nook, though I'm no longer in love with it like when I first received it. I've also ordered the latest Kindle so we'll see which one I'll keep - I'm looking forward to the push-button keys on that, LOL.", "overall": 3.0, "summary": "Drains battery so fast", "unixReviewTime": 1283385600, "reviewTime": "09 2, 2010"}