{"reviewerID": "ALUNVOQRXOZIA", "asin": "1400599997", "reviewerName": "Conrad B. Senior", "helpful": [2, 23], "reviewtext": ".Paid $[...] for this in April 2010.  Biggest waste of money I ever spent.  not worth the hassle of getting it repaired.  Made me miserable and unhappy for three days.  This is not how I want to spend my life--feeling miserable and abused and wondering how I got suckered into this huge mistake.The good--or perhaps the OK--I found nothing really good.GSM service is free for purchasing books and most uses. Not all that valuable.  I'd be happy with just WiFi and enough memory to carry around a personal library. with me.  GSM available for anything else but books.  Wifi works ok, after some fussing with the settings.  Many times I got error messages.  I kept trying until it worked.  There is some issue with the Wifi but it can be fussed with until it works--starting and stopping it.The bad--just about everything:I travel a lot, and need to carry my library with me.  This device does not work to download books outside of the US.  Why not?  I can understand the GSM not working, but if I have WiFi access somewhere, I should be able to load anything I want anywhere.  I can load books anywhere with my iPod Touch. Requires a US address.  Why?  Why can't anyone use it?  Device requires that you sign up with B&N; with a credit card.  Why can't I download free books without a B&N; account?  You cannot use this device until it is registered.This device is barely functional.  The interface is poorly designed, B&N; does a great job of making it difficult to find free books, and the books that are normally free--B&N; charges you $1 to $2 for these books! Outrageous!  Most people would not have a clue they are being ripped off being charged for books in the public domain.The interface is so bad that everyone is hacking these devices to make them functional.  Do a GOOGLE search for nook soft root--better yet check out YouTube and search for TROOK.Do a search on nook itself for free and you won't find free books, you will find books with \"free\" in the title or crippled editions with two chapters free.  There is no menu selection for find free books.  If you do find a free book it will be after wading through page after page of the same title--it would take days to find even a few interesting free books.  With the Kindle, at least you get to choose a few best sellers are part of your purchase price.  The B&N; give you nothing for free but garbage.  They want to frustrated enough to pay them more money for overpriced books.  Personally I can't see paying the same price for an electronic book as I do a paper bound book that I can resell or give as a gift.  Electronic books cost nothing to produce and distribute--why do they cost so much?  It is gouging, IMHO.To get a free book into your nook is a nightmare PITA.  I use an iPod Touch and was able to load 60 free books into it, in about 8 minutes--easy and simple.  Not menu after menu and then find out the book was not loaded after all.With B&N; nook it takes a long time to select and load a book.  You have to pay for a book, even if it is zero dollars--another menu choice, just to get you in the habit of hitting a purchase button.  There are lots of free books out there.  Why should it be hard to load these? Personally, I want a large library with me because I travel alot, and I want to find  what I want quickly, and I want to read it without hassle.PFD files can be loaded but these are not re-sized, so that type is pretty small and hard to read.  I can't read them, and I have reasonably good near vision.  If you are young with perfect vision you might be able to read for a while until your eyes get tired.  PDF don't work well on this device.Changing a page is a pain with the controls.  There is a way to use a finger swipe that some people have difficulty with.I personally hate wading through 40-60 pages on the life of the author, at the beginning of the book when all I want to do is read the book itself.  Books with a ton of crap in the front, with articles about the life of the author, acknowledgments, are a PITA toget around.  Scrolling down to chapter one to start the book is problematic--sometimes you are sent back to the index, other times you go to Chapter one. Why should I have to scroll and enter a command twice.  Why can't it work the first time?I constantly had the urge to use the white part of the device as a touch screen, but only the bottom is a touch screen.  I found myself thinking, my iPod Touch is better than this.  It is fast to touch what I want.  Give me something better like a Blackberry pointer ball!Display is flashing every time a page is changed.  I found this constantly annoying.  Why?  There is no reason for the flashing.  EVERY PAGE FLASHES AT YOU!  YOU WILL LEARN TO HATE IT!!!!USB power connector.  This is a weak spot of the device.  Instead of using a robust connector, they use a micro USB connector. It is wobbly. Even a mini-USB would have been better.  At times I  could not make this connector work.  It is delicate.  It doesn't want to mate up.  I found I needed to be very precise on aligning it, even then it would not connect.  I doubt that this will survive 100 re-connections.  If you buy this device, do not expect it to last more than two years.  It would be smart to get the extended warrantee--another $60 for two years--If you buy a nook.  Charge it only when you have too, or you will wear out this connector in a short period of time.  While the battery life is good, given the crappy connector, I don't understand why they didn't put a battery 2-3 times larger in this device so that the connector would last longer and have less wear.Memory Storage is limited to about 1GB with space to add another memory card.  To bring it up to 8 or 16 GB, it will cost you another $30 to $60, or if you buy it from B&N; it will be twice as much.  I feel the device is worthless without at least another 8GB of storage.  I'd rather it came with another 16GB.  The iPad comes with that much or more--so you get a color full touch screen for not much more than the cost of the memory you need.This is a good gift for someone clueless about electronics that won't know any better about how badly B&N; crippled their android operating system and don't understand what a good interface is all about.Do yourself a favor.  Try an iPod Touch, and I assume the iPad works as well.  Apple makes quality products that work right, with strong connectors, great software, and are backed up with the highest rated customer support.  B&N; built something with one purpose only, to sell electronic books--and to make it difficult to find free books, and to break quickly.  If you want to be screwwed over, buy one of these and then bend over because B&N; sees you as someone to be used and abused--not a valuable customer.If B&N; made it easy to download free books, I'd be more forgiving on the crappy software they use and the delicate power connector.  If B&N; made a decent, usable interface, and made it easy to load whole library's of free books, I'd probably buy some electronic books and they would earn my business.  As it is, I will never buy an e-Book or any other book from B&N.;  That is how angry I am about wasting money on this product.My nook is dead after only three days.  I wish I could return it.  I don't have the original packaging either, so that even if I got a new replacement, I cannot sell it on eBay to get my money back.  I'm not sure what I'll do.  I will be calling B&N; tomorrow to see about a replacement, and begging for a store credit instead so I can buy an iPad instead.The bottom line is, I'm more than disappointed about the product.  I'm angry enough that I'll never do business with B&N; again--even if they refund me the price of this device.  I don't even want it back if it were repaired.I'd rather pay $600 for an iPad, purchasing from a company that charges a lot for products that are well thought out and work well.  While I may wish the price was less for Apple products, at least I don't have this awful feeling of being screwwed ten different ways by B&N; with their service and nook product.For those who think this is a good product.  You are fools who don't know enough to make a valid judgment.  I laugh at you, because your nook will be dead within a year.", "overall": 1.0, "summary": "AVOID AVOID AVOID  Buy and iPad....", "unixReviewTime": 1271548800, "reviewTime": "04 18, 2010"}