{"reviewerID": "A1JAJO1BULTYMZ", "asin": "1400599997", "reviewerName": "Cynthia \"cdeluz\"", "helpful": [2, 2], "reviewtext": "After reading many technical and customer reviews of both the Nook and the Kindle, I purchased the Nook.  I think that both the Nook and Kindle are good products, but the Nook offers the user some unique advantages over its counterpart--the Kindle. First, a buyer can actually test drive the Nook before purchasing it at either Best Buy or at a Barnes and Noble store. The Kindle is only available on line at Amazon.com.  I cannot invest my hard earned money into buying an electronic device without trying it out first. The physical design of the Nook is attractive, sturdy, and compact. Navigating is easy. The user does not have to use the left/right arrows on the Nook to turn the page of an ebook.  The pages of a book can be easily turned by simply swiping the touch screen. Bookmarks can also be set. This is an important feature for me since I tend to read more than one book at a time. Secondly, the Nook offers web browsing.  I was able to link my Nook to my home wireless network and surf web pages.  Although the software is still in its beta stages, I am impressed at what I can already do.  Next, I can download and/or design wallpapers and screensavers for the Nook. This might be a minor point, but it makes the Nook unique and customizable for its owner. The Nook's storage capacity can be expanded. The Nook comes with 2GB of storage that the user can expand up to 16GB by purchasing and installing a micro SD card. The Nook's internal battery lasts about five years with normal use (this is according to technical reviewers), and a replacement battery can be purchased and installed by the user. Nook users also have a community forum they can join on the Barnes and Noble website to share ideas, tips, and news about the Nook. Also, improvements in the Nook software updates are due to customer input. I like for my suggestions to be heard and the Nook engineering team is listening. Don't take my word for it. Test drive the Nook for yourself before you make a decision.", "overall": 5.0, "summary": "Take A Test Drive", "unixReviewTime": 1278201600, "reviewTime": "07 4, 2010"}