{"reviewerID": "A2VG364UUGYFHI", "asin": "B000026D8E", "reviewerName": "tvguyer \"tvguyer\"", "helpful": [7, 7], "reviewtext": "stay away look for updates in other reviews for failures.Pros: Works fine until it dies!Cons: I have had 3 failures of this model disk in the last 45 days in 2 different systems. These were not gamer systems and are well cooled in large Antec boxes. Clearly Seagate has a problem and expect additional failures - next time I will put the service / shipping charges towards Western Digital units rather than replacing junk with junk.Cons: ... died without any warning after two months.The return policy is horrible - you are literally not allowed to use packing peanuts, bubble wrap, or newspaper to package a dead drive when you return it for warranty replacement. It has to be 2 inches of foam rubber in a corugated box or your warranty is void.Also, you are sent a REFURBISHED drive as a replacement.You are also required to pay for shipping the drive back, and can wait as long as 30 days from the day they receive it to get your new one.This last point isn't too bad in itself, but when mixed with everything else, it's stupid.Oh, and the RMA form on the website was down for two or three days before I could actually get it sent in. Customer service couldn't even fill out an RMA request for me - the entire system was down for \"maintenance\".They also make sure to withhold the detail about packing until you already submitted the form... and possibly gave them $20 to avoid waiting a month for your replacemeOther Thoughts: What happened, Seagate? I have two more of the older 7200.10 drives in here and they've run absolutely beautifully for the year I've had them - as a matter of fact, they're the only thing holding my degraded RAID5 up right now. I still have the old 160GB drive that came with my Dell five years back, and it still works like a charm. I order a couple 7200.11 drives, one arrives DOA and the other dies within two months without any warning.Cons: Had a SD15 failure. Drive was making a high-pitched noise just before it failed on machine reboot. Was able (with effort) to get SD1A flashed onto drive. But then drive became very noisy -- every few seconds, it would sound like the head was tracking accross the drive (a 'farting' noise, as some have said). Performance would also drop to near zero at these times.Got a warranty replacement from Seagate (which cost me $20) -- another drive with SD15! Sure enough, one week after install this one just started to make the high-pitched noise, so I'm typing this before I'm computerless once again.Other Thoughts: I will never, EVER buy Seagate again. I will do everything I can to make sure no one I know buys their products, either. Shame, shame, shame on you, Seagate.", "overall": 1.0, "summary": "-5 stars", "unixReviewTime": 1236643200, "reviewTime": "03 10, 2009"}