{"reviewerID": "A1QS9CHFCEB3WJ", "asin": "1400599997", "reviewerName": "Daniel Murphy \"Dan Murphy\"", "helpful": [51, 67], "reviewtext": "I'll admit up front that when I chose the Nook over Kindle and Sony's e-reader, I was impressed by that nifty full color touchscreen at the bottom of reading screen.  Glitz does not equal function, as I promptly found out.To be fair to Nook, if ALL you want to do is read, the device works, and works pleasantly.  I received my Nook in February, so it had the latest firmware updates, and I experienced none of the delays in downloading, missed sections of books, delays in page turning that early reports noted.  But if I was attempting to do anything more than clicking the page turning buttons, OUCH!The nifty little full color touchscreen (NOT to be confused with the e-paper reading screen, which is permanently gray-scale) just can't do it's job.  It responds slowly and inconsistently to touch, is quirky in its response, and virtually (no pun intended) unusable.  The virtual keyboard:  what a nightmare.  It's a true challenge to type more than one or two words without making an error, and trying to fix that error degenerates into a tragi-comedy in short order.The unit itself is pleasant to the hand, and comfortable.  It's also darn slick in its appearance, and if aesthetics  are your only criteria, well, go for it.  But here is why I returned the Nook after one week:  any optional feature, such as bookmarking, highlighting text and annotating it, search functions for previous book marks and annotations:  purely a nightmare.  The processor of the Nook appears to be vastly underpowered, and each instruction you give the touchscreen results in a wait that seems interminable.  It took me 30 seconds, AFTER I got good at it, to highlight 3 lines at the bottom of a page.  Simply not acceptable.Battery life:  might have just been my own unit, but in 7 hours: dead.  I also experienced two full scale lockups, with all buttons simply refusing to work for several minutes.The Nook's only advantage, as far as I can tell, is access to significantly more free content than you can currently access on Kindle.  Not worth the incredible frustration of wrestling with a device that went for touchscreen technology, but forgot that the touchscreen needs to be FUNCTIONAL before you bring it to market.Update as of 2/11/2010:  I purchased a Kindle after returning my Nook, and have been using it for three days.  Wow.  What an incredible difference in terms of ease of use.  The keyboard is very functional, bookmarking and note taking is effortless, the dictionary function (move the cursor to a word, instantly a definition pops up) is wonderful. Battery consumption is imperceptible, after 3 day, no visible drain (my Nook lasted 7 hours).  Downside of the Kindle?  Books whose copyright had expired (e.g. Wuthering Heights)that were FREE on Nook, are 99 cents on Kindle.  Nook lists all vendors of a given book, with prices conveniently visible, Kindle does not.  Irritating.  Lastly, Nook had a tiny clock in a corner of the screen, which I found very useful.  Not available on Kindle.  Overall:  for my needs, no contest whatsoever: Kindle", "overall": 1.0, "summary": "All That is Glitzy is not Gold", "unixReviewTime": 1265500800, "reviewTime": "02 7, 2010"}