{"reviewerID": "AOEAD7DPLZE53", "asin": "B000028F42", "reviewerName": "NLee the Engineer", "helpful": [102, 106], "reviewtext": "This item offered here (Recoton ADF1650 50/1600W Dual Wattage Travel Converter) is actually two different converters built into one package. At LOW setting (up to 50W), it uses a small AC transformer to convert 220V sinusoidal waveform into a 110V sinusoidal waveform. This is the preferred approach which works well for any low power appliance.To handle higher power, however, the AC transformer must be made bulkier and heavier (around 20 pounds just for 1000W). This makes it impractical as a travel voltage converter for large-wattage appliance. Therefore another method is used by this converter...At HIGH setting (50-1600W), this convert simply uses a solid-state switch inside to chop off part of the 220V sinusoidal waveform. The resulted waveform, as seen by the appliance, is highly distorted and is far from an 110V sinusoidal AC voltage.For a purely resistive appliance (such as travel iron or water heater) it works just fine irregardless of different voltage waveform. But if you ever try to power an electronic appliance (such as TV, computer or battery charger) with this distorted 220V waveform, it will probably be fried in an instant!The product manual did warn against using the HIGH setting for any electronic appliance exceeding 50W. So legally the company is covered. My advice is to stay away from this potentially destructive product - unless you are really, REALLY careful about what to plug in. Chances are, sooner or later somebody will forget about this warning and plug a Xbox into this \"converter\" - only to get a big BOOM!If you must bring electronic appliances with your oversea trips, make sure they are rated for universal voltage of 100-240V AC. That way, you can safely use them in other countries without the need for a volatge converter. Power supplies for most portable electronics (laptop, camcorder, cell-phone, electric shavers, etc.) are already designed for universal voltage, although some of them may require you to physically flip a switch.But don't forget, even if you don't need a voltage converter, you still must bring a set of plug adapters for foreign countries. For example, consider theTravel Smart Polarized Adapter Plug 5 Piece Setfor this purpose.", "overall": 2.0, "summary": "Learn the truth about \"Dual Wattage\" converter and don't get burned", "unixReviewTime": 1206403200, "reviewTime": "03 25, 2008"}