{"reviewerID": "A2G0O4Y8QE10AE", "asin": "1400599997", "reviewerName": "Deborah A. Woehr", "helpful": [194, 199], "reviewtext": "Despite all of the negative reviews, I decided to take a chance and buy the nook, once I tested it out at my local B&N.; I loved the look and feel of this device and was looking forward to the convenience of buying more books without adding more clutter to my already cluttered bookcases. I read all of the pros and cons of owning a Kindle and compared it to the pros and cons of owning a nook. The nook won because of its versatility (epub format, book lending, etc).My nook arrived on January 28th. Since then, I've experienced one crash and had to figure out how to use the touchscreen so that I can flip the pages without having to use the arrow keys. The latter took some practice, but I eventually mastered it and have been enjoying this feature ever since. I've also read three books in the space of a week, which is a personal record for me, as it normally takes two weeks for me to read a single paperback, longer if I'm reading an ebook on an LCD screen.The eInk technology is fabulous. I can read all day (and do) without eyestrain. The letters are very crisp on a plain white background. Even better, you can adjust the font size from small to extra large. Not only that but the nook comes with several fonts: Amasis, Helvetica Neue and Light Classic. I'm happy with the Amasis as it resembles Times Roman.My only complaint so far is that I am not able to categorize my books into categories. At the moment, I'm forced to wade through my list until I find the book that I want to read. B&N; has already sent out an update, which is a good improvement over the old interface. While the touch interface can be a bit buggy (Sometimes you have to flick your finger more than once or use the arrow keys to turn the page.), I can turn pages in one second compared to the 2-3 seconds it would take with the original software. That wasn't a big deal until I received the upgrade.I also like what they've done with the bookmarks feature. Before, they had a strange numerical format for bookmarks. With this upgrade, it lists the page that you bookmarked, which is much nicer.I love how I can download samples of ebooks directly from my nook without having to rely on the B&N; site to do everything. Once you finish the sample, you have the option to buy. If you decide to buy the book, you will be taken to the last page you read so that you can continue from there. You can also archive the books that you've read directly from your nook with the press of a button, which helps manage your list.Sideloading my pdf ebooks onto my nook was an easy experience. However, you can't categorize your documents; you can only sort them by title or author.Another great aspect of owning a nook is that you can check out ebooks from your local libraries (see [...] for a list of libraries near you), sideload books that you have bought from Fictionwise and other ebook stores, and download free ebooks from either the B&N; site or Google Books. That's what ultimately sold me on the nook, the versatility and freedom to choose where I want to buy or download free ebooks. The nook is not proprietary, unlike the Kindle and the soon-to-be-released iPad.The interface is very easy to use. It comes with a manual that you can read on the device, or on the B&N; website. If you're still stuck on an issue, I found this great forum ([...]) with friendly people who can help you.I've yet to check out the Lend feature because my family and friends have yet to embrace this technology.Other than my issue with organization, I am really enjoying my nook. I'm looking forward to reading many books in the future, thanks to this wonderful device. Highly recommended.Side note: I agree with S. Dayton about the iPad. After reading a few ebooks on my iTouch and my Mac, I have to agree with him about the eyestrain. For casual surfing and watching video, LCD works fine. But for longterm reading, eInk is the way to go.", "overall": 4.0, "summary": "Very Good, Despite Its Quirks", "unixReviewTime": 1265587200, "reviewTime": "02 8, 2010"}