{"reviewerID": "A2C4O93BXM5ROE", "asin": "1400599997", "reviewerName": "dexlin", "helpful": [6, 6], "reviewtext": "After MONTHS of research for my first ereader I finally decided on the Nook. With all the buzz, I, of course, ran out to BN to see the Nook when it first came out and was incredibly disappointed at that time as it was painfully sluggish and I had almost crossed it off my list for purchase. However, I went back and saw it again at the store after about 6 weeks from my first viewing and what a difference! Barnes and Noble has made great strides. A friend showed me her Kindle and I got to play with it and I looked in stores and saw the Sony reader as well. Did MUCH research online as well on some of the others such as Jetbook Lite.As much as I LOVE Amazon and shop here more often than I probably should LOL. I decided on the Nook seeing the improvements that were already made in that short amount of time. What sealed the deal for me was the SD card option to expand memory AND you can change the battery yourself as opposed to having to send your device back over a simple battery change.I am not regretting my decision to go with the Nook at all. I have to admit that it did freeze up on me twice, BUT it only did that when I interrupted the charging process. So, I don't know exactly what caused that. No problems at all while reading. As far as reading on the Nook, its a great device. Downloading books is fast and simple to do. Page turning is fast now. Its a dream come true for an avid reader like me.The only con that I've noticed so far is battery life. I think its a huge stretch to say the battery lasts 10 days. However, the wi-fi turns itself off after being idle for a minute or so, so you don't have to manually turn it off. When you activate the menu, it will reconnect to the network. So, BN is making an effort to increase battery life without much manual interaction.I highly recommend the Nook. With BN updates coming as quick as they are, I think this device is proving to be THE superior ereader.", "overall": 5.0, "summary": "Giving other readers a run for their money", "unixReviewTime": 1265673600, "reviewTime": "02 9, 2010"}