{"reviewerID": "A44UKZE6XEV9", "asin": "1400599997", "reviewerName": "Eddie E. Hicks", "helpful": [46, 49], "reviewtext": "I purchased a Kindle for my wife last Christmas. She loves it and uses it more than any other gift I ever purchased her. She was having so much fun with it I decided to get an ereader for myself but I was drawn more toward the Nook. I read so many bad reviews about the Nook I wasn't sure if I should get it or a Kindle or maybe something different with a touch screen and wireless connection. I thought about it for a few weeks and noticed that the reviews started getting better. I decided to go for it. I ordered it last Wednesday from B&N; and received it 2 days later. I am so happy I did. I didn't experience any of the the negatives I read about with exception that battery could stay charged longer. Talking about the battery, it's nice to know that you can change it yourself and at a much lessor expense than with a Kindle. I'll probably never need it but it's also nice to be able to add a memory card to hold more content. And the Nook just looks nicer in my opinion.The new update was released the same day I received my Nook and I updated the firmware the second day I had it and it runs even more smoother. I have been a gadget man all my life but this is my first touch screen device. I had no problems what-so-ever navigating the menus and the menus changed fast enough for me.My wife still loves her Kindle but I think she is a little jealous. She asked me why I didn't get her a Nook for Christmas.I was completely in the dark about ereaders until just 2 months ago. I know during my research I found people that were experiencing  problems and were unhappy with every reader I checked into. If you were putting off getting a Nook because of bad reviews, I would give them another look. There has been 2 firmware updates already that probably addressed many of the earlier concerns. That's not bad for a device that was only released a short while ago. I'm sure there will be further updates as time goes on and it will get only better.~eddie", "overall": 5.0, "summary": "Glad I gave it a chance", "unixReviewTime": 1265760000, "reviewTime": "02 10, 2010"}