{"reviewerID": "A2ICKE6A3MJMM5", "asin": "1400599997", "reviewerName": "E. L. Green", "helpful": [2, 5], "reviewtext": "I am still waiting for the perfect ebook reader. I bought the Nook for these reasons: 1) It reads industry-standard ePub-format ebooks, 2) it's tightly integrated with the B&N; ebook store, 3) the ebooks are encrypted in a well-documented easily-understood format that is portable across multiple devices so they can be decrypted and read in, say, your iPad's Nook reader software, or even in a Sony Reader (with the very latest firmware), without having to be re-purchased because of DRM nonsense.The problem is that the Nook simply doesn't live up to its promise. The \"paper-white\" display is more an off-beige, and reflects light in a way that makes it hard to read with a reading light (necessary because it has no backlight, as is true for all ePaper devices). It's heavy and the buttons to change pages are hard to push, especially with gloved hands as you might have while reading outdoors on a cool day. The \"5 day battery life\" in reality for me has been a 1-day battery life, read a book, and it needs to be recharged, and be darn sure to turn it off. The thing freezes up and crashes all the time even with the very latest software, and is excruciatingly slow even with the very latest software. The latest software added classifications for the ebooks so you could sort them into pseudo-folders, which is necessary given how excruciatingly slow the Nook is to scroll through its book list (get about 50 books on the list and you're in for major pain), but the clunky way they implemented this makes those of us who've gotten used to modern user interfaces frown and shake our heads.Sad to say, I really can't recommend any current eBook reader. Either they're too clumsy to use (Nook), have no books available for them (Sony), or have a proprietary eBook format that locks you into a single vendor (Kindle). I'm seriously considering buying an iPad, yes, it will only work for 9 hours or so on a battery charge, but that's true of the Nook too in real actual use and the iPad is usable for a lot of other things too. It's just disappointing that I can't get an ePaper-based reader that meets my criteria (non-proprietary ebook format, long battery life, compact, decent user interface), and instead have things either crippled by bad design decisions or crippled by having a proprietary ebook format that locks you into a single vendor. Well, I don't like crippled, so I'll look elsewhere, thank you very much...", "overall": 2.0, "summary": "Disappointing", "unixReviewTime": 1290988800, "reviewTime": "11 29, 2010"}