{"reviewerID": "A105AZN9C8UAOJ", "asin": "1400599997", "reviewerName": "J. Malmquist \"cparkhorn\"", "helpful": [1, 2], "reviewtext": "I have been super happy with this reader.  In the bright sun sitting outside, no problem.  On the many flights I take, no problem.  B&N; site and downloading books is a breeze.  I've got a Droid X phone, and the accounts sync, so I can quickly pull up the same book on my phone with the Nook App, very cool.I can lend, and have others lend me, some of the books purchased.Our local library in Central Texas, outside Austin, is connected to Overdrive.com.  With my library card I can download epub books and check them out, anywhere I've got internet.  I don't have to check them back in, they just go away after the check out period.  Same with Audiobooks.  Nook handles this format, other eReaders do not, so you might want to look into this option and what formats the readers have before making a decision.I like the onscreen keyboard/touch screen, personally.  It is bright and easy in areas where dimly lit and the light in your reader case is directed at the reading screen.  Seems like no big deal, but after 28 hours on a plane you get tired and this makes a difference.Not a bunch of keys to hit/press with the keyboard exposed.  This is a personal opinion, and I can absolutely understand why others may want the keyboard.  I put in pagemarks etc on books, but don't type a lot of notes into the ebooks when reading.  If you do a lot of this, you may want to test run the onscreen keyboard and see if you like it.  I don't, the amount of typing is very limited, so onscreen is perfect and I'm used to it with my phones.Using this over wifi to surf the internet is something you can do, but it isn't the best.  You can in a pinch, but it's easier for me to pull out my smartphone and crank into a website.The number of places to get books, especially free ones, is awesome with the Nook handling so many formats.  B&N; just search 0.00 and titles and you'll get thousands of classics come up that copyright is over and they are free.  gutenberg.org is puts free classics by the tens of thousands out that you can download onto your Nook for free, google books does this and a few other sites.  Tons and Tons of books for free, I haven't read Tom Sawyer in 20+ years and am now, for free.  Just an addition to note.Lots of periodicals, newspapers etc, that you can get daily.I take my kids into B&N; and they love to look through the kids books.  While there, I can read any book over their Wifi for free for up to an hour.  I don't use this a lot, but once a month or so when I take the kids, it's pretty cool.Overall, I'm really pysched, this Nook has been awesome.", "overall": 5.0, "summary": "Awesome Reader", "unixReviewTime": 1297728000, "reviewTime": "02 15, 2011"}