{"reviewerID": "A3OKH5G69MS8D9", "asin": "1400599997", "reviewerName": "JRH \"j5094\"", "helpful": [8, 13], "reviewtext": "Most of the other reviews have the details about what is good and bad in their opinion, and most of it is accurate. The battery life is misrepresented by B&N.; The only way you could possibly get 10 days out of the battery is if it is off. However, 2 to 4 days is a real possibility, So, bring your charger or USB to computer cable. Just like Apple IPOD, the B&N; folks decided to use a non-standard USB cable that appears to match the Apple ones. This is a minor problem, but do not expect to borrow a USB cable from someone while on travel. The included small charger worked very well.The key thing is how does the NOOK function as a book reader. In my opinion, it is adequate, and no more. I downloaded a number of free books without any problem. I also downloaded some paid books form B&N.; Once again, no problem. Finally, I downloaded some books from my public library onto my computer (not the NOOK)using the free Adobe software. Using the USB cable to my NOOK, I simply dragged the books to the NOOK, and voila, two seocnds later they were available for 14 days. So far so good. One could now rant about the interface (so-so), or the fact that you should reduce the color-screen brightness to about 10% to save the battery as well as turn off the WI-FI when not in use, and so forth, but how does it work when reading a book.If you are like me, and read fairly fast, most books will be a real page turners, since there is not much on a page compared to a real print on paper book. The print is clear. It is faily black on a slightly grey background (some might say off-white), which under a bright reading light is quite comfortable. For the eyesight challenged, there are bigger fonts accompanied with still more page turning. The same is true of the KINDLE. Page turning is easy and intuitive, so not a problem. Use the buttons on the side, not the color interface.A big feature of the NOOK is the ability to add a memory card. Well it is true you can do this, but it is not for the faint of heart or fingernail impaired. The first time you try to open the NOOK using the nearly invisible tab, you will wonder if you are going to break the cover. Just be careful, follow the instructions, and all will be well. Now, why would you want to add memory. As it arrives, the NOOK holds a huge number of books. You might want to add some of your work in PDF documents - this chews up space fast - and the pdf reading capability is primitive at best. Get a small netbook for this purpose and leave the NOOK for books. Changing the battery-RIGHT! Perhaps at the end of life, 2 to 3 years, to save a service trip. By then the technology will be antique, and you will replace the whole NOOK, not just the battery.A disappointment is the lack of even a primitive browser so that you could check email without lugging along another computer. The KINDLE has this feature. The NOOK can be \"upgraded\" to also have a browser, but then it is non-standard, and you might have trouble as B&N; upgrades the official firmware. Perhaps B&N; will relent and give us email capability similar to the APPLE I-Touch. I can understand not wanting to overload AT&T; with too much traffic, but simple text emails should not have been a problem.Finally, why would you want a NOOK in the first place. Remember, real books use no power, are truly random access, can be lent to anyone for as long as you like, and will function far into the future regardless of technology changes. The only purpose I can see for having a NOOK is for travel and for electronically borrowing books from a library without getting into your car or walking overmuch. Well, scratch the last, since you can borrow and read books on your computer. The airplane travel or train commute is a biggie. Books are heavy and bulky. Carrying 6 books onto an airplane is a pain. Plus, hauling out your NOOK to read makes you look technically COOL, and for the short term, is sure to start a conversation with a nearby stranger. The conversation might be interesting and better than the NOOK-book you were going to read.Well, I've written enough and am going to read a book that I just downloaded from the local library. I'll try not spill my soup on the NOOK while reading and eating -or it would become a SOUPER-NOOK.", "overall": 3.0, "summary": "A HALF COOKED NOOK", "unixReviewTime": 1263686400, "reviewTime": "01 17, 2010"}