{"reviewerID": "A2XXO4NDGULP0M", "asin": "B00002EQCW", "reviewerName": "Frannie", "helpful": [4, 4], "reviewtext": "Bought my first FS105 on 5/28/2012 from Amazon.  It died several days later.  That time, Amazon replaced it including return postage on 6/7/2012.  OK, I expect a dud once in awhile.  However, this morning, 9/23/2012, less than 4 months later, the replacement died.  Completely.  Disappointed in the NETGEAR brand.  Please be aware that in keeping with the instructions, it is not in direct sunlight, not near a heater or heat source, and is in an open area where it gets plenty of ventilation and is climate controlled.  It sits flat on a table, nothing on top or under it to heat up.  So I can't think of anything that I have done to cause the problem.  It was good while it lasted.  I didn't overwork it; I simply wanted to connect my laptop and my desktop to my DSL Ethernet connection.  The laptop is always connected; the desktop only occasionally.  Last night it was working fine, this morning, nada.  Amazon's solution is for me to pay return postage, and they will issue a \"partial\" refund in an unnamed amount.  I suspect that the partial refund won't even cover the cost of return postage.  Guess some days it just doesn't pay to get out of bed!  I sent email \"feedback\" to NETGEAR, since they don't provide any other options on their website.  Their web forms would not accept a phone call or support, don't know why.  I don't have high hopes for any assistance from them.  Just wanted to let potential buyers aware of my bad experience.  Lots of folks seem happy with this product, but I wonder how many of them will feel the same after 6 months or a year.  Good luck everyone!Update:  9/28/2012  I emailed NETGEAR about a week ago and explained what happened with their product, asking what recourse I had.  I got 7(SEVEN!) emails back, stating that they had received my email and/or it was \"referred\" to such and such a department for handling.  Then I got one expressing sorrow that my claim had been handled badly (Gee, I didn't see that they had handled it at all!) and would I fill out a survey so they could improve for their customers!  What about helping this one!?  The seventh email was a REMINDER to fill out the survey.  Give me a break!  Guess I just have to laugh.  Draw your own conclusions.", "overall": 1.0, "summary": "TWO of these died on me!", "unixReviewTime": 1348358400, "reviewTime": "09 23, 2012"}