{"reviewerID": "A2IAD8XA81CQWQ", "asin": "1400599997", "reviewerName": "kare777", "helpful": [3, 3], "reviewtext": "I bought a Nook today. The one and only reason I chose Nook (instead of just sticking with and upgrading my beloved old Kindle 1) is its ability to download books from the public library. Tomorrow I am taking the Nook back to Best Buy for a refund, not an exchange. The Nook is attractive and nicely packaged. I completely expected it to just work, like my Kindle did (and still does) and all of my Apple products do. But, like so many other reviewers here, my Nook never even got up and running before it croaked. First, it would not complete the registration process. I have an active account on B&N; and strong WiFi in my home, plus this Nook also has 3G so there were not any connection problems. Then, when I decided to just register later and moved on to explore how the Nook worked, it froze. Could not reboot or turn it off by holding down power key as suggested in the troubleshooting help/support on the B&N; website. It did not work. I do not want to mess with taking the back off, using little screwdrivers or whatever to take out (the fully charged) battery, etc. We should not have to do that on a brand new 200.00 product! So, am taking it back and won't buy another until they improve the quality of the thing. I never had one bit of trouble with my trusty Kindle, and would not even be looking at another brand of reader except for Kindle's inability to download library books.  I'm giving the Nook two stars instead of one because, if it actually worked, it looks like it would be a nice ereader and it has a more open format than Kindle does.Update: 1/28/11Went to return the Nook for a refund today and at the last minute decided to give it another go, so did exchange instead. Tonight charged and powered up the replacement Nook, so far so good. It works perfectly. Registration was smooth and fast, wifi connected easily with my signal, downloaded a book quickly, and navigation is a breeze.  No problems encountered yet except that it is not downloading an available firmware update, and there's probably some explanation for that so not a big deal.  So, I might just end up keeping this baby as a companion to my Kindle. Love having the Nook with its open format for library and other downloads. Will see how it holds up over the next several weeks and then update my rating accordingly.Update: 2/3/11Returned the Nook to Best Buy today and bought a Kindle 3 through Amazon. After exchanging the first defective Nook then using its replacement for several days I found that the device worked pretty much as it was supposed to. There are a couple of minor things about it that I was not crazy about and probably would have gotten used to, but there is one problem (design flaw?) that for me is definitely a deal killer. One of the minor annoyances is that there is a lot of screen flash during any menu change. Another is that the color, lighted touch screen control at the bottom of the device is distracting when it lights up at any touch during reading. And after a while I was not that crazy about the menu navigation either, seemed like too many steps and screen flashes, but probably could have gotten used to that too. I would not have rejected the Nook just over those little quirks. The big reason that the Nook was no way going to work out for me is, again, that touch screen display at the bottom of the device. It is, like an iPad, highly reflective. So what that means is that when the screen is off, which it is most all of the time during reading, you can watch yourself read! The black screen reflects anything in front of it, almost like a dark mirror. That was a no go for me, no I did not like it at all. Aside from these annoyances, the Nook did well at everything it was designed to do. So will upgrade the rating to reflect (haha) that. I have to say that I am much happier with the Kindle, but Amazon really needs to get with the program and let Kindle use the epub format. They will eventually lose me and a lot of other prospective customers over the epub problem, it is that big of a deal.Yet another update! 5/31/11Caved in and purchased another Nook last week. I still love my Kindle and prefer it over Nook, but just could not wait another minute for Amazon to open Kindle to ePub for downloading public library books. So, last week when B&N; had Nooks for sale cheap on their eBay website (99.00, free ship, 3g/wifi, non-color, refurb w/ full warranty) I jumped on it. This refurb Nook worked much better out of the box than my initial brand new device purchased then returned back in Jan/Feb. I am using the Nook just for library books, and it does what it's supposed to do. Navigation works well, but seems like it requires more step than Kindle. Still do not like the reflective color screen below the reading area. There is one thing that I do like better on Nook, the screen background is a paler gray than Kindle making for easier reading in low light. I will keep this Nook until Amazon does ePub, then stick with Kindle.", "overall": 3.0, "summary": "Kindle lover jumps ship for a few hours", "unixReviewTime": 1296086400, "reviewTime": "01 27, 2011"}