{"reviewerID": "A2YCEKVUN1W5F1", "asin": "1400599997", "reviewerName": "K. Salinger, MSN, FNP, RN AHN-BC", "helpful": [16, 17], "reviewtext": "There are a multitude of reviews that compare and contrast the Nook and Kindle, so I'm not going to go into a full-blown comparison and review. I'm going to focus on my experience owning both, most specifically battery life and availability of books.My husband uses the kindle and I use the Nook. The reason I went with the Nook is because initially I was very \"anti\" non-paper book. He wanted a kindle and I sneered at the idea. I was being a book snob and didn't like the idea of books in electronic format, so I snubbed my nose at it.However, after we took a vacation and he had his kindle loaded with books, and I had 8-10 big paper books, I began to reconsider my position.  Upon return from our vacation I elected to get a Nook. I did so because I liked the idea of the touch screen at the bottom rather than the keyboard, which I thought made the kindle look klunky. I thought overall that the Nook was more aesthetically pleasing. So - I ordered the nook.There are two major things that the kindle has on the Nook, and that is far superior battery life, and significantly more books available for download - especially so if you read non-fiction.The battery life on my Nook is awful. So much so that I ordered a new battery thinking perhaps I had a dud. Nope - it's performance is just the same. If I am actively reading a book I have to recharge  every 3 days. If I don't read it for 10-14 days it will drain on it's own. Comparing this to my husband's kindle, he can go an entire 2 week trip reading books daily without having to recharge his kindle! It takes a couple months to drain with no usage. The kindle's battery life is mega-much more than my Nook. I have serious battery life envy. For that alone I've begun to covet his kindle.The second bummer is that most of the available books for Nook are fiction. There are some of the more popular non-fiction type books available. Usually whatever is most trendy at the time, but for the most part any professional type texts, or anything not on a best seller list that is non-fiction can't be found for the Nook platform. However, when I go to Amazon, 8 of 10 times, I'll find it available for download on the kindle.BUT! One thing about this is that for me, I tend to mark up and highlight my non-fiction books a lot because I'm using them for reference sources. It is very difficult to quickly retrieve highlighted text from the electronic source compared to my real, paper books. So I've actually come to realize that I'd likely be purchasing my non-fiction as real paper books anyways, so that I can have them for ready reference and mark them up with my highlights and little flags (yes - I'm a geek who uses the little flag tabs to mark pages in my books!) So, I'm now fine with the fact that I can't readily download non-fiction to my Nook and instead I continue to buy them as regular, paper books. As I said above, I'd likely buy my non-fiction as real books anyways since I use them as references.I now download all my fiction books to the Nook. So it's become my source for pleasure reading, which is great, since that is the kind of stuff I take with me when I travel or about town anyways, and can just stuff the Nook in my purse.However, I VERY MUCH ENVY THE BATTERY LIFE OF THE KINDLE! If I could stuff a kindle battery into my Nook I'd be a super happy girl.If I had it to do over I'd likely buy a kindle for myself despite it's less aesthetically pleasing appearance. The battery life and availability of books is far superior to the Nook.", "overall": 4.0, "summary": "Extra info to consider between Nook & Kindle (I own both)", "unixReviewTime": 1285459200, "reviewTime": "09 26, 2010"}