{"reviewerID": "A13HUHXEQPX3YI", "asin": "1400599997", "reviewerName": "Lightning TigerFists", "helpful": [16, 17], "reviewtext": "Pros: eInk display preserves traditional reading experience and has great clarity and contrast. Reads PDF (both scanned and standard text) and EPUB book formats with no hassles or conversion required. In-store help and extra features from B&N.; Page turning speed is much improved with most recent update. Android OS allows for almost unlimited software improvements and added features. Replacement batteries can be bought and installed easily. Accepts SD cards for increased storage capacity (this really comes in handy if you want to use the device as an mp3 player or for audiobooks).Cons: eInk display requires you to operate at a bit slower pace than the touchscreen alone would allow. (Also: Not sure why the price from this supplier is abnormally high?)I've played with an iPad and it's a very fun device. But what I don't like is a glowing backlit screen, as I look at a monitor all day. When I read, I want to relax and give my eyes a break, and that's why I prefer eInk displays.The Nook's primary advantage over the Kindle is that it allows you to read EPUB and PDF books (scanned or text; either works) and buy books from various online ebook stores, including the Sony Reader store. This has already allowed me to read two titles that I wouldn't have been able to get for the Kindle. It also works very easily with Adobe Digital Editions software, a huge plus. Currently Amazon offers some titles that B&N; does not (a very temporary state of affairs, I suspect), but those are usually available from Sony.Add the book loan feature, free library books, and the ability to take it to a B&N; store for bonus features, and this unit pretty much stomps the Kindle and Sony readers.The Nook is a little slower than a phone or your other electronic devices due to the e-Ink screen, but once you get used to it, the device seems very smooth. In fact, I find that having to slow down a little actually helps me relax, and once you master turning pages with a quick brush of the thumb across the touchscreen, reading with the Nook is a very pleasant experience. I now prefer it to reading books in print, to be perfectly honest.", "overall": 5.0, "summary": "Easy on the Eyes", "unixReviewTime": 1272585600, "reviewTime": "04 30, 2010"}