{"reviewerID": "A19N3S7CBSU6O7", "asin": "1400599997", "reviewerName": "OregonBay \" OregonBay - 1999 to 2014\"", "helpful": [9, 12], "reviewtext": "I will continue to update this review as I discover new features of the Nook, so stay tuned folks!*****************************************************************************Updated 02/08/2010*****************************************************************************I've been using my Nook with the newest update (v 1.2) for a few days now.  This is the second update to the Nook since launch.  All I can say is THANK YOU Barnes & Noble!The LCD screen improvements alone are GREAT!  With better looking icons, more responsiveness, and a sleeker appearance -- it makes me think of that McDonald's commercial: I'm lovin' it!Several of the well documented issues have been fixed, such as losing bookmarks due to powering off the unit -- which as it turns out was the most cited problem for Nook bashers and haters alike.  Nook haters will also be disappointed that the battery life has been optimized too.All-in-all if you've been waiting for the minor 1.0 issues to be fixed prior to purchasing the Nook you will not be disappointed in this newest version.  And if you have been considering switching from the Kindle you would be well advised to do so at this point.*****************************************************************************Updated 01/31/2010*****************************************************************************This device is clearly the best option on the market today, with it's LCD touchscreen, Wi-fi, memory expansion capabilities, and so, so much more. Let's \"wade in the weeds\" and look at some of the features in detail:LCD TouchscreenSo far this is the only mainstream reader to offer a LCD screen of any kind. The Coverflow-like book cover listing is beautiful, elegant, and functional. With the newest update it is uber fast, intuitive, and responsive. Page turns are super easy with the touchscreen, all you have to do is swipe the screen with one finger when it's in standby mode and the page turns.  In addition, it's easier for me to navigate books via the LCD than textually. Seeing the cover is a really nice feature, since books are designed to pique your interest by the cover. It just seems like a good cover sells a book, and seeing that cover in crisp LCD sells me from time to time.The keyboard is nice, any time a text field comes up you will have the keyboard pop up on queue. It's fast, responsive, and best of all doesn't look like a 1970's era fax machine keypad like some of the older readers on the market.Wi-fiThe built in Wi-fi is one of the great features of this device. Modern 3G speeds are pretty fast, but as most of us know that have smartphones, Wi-fi is about 100 times faster, especially when one tries to download large things, or a lot of content. The Wi-fi on this device is no exception... it's fast and super easy to set up. The on screen instructions are sooo clear to follow. I couldn't imagine only having 3G these days, like when you are in an area that doesn't have 3G coverage, you can still use the Nook over Wi-fi.  This is truly one of the killer features of the Nook.  You can go into a B&N; store and Wi-fi to your hearts content, but then come home and do the same.  Hotels offering free Wi-fi are the Nooks biach.Memory ExpansionThe Nook has a Micro-SD card slot which accepts up to 16GB Micro-SD cards, this allows you to upgrade your memory indefinitely. Another advantage would be to organize your books. And books on the card are never going to get lost if your reader dies -- without having to re-download from the cloud.  Plus with the new B&N; desktop reader you can move your books from the Nook to a laptop/netbook on the fly, and what if the worst should happen and your eReader dies?  You still have those books on the card.AppearanceThis is a biggy for me as it is for most people... I don't tend to buy or use things that look ugly. That's why I've got an iPod instead of a Zune, why I've got a LCD TV instead of a CRT, and now why I've got a Nook instead of another reader. The appearance of this device can be described with one word, SEXY. It just looks good. Other readers currently available range from looking \"not too bad\" to looking downright ugly. This reader is the exception to that rule and employs a host of features to boot.Book formats and availabilityThis is probably the biggest of all the features, since we are talking about a book reader, the Nook boasts a whopping 1,000,000 books available for it, in readily readable format, from just two sources (B&N; and Google). The nearest competitor only offers 500,000 books in it's native format (Kindle). You can convert many books to a Kindle readable format, but it's a hassle and you have to use your computer to do that. Sort of defeats the purpose of the wireless if you have to constantly connect to the PC. And there are third party sources for books in Kindle format, probably websites you've never heard of, new sites pop up all the time since Kindle has a big install base, but the quality of books on those sites is in question compared to a reputable company like Google.eInk displayIt seems to be crisper than much of the competition out there. The ability to change the typeface and size of the fonts is wonderful. The nearest competitors screen almost seems fuzzy in comparison, which for me makes it harder to read. Page changes are fast on the Nook, while nothing can compare with the speed of changing a real books' page, it's fast enough for the average person. Speed readers may find themselves waiting for a few milliseconds though. The controls on the Nook are straightforward and intuitive.Replacable batteryThis is another biggy for most ebook people, with the Nook you can change the battery out should you A) want extended reading times without charge, or B) if the original battery dies for some reason.  Many of the other readers on the market do not allow this, which means they are bricked if the battery dies and will either have to be repaired or replaced.Battery lifeA lot has been said about the battery life of the Nook, and other eReaders.  All of the manufacturers of these devices overstate the real world battery life in real world useage situations.  I have a co-worker with one of the Amazon (Kindle Brand) eReaders and he has to charge every 3 - 4 days.  Nook lasts for me about 5 - 7 days, but it all depends on what features you use on either or any of the devices and how much you use them to determine actual, real world battery usage. Either way, all of these devices are easy to charge.  Just plug into a standard 110 - 120 outlet and PRESTO!  Or in the case of the Nook, you can also plug into your computer/laptop/netbook and VOILA!  You will be on go in no time flat.Ease of useThe Nook is easy to set up and use, The onscreen keyboard is more familiar and similar to modern devices than many of the competitors setups.SummaryThere are so many features of this device it's hard to capture them all in one review. All in all this is one great device, with it's iPod like look and feel, large number of built in features, and industry standard operating system, it's clearly the choice of discerning electronics customers.*******************************Update*******************************So, I had been told on these comments that the B&N; in store functionality was not ready to be used yet -- another lie dispelled today.  I stopped in at the B&N; in Hillsboro and it is in fact fully functional.  My Nook immediately recognized the B&N; network and connected without me even having to tell it to!  As it turns out there is exclusive content at each B&N; store, at this particular one there were multiple books that could be downloaded for FREE!!!  So, seeing one that piqued my interest I naturally downloaded it.  Wow, super fast and convenient, and FREE!", "overall": 5.0, "summary": "Nook eReader", "unixReviewTime": 1262044800, "reviewTime": "12 29, 2009"}