{"reviewerID": "AOKC4MRKH1UON", "asin": "1400599997", "reviewerName": "Phil28 \"Gadget Guy\"", "helpful": [26, 42], "reviewtext": "The Nook is the best e-reader yet. It replaces the keyboard on the Kindle with a color touch screen about the size of the iPhone display. This makes it easy to maneuver between  the store, your library, your current book, the daily (with messages, newsletters, and other free content), and settings. The LCD display changes from menu items to images of book covers to a keyboard as needed, and then turns off when reading.You can connect by both WiFI and free 3G to download a purchase in seconds, and connect with WiFi to get content and other offers when you walk into a B&N; store. I'm using the latest 1.1.1 SW release that fixes most of the issues noted in early reviews. Updates are done automatically over the air.The nook feels great in the hand with a slightly contoured back that adds a little thickness for the hand to grip. Controls are provided for equal usability by a left or right-hander person. The back is removable and replaceable with different colors. They are all rubber coated to make it less likely to drop. Unlike the Kindle the battery is replaceable and the memory is expandable. The e-ink display is the same type, but appears to be slightly crisper than the Kindle 2. The nook supports  EPUB (Non or Adobe DRM), PDB (Non DRM), PDF, Graphics: JPG, GIF, PNG, BMP, Audio: MP3, PDB. The online B&N; bookstore has about a million books compared to the Kindle store with half that, the major difference being the free public domain books provided by Google.Summary:While it costs the same as the Kindle, the nook is loaded with extra features: WiFi, color LCD, removable battery, expandable memory, more open book formats.  You can customize your nook with your own photos to create personal screen savers and lend between nook, iPhone, a PC and a Mac.", "overall": 5.0, "summary": "Nook is the best e-reader yet", "unixReviewTime": 1261526400, "reviewTime": "12 23, 2009"}