{"reviewerID": "A3I1GZ3Z7AXSNZ", "asin": "B00002EQCW", "reviewerName": "M. Kalagias", "helpful": [0, 0], "reviewtext": "Dead just under 2 years after placed in service (actual usage time about 20 months). Powers on now and even provides some limited intermittent function between two computers connected to it but wont talk to the route and will not connect to the net which tells me the up-link port is completely shot and the other ports are about done for. Warranty is for all practical intents and purposes pointless as the customer is expected to pay for shipping both ways and in the end you have a refurbished unit that only carries the original purchase date warranty (i.e. in my case warranty would end on 7/7/2015 with the 5 year warranty this model has) but shipping cost more than buying a new product. I am dropping my review to 2 stars since it did when all is said and done last 20 months which comes out to $1.20 a month at the price I paid and $1 a month at the current price. Final verdict, I will consider getting another one to replace this but only if I can't find one with a better warranty plan for about the same price.See original review below...There isn't really much to say about a switch, it has one simple job and as long as it does it that's what counts (A switch for those who are not certain is easiest to explain by saying it is akin to a power strip, you can plug all the machines you want into to it, but if you don't plug it into a managed source of signal such as a router or server it is like expecting a surge strip to provide power and work when it is not plugged into an AC outlet). If you want to split one LAN Drop (Network plug in) at for example at your entertainment center and hook up your PS3, Cable/Satellite box, Internet ready TV, A/V receiver with internet radio, etc. This is for you because all a switch does is take the one IP address assigned to it by the host system and share it out over all devices connected to it (while they are turned on and seeking connection of course, it doesn't allot bandwidth to devices that are not currently asking for any).Bottom line is this does the job so far and is well constructed, at this very moment unit has been plugged in for almost two weeks and is cool to the touch (I have it wall mounted behind my TV were it gets plenty of airflow) so time will tell but I have seen units like this in multiple brands at customer sites (I'm a network tech) work for years, if this one fails in an abnormally short time I will revise my review to reflect the time and details/circumstances of the failure.", "overall": 2.0, "summary": "*Updated* So far so good... not anymore", "unixReviewTime": 1279670400, "reviewTime": "07 21, 2010"}