{"reviewerID": "A3IIYC4PF1DTG9", "asin": "B00002JXFH", "reviewerName": "Ariel Meadow Stallings \"Author, Offbeat Bride\"", "helpful": [0, 0], "reviewtext": "I've used an ergo keyboard for a couple years, and have no idea how I ever survived with out one. It goes without saying that ergos are much better than flat keyboards. Your shoulders feel so much better.But when my Natural Elite finally died (piece of crap that it was, I'd grown attached), I was excited to try the Pro.Let me tell you, after only one day of use, I'm already wondering how I ever worked without these hotkeys! The Media keys are especially great--I had grown so sick of having to hunt around with my mouse to mute my music when the phone rang, and this keyboard's &quot;mute&quot; button has proved to be my new best friend. Several of the buttons are customizable, so I was able to remove several frequently used shortcuts on my desktop, now able to access my calculator and My Documents from my keyboard.I'm having a little trouble adapting to the placement of the &quot;INSERT&quot; key--it's where &quot;HOME&quot; was on my Elite, and you'd think Microsoft would have a little consistency with those function keys.A perk for less advanced users, frequently used control shortcuts (like CTRL-C, CTRL-V, CTRL-Z, etc) are actually marked on the fonts of the letter keys. I've been amazed by how many people still mess with their mouse to do a cut-n-paste, so hopefully this will introduce more users to the CTRL-A, CTRL-X, CTRL-V quick keyboard method of cutting n pasting.I agree with other reviewers that the USB ports are not really all that exciting, but I do have both my mouse and digital camera plugged into the ports. Works great.This keyboard definitely doesn't give you that :click: that many of us are used to. But I'm actually enjoying the muted :clack: instead.SO, watch out for those hotkeys--You'll get hooked too!", "overall": 4.0, "summary": "Hotkeys are addictive", "unixReviewTime": 984873600, "reviewTime": "03 18, 2001"}