{"reviewerID": "A3S87ZOPB3UM9N", "asin": "B00002JXFH", "reviewerName": "atmj", "helpful": [7, 8], "reviewtext": "I've had this keyboard for about 1 year now (I think).  It's only negative is how it works with existing computer furniture that I have.With the curved edge and higher profile (2 inches high)  this keyboard may be a bit big for some computer desks.  It effectively takes up about 10 inches in depth and 19-1/2 inches in width.  My desk has the keyboard \"drawer\" that pulls out and only has 3 inches between the drawer top and the desk bottom.  It had a strip of wood on the front face as a hand rest, that I had to remove in order to use this keyboard.  This keyboard has a hand rest of its own.  I'm only mentioning this because it is a common design on some computer desks and may not be as easily removable as mine was.  It needed to be removed because it set the keyboard too far back and the drawer was not opening far enough for the top keys to be accessed.  Also, since my keyboard drawer is only 29 inches wide, I only had 10 inches left for my mouse pad.  What I find is that the keyboard occassionally jostles my 8-3/4 inch wide mousepad and it jams against the side of the drawer making it hard to move.My set up works okay for me, however, if your keyboard drawer is any smaller and you need a larger area for a mouse, you might have a problem with this keyboard.The main advantages of this keyboard in my opinion is the sloped design that ergonomically suits the hands better and the USB ports.  As a person that has a digital camera, I find these USB ports very handy.  Who wants to fish behind your CPU every time, you want to download pictures.This keyboard also has keys at the top of it, that do some functions automatically, such as Mail, Calculator and My computer which are far to the right over the number keys.  Additionally, you can do all internet functions from Back,  to Home via keys on this keyboard (top left over keyboard).  I don't find the internet keys so handy as I tend to use the mouse for this.  (Habit from my work keyboard).  You also can bring up and control your media player via keys too (top right over keyboard).  This is handy.  You can adjust volume, play, stop or change to previous and next track.  This is neat, as you don't have to hunt around for this, while in the middle of something else.Also, handy are the indicator lights that show that the num lock, caps lock and scroll lock is on.  They are right in the middle of the keyboard where you can't miss them.  For someone that goofs with caps lock on passwords, this helps somewhat.  Ironically, due to my work keyboard though I find myself always looking in the wrong spot.As for installing this keyboard it was simple.  One thing I did find was that on my older 300 Dell machine, with Windows 98, I could not get the USB ports to work. I have no idea whether this was a factor of the computer or the keyboard.  However, now I have a 733 Windows ME and they work fine.  I have no idea why this happened.  I regularly have a USB CD writer attached to one and a digital camera to the other.This is a decent deal too.  I bought this keyboard for almost twice as much and find it an excellent investment.UPDATE: I just realized I did this review 9 years ago almost 10 and I'm typing this update on this very keyboard.  Sounds like it was a good investment after all.", "overall": 5.0, "summary": "Great keyboard, handy USB ports", "unixReviewTime": 975974400, "reviewTime": "12 5, 2000"}