{"reviewerID": "A57Q87B0TC9IJ", "asin": "B00002JXFH", "reviewerName": "Derek G", "helpful": [6, 6], "reviewtext": "... I have to give credit where credit is due and this keyboard is the best of the best in my opinion.Getting used to the split shape of this keyboard and any ergonomic keyboard for that matter takes a little getting used to but it's not difficult and eventually you won't notice the difference.  In fact, I find it easy to go back and forth between my keyboard and standard keyboards elsewhere.Microsoft keyboards also have a nice solid feel with each keypress.  Not soft and spongy and not a hard up/down click either, but a nice touch.  My last Natural (purchased when they first started making them) was very reliable and only died once I spilled a large quantity of soda on it.  I was then presented with the opportunity to test the rumor of being able to clean your keyboard in the dishwasher (it doesn't help.)The buttons on the top are helpful and I didn't find any problems with system crashes.  Most of the buttons are media player related (play/stop, ffwd, prev, next, volume...) and the others are internet related (back, fwd, stop, refresh...)  Personally, the only button I really use is the calculator.Other than reliability and feel, I think the main reason to buy this over cheaper keyboards is for the extra USB ports.  Newer computer manufacturers have wised up to the fact that USB ports might be better placed on the front of the case rather than the back.  If you're not one of these lucky souls with USB ports in the front, or you just need a couple extra USB ports, then this is a good way to get them.Lastly, some other reviewer wrote (repeatedly) about the number 6 being in the wrong place, err.. ok.  I didn't even notice and even if that's true and there's some kind of \"Ergonomic Keyboard Book of Law\", which I doubt, I never had any problem adjusting to it.Hope my review helped!", "overall": 5.0, "summary": "As much as I hate Microsoft's business practices...", "unixReviewTime": 1018656000, "reviewTime": "04 13, 2002"}