{"reviewerID": "A3G7BEJJCPD6DS", "asin": "1400599997", "reviewerName": "VeraP", "helpful": [9, 9], "reviewtext": "I got the Nook the day before Nook Color was announced. I actually waited until the Nook Color was announced before opening the box - I wanted to see what the new gadget had to offer and if it'd be worth trading mine in.There were some rumors that the Nook Color would feature a screen with Mirasol technology, and I was disappointed to learn that it actually had an LCD screen coated with something to reduce glare. I state at an LCD screen all day at work, and don't want to do the same while reading. Plus, I'm not sure how well the LCD screen would fare in the sun and I'm interested to hear feedback from Nook Color owners.I think the color screen matters if you want to read a lot of magazines, or textbooks, or kids' books, none of which I'll be doing. Nook Color also stores more books (6000) and allows the reader to send updates to Facebook and Twitter directly from the eReader. Personally, I didn't find any of these extra features particularly appealing, so I'm happily sticking with the original Nook.My Observations/Pros of the Nook-It's bigger than I expected, in a good way. It's not heavy, but has a nice \"significant\" feel to it.-I think few people realize how clear and book-like the e-Ink screen actually is. I showed the Nook to some friends, and that was the first thing they noticed.-The bottom LCD touch-screen adds a little oomph with the color buttons and book covers.-Getting ePub books from the public library has been surprisingly easy, although you have to connect the Nook to a computer in order to transfer the ePub files.-I've been enjoying the Nook Facebook group where administrators post a free eBook every Friday.-The instructional videos online are very helpful in getting started with the Nook.Cons-BN.com has a Free NookBooks section, but for some reason, not all the free eBooks are listed. I saw some Kindle titles that were available for free, and when I searched on BN.com, turns out they were free there as well.-I didn't care much about the LendMe feature of the Nook, but it was still disappointing to learn that not all purchased eBooks can be lent out. Publishers control which titles can be used for lending, and each book can only be lent out once....ever.-The PDF manual for the Nook is very confusing and can benefit from some serious editing.-There are definitely more Kindle books than NookBooks available, but I hope that will change in the near future.All in all, I am pretty happy with the Nook and I think the fact that it supports a wider range of eBook formats outweighs many of the cons. I like not being tied down to one proprietary format and being able to check out eBooks from the library is priceless to me.", "overall": 4.0, "summary": "The Number of Formats Supported Outweigh the Cons", "unixReviewTime": 1288569600, "reviewTime": "11 1, 2010"}