{"reviewerID": "A1ZG9WMHNMGY62", "asin": "B00002JXFH", "reviewerName": "ffass \"ffass\"", "helpful": [3, 5], "reviewtext": "OK, I admit it - I've only used this keyboard for one day but couldn't wait to write a review. First off, I can rightly claim to be an official Mac enthusiast/fanatic since buying my 1st computer (Blue &amp; white G3, 350Mhz) in 1999 and understand some of the Mac community's loathing of Microsoft. But if a product works this terrifically for the Mac, even if it's a Microsoft product, then we should show our support for the Mac by buying the superior product. When Apple offers an equally fine split-keyboard I'll trade this one in for that, but at this time they don't have one.I have experienced the superior stress-reducing ergonomics of the 'split' keyboard design for a couple of years now with the Adesso TruForm keyboard, which is also a fine keyboard, but this one from Microsoft is a cut above the rest. Note that I have also briefly tried the Datadesk 'SmartBoard' split-keyboard which was also a fine product but the keys on that board made very audible 'clicking' sounds - a real distraction when you're used to 'silent' keys. Fortunately, the Microsoft keyboard keys are very quiet.The keyboard is indeed wide but not as wide as the Adesso Tru-form keyboard. The keys on this Microsoft board are soft to the touch, but with a responsiveness that I find perfect (not 'mushy' like the Apple Pro keyboard). Just plug in the USB cable and you're ready to go, though there is a CD included that contains some very useful software to allow you to reprogram many of the hot keys to your liking and to mirror those keys that are on the Mac keyboard, such as the command and option keys (all reprogramming was super easy and worked flawlessly for me). All the keys worked as advertised: the volume control keys, the internet hot-keys (they work with IE or Netscape), the reprogrammed Apple 'command' keys, and more. The comments about the product's plastics feeling cheap are totally unfounded - this is a solid product with thick plastic moldings throughout. The CD also installs informative HMTL help files on the subject of proper keyboard usage (posture, carpal-tunnel symptoms, etc.); this is really a complete package.If you are someone that is about to embark on the blissful path of the split-keyboard then this is the keyboard to buy - it's the best one one out there for the Mac. You won't turn back.", "overall": 5.0, "summary": "Microsoft Natural Keyboard Pro: a GREAT product for the Mac", "unixReviewTime": 995932800, "reviewTime": "07 24, 2001"}