{"reviewerID": "A1M4NJYP0WNL8Q", "asin": "B00002JXFH", "reviewerName": "Marc Ruby&#8482; \"The Noh Hare&#8482;\"", "helpful": [12, 13], "reviewtext": "I spent a fair amount of dithering before I bought this keyboard.  Not that it's excessively expensive.  Rather, it looked a bit of an ugly duckling up there on the shelf and I wasn't sure if it would be comfortable enough.On my third trip to the shelf, I finally studied it a bit more carefully.  I noticed the little messages on the keys to remind my failing mind of control functions.  I noticed the special function keys that provided web navigation, media control, instant access to My Computer and the calculator, and the sleep key.  I noticed the volume control keys.  I remember that I hadstarted to turn off the sound on my Klisch 4.1's because their volume occasionally gave the cats heart attacks.I figured, &quot;What the heck, I've made dumber mistakes&quot; and brought one home.  I already had an old, grungy Intellipoint keyboard, so intallation took about 30 seconds of hardware time and a minute to install the software.  &quot;So far so good&quot; I say to myself.  One star for installation.Test one: typing.  Ooh the extra large wrist rest that looked so ugly in the store looks pretty good.  And the angle feels a bit better.  The keys have a nice thunk and a springy feel.  One star for feel.Next I try the volume control - Wow! The look of worry vanishes from the cat's faces.  The rest of the media keys work fine and the internet navigators are great.  When I hit the sleep button my machine does exactly that.  One star for cool features.The software is simplicity itself.  Adjustments for speed, language, hotkeys, some special options and a nifty little on screen display for keys like volume.  Everything works just great!  One star for easy of use and clear instructions.The last star is for the two USB ports on the back of the keyboard.  This basically changes one of the USB ports from the back of my machine into two on my desk.  Works great for a mouse and, in my case, a zip drive.I've gotten used to the original funny shaped Intellitype.  This new model seems like the perfect set of improvements in functionality and ergonomics.  Given the amount of time I spend with my fingers on the keyboard it's well worth the money.", "overall": 5.0, "summary": "Significantly Improved...", "unixReviewTime": 985392000, "reviewTime": "03 24, 2001"}