{"reviewerID": "A243HY69GIAHFI", "asin": "B00002JXFH", "reviewerName": "tropic_of_criticism", "helpful": [19, 22], "reviewtext": "I tried very hard to like this keyboard, but I just couldn't.  Though it  has a lot of very cool special function buttons, it fails to do the basic  thing a keyboard should do: be comfortable to type on. And the packaging is  mildly misleading about the nature of the USB ports.I didn't find  anything particularly \"ergonomic\" about the keyboard.  The curve of the  board is just a little too steep for my hands. It's awkward getting to the  extreme upper corners, such as the all-important \"backspace\" key.  I found  the distorted size of the bottom row of keys hard to get used to as well.  And the hand rest can't be detached.  Most disappointingly, the key action  is awkward and loud.  I'm not sure I've ever encountered any keyboard which  felt worse under my fingertips.  Even the non-ergonomic version of this  keyboard has keys that feel better.Likewise, the much-touted USB  ports are a mixed bag.  Though prominent among the advertised features, the  USB ports aren't sufficiently explained on the packaging.  You don't  actually increase the total number of USB ports on your system by two.  You  MUST  plug the keyboard into an existing USB port, so you get a net gain of  only ONE port.  And they're unpowered ports which means you can't plug  bigger USB devices--like hubs, printers, and scanners--into them and expect  great results. This is not a way to add USB functionality to your system;  it only rearranges where the ports are.  This redistribution does have its  utility, however.  Game controllers, microphones, and digital audio player  downloads can be moved forward to the keyboard.  If you find yourself  crawling under your desk all the time to switch out your smaller USB  devices, this keyboard will add some needed convenience to your life.In sum, I strongly advise anyone who's thinking of buying this keyboard  to test it first.  Find a demonstration model in a computer store and try  typing on it.  If you like it, fine: come back here and buy it. As long as  you understand the limitations of the USB ports and can deal with the key  action, the keyboard is actually a good value for money.  But while you're  testing keyboards, make sure you try a whole range of them.  Get one that's  really comfortable for your hands-not just one that seems to be cool.", "overall": 2.0, "summary": "Ergonomy is more than a split keyboard", "unixReviewTime": 966643200, "reviewTime": "08 19, 2000"}