{"reviewerID": "A35SB5XA89HR41", "asin": "1400698987", "reviewerName": "bookloveranne \"booklover6\"", "helpful": [38, 42], "reviewtext": "I had given my kids a Nook Color a couple years ago. Sold it last fall and got 1 girl a Kindle Fire 2nd gen, and the other a Lenovo A2107. The Lenovo was absolutely horrid so I wanted to replace it. This summer, when the Nook HD got Google Play, and the prices fell, I sold the Lenovo and got my daughter the Nook HD 16gb Snow. She absolutely loves it! I liked it so much, I got the Nook HD 8gb for myself. I like it much better than my Kindle Fire HD. The size is smaller, and thinner, and lighter, which are great things. And you can put whatever wallpaper you want on it, unlike the Fire HD.I sold the 2nd gen Kindle Fire and gave the other daughter the Fire HD, but she has since switched to a Nook also (HD+). So now I have the Fire HD and the Nook HD for myself. I like the Nook HD better for the reasons stated above. Size and weight are so much smaller on the Nook HD. The screen resolution is also better. There is nothing I don't like about the Nook HD. I did put a GreatShield Glare Screen protector on the Nooks, to reduce the shiny glare. We use them without cases, just sleeves. They are phenomenal tablets.If you or the person you are buying for loves to play games and will likely download hundreds of them, definitely get the 16gb Nook HD. You will want as much space for apps as you can afford, despite the SD card slot. Games have to be installed to internal memory, for the most part. The SD card slot comes in handy for books, movies, photos and music. I got the 8 gb Nook HD for myself, because I don't play games, the only apps I need are for reading, playing music, news, web, stuff like that. I put my files on the SD card and I am set!I don't plan to buy the new Fires when they come out.  They are far too limited, in my opinion. (So was the Nook, of course, until they added Google Play). I have ADW Launcher on all three of the Nooks, though my daughters tend to prefer the standard Nook launcher. What shows up on that home page can be customized to show only what you want it to show. There is also an \"app drawer\" icon that shows the most recently opened apps for easy launching. It really is a great design, and far superior to the tiresome carousel on the Kindle Fires.", "overall": 5.0, "summary": "We LOVE the NOOK HD!", "unixReviewTime": 1379203200, "reviewTime": "09 15, 2013"}