{"reviewerID": "ADHS2PU94QURO", "asin": "B00002ST80", "reviewerName": "James Hayes \"technocrat\"", "helpful": [131, 134], "reviewtext": "I've been a ReplayTV owner for several months.  That said, I am only somewhat satisfied with the overall quality of the system's software.  I am satisfied with the ReplayTV hardware, with one caveat.  I am not satisfied  with Replay customer support.With each new software release it seems  that the same bugs linger and no new features appear.  Of course it's hard  to tell what bugs ReplayTV is actually fixing, because they won't tell you.  Even when you ask.  Nicely.They won't tell you what improvements  they're planning either.  Of course you can guess that they don't want to  tip off any competition, but considering the product marketing blitz coming  from TiVo, replay needs to be forthcoming to survive.  Replay is missing  some very nice TiVo features.I have 15 years of experience writing  software for high-performance embedded systems (which is what ReplayTV is--  a sophisticated computer) and I can't seem to understand why ReplayTV  doesn't have a handle on some serious bugs still present in the  software.While it's true, my unit doesn't flat out hang anymore, it  still has some frustratingly random problems.  Specifically:* Sometimes  it forgets to record a program even when disk space is available and no  recording conflicts appear in the recording schedule.* Sometimes is  forgets which channels I have told it to ignore and not display, and  sometimes it ignores channels I ask it to display.* Sometimes the  software is so busy doing something (who knows what) that it can't keep up  with the video data being written to disk, and I get a show filled with 2  second drop-outs. (This is one manifestation of the much talked about  flashing black screen)* Sometimes the box forgets how to display a  picture and displays a black screen instead.* Sometimes the channel  guide is wrong, or when the channel line-up, it may take several days to  work the kinks out. (Recently DirecTV started offering local service, and  duplicated some channels--including a special PBS channel for some  customers.  It took two days for ReplayTV to fix their channel guide.  Meanwhile, I was without PBS.)* Sometimes the audio is not synchronized  with the picture.  This happens often when skipping commercials, or when  using fast-forward or rewind.* The &quot;recorded shows&quot; listing is  so slow (several seconds per line when scrolling), that I dread having to  use it.  You cannot use the page-up/down feature here.Ok, what do I  like?* Multiple video inputs allow you to hook up cable-tv, an antenna,  and satellite service at the same time.  The program information is merged  into a unified program guide.  That's a neat trick.* Knowing a few words  in a title of a movie is enough for the ReplayTV unit to record a show.  I  use this as a recording &quot;to-do&quot; list.  If I hear of a movie I'm  interested in viewing, I just add it to the list and if it's ever  on-the-air, it gets recorded.* The commercial skip button is neat.  And  even though I over-shoot the program sometimes, the instant replay button  takes me back a few seconds and I'm back in sync.* The ReplayTV box  controls my DirecTV satellite receiver through a direct wired hookup  between the two.  In my experience, this is much more reliable than using  an infrared &quot;blaster&quot; that emulates remote control key  presses.* The user interface is somewhat spartan.  Frankly, I love the  simplicity of it all.  The channel guide is well suited to my  &quot;surfing&quot; habits because it emulates the Sony DSS Receiver  listing format I am quite familiar with.What needs improvement:*  Page-up/down in recorded shows listing* Progress indicator when moving  around within a recording* Sorted list of recordings* Frame-by-frame  control* List of upcoming scheduled recordings* When viewing a  recorded program, status messages about upcoming recorded programs appear  on the screen.  This is bothersome when you're actually copying something  important off the system--perhaps to a VCR. You need a way to turn the  messages OFF.From a hardware standpoint, their system seems reasonable.  My only complaint is that the unit runs very hot and thus may shorten its  lifespan, or cause unpredictable problems when enclosed in a cabinet with  an AV receiver and other heat generating componentsPerhaps my most  frustrating complaint is the &quot;canned&quot; reply you receive when  sending e-mail to customer support, and the lack of content when they do  finally reply.  Yes, I *know* that it's a problem in your software.  Duh.  That's why I complained.  How about telling me when it's going to be fixed,  or what's causing it, or the tracking number you use so I can ask about it  a month from now?In summary, I give ReplayTV a 3 star rating. It mostly  works.  It has software problems.  But I continue to rely on it, though  sometimes it can be frustrating.", "overall": 3.0, "summary": "Replay on track, but still has glitches", "unixReviewTime": 944956800, "reviewTime": "12 12, 1999"}