{"reviewerID": "A2Q6I453ZNXBE2", "asin": "B00002ST80", "reviewerName": "John Romkey", "helpful": [10, 10], "reviewtext": "I've used both Replay and their competitor Tivo, and I have to say I'm much happier with Tivo. For one thing, Replay included Firewire ports on their original unit which they marketed as being available for adding  external hard drives. After a year the software still doesn't support them  and they can't say when it will!I've also been bitten by quite a few  software bugs and find their management mechanism for recorded programs to  be byzantine and often surprising. I've had the unit delete a program I was  watching in order to record the latest episode when it had plenty of space  and was supposed to keep several episodes of the program. Also, several  times I've gone to watch recorded programs and found that the unit had  crashed.Also, if you change recording characteristics for a show (number  of episodes to store, quality, etc), Replay deletes your currently recorded  episodes!I've also had Tivo crash, but only while I was actively using  it. Tivo has never failed to record a program for me, and I've found their  interface for managing what to be intuitive and easy to use. Some of Tivo's  programming guides are poorly designed, though.The live pause feature of  both Replay and Tivo is wonderful, and Tivo is limited to 30 minutes  whereas Replay is limited by the amount of available space (usually much  more than 30 minutes).Also, be aware that the quoted times for both  Replay and Tivo are for lowest quality recording. You'll probably find that  the lowest quality is TOO low and that you'll want to use the next best  quality, probably halving the available record time.In short, Replay  should spending their energy on getting existing products to work reliably,  and on supporting features they promised a year ago, rather than  introducing new products.", "overall": 2.0, "summary": "mixed experiences with Replay", "unixReviewTime": 941760000, "reviewTime": "11 5, 1999"}