{"reviewerID": "A36VJLLJTI7TIA", "asin": "B00002SWHH", "reviewerName": "Bill Lehecka", "helpful": [11, 11], "reviewtext": "I received a great birthday present in 2000; the TiVo.  I can honestly say it's changed the way I view television (however corny their ad slogan is).I set up my TiVo in late September, and I haven't looked back since.  The setup took an extraordinary amount of time (at least 2 hours), but once I got rolling, everything else was pretty easy.  I can't tell you how much I enjoy taking my time to do things instead of rushing home to catch my favorite program.  I don't have to worry, because TiVo's got me covered.Not only has the TiVo recorded programs I like to watch, but it recommends show that I might watch (though the use of the Thumbs Up-Thumbs Down recommendations I give to specific shows), and I can say that some of the recommendations they've given have hit the nail right on the head.  The recommendations can be a little weird though.  I mean, I'm a guy who likes The Simpsons, but does that mean I'll like Rugrats as well?This is not a perfect unit, though.  Drawbacks include missing recording cues (although not entirely TiVo's fault, but you'd think some networks would get on the ball here and standardize when they start and stop a show).  You wouldn't know how many times I've said &quot;Oh, the recording started late again,&quot; or &quot;Why did you cut off the ending?!?!?&quot; Also the unit, in a quiet room, can be a little noisy.  When I'm watching a show late at night, I can hear the unit's hard drive churning.  Maybe I'm nitpicking, but I thought you would like to know.Another drawback is the inability to totally skip over commercials.  You can fast forward, sure.  You have to be good at timing the fast forward right so that when you hit play, you'll catch the show just after commercial.Yes, the product has drawbacks, but I can look past that for now and say that this product is amazing. In a couple of years my tune might change, but for now, make mine TiVo!", "overall": 5.0, "summary": "It's changed my life", "unixReviewTime": 977097600, "reviewTime": "12 18, 2000"}