{"reviewerID": "A2NGUYX6A691YS", "asin": "B00002SWHH", "reviewerName": "David Whittle", "helpful": [1, 1], "reviewtext": "There are plenty of gadgets that give the impression that it's great- but once the initial excitement wears off you realize it didn't live up to what you expected. Do you have pieces of junk in your closet that you had high hopes for? Rest assured TiVo is NOT one of those.TiVo really does change the way you watch TV. Not only can you pause &quot;live&quot; TV (a feature that has to be used to be appreciated), but you can replay and slow-mo live too! No more &quot;what did he say?&quot; or &quot;did I just see that?... with a simple push of one button you can jump back 8 seconds, and keep jumping back 8 seconds with multiple button pushes....And who doesn't love to skip the commercials?!Best of all, for many TiVo users the concept of &quot;live TV&quot; simply disappears. TiVo is, after all, a recording device. If you want to watch programs when it's convenient for you, it's as simple as keying in a few letters to find the show, and select &quot;record this show&quot;. Best of all, you can also choose a &quot;season pass&quot;, which records that show every time it's on that channel. No more missed episodes, no more forgetting to watch. It's a very user-friendly and easy to use device- even someone who has a VCR with a blinking &quot;12:00&quot; will be watching every show they love.UPDATE:  TiVo has added a &quot;Wish List&quot; that will allow you to put in favorite actors' names, keywords or whatever you like so TiVo can automatically record these personal favs.  I put in &quot;Beatles&quot;, so now every program description that mentions the Fab Four automatically gets recorded for me.  Brilliant!Video quality ranges from sub-VHS (&quot;basic&quot;) to nearly impossible to tell from the original (&quot;best&quot;) plus two levels in the middle. I was worried with the claims that TiVo &quot;degrades&quot; the picture quality of recorded and live TV because of the MPEG compression, but I found that the &quot;Best&quot; quality is nearly perfect, and &quot;High&quot; quality is very acceptable. This videophile has no problems with what TiVo does to the signal.One of the coolest features of TiVo is its ability to learn what you like and don't like. Using the &quot;Thumbs Up&quot; and &quot;Thumbs Down&quot; buttons on the remote, your personal TV player will be able to give you suggestions on things you might have missed or didn't know you would like. If there's room on the hard drive it will even record things it thinks you might like, but ONLY if you tell TiVo you want this feature. I have found a few movies that I had never heard of that were actually pretty good.Speaking of the remote, the Philips TiVo remote can also operate your TV and stereo receiver, and it's one of the best remotes I've ever had the pleasure to use.So why didn't I give TiVo a perfect 5 stars? I subtracted a star because, with a device like this, there's always room for improvement. Setup takes an agonizingly long time, especially if you have a lot of channels on your cable or satellite. The current version of software does not allow you to add &quot;handles&quot; to your recording, so it's not uncommon to miss the final minute of a show or movie. (UPDATE: This and other great features have been added as a software update, so my review went from 4 to 5 stars.) If the network doesn't start at the top or bottom of the hour the recording can be less reliable, and if something like sports run over causes a time shift you are out of luck for that recording. It's still much MUCH better than VHS recording, of course.One thing to keep in mind is the claims of &quot;14 hour&quot; and &quot;30 hour&quot; TiVos are a little misleading- those times refer to &quot;Basic&quot; quality. If you care about picture quality, you will be recording at the &quot;High&quot; and &quot;Best&quot; video level which can bring a 14 hour unit down to 4 hours, and a 30 hour unit down to around 9 hours. Record a couple movies at &quot;Best&quot; and you will start to see the hard drive space disappear. My advice: go for the &quot;30 hour&quot; if you can afford it. Once you discover all the great shows you have been missing because they aren't on when you can watch them, you will need every bit of hard drive space.Another thing to remember is that, in order to utilize your TiVo to it's fullest potential, you will need to plug it into a phone line and subscribe to TiVo's $9.95 a month service. But let me say that the service it worth it! For that monthly fee they update the show listings every day and will even update the unit's software when they add new features. And TiVo's customer support is 2nd to none.Final word: TiVo is a brilliant device that, once you try it out in your own home, you will never want to be without. If you value your time and enjoy TV, this fun and friendly little device will become your best friend.", "overall": 5.0, "summary": "You NEED this....", "unixReviewTime": 952387200, "reviewTime": "03 7, 2000"}