{"reviewerID": "A2CKNYM4Y87MYC", "asin": "B00002SWHH", "reviewerName": "mdchachi \"mdchachi\"", "helpful": [54, 56], "reviewtext": "This is a great, revolutionary product.  It's pretty much as great as everybody says.  I've had mine for a couple of months now and have no major complaints.  However, in case Tivo's reading, all my (minor) complaints  follow:Tivo comes with all kinds of hardware.  Everything except a coax  splitter which you need to buy if you want to continue using the tuner on  your TV.  (Which I think would be just about everybody because you have to  do this if you want to watch live TV while Tivo's recording).The Season  Pass records all showings of a particular show no matter when or what  channel it's on.  However if you pick a show that's in syndication or a  cable show that's repeated often, you'll get many more than you actually  want.  It'd be better if a Season Pass was only good for one channel and  time period.  Also be nice if it were smart enough to not record additional  showings of the same episode.  Another bad thing about this is that it will  not allow you to create other Seasons Passes if it thinks it interferes  with the first one.  (Like say you only want a Seinfeld season pass for a  4pm showing but Seinfeld also runs at 9pm on some other channel; I can't  set up a season pass for some other 9pm show without disrupting the first).  Of course the way around this is to record by time but I think some  improvements can be made.When watching live TV, it keeps the last 30  minutes UNLESS you switch channels or a new show starts.  This means that  if I stop watching (without pausing) near the end of a show and a new show  starts in the meantime, I'll have lost the ability to go back and watch the  end of the show I was watching.  I don't see why they blow away the last 30  minutes when a new show starts, particularly if it's on the same  channel.As other people mentioned, it'd have been nice to have a  skip-forward feature so you could skip forward in increments of 30 seconds  or something.It'd be nice to have a menu option to have a less  conspicuous play bar (or to put it at the top of the screen instead of the  bottom).  It covers up things like Who Wants to be a Millionaire questions  until it times out and disappears.Sometimes the sound loses its top  frequencies such that it sounds like a bad speaker.  S sounds sound like  static.  This might be a function of the broadcast but live TV doesn't  sound that way.It'd be great to have a VHS record list feature so you  could record multiple programs to videotape all in one go.  Sometimes I  make tapes for my  overseas friends and having to record one 1/2 hour  program at a time is a pain in the rear.When scrolling through program  listings, it makes you wait a second before bringing up the next screen.  It should be pre-loading each screen in advance so it doesn't have to waste  this kind of time.Due to program scheduling, many times it will miss the  last 30 seconds or so of a broadcast (so you might miss that last joke  while the credits are scrolling).  It should give you an option where it  will always record a couple of minutes before/after a program (if there  isn't another program scheduled to be recorded immediately afterwards).I  guess that's about it.  Don't let all this scare you away.  It's an awesome  product and now that I have it, I wouldn't watch TV any other way.", "overall": 4.0, "summary": "Great Product, could use some tweaks", "unixReviewTime": 958348800, "reviewTime": "05 15, 2000"}