{"reviewerID": "A2B0HYERQR96HI", "asin": "B00002SWHH", "reviewerName": "MikeCG \"MikeCG\"", "helpful": [20, 27], "reviewtext": "Wow, I wrote this almost 10 years ago and I still love Tivo, but have graduated to two HD models.  I've used several DVRs rented by my cable company and they don't hold a candle to Tivo; the only advantage is they are a little less expensive. But you get what you pay for.  I still say: GET A TIVO!!There's not much one can add to 100 other reviews about TiVo.  All I can say is, if you don't have one, you don't know what you're missing.  Deciding whether or not to buy a Personal TV Recorder, which is what they  are called, is a \"no-brainer.\" BUY ONE!  The only decision is  whether to buy TiVo (versons sold by Phillips and Sony) or ReplayTV (sold  by Panasonic).Both systems require that they call in by local  telephone call each night to download program information about the  channels you receive locally, either by cable, satellite (Dish/DirecTV) or  antenna, and both charge for that service.  ReplayTV sells for about $200  more than TiVo, because the ReplayTV subscription charge is included in the  purchase price.  TiVo sells for about $200 less, but you must buy the  subscription.  The total cost is essentially the same.One advantage to  TiVo, that ReplayTV doesn't offer, is that you can also elect to subscribe  to TiVo by the month ($10) or year ($100) if you don't want to shell out up  front the $200 for the life-of-the-TiVo subscription.  ReplayTV  subscriptions are for machine life only. Both lifetime subscriptions are  tranferable to new owners, so you can sell it or give it to your kids when  the next PTVR generation comes along.Each consumer will have to make  up his or her own mind about which system to buy, but I urge you not be  misled by explanations saying ReplayTV subscriptions are \"free,\"  and TiVo subscriptions are more costly.  NOT TRUE.No matter which PTVR  you get, your TV life will never be the same. You'll wonder how you  survived without!", "overall": 5.0, "summary": "TiVo Will Forever Change the Way You Watch TV!", "unixReviewTime": 963446400, "reviewTime": "07 13, 2000"}