{"reviewerID": "A2396ASCFP9L7F", "asin": "B00002SWHH", "reviewerName": "\"naomiii\"", "helpful": [13, 14], "reviewtext": "I hesitated before buying a TiVo, because I wasn't sure if it was the best option for me. Now I can't believe that I ever lived without it! I've only had it for a month, but now whenever I watch TV somewhere without TiVo, I get so frustrated because I can't pause, rewind, have an instant replay, etc. I can't imagine living without the TiVo-- I hardly ever use my VCR anymore.Setting up the TiVo is not as easy as they make it out to be -- if you have cable box you may have to spend countless hours fiddling around behind your TV before you can get the TiVo to work, because it's meant to work with either Direct TV or a Satellite. Nevertheless, it DOES work with almost ALL TVs and set-ups, and after you first get it all set up, it's effortless to use. The interactive menu is intuitive and easy-to-use, so you'll be setting up Season Passes to record your favorite shows as soon as you start. You can search for shows to record by Time, Channel, Name or Genre, and you can get a &quot;Season Pass&quot; in order to record the show whenever it's on.I love always having a selection of shows I like ready for me to watch, instead of having to channel surf endlessly to find something. Though there may not be a full 30 hours of recording time on the TiVo (30 hours is only with &quot;Basic&quot; sub-par Quality picture-- and Best Quality you can only record 9 hours), I still find that I always have extra room left over to record my favorite shows. I've actually found that I don't watch MORE TV now that I have the TiVo, I just watch TV shows that I actually like, at times when I am available. I get more homework done now (no joke). If there is extra room available, the TiVo actually records TV Shows that it &quot;thinks&quot; that you would like, since you are able to rate TV Shows and Movies, it can choose similar ones that you might enjoy. For example, if you give &quot;Friends&quot; 3 thumbs up, it may record &quot;Seinfeld&quot; for you if you have extra room. If you don't want the shows it it records, you can simply delete them or give them a &quot;Thumbs Down&quot; rating. The more shows you rate, the better TiVo understands your personal tastes. The only thing I wish it could do is record on one channel while I watch another, but it is understandable that it cannot. Also, TiVo comes up with &quot;updates&quot; now and again to improve on its features, so if something isn't perfect now, it may be improved in the future. For example, some reviewers complained that while recording sports, TiVo would fail to record if the game went into overtime, but now TiVo has a feature which lets you &quot;cushion&quot; your recordings by however much time you want, to ensure that you don't miss anything.One of the best features by far is a the &quot;Live TV Guide&quot; -- if you just press the &quot;Live TV Guide&quot; button while watching TV, a menu pops up on top of the screen giving the name of the show or movie, a brief plot summary, who the actors are, when it started, when it ends and what's on after it. Watching TV was never so easy. Whenever I show my friends how TiVo works, they are amazed by how we can pause, go get a drink or go to the bathroom, then come back and fast forward through all the commercials. You'll also never have to say &quot;Wait! What happened?? I missed it!&quot; because you can simply rewind backwards in the program and watch it again.I know that I am gushing about this, but TiVo seriosly has changed the way I watch TV-- as many other reviewers have said, TiVo lets YOU control your TV, not the other way around. I think that I'll be using it for a long, long time from now, and I have no regrets about buying it.", "overall": 5.0, "summary": "Say Goodbye to your VCR...", "unixReviewTime": 992390400, "reviewTime": "06 13, 2001"}