{"reviewerID": "A1EMDSTJDUE6B0", "asin": "B00002SWHH", "reviewerName": "Randy Given", "helpful": [5, 6], "reviewtext": "If you want to save significant time watching TV and want to watch a variety of higher-quality shows when YOU want to, this is the product to get.The &quot;pause&quot; feature is very handy, but the big seller is the Season Pass (below).  If you have to put your child in bed, you don't have to miss a part of your show -- just hit Pause and then Play when you come back.  Same for the telephone or when Mother Nature calls.  This is a great stress reducer!Season Passes are even better.  No more fussing with tapes and figuring out which has what show on it (not to mention that it would take 10+ tapes to do what we do with TiVo).  For example, we set a Season Pass for &quot;The West Wing&quot; just once, and now it will record every show that comes up (you also can choose only new shows instead of reruns).  It will keep track of time changes and day changes.  When you come home, you look at Now Playing and it shows you what shows are available.  Ours has things like &quot;The West Wing&quot;, &quot;ER&quot;, &quot;Boston Public&quot;, &quot;David Letterman&quot; and &quot;Whose Line Is It Anyway&quot;.  Who cares when they were shown live, we can watch when WE want to.My wife watches soap operas again.  With tapes, she got tired of putting in new tapes, accidentally recording over shows, forgetting to rewind before recording, etc.  All of that is history.  Now the shows come up in the list and she can hit Play or Delete (if she has several days worth, she is more inclined to hit Delete).  While viewing, she can skip through sections at 3x, 20x or 60x.  She typically watches 90 minutes in 15 minutes or less (she only cares about one or two story lines in a show).It will almost certainly change your viewing habits -- for the better.  You may watch shows, again, that you used to watch.  You are not required to watch crappy shows because that is the only thing on at the moment.  More shows, higher quality, less time.  That is what makes a great consumer product.", "overall": 5.0, "summary": "Awesome!  Save Time And Get Better Viewing!", "unixReviewTime": 985046400, "reviewTime": "03 20, 2001"}