{"reviewerID": "A3TJP0AW9HHY2", "asin": "B00002SWHH", "reviewerName": "Todd A. Bauman \"toddz_ok\"", "helpful": [0, 0], "reviewtext": "After reading about Tivo and personal digital recorders in magazine reviews and here, I decided I would take the plunge.  I thought hard about getting the Phillips 60 hour version, but at twice the cost and because I hadn't even tried the concept out, I decided to settle for the Phillips 30 hour unit.  After an easy, but time consuming setup (best if you do it right before bedtime), I quickly realized how cool and useful this thing is.  The video quality is fine, decent even at the &quot;lesser&quot; levels (movie credits do get blurry and difficult to read), although true videophiles may find it unexceptional.  I would have to say the most pleasing aspect of this is that I am now getting the most out of my premium cable movie channels.  I am now catching a lot of movies I routinely missed because I was not vigilant enough to find out when they might be on so that I could set my VCR to tape them.  Now, the &quot;Network Showcase&quot; feature alerts me to all of the channels' current and upcoming flicks and all I have to do is to say &quot;yea&quot; or &quot;nay&quot; to recording them.  Even if I don't check ahead, the thing records movies it thinks I might like based upon preferences I have expressed for other features and shows.  Awesome.  Also, skipping commercials is an easy and pleasurable feature.  By the way, any football (or other live action sports) enthusiast easily will see the usefulness of such a device.One thing that disturbs me about the Tivo phenomena is that I fear that it may be rendered obsolete quickly because of how rapidly technology is evolving.  I purchased the lifetime service option and I will be downright bummed if something else comes along to supplant it before I get my money's worth and I wind up having to buy into something else!", "overall": 5.0, "summary": "I'm hooked", "unixReviewTime": 978134400, "reviewTime": "12 30, 2000"}