{"reviewerID": "A23ZO1BVFFLGHO", "asin": "B00002SWHH", "reviewerName": "Wayne Chung \"c4victor\"", "helpful": [9, 10], "reviewtext": "listen...you're life will never be the same with TiVo. I didn't convert until my two brothers kept recommending this product. Now you can watch AND record TiVo shows at the same time. If you miss the beginning/end - it doesn't matter - you can slew to whatever point in the recorded program. Sounds inconsequential, but it isn't when you've missed the beginning of the nightly news, that all so important soap opera, or whatever your fancy. One of the best features is the fast forward/rewind 3-speed scan - once you hit play, it plays back at the last visual pause/transition, starting you at your program.The unit starts 'learning' your TV preferences by content; there's also a personal voting scale so the unit can start learning and recording on downtimes. This is great for reruns - but becomes troublesome to delete constantly if you record at high quality resolution or have a ton of shows lined up. Also, there a 'season pass' that essentially records the specified show whenever it appears in the tv lineup; this is a problem if you'd like to override just one of the shows for an alternate specific show. You'll just have to revert back to manual setting of time/date recording. Oh, the setting of time/day recording like VCRs is over, you can search and select by show name, search by type of subject matter (drama, news, etc).The term 'product' is misleading - this machine is a computer with one/two hardrives, a modem that allows for updates, all the current input options (satellite, S-video, RCA) and comes with all the cables you'll need and more. The all-knowing eye semantics on the front facia is a bit ominous, but true to its function.(...) Get a unit with one harddrive if you've got the choice...research a bit and you'll see why if you're a hacker. The folks who designed and put all this together should get some sort of couch-potato award.", "overall": 5.0, "summary": "A must purchase for max couch-potato efficiency!", "unixReviewTime": 985651200, "reviewTime": "03 27, 2001"}