{"reviewerID": "A10K1AI4CC0588", "asin": "B00002SWUE", "reviewerName": "Dave Faris", "helpful": [11, 11], "reviewtext": "I've had my TIVO for about 3 weeks, and I'm very glad I bought it. It took alot to convince my girlfriend that it was a smart purchase, but when she realized how easy it was to record her favorite shows, she agreed with me. No more fumbling for video tapes or botched VCR programming.I sort of  wish it had more capacity. 14 hours means that things are deleted sometimes  before we have a chance to watch them. Also, the video quality does get a  little funky when you save everything in basic mode (max. compression), but  it's certainly not unwatchable. (I know a 30 hour unit is available, but I  couldn't justify spending the extra $400 for it. I hope Phillips offers  some kind of upgrade path for the system!)By far, the coolest feature of  the system is the auto mode, where Tivo learns what you like and don't like  based on the programs you've chosen to record or given your approval on.  It's always interesting to see what it comes up with.I have a few minor  complaints, mostly simple design flaws. While the idea is cool that you can  get a &quot;season pass&quot; which means that Tivo will record every  episode of a particular program, regardless of which channel it's on, it  would be good if you had the opportunity to limit the scope of the season  pass. Say, for example, you want to get a season pass to THE SIMPSONS, but  you are more interested in the newer episodes on Fox on Sunday night, and  not the older ones in syndication. The way the device works now, a season  pass gets you all of them... within a few days, your Tivo will be full of  all of the episodes you can stomach, leaving no room for other programs. On  the other hand, if you choose a season pass to ANTIQUES ROADSHOW, you'll  get the PBS and the BBC versions, so there is definitely a benefit to  having it work the way it does.To the designer's credit, Tivo won't  save the same episode of a tv program twice at any given time, however,  this only works based on the tv guide descriptions -- if a program is  entered with &quot;No description available,&quot; Tivo will tape duplicate  episodes over and over again.Another minor complaint is that trying to  switch channels through the Tivo in &quot;Watch Live TV&quot; mode is a  little clumsy. There's a noticable lag while the Tivo tells the DirectTV  box to switch the channel. I also prefer DirectTV's program guide to the  Tivo's.These complaints aside, I am very happy with the machine, and I'm  very glad I bought it. Now, I never channel surf -- there's always  something good to watch... something I want to watch. I don't know how I  got along without it.", "overall": 4.0, "summary": "A great device.", "unixReviewTime": 946771200, "reviewTime": "01 2, 2000"}