{"reviewerID": "A2U6X0GHPCODVV", "asin": "B00002SWUE", "reviewerName": "Dylan Ginsburg", "helpful": [45, 46], "reviewtext": "...that I don't know where to begin.The UI is very well designed. It's obvious and intuitive how to navigate the menus. My only complaint is that I sometimes they err towards providing too many navigation and confirmation screens. While this makes each screen less intimidating, it does make  navigation a bit more tedious. But this is really a minor complaint in an,  overall, brilliantly designed interface.The features are explained well  enough in the Amazon comparison guide and elsewhere. I'll just say that  they work as advertised and are extremely cool! TV serves my schedule  instead of the opposite.The quality in the best mode (the one used for  viewing and pausing live TV) is nearly indistinguishable from the source.  If you have a really big screen and high end audio equipment you may notice  the difference. I find it fine for general TV viewing though I do bypass it  for PPV movies. I generally use the medium (second lowest out of four)  quality setting when recording. It's a lot better than VHS but is a  noticable dropoff from the original.My biggest complaint is the box's  sluggishness in changing channels and responding to user commands. It takes  about a second to change channels and, sometimes, several seconds to go  between menu/guide screens.There are two misperceptions I constantly see  in user and professional reviews regarding TiVo vs. ReplayTV. First,  ReplayTV's service isn't really free. They just build it into the base cost  of the unit. When factoring in lifetime service from TiVo, the prices have  remained comparable between the two products. TiVo was a cheaper when the  products were first introduced and now ReplayTV is cheaper. But they're in  the same ballpark.The second misconception regards TiVo's automatic  suggestions that are based on user preferences. Where's the negative in  this? If you don't like it you can turn it off and it'll never record  anything you don't explicitely ask it to record. But what's the harm? If  there's extra space on the drive why not use it? It'll never take space  away from the programs you've asked it to record. It's hard enough to sift  through and find quality programming to watch. I'll take any suggestions I  can get. The biggest problem with TV is too little quality programming at  the time I want to watch. The box is just trying to fill itself with stuff  I might want to watch. And sometimes it works. The other day I came home  and TiVo had recorded The Truman Show. This is a movie I like but wouldn't  have thought to mark for recording. It was nice to have a good movie  waiting for me when I wanted to watch it.Every time I turn on the TV  it's like I have a little surprise waiting for me when I check what the  TiVo's recorded for me. I like the serendipity of channel surfing - of  finding something I wasn't expecting. That's why I like the TiVo's  suggestions in addition to it allowing me to specify exactly what I want to  record.I haven't used a ReplayTV. It's probably an excellent product,  too, but the number of technical complaints is troubling. TiVo seems to  have a higher satisfaction/lower complaint ratio. And TiVo's usage model is  more to my liking.", "overall": 5.0, "summary": "So many good things to say...", "unixReviewTime": 943660800, "reviewTime": "11 27, 1999"}