{"reviewerID": "A1TFOXCKW4JHIB", "asin": "B00002SWUE", "reviewerName": "Tony Ursillo", "helpful": [17, 18], "reviewtext": "NOTICE: This review relates to TiVo, not this specific hardware device. I have a Sony SAT-T60 DirecTV/TiVo combination receiver.My wife and I became addicted to TiVo within 1 month after installing it. We have gone from watching 90% live TV/10% recorded (VCR) to 90% Tivo/10% live TV! We hardly watch anything anymore at its regular time. We simply pull up the &quot;Now Playing&quot; menu, which lists all the shows I have previously recorded, and watch whatever we're in the mood for - drama (Law and Order or Once and Again), comedy (Friends, South Park), reality TV (Survivor, Fear Factor), or sports (Illinois basketball, cliff diving).There are so many cool things about TiVo, but these are my THREE FAVORITE things:1) Season Pass, which once you set it up, allows you to record a particular show EVERY time it's on or all shows with a particular actor or subject,2) Easy to record (simply choose the show, not the time and channel) and easy to find and play (scroll through &quot;Now Playing&quot; list of prerecorded shows and choose &quot;Select&quot; to play),3) Record two shows at once (like Survivor and Friends, which both start at 8:00 on Thursday) with a DirecTV/TiVo combination receiver, which we have.We started with the monthly subscription and moved to the lifetime after just a month (it's good for the life of the box, not you). We have a Sony model, and I've found Sony to always be reliable (two TVs, one VCR). I bought a 4-year warranty as a safety precaution (new technology and insurance against the lifetime subscription). DirecTV customer service is decent, but not great (they handle the TiVo side as well). The BEST resource for TiVo is the TiVo AVS forum, which you can link to from the Buzz section of the TiVo Web site. It's a &quot;must read&quot; prior to buying this unit. But I am not exaggerating when I say that this is the coolest, most liberating invention to come out since the World Wide Web. No joke! You will fall in love with your TiVo too.", "overall": 5.0, "summary": "I love my Tivo!", "unixReviewTime": 1006992000, "reviewTime": "11 29, 2001"}