{"reviewerID": "A3C3VITIMY0DJJ", "asin": "B00003006K", "reviewerName": "Josh", "helpful": [0, 0], "reviewtext": "If you're considering buying this switch, you most likely have more than a few computers to network.  And if you're the casual home user, this switch will give you appreciable performance at a great price.  As a geek with 4 constantly-on computers with a mixed OS network, I can say that this switch (which was an upgrade from a 5-port 10/100 hub) really improved my network connections.First off, you should know the difference between \"hubs\" and \"switches\".  Hubs are your typical central connecting device that will allow you to hook up more than one computer on to the network at a time.  They are usually quite cheaper than switches, at the price of loss of performance.  Switches have separate bandwidths for each port, unlike hubs; thus, allowing more traffic to go through between each computer on your network.  Of course, if you're going to be doing nothing but sending e-mails and occasional web surfing, a cheap hub will do all of this for you.  But for the heavy gamers or those that want to use network intensive tools will appreciate the individual bandwidth that each port gets.Some people complain that by switching to this switch, their network performance has decreased.  This was the case with one of my computers, where transfer rates sharply fell from 42% capacity to 1.2% in a matter of seconds, rendering a 1GB file transfer practically impossible.  After a bit of analysis, I found 2 causes for this: 1) faulty cabling, and 2) cheap unreliable network adapter.  If you have cheap old network cables that have been crushed by chairs, doors, etc., they could be affecting the reliability of your network, and the full duplex operations of the 100Mbit network could be adversly affected by line conditions to where it has to resend packets to correct transmission errors.  The other common culprits are cheaply constructed network adapters (NIC's) with especially poorly written drivers.  I replaced all wiring with 350MHz Cat 5e cabling and replaced all cheap cards (e.g., CNet Pro 200) with higher grade ones, and the reliability and transfer rates have soared to a little under theoretical maximum throughputs.  According to a network expert, some recommended lower-cost cards are D-Link DFE-530TX (uses the RTL 8139 chipset) or 3Com EtherLink or 905TX series.Too many people blame the switch when it is really their setup's fault, and it should be pointed out that the switch is very well-made and easy to setup.  It should be pointed out that the switch does make an electric \"fuzz\" noise that many switches/hubs will generate.  If you are using quiet computers or laptops or are planning on putting the switch anywhere quiet, you might find the noise distracting.  However, it's a subtle \"quiet\" sound, so the level may vary depending on your perception of loudness.  Also, if you have more than 8 computers, it should be noted that these switches are not stackable so you it won't be as neat.  Wall mounting is possible and probably recommended, as a small, light-weight device such as this tends to not stay on the ground very well if the angles at which you plug in the network cables lifts or pulls on it.There aren't any true flaws in the product, works and performs well, and I readily recommend it to anyone seeking to setup or improve a home network on a budget.", "overall": 5.0, "summary": "Good Consumer-Grade Switch", "unixReviewTime": 1039910400, "reviewTime": "12 15, 2002"}