{"reviewerID": "AYC7L2YJMZOOC", "asin": "1400699169", "helpful": [0, 0], "reviewtext": "A year after Barnes and Noble dropped the price approximately one hundred dollars the Nook HD+ 9\" is still one of the best values in the tablet market.  The price is starting to creep up for a new one so keep your eyes open for a sale, but don't wait too long because they are no longer being manufactured.There are two primary reasons that I like the Nook HD+ 9\". First of course is the 1920 x 1280 high resolution display.  You will note that  by comparison 1080p is only 1920 x 1080 so this display is 4x3 not 16x9.  In my opinion the extra pixels make browsing web pages more pleasant in both portrait and landscape mode.  The second reason is that this tablet was sold in large numbers so developers have released ROM builds with the latest version of Android KitKat.  These can be used either by flashing the tablet's ROM internally or running KitKat from a micro SD Card and leaving the Nook's original operating system untouched.We have numerous Android devices and were able to download everything we needed for free, but their are companies who sell micro SD cards already set up for around $20.  So for a reasonable price one can get a \"rooted\" android tablet without doing much research and with almost no risk to the tablet or your warranty.This tablet was originally released in November of 2012.  It has a 1.5 GHz OMAP4470 Dual-Core Processor which is a little slower than the Samsung Exynos 4412 dual-core 1.5GHz processor found in the Galaxy Tab 3 8\" that was released in a few months later in mid 2013.  The processor is good enough to play most formats of HD Video, but struggles with games with 3D graphics.  It performs better with the rooted version of KitKat than with the stock Nook OS.We had a Galaxy Tab 3 8\" and now have a Galaxy Tab 4 8\".  They both have a very good GPS and cameras in the front and rear.  The Nook has neither of these features.  But the bigger display with 1920x1280 resolution as compared to 1280x800 on the Galaxy Tabs more than makes up for these shortcomings for most of what we use a tablet for.Many of these were sold so there is a very good support network.  Lots of accessories are available through Amazon and the other usual suspects.  The hardware has proven to be dependable despite a few people who have reported problems here.  They come with a good warranty and extended warranties are available.  I am giving it 5 stars not because it is the greatest tablet ever made, but because at this time at the prices they are going for on sale... it is the best tablet value that I am currently aware of.", "overall": 5.0, "summary": "Great Value!  Don't wait too long... they are no longer being manufactured.", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}