{"reviewerID": "A3QMJMTLJC34QC", "asin": "B00003006R", "reviewerName": "Vincent E. Martin \"Darkbard\"", "helpful": [1, 1], "reviewtext": "Bottom-Line: If you need an affordable, reliable, easy-to-install and configure 32-Bit NIC look no further than the Linksys \"LNE100TX EtherFast 10/100 LAN Card.\"For the past few months the unthinkable has been happening, my Intel Pro 100/1000Gbps desktop-class Network Interface Card (NIC) had been failing.  I didn't want to believe it, but the last few days it has been none too obvious.The problem: every time I restarted the (file) server the NIC was installed in, the adapter flapped, that is the link was dropping for long seconds, then come back for a minute, then dropping the link again.The only way to resolve the issue was to turn the server off, unplug the RJ-45 cable from the NIC, turn the server back on, log into Windows, then plug the RJ-45 cable back into the NIC.  After this procedure the NIC would stabilize.  By not following the procedure the server would hang at \"Applying Security Settings.\"I played this game for the last three months until I finally grew tired of the drill.  I caved in and slid my (spare) Linksys \"LNE100TX EtherFast 10/100 LAN Card\" into the PCI slot.  Problem solved!The 411The \"LNE100TX EtherFast 10/100 LAN Card\" is a high performance NIC designed for desktop computers with 32-bit PCI expansion slots. Right out of the box, the \"LNE100TX EtherFast 10/100 LAN Card\" is ready to run on both 10BaseT and 100BaseTX networks.  The 10/100Mbps NIC can automatically detect your networks maximum speed and adjusts itself to the appropriate speed.The \"LNE100TX EtherFast 10/100 LAN Card\" also features Wake-On-LAN (WOL) a feature that allows you to remotely turn on the computer.The NIC is equipped with two LED's; Amber to denote a network connection speed of 100Mbps, and; green (Link/Activity) to signal that the card has been connected to a network.  The light will flicker when data is being transmitted and received over the network.  The RJ-45 can accept a Category 3, or 5, network cable.First ImpressionsI am very pleased with my new Linksys \"LNE100TX EtherFast 10/100 LAN Card.\"  I installed the NIC in a Dell tower computer with Windows 2008 Server Standard Edition.  After the NIC was detected Windows 2008 installed the appropriate drivers; afterwards the \"LNE100TX EtherFast 10/100 LAN Card\" was ready to use at full 100Mbps Duplex; that is 200Mbps.ConclusionSince installing the \"LNE100TX EtherFast 10/100 LAN Card\" all has been well with the servers' network connectivity.  Though I have always installed Intel NIC's in my server platforms, the Linksys \"LNE100TX EtherFast 10/100 LAN Card\" has proven itself a worthy \"stopgap\" replacement and one I might just keep in place over the long haul.", "overall": 4.0, "summary": "An Affordable Alternative to My Preferred Network Adapter", "unixReviewTime": 1293148800, "reviewTime": "12 24, 2010"}