{"reviewerID": "A3MV1KKHX51FYT", "asin": "B0000300QN", "reviewerName": "Acute Observer", "helpful": [2, 2], "reviewtext": "Iomega ZIP 250 MB USB External DriveThis unit has a rounded dark blue case and is powered by the USB port.  You should select the icon to \"Unplug or Eject Hardware\" to remove this device. The IOMEGA software should be installed on Windows 2000. If the unit does not have an eject button on the drive you must select the EJECT command from the Properties menu. It is good to do this all the time because of the disk caching system. The 250 MB drives can read and write to 100 MB ZIP disks, but slower than with a 250 MB disk. The fastest transfer is with an internal IDE ZIP device.The \"User's Manual\" warns against using the Operating System to copy a disk. Use the Iomega \"Copy Machine\" program. Right click on the ZIP drive to select the Iomega \"Format\" function. Use \"Short Format\" to delete all data on an IOMEGA disk. The \"Long Format\" repairs a drive with errors, converts from another format, or removes all passwords (not usable on a 100MB disk). \"Write Protection\" protects against writing over data, a password can protect against both reading and writing files. You can also flag the ZIP drive as \"non-removable\" so it appears like a hard drive. The manual has the details.Computers have a limited number of IDE devices and drive bays so a separate storage device is practical. Replaceable 250 MB ZIP disks provided vast storage in the past but are no longer the latest in storage technology. The 250 MB ZIP disk is less widely used than the 100 MB disk. ZIP disks reuse deleted space unlike a CD whose space is consumed when you replace files. Falling prices for CD discs solve that problem. A ZIP disk has no compatibility problems between different Windows systems and computers. A CD written on one system may not be updated by different software on another system. [You may find support on the Internet for USB Mass Storage Devices for Win98.]To test the status of a used ZIP disk. 1) Right click on the drive, select `Properties'. 2) Select the Iomega tab (after support was installed). 3) Select `Diagnostics', then `Close' after the green light. 4) Select `More Info' on the `Disk Type' Note the `Disk Life Status' and the `Format Life Status'. Percentages lower than about 85% are not good. 5) A `Long Format' can improve the Life Status statistics.", "overall": 5.0, "summary": "Useful Data Storage and File Transfer", "unixReviewTime": 1266451200, "reviewTime": "02 18, 2010"}