{"reviewerID": "A2IQSNBMGS45X9", "asin": "1400699169", "reviewerName": "Annie Wong", "helpful": [0, 0], "reviewtext": "Well, I bought it because of the 1080p resolution.  The screen quality is beautiful.  I already have an Apple 4th generation iPad, but I couldn't resist on the high quality picture and low price.  After I received the Nook, I immediately rooted with Kit Kat, the latest operating system.  Let me tell you, I am glad that I made the move.  The original Ice Cream Sandwich OS has lag but not Kit Kat.  With Kit Kat, not only the Nook operates much more smoothly, you also get the full Android tablet experience and more apps available from Google Play.I recently stumbled across the XBMC Cine Player Android app in the Google Play store.  With this app, I can now stream over 1500 movies in HD quality for free.  I have been using XBMC for a little while now on both MacBook Pro and Raspberry Pi, though the Cine Player version's library is not as extensive as the MacBook Pro and Raspberry Pi, it is good enough for use when you are on the road like in a hotel or something.  With Kit Kat, I experience very little buffering issue. I can also output contents to a TV via the Nook HDMI adapter.  I believe you can output signal to a TV via Google Chromecast but I haven't tried it yet so I can't be for sure.I highly recommend the Nook if you root it with the latest OS.  I am finding more and more things that I can do with the Nook then the iPad due to Android is an open system.By the way, I use N2A to root my two Nook HD+'s.  With a N2A micro SD card, it gives you the dual boot capabilities.  You can use it to boot Kit Kat or the native Barnes and Noble OS without removing the card.  The N2A card doesn't replace the native OS as the Kit Kat OS is stored in the micro SD card so you don't have to be concerned about voiding the warranty from alternating the tablet OS.Bottom line, the Nook HD+ is already a pretty decent tablet.  One can greatly improve its potential with a simple change to the OS.  If front and back cameras and GPS are not necessities for you, the Nook is a good value tablet for 1/3 of the cost of an iPad.  By the way, I bought an external bluetooth GPS for $16 and it works like a charm with the Nook.  One can expect to spend $100 for an external bluetooth GPS if your IOS device doesn't come with an internal GPS.", "overall": 5.0, "summary": "Well worth every penny if rooted with Kit Kat", "unixReviewTime": 1400976000, "reviewTime": "05 25, 2014"}