{"reviewerID": "A243HY69GIAHFI", "asin": "B0000300QN", "reviewerName": "tropic_of_criticism", "helpful": [77, 79], "reviewtext": "The Zip 250  is perhaps the most rational choice for anyone looking to  bridge the gap between Macintosh and Windows based machines.  In both the  SCSI and USB forms, it invites portability.  It's the ideal solution for  anyone who creates anything but video on one platform for use on the other.  (For cross-platform video editing, a Jaz drive is more  appropriate.)It's also great if you're living on a budget.  Though your  initial purchase is more expensive than buying a Zip 100, you'll spend far  less on disks.  Since 250mb disks are essentially the same price as 100mb  ones, your overall storage costs will be cheaper in the long term.Perhaps more importantly, you won't have to abandon your existing Zip  library to upgrade. The product's much vaunted backwards compatibility with  Zip 100s is real and mostly trouble free.  The only glitch with it is that  if you're trying to save large (over 15mb) files to a Zip 100, it will take  substantially-even painfully--longer than if you were using a Zip 100  drive.  For many people, this won't be a consideration. But if you have  large multimedia files in your 100mb disk library, you might consider  transferring them over to 250mb disks.  To put it simply, I definitely  wouldn't recommend either version of this product  if you plan to use only  100mb disks.  The real question, though,  is whether you should get the  SCSI or the USB version.  Out of the box, the SCSI external is twice as  fast as the USB, but less portable.  To use the SCSI version, you've got to  have SCSI cards installed in every machine on which you're going to use the  drive.  Virtually no computers, PC or Mac, come with pre-installed SCSI  cards, so you'll immediately have to spend money to bring your computer(s)  up to speed.  And you'll have to deal with the fact that most unknown  computers won't have a SCSI card.Meanwhile, the entirely more  portable USB version, though slower by default, can be brought up to the  same speed as the SCSI.  With the addition of a FireWire adaptor, there's  no difference between the two drives.  All Macs since the G3, and an  increasing number of PCs come with FireWire built-in.  And if you happen to  encounter a computer without FireWire, you can easily remove the adaptor  and go back to the default USB connection-which isn't exactly \"slow\",  anyway.With either form, you're going to have to spend some more money  to get both top speeds *and* portability.  If you don't plan to travel  outside computers you already know have SCSI capability, it's probably  cheaper to go with a SCSI Zip.  But if you want the fastest,  largest-capacity  Zip drive that you can use on the highest percentage of  computers, buy a USB Zip 250, and add on a FireWire adaptor.", "overall": 5.0, "summary": "Choosing between the USB and SCSI versions of this product", "unixReviewTime": 968457600, "reviewTime": "09 9, 2000"}