{"reviewerID": "A3MV1KKHX51FYT", "asin": "B0000300QQ", "reviewerName": "Acute Observer", "helpful": [0, 0], "reviewtext": "Iomega ZIP 250 Parallel Port DriveThis device allows both storage and transfer and works on any bi-directional or EPP parallel port. For best results, you should run the \"Parallel Port Accelerator\" program when the unit is connected. Computers have a limit on the number of IDE devices, and desktop computers have a limited number of bays. The disks are easily replaced to provide vast storage within the 250Mb limit. This device must be connected when all power is off, like a parallel port printer. Backing up a small amount of data is not a problem, but large amount of data files will run slowly. The fastest transfer is with an internal IDE ZIP device. Most printers will operate from the printer port on the back. The 250 MB unit can read and write the more popular 100Mb disks as well.The \"User's Manual\" warns against using the Operating System to copy a disk. Use the Iomega \"Copy Machine\" program. Right click on the ZIP drive to select the Iomega \"Format\" function. Use \"Short Format\" to delete all data on an Iomega disk. The \"Long Format\" repairs a drive with errors, converts from another format, or removes all passwords. \"Write Protection\" protects against writing over data, a password can protect against both reading and writing files. You can also flag the ZIP drive as \"non-removable\" so it appears like a hard drive. The manual has the details. The manual offers suggestions if this doesn't work.Parallel Port drives have their drive letters assigned after the hard drives. Another Parallel Port unit can be connected to the first (\"daisy chaining\"). This changes the drive letters assigned to CD-drives. Will the data on a disk survive for over a decade? Few hard drives survive 10 years of daily use. All your important data files should be copied from a hard drive to ZIP drives or other media. ZIP drives, like floppies, should not be exposed to magnetic fields or high heat. CDs can be damaged by high heat. ZIP disks are reusable, replacing data does not decrease the size. A CD disk consumes space when a file is replaced. A ZIP disk never has compatibility problems between different systems and computers. A CD written on one system may not be updated by a different system.To test the status of a used ZIP disk. 1) Right click on the drive, select `Properties'. 2) Select the Iomega tab (after support was installed). 3) Select `Diagnostics', then `Close' after the green light. 4) Select `More Info' on the `Disk Type' Note the `Disk Life Status' and the `Format Life Status'. Percentages lower than about 85% are not good. 5) A `Long Format' can improve the Life Status statistics.If your system does not recognize your used parallel port drive (Add New Hardware Wizard), select the hardware from the list: \"SCSI controllers\", \"Iomega\", \"Iomega Parallel Port Interface\", then \"Finish\".You should set the Printer Port as EPP or ECP.Then modify the 'Settings' for the Iomega Parallel Port Interface as follows.The port settings assumes the usual I/O address.'My Computer'; 'Properties'; 'System Devices'; 'Device Manager';'SCSI Controllers'; 'Iomega Parallel Port Interface'; 'Properties'; 'Settings'/mode:eppecr /port:378 /speed:6", "overall": 5.0, "summary": "Useful Data Storage and File Transfer", "unixReviewTime": 1253577600, "reviewTime": "09 22, 2009"}