{"reviewerID": "A3PD8JD9L4WEII", "asin": "1400699169", "reviewerName": "Bron \"Bron\"", "helpful": [57, 59], "reviewtext": "Review for Barnes & Noble NOOK HD+A new winner in the \"best value in a mid-size Android tablet\" category.When it was originally introduced at around $270 it was a decent value in a mid-hi range tablet, but limited by the closed B&N; ecosystem.  Now that it is being offered at new prices ($150-180) and has been upgraded to support Google Play Android apps as well as B&N; content, the value proposition is much improved.  (Yes, you will have to be patient and let your Nook HD+ do a couple a major software updates before you can really settle down and enjoy your new toy!  But it's worth the wait.)If you are coming from other Nook devices, you'll feel right at home.  If not, you may be surprised to find the combined \"reader\" and \"Android tablet\" interface pretty nice.  It's well thought out and for the most part works very well.  Take your time and be willing to explore a bit and you'll soon get the hang if  it.  Don't miss the \"Nook Today\" icon which is a clever one, but easily overlooked.  All in all, I was very comfortable with it in a short time and actually find the UI a bit of a refreshing change.  (Occasionally, you have to use the home key instead of just \"back\" but a minor quibble.) [Note: You can \"override\" the Nook UI and install other \"launchers\" but I, personally, felt no need to do so.  But nice to know the option is there if ever needed.]The size is a nice compromise between the smaller units (too small for comfortable long video watching) and the larger units (big, heavy, bulky).  The 8-9\" range seems to be the sweet spot.  The FULL HD (1920x1080 256ppi) screen is gorgeous with great colors and contrast and sufficient brightness.  Videos/movies, YouTube, Photos, Graphics, all look great.  The high quality screen is the big draw here, in my opinion.  Excellent value at the new price point.The size, weight (very light for this size device), slimness, and easy handling are all good points of this tablet.  Some do not like the Nook hole on the bottom left, but I am fine with it.  It gives a bit of orientation, an easy place to grab the tablet, and so on.  The styling looks good to me and the slimness is nice and makes it easy to hold and handle.HD YouTube and Netflix look wonderful.  This is absolutely one of the best tablets for the price if you want to watch Netflix on the go.  I was able to hook up my portable bluetooth speakers without any problems, so the movies sounded great as well.  Bluetooth headphones also worked well as did regular headphones, of course.  The built in speaker(s) is OK, but not sufficient for best music and movie sound quality (as is true with most tablets).The controls are well placed, simple, and easy to use.  The MicroSD card slot is a nice bonus so you can expand your storage easily and is a feature missing from many tablets.  The proprietary charging port is a minus, a standard USB would have been more flexible, but it works well and charges faster.  The handy \"HOME\" button with the Nook logo is very useful and also works well.There are no cameras - and I could care less, but some might.  I'll take the superb screen, great design and build, and other nice features and be happy.  For the techies, it uses 1.5 GHz dual-core OMAP 4470 proc and 1 GB of RAM.  Not cutting edge, but plenty fast.  Benchmarks I checked were all pretty good and the Nook HD+ is very responsive in use. The back features a nice \"soft touch\" feel that I really like versus many tablets that have a slick back making them prone to being easily dropped.The recent update adds the Chrome browser to the NOOK HD+ and web browsing is snappy and works well.  Everything looks great, of course, on the FULL HD screen and the Chrome browser handles most web pages with aplomb, formatting them nicely for the Nook HD+.  Chrome will also sync and update your bookmarks and such across devices, automatically, which is nice.If you like Barnes & Noble and their books and movie content, then, of course, that is a win for you as well.  It's all here and well integrated.  Plus there are some Nook HD+ specific apps pre-installed and you should prefer them in most cases.  (Note: I made the mistake of updating the Nook Netflix app with the one from the Google Play store -- big No-No!  It did not work at all.  Once I uninstalled it and went back and reloaded the Nook-branded version from the Nook store (free) -- everything worked fine again. I've had this issue with other tablets as well, the Netflix app seems to be very picky and you need the right one for your specific tablet. I had also installed the Android Pandora over the Nook version, but that one worked fine.  So...if you do this and have issues, just uninstall and reinstall from Nook Store/Cloud vs. Google Play Store and you'll be fine.)All of the other Android apps from Google Play that I tried have worked fine.  Pandora, Stitcher Internet Radio, Maps, Amazon MP3, Amazon Kindle (wow! a bit of a surprise!), Gmail, YouTube, etc. all work as expected.  The new openness of the NOOK HD+ is a game changer for the NOOK line, and pushes it way up in the rankings in my opinion.I bought mine at the local B&N; store and there's a lot of help available there if you need it, which is a huge bonus if you are tech challenged and need advice and help locally.  Very friendly staff and great customer service, what a novel concept!  ;)The Nook HD+ is a \"sleeper\" - an often overlooked alternative to other more expensive tablets that can both out perform them and well beat them in value, being available currently at very attractive prices.  A 5 star item for features, design, performance, and value.", "overall": 5.0, "summary": "5 star item for features, design, performance, and value.", "unixReviewTime": 1372204800, "reviewTime": "06 26, 2013"}