{"reviewerID": "AT2J7H5TRZM8Z", "asin": "B000031KIM", "reviewerName": "A Customer", "helpful": [7, 7], "reviewtext": "It's true...I am a chronically unorganized person. My office is a mess, my desk is a mess, and my schedule...well we won't even talk about that.Fortunately, one aspect of my life has become a little easier to manage thanks to my brand spanking new Palm Vx. Until recently, I didn't really see the use in a PDA but when others in my office began raving about theirs, I took a leap of faith and bought a Vx.What Is It?Essentially, the Palm Vx is the high end (non-color) organizer offered by Palm. The Vx is capable of managing your calendar, email, task list, address book and offers a whole host of other capabilities through third-party software.The Vx has a sleek, silver aluminum case that offers more protection than the traditional plastic case. In addition, the Vx has a slim design that is nearly half the width of many of the other PDAs on the market.How Can It Organize My Life?First, get rid of that bulky Franklin planner! The Vx can store everything you would typically store without all that paper mess. Need to make a note? Write it in the Vx's notepad. Need to check your schedule? Check it out in the Vx's scheduler. Just about the only thing you can't do with a Vx that you could do with a Franklin is doodle (and I probably just haven't figured out how to do that yet).How Easy Is It To Install It?Installing the Vx is relatively easy. Just connect the cradle to a serial port on the back of your computer, pop in the CD and run the setup. The Palm Desktop software setup walks you through the process in about 5 minutes.Be careful, however, if you are going to use Outlook for your email client. In order to use Outlook, you have to have the PocketMirror software installed (it comes with the Palm CD). When the setup asks you if want to setup your PDA to read email, click the button that says \"Learn More About Using Microsoft Outlook\". This will setup the PocketMirror conduit and enable your Vx to read and send email through Outlook. ...Well, as I mentioned above, you get sleek looking PDA that replaces your traditional planner. On top of that, however, you get rechargeable NiCad batteries which are a must for anyone who uses their PDA a lot. There's nothing more irritating than to have your AA batteries die in the middle of a meeting.Also, you get a nice looking leather cover, which I promptly replaced with a BodyGlove neoprene cover for $20. I wanted the extra protection and I liked the ability to hold business cards in my PDA case.What Are The Downsides??The first downside is lack of expandability. Although you are able to connect a modem for mobile access, I don't like the fact that you can't add more memory or modules such as MP3 players, digital cameras or any of the other modules offered for the Handspring. Apparently, Palm realized that I was not the only person who feels this way because the new generation of Palm PDAs (the m500 series) offer memory expansion slots and additional modules.Although it doesn't mater all that much to me, I guess some would consider the lack of color to be a downside. Although I did consider the Palm IIIc when looking at PDAs I chose to go with the smaller, lightweight model rather than the bulkier model that offered color. I don't miss having color so it's not really that big of a downside.The only other downside I see is the fact that the cradle shipped with the PDA runs off a serial port instead of a USB. Although I don't notice a big difference in the time it takes to sync, I would like to know that as serial port becomes more outdated, I can continue to use my PDA.OverallI am really impressed with my Vx. I have been using it for a couple of months now and have nothing but praise for it. The batteries hold their charge for quite a long time, the sync process is relatively quick, and the organizer itself has attracted a lot of comments.If you are considering a PDA, I would definitely take a look at the Vx. It's well worth the money.", "overall": 5.0, "summary": "Finally!!! I'm Organized!", "unixReviewTime": 1008201600, "reviewTime": "12 13, 2001"}