{"reviewerID": "AY8Q1X7G96HV5", "asin": "B000031KIM", "reviewerName": "Chris Prinzivalli", "helpful": [112, 133], "reviewtext": "Weighing in at just 4oz., it has the same anodized aluminum exterior and LCD screen as the Palm Vx handheld. Yet it has four times the memory of its predecessor, giving you more speed and more storage... Now, no matter how busy your life gets, you can keep it together in style... Keep all your meeting times, places, people, phone numbers and other information safely tucked away in this elegant device... 8MB of memory stores up to 10,000 addresses, 5 years of appointments, 3,000 to-do items, 3,000 memos, 400 e-mail messages, plus, there's plenty of room for extra add-on applications, books, language translators, image viewers, dictionaries, games, advanced calculators, and more... Use the HotSync cradle to quickly backup and exchange information between your PC and your Palm handheld, as well as any number of popular PIMs like Symantec ACT! and Microsoft Outlook. Long-life lithium ion batteries recharge themselves in the HotSync cradle in just minutes a day. A full charge lasts up to a month. Optional recharging kit available for road warriors... With the Palm V Modem, you can access your desktop PC remotely in just minutes using a standard phone line or GSM cellular connection. Now you can check e-mail, access information from the office, or schedule a group meeting. Customize your organizer with thousands of personal productivity and enterprise applications available today. IR PortBeam your business card, phone lists, memos, and add-on applications to other IR-enabled Palm OS devices. Use third-party beaming applications with IR-enabled phones, printers, etc. Items Included in the BoxPalm Vx handheld, Palm Desktop software, Applications for Palm Vx handheld, Rechargeable battery (internal), DB-25 Adapter, Getting Started Guide, 2 Stylii, Protective leather cover, Handbook, HotSync cradle, Adapter/recharger. A great advancement in the realm of the Palm Pilot, this unit is far more durable than the III or the VII series...", "overall": 5.0, "summary": "Palm Pilot Vx...", "unixReviewTime": 972691200, "reviewTime": "10 28, 2000"}