{"reviewerID": "A3H9RTXHQ5H4UT", "asin": "B000031KIM", "reviewerName": "Deepak Krishnankutty", "helpful": [30, 30], "reviewtext": "Last year, I helped my cousin install his Palm V to work with his desktop. Thought it was a neat device but, did not want to buy one for myself at the time; thinking that my laptop was good enough for what I need to do. Stupid decision !I finally bought myself a Palm Vx this August and it has changed the way I use and access information on the move. It's forte is dependable connectivity and it does that so well. The Vx ships with Chapura PocketMirror, which an excellent sync/conduit manager, optimised for Outlook users (97-2000) and is a breeze to set up. PocketMirror integrates seamlessly with Palm's own desktop manager - just follow the instructions and you will be able to hotsync all your data in Outlook, literally within minutes. The Vx also ships with AvantGo, which is perfect for those of you who want to browse your favourite websites off-line and on the move (it syncs with your chosen sites every time you hot-sync; just a push of a button away).There is no point dwelling on the number of addresses, memos, etc. that the Vx can store, since these are pretty much the industry standard with other brands too and realistically, it is unlikely that you will ever run out of space for these items. The 8MB in the Vx comes in handy when you use applications such as AvantGo and if you tend to keeps hundreds of messages in your Outlook inbox (like I do!).I have recently added Documents to Go ([...] a 3rd party add-on. This software brings Word and Excel files into my Vx and now, I no longer have to use my laptop for every important document or spreadsheet I need to access quickly in a meeting or whilst on the phone - it's all there in the Palm of my hand (pun intended) !If I had a Palm wish, I guess a colour version of the Vx would be the ultimate; though, knowing the folks at Palm, this is probably around the corner (since they have already released a colour version of the III series - the IIIc). I guess I would also like to have my 'Sent Items' mailbox from Outlook in my Palm - there probably is software available somewhere on the Net which does this, but I haven't found it as yet.Bottom-line. Spend the money on a Palm Vx, you prospective PDA shoppers ! You will not regret it !", "overall": 5.0, "summary": "Palm Vx ...... look no further for a connected PDA !", "unixReviewTime": 970099200, "reviewTime": "09 28, 2000"}