{"reviewerID": "A3W112102BC6BG", "asin": "B000031KIM", "reviewerName": "J. Lara", "helpful": [7, 7], "reviewtext": "I thought it would be helpful to make another review 8 months after using my Vx instead of a few days just to give a more objective perspective on the utility of the device once the novelty and the excitement of a new toy has passed away.Hardware: After 6 months, i would have figured that Palm or Handspring or even Sony would have come out with a PDA that could rival the Vx's elegance and style. Unfortunately (or Fortunately, depending on where you're standing) none has come close. Another pleasant surprise is the durability of my Vx. Although i can't speak for all Vx's out there, mine has survived quite horrific spills.There are few hardware hitches with the Vx but nothing that i would take away anything from its obvious beauty and durability. There is one other issue that i must address. Initially i thought having a built in rechargeable lithium battery instead of the AAA batteries would be a clear advantage. However i have discovered that its not the case. For the Vx to be that thin it had to adopt rechargeable lithium batteries. Although one might think that a rechargeable battery is better than AAA, you better be prepared to charge your palm at least every three days.Software: No matter what the PocketPC boasts of its capabilities, if it lacks third party application support, then how useful can it really be? Similar to Windows CE or even the other PDA operating systems, the Pocket PC could die a slow and painful death because of this lack of support.This is the real strength of the Palm OS. 8 months ago there were thousands of third party applications with hundreds more being added monthly.Unfortunately because of this flood of applications, some applications may have unknown effects on our units. Although many result to a soft resets, there are instances when a hard reset (complete data loss) is required to fix the problem. Sometimes there are instances when certain applications won't work with the presence of others. Again these are unusual circumstances and it certainly wouldn't deter me from getting a PALM OS unit again.Overall I guess by know you've guessed that im still in love with my Vx. I have many applications on my Palm but my personal favorites are; for regular applications there are Fireviewer and AvantGo and Documents to Go, for Games there are Dope Wars v 2.3, IRBattleship, PacMan, SpaceTrader, and Yahdice and for Utility programs there is Atools, Benchmark, Hackmaster and Cruise.In terms of accessories I recommend getting the Palm hardcase. Check out my review on this product. There are hardier cases out there like Rhinoskins and Concept Kitchens, but this one is my favoriteSpeaking of Concept Kitchen, i also recommend using their WriteRight product. Its a protective film that goes over the screen. Not only does it protect your palm screen from scratches and reduces glare, it has a pen to paper feel when using a stylus. Speaking of stylus, you can just forget about the stock stylus of the Palm. Its [...]! If you want to get carpal tunnel in 5 minutes go for it. Otherwise i recommend using another instrument. I recommend using those multi-pens that have a stylus, pen and pencil in one. There are many great pens out there that have already incorporated styli in their line. Cross makes one the is pen on one side and a stylus on the other. Pilot makes some nice ones, Lamy and Rotring makes them too. I personally use the Rotring matte black trio-pen. Its a converted pen so i had to buy a stylus refill and replaced the red pen option with the stylus.Unfortunately it hasn't been a completely smooth 6 months. Just recently i had a strange experience of my address book being completely wiped out! It existed on my desktop but it wouldnt sync to my palm. After a little reinstallation of the desktop application and consultation with the palm technical support, i was able to fix the problem. Which brings me to the point of hotsyncing. It is CRITICAL that you hotsync. I must say that although it is not necessary to running your palm, a computer is essential to back up files and to install programs. Get backup buddy as well. that works really well. HOTSYNC, HOTSYNC, HOTSYNC!!The Vx is a good investment. With the m500 and m505 soon to come out, that should decrease its price considerably. Although I'd be inclined to recommend the m505, the [VX's price] is a steal!Last thing, before you go and buy your PDA i strongly recommend you do your research. I cant stress it enough. Read what people have to say about their experiences and thoughts about their units. Consumers are the best sources of objective reviews.Good Luck people and more power to PALM.", "overall": 5.0, "summary": "Still in love with my Vx!!", "unixReviewTime": 987897600, "reviewTime": "04 22, 2001"}