{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B000031KIM", "reviewerName": "magellan", "helpful": [20, 20], "reviewtext": "I have owned both a Palm Vx and IIIc (my current model) and they are great products. Although I have had my IIIc for almost a year, and my Vx for 6 months before that, I am still just as amazed at how useful it is as when I first bought it. These devices are not toys. They will help you organize you life in a way you would never had thought possible, and I am still thinking of new ways to use all the time. I just noticed something interesing about my Palm and thought I'd mention it here. A minute ago I put my Palm in its cradle to do a hot sync. I pushed the button but nothing happened. I tried it again but again nothing.Then I noticed there was a reminder notice on the screen. I cleared it by tapping the &quot;Okay&quot; button, and after that I was able to hot sync.Apparently the Palm OS considers a reminder notice to be at a lower interrupt level than a hot sync, which, if you think about it, is probably true, since you wouldn't want to miss a reminder notice because it got blown away by the hot sync screen.Just one more thing that shows how well-made and thought out these little gadgets are.One other thing. I also have a Compaq iPAQ, which I also have become very attached to, in addition to my Palm. Although the iPAQ hot sync process is a little easier than the Palm (you just put it in the cradle and the unit is automatically detected, you don't have to hit a button as with the Palm), the Palm does have one advantage here. I can hot sync when I'm dialed in and on-line with the modem in use. The iPAQ uses a USB port, which looks for a free COM port to work with, and this conflicts with the modem. When I try to hot sync while using the modem, I get a message that there is a conflict and it won't hot sync. This is despite the fact that my system has two COM ports and the Microsoft Windows diagnostics shows the second COM port as free and not in use.However, one interesting thing the iPAQ does is you can work with it while it is hot synching. You still can't do that for the Palms.", "overall": 5.0, "summary": "A comment on hot-synching", "unixReviewTime": 991785600, "reviewTime": "06 6, 2001"}