{"reviewerID": "A2UREP3Z9EU6V5", "asin": "B000031KIM", "reviewerName": "Mark", "helpful": [174, 175], "reviewtext": "The time arrived for me to upgrade from my trusty old Palm V. I was running short on memory, so that left the Palm IIIc, Vx and Jornada 540 for consideration.I tried the IIIc for a month. Found the color screen a  pleasure to work with. There are not that many 3rd party apps in color yet,  but that appears to be changing fast. I liked the TinySheet Excel  compatible spreadsheet in color. The black on white screen is very readable  for e-books. Battery life was acceptable. On a 3 week business trip I had  to recharge it only once. The downside for me is size, the comfort factor.  You can NOT comfortably carry a Palm in a shirt pocket. I carry it in my  pants pocket, with the V I would forget I had it until I needed it. The  IIIc, it was just always 'there'. The only other gripe I have is that it's  almost impossible to read the screen outside. Something I took for granted  on the monochrome V. Bright daylight however fully washes out color  screens.  I REALLY like the small updates to the new PalmOS. Eg. the  little shortcut bar that appears at the bottom of the screen for menu  shortcuts is an excellent innovation. It makes cutting and pasting as fast  as with the PC using the keyboard.I used the Jornada for 2 weeks before  I returned it. As my expectations weren't that high from my previous  exposure to the platform I can't say that I was dissappointed. However, I  still don't think MS is up to par. On the balance still more 'clicks' are  needed than on a Palm. I couldn't find those easy to use 3rd party freeware  apps such as the NY crossstreet finder, on PocketPC. On face value I liked  Excel, but I found it's small differences with the PC version annoying.  Knowing one, I made assumption about the other that didn't always pan out.  The high resolution of the screen is nice. For e-books the Jornada would be  good, if not for the poor passive matrix screen. For example, on the plane,  I could put the IIIc on the tray in front of me, and read at an angle. This  is impossible with the Jornada screen. For basic PDA functions it is  adequate. I feel the apps still are a bit sluggish. Playing MP3's is fun,  but with 2 songs at CD quality, memory is depleted which makes it  impracticle for multimedia, unless you spend more to expand memory. Forget  playing MP3's in the background while doing other work, the device slows  down to a crawl. Size wise, the Jornada is a bit bigger and heavier than  the IIIc, which to me is a problem as I already explained. Battery life  seemed shorter than the IIIc, though it may be subjective because it was on  a lot, while learning the PocketPC platform.The Palm Vx is basically a  faster Palm V with more memory. Just got it yesterday and I already love  it. This is the one I'm keeping. I suppose that after getting used to the  size and weight of the Palm V, there is no going back. However, I'm glad  that I went through the hassles of trying out the other 2 models. I learned  a few things:1) Size matters.2) Until technology for multimedia  matures, color screens do not add significant value to justify their impact  on size and battery life.3) PocketPC looked good on face value, but  didn't go the distance, however, I do believe that as technology advances,  multimedia such as MP3 playback will be great to have. I hope that by that  time Palm will have the capability.4) 3rd party apps add tremendous  value. Something I forgot until I couldn't find my favourite little add-ons  that make life easy, such as AccountManager, cross street finder etc.All  in all, the best favor you can do yourself is getting one. Got my parents a  Palm V 2 months ago, now I have to get them another one so they stop  fighting over it.", "overall": 5.0, "summary": "Currently the best PDA on the market", "unixReviewTime": 958176000, "reviewTime": "05 13, 2000"}