{"reviewerID": "A2E2I580OO3HET", "asin": "B000031KIM", "reviewerName": "M. Broderick \"mikebinok\"", "helpful": [35, 39], "reviewtext": "When my Palm V was stolen last May, I went right out and bought a Palm Vx to replace it!  Upfront, I should address the comment of the reviewer below who complained of losing his data when the device crashed.  The Palm Vx comes with software that allows you to create a copy of all your Palm data on your computer.  If you lose the Palm data for some reason (or the computer data), you can restore the lost data with a couple of mouse clicks. The Palm comes with a &quot;cradle&quot; that is used for recharging and for linking to the computer.  When my Palm was stolen, I easily restored my information into my new Palm Vx.  The process of storing data takes about 15 seconds, and literally just takes a button push after you have put your Palm in the cradle. I should mention that in 18 months of extensive use, I've never &quot;lost&quot; my data due to software failure.  I did lose it when my Palm was stolen of course, but was  easily able to replace it. I find two main uses for my Palm--As a scheduler, I can enter something I want to be reminded of at a future date, and have the Palm alert me at a specified time (typically five minutes before the meeting starts, for meetings at my work).  You can easily view all the items in place for each day, and there is also a weekly view.  This can be done years in advance, and doesn't have to be for work stuff--I have a gasket in an underwater camera which needs to be replaced in May, 2002, and I have entered a reminder to alert me at that time! The other thing I use it for is as a way to find &quot;forgotten&quot; information.  I make and store memos of important conversation or important information.  Also, I make notes in the &quot;address book&quot; of key information about people--Things I've discussed with them, or areas of expertise they have.  I can use the &quot;find&quot; feature on my Palm to locate a term.  So if I want to know what conversations I've had about widgets, or who I have talked to that knows about widgets, I can enter &quot;widget&quot; in the find feature, and I will be shown a list of all my memos that mention widgets in the text, and anyone in my address book who I listed as being widget-related!  Incidentally, I'll also get a list of any appointments in my calendar that mention widgets. If you are a busy person (and not just a business type, students, or homemakers may benefit as well) I believe you will be able to make good use of a Palm Vx.  You may be equally satisfied with a Handspring, or with other makes of Palm, though.  The two great advantages I see with the Palm Vx (or Palm V, if you can still find one) are that the profile of the device is very slender--It fits in my front slacks pocket without leaving a substantial bulge.  Second advantage is that the internal battery provides power for a week to two weeks of use, and can be recharged by resting in the cradle. No need to buy replacement batteries, or juggle them around replacing them.", "overall": 5.0, "summary": "I love mine....", "unixReviewTime": 976752000, "reviewTime": "12 14, 2000"}