{"reviewerID": "AY62TN9VGKI2Z", "asin": "B000031KIM", "reviewerName": "Mitchell Small", "helpful": [36, 36], "reviewtext": "I've owned my Palm Vx for about a year and a half now. Despite the hype over much higher priced units, I still think it's one of the best PDAs out there.What I Like 1. Memory, and lots of it. If 8 Mb does not sound like a lot, think of what you're using a PDA for. There's plenty of room for the phone book and appointment book. That's 80% of what I use my Palm for. I've never run out memory. 2. Lots of freeware and cheap shareware add-ons. The most useful is the new Palm PDF Reader from Adobe. I can take important documents with me as a PDF and have them as a look up document. Other nifty utilities I've picked up include a travel alarm clock with World Time Zones, IP Calculator and some neat games to pass the time. Coming on strong are text document readers and databases. 3. Good monochrome display with adjustable contrast. Sure color on PDAs is a hot topic, but from what I've seen, color is not worth it on a PDA. The color is poor and it really decreases battery life. 4. Built in rechargabe power and long battery life. No hassle with batteries: drop it in the cradle and it recharges. I've gone as long as three weeks without recharging.What I Don't Like 1. I had to add PocketMirror to synch with Outlook. When I upgraded my desktop, the Outlook synch was lost until I purchased a new PocketMirror. I have no gripe with the performance, I just wish this was a standard feature 2. No expansion capability. I know I said it has enough memory, but I wish I could add an MP-3 player or use SmartMedia for archive storage. 3. It looks so nice I have to watch out someone dosen't &quot;adopt&quot; mine!PDA's are what most people really need when they say they need a laptop. If you really do need portable spreadsheets or data bases and total e-mail management capabilities, you *do* need a laptop and no PDA is going to fulfill your needs. A PDA is a handy electronic version of the old standby appoinment book with some adapatability to other tasks. As for the current crop of hype topics: Wireless? It's a solution in search of a problem. Color? Keep it on the big screen where it belongs.", "overall": 4.0, "summary": "A Classic and Still The One To Compare Others To", "unixReviewTime": 997056000, "reviewTime": "08 6, 2001"}