{"reviewerID": "A6ZPLVAUQ6695", "asin": "B000031KIM", "reviewerName": "neurotome \"neurotome\"", "helpful": [54, 56], "reviewtext": "I am a busy doctor, a Macintosh user, and an avid Palm enthusiast.  Here is my bottom line: if you don't have a Palm Vx, you have to get one, right  now.The address book alone is worth the price of admission, keeping  hundreds of names, phone numbers, addresses, and e-mail addresses instantly  accessible (and categorizable and keyword searchable!)  The date book  instantly makes obsolete all those little paper-based 'pocket organizers'.  And the note pad and to-do list are just the thing for jotting this or  that.  Synchronization with a USB Mac is seamless and the Mac software,  based on Claris Organizer, is quite good.  (Be sure and buy the 3Com Palm  USB kit; other 3rd party USB-to-serial adapters I tried didn't work.)But  where the Palm really shines is in the 3rd party software, much of which is  free, that is available over the web.  Epocrates for doctors (a hypertext  drug guide a la the famous Pocket Pharmacopoeia) will become your portable  brain for drug selection and dosing.  And AvantGo, a service that allows  daily downloading of nearly any text-based web site into your Palm, is  highly useful; I use it for news (general and medical), sports scores,  current movie showtimes in my area, 5-day weather forecasts, and a daily  joke.  It eases the pain of spending 36 hours straight in the hospital.  Vindigo, a free city guide to restaurants and nightlife, is great but takes  too long to sync every day (adds about 5 minutes to a normally 2 minute  sync) so I took it off.There are also freeware amusements (Mulg,  DopeWars, and C.A. Explorer are currently installed on mine) and electronic  books (Victor, Adams, and Ropper's pocket neurology text, for instance)  that may be of use to you.  8 MB is plenty for all of the above - I have 4  MB to spare.The batteries recharge overnight in the cradle and last a  long, long time.  I would offer 2 caveats: 1,  Mac Outlook Express won't  interface with the nice e-mail app (Eudora does, though, if you want to  switch.) 2,  You can't just carry the Palm around in your pocket.  It'll  fall out onto the floor and the screen will crack.  Get either the Deluxe  Carrying Case or the Leather Belt Case.  I have one of each and prefer the  belt case for practicality and fall-proofing; if I was worried about  looking professional I might use the deluxe case in my white coat top  pocket instead.", "overall": 5.0, "summary": "Doctor, Mac User says: Gotta have it!", "unixReviewTime": 966556800, "reviewTime": "08 18, 2000"}