{"reviewerID": "A2SBFXPN5V6A6X", "asin": "1400699169", "reviewerName": "L. A. Dye \"700hpAMG\"", "helpful": [10, 18], "reviewtext": "Having all the iPad models, 9 different Android models, I can say this tablet overall is a bit disappointing. I realize for those that have come from old hardware or new to tablets might believe this is a bit harsh, but keep in mind this is more of a comparison to other options available out there. Granted there are price differences and for price alone, this is a decent deal.The hardware itself is impressive. Bought these for our 4 and 6 years which were upgrading from their Galaxy 2 7\" tablets. The most significant issue with these tablets is the B&N; version of an already outdated Android OS_Ice Cream Sandwich, not the latest Jelly Bean which is far far better. It is very clunky and very slow, not at all snappy by any sense, even with the latest updates. I did buy it as they finally put Play on it which was a requirement for me, but the OS itself is just horrible. It does have a kids profile mods which is very handy as it allows you to limit what your kids can open.Additionally, as this is an 'overlay' OS, it is very limited in terms of options. Sound options are none existent for various task such as switching profiles, etc. Many apps on the Google store will indicate not compatible with this device. I generally ROM my Android devices however CM10 is the only one at this time with any support and that ROM is very very buggy compared to say Frosty ROM which is not available for this tablet. It works, but again, not a smooth integration of a ROM. So really, your stuck with what B&N; puts on it and at this time, it is very slow and clunky. Now you can 'BUY' a card with Jelly Bean on it, but again, pulling off the card is slower vs. internal memory, though it does allow for a very simple method of getting a 'real' Android OS on this tablet and perhaps the best route at this time.For the kids, they still like the tablet, enjoy the better graphics, larger screen, etc. Once going graphics is good, sound is adequate though not great, touch input is good. But for me, I could never use this tablet for serious use. My Asus TF700T is my go to tablet, even over my iPad 4,3,2,etc. At this time I am contemplating just selling these and buy Nexus tablets for the kids instead as it is more a pure Android experience and not hindered by the clunky implementation of an older Android OS. Perhaps if B&N; releases an OS based on Jelly Bean it may improve things.Bottom line, there are far better options in the Android world.PROSGood resolutionTouch is goodGreat balance of size, not large nor small like a 7\" tabletHas Play installedExternal memory card optionCONSB&N; OS is horrible, slow, cluncky, and based on old Ice Cream Sandwich, not Jelly BeanSpeakers are just OKVery limited accessory options compared to even Kindle HD devicesCharger plug is very tight on both of my models. Perhaps it will loosen up over time. Never had a tablet exhibit this in the past.Lack of support from the aftermarket in terns of ROM availability.No cameraOld slow Wi-Fi hardware, and you will notice this. Download speeds compared to my other tablets is very slow.", "overall": 2.0, "summary": "Very clunky, slow, and outdated OS impedes good hardware", "unixReviewTime": 1369612800, "reviewTime": "05 27, 2013"}