{"reviewerID": "AM4ZQJ0IORVWG", "asin": "B000031KIM", "reviewerName": "Rob \"Revuman\"", "helpful": [46, 49], "reviewtext": "If you've been doing you're homework on all of the PDA's out there now then you probably have heard all about those &quot;palm&quot;top computer systems.  What I've found that is most disturbing about those palmtops is  that they have so much more than you need, are larger, have reduced battery  lifes and are about twice as expensive as the wonderous piece of equipment  I am reviewing now.The Palm Vx is the latest and, in my opinion, the  greatest Palm of all the ones that 3Com have produced.  Using the latest  version of the palm OS, this device comes loaded with 8 megs of ram, a  battery that will last up to a month on one charge, enough programs to  organize your entire life, and an easy to learn writing technique called  graffiti.  And although it may not be quite as accurate as on the more  expensive PDA's, it does the job, and there is also a built in keypad that  can be used to input information.Syncronization with your computer or  laptop is simple too.  Just place the palm in it's handy-dandy charging  station (which is included) and hit the HotSync button.  All of your days  notes, scheduals, information, and whatever is easily backed up to your  hard drive.  And anything that you add to the computer transfer program  will be uploaded to the palm Vx.  In short, the setup is easy, the programs  are user friendly, and did I mention it only weighs 4 oz!  Also, unlike  it's palm bretheren (mainly the Palm III's), which have a hokey plastic  casing, this palm has a very sleak magnesium casing that is both stylish  and that just feels damn good in your hand.However, it does have it's  downsides.  For starters, the built in IR (infrared port) is almost useless  beyond 4 inches away which means that the transfer function between two  palms, although nice, isn't very useful in most real world situations.  Hell you can't even beam a signal across and empty room.  Second, unlike  it's cousin, The Visor, which was produced by the company who had the  original idea for the Palm, it has no extra memory slot and therefore  cannot have extra memory added to it.  However, since there is not much  that would use all 8 megs on the Palm Vx, you wouldn't need to expand your  memory anyway.  And thirdly, expect to buy a real case for the Palm  immediatly after your initial purchase since all the palm comes with is a  cardboard cover in leather that is attached to a stylus pen and that fits  in one of the two pen slots on the palm.In general, I find that the  palm Vx surpasses it's more expensive competitors in every way; from price  to simplicity, from form to function.  And if you need to get your life in  order without dropping a boatload of money on a color screen and useless  extras, then this is your best bet.  And to put it simply, I wouldn't trade  my Palm for any &quot;palm&quot;top PDA if you paid me.If you're still  curious about the more complex PDA's, go check out my review for the  Cassiopia E-115.  Enjoy!Revuman:  Hey!  Can ya let me outta the screen  please?  peace!", "overall": 5.0, "summary": "The Best Organizer on the market, hands down", "unixReviewTime": 957830400, "reviewTime": "05 9, 2000"}