{"reviewerID": "A12A8LU93A132U", "asin": "B000031KIM", "reviewerName": "Steve", "helpful": [18, 22], "reviewtext": "The Nino with Case, 20MB CF card and battery weighed 11oz. The Palm Vx was  only 6oz with battery and slim Palm case.  The Palm was also about half as  thick and an inch shorter with the same screen size although an inch in  taken up with the writing area. I first bought the Nino because as a  longtime PC user, I thought that WinCE would be more versatile. I thought  Microsoft would win the battle of the platform, thoughts of Apple thorough  my mind. I didn't want to find that I ran out of memory before it could do  everything that I needed it to do. I found the Nino a palmtop computer  trying to be an organizer and the Palm an organizer trying to be a palmtop  computer. The Nino could do everything and was very expandable. It is a  hand-held computer, but it was just too darn big to carry around in my  pocket. I don't carry a briefcase or travel for business. I wanted an  everyday organizer to hold contacts, itineraries, notes, lists,  appointments, financial information, simple maps and do some calculations.  The Palm Vx does all this in such a small size. If I needed to use a  computer on the road, I'd buy a laptop. I don't need to edit Word  documents, do any database work, access the Internet, use multimedia or  color, read books or play elaborate games on it. I just wanted something to  hold basic information and do relatively simple calculations till I could  transfer it back to my computer. So far it does everything that my Nino  did, but with less memory. I still have 74% memory left. About 2.1 MB out  of 8 for the Palm vs. 15 MB out of 24 for the Nino (with CF card); the  programs use less memory. It my case, size mattered. I found I was never  carrying the Nino when I needed it. I'd leave it in my car. Overall, the  Palm does everything I need and want it to do. I do worry about  expandability, but so far it hasn't been an issue. If I had gone with the  Palm V I'd be in trouble. If you want something that could do those other  things, I'd just spend the money for a laptop. The Nino could do those  other things, but not very well, compared to a laptop. If they could cut  back on the size of WinCE or PocketPC devices I think I'd consider them.  Till then, I'm sticking with Palm.", "overall": 5.0, "summary": "Palm Vx Vs. Nino 312 (WinCE device)", "unixReviewTime": 966988800, "reviewTime": "08 23, 2000"}