{"reviewerID": "A1TFOXCKW4JHIB", "asin": "B000031KIM", "reviewerName": "Tony Ursillo", "helpful": [39, 39], "reviewtext": "You can read all you want about the specs on this thing.  Instead, I'm going to go at this review by giving you a flavor for how I use mine.  I've had my Vx for about a year and a half now.  I'm very computer literate, with a professional job in which I travel often, have numerous appointments and am on the phone regularly.  But until last year, I was married to my appointment book and Rolodex.  In fact, I carried my Rolodex (yes, the entire thing) with me on trips.  I finally gave up that circus act and bought a PDA.  All I can say is that I feel empowered now.  I have all my key information at my fingertips and the ability to add and delete, on a moment's notice, information like a new phone number or a change in the time of an appointment.I went with the Vx because of its sleek design.  It slips easily in and out of my pants pocket or suit jacket inner pocket.  The stylus is a bit dainty, but you have to deal with it to get the benefit of a thin device.  Graffiti is easy and fast enough once you practice a little - the menus are easily accessible if you need help figuring out how to make a particular punctuation mark or some symbol.  I find the hardcover is enough protection for the screen - no need to protect the entire device in another case.  The screen is defintely vulnerable to scratches, so be careful to only use the stylus when writing or buy some of those disposable plastic sheets that overlay on the screen.  It syncs very easily (one-touch in the cradle) and the battery will last for a couple weeks (probably 3 hours of usage) if you don't recharge it at all.  I'd recommend synching at least every week so that your information is safely stored on your PC in case you lose the Palm (a nice benefit of PDAs that obviously didn't come with my appointment book/Rolodex setup - :).  Note that you'll have to buy a cradle with a serial port (included with purchase) - I couldn't find one with a USB - so make sure you have a serial port on your laptop if that's what you'll be synching to, or you'll have to buy an adapter that would sit between the Vx and your laptop.What do I do with this thing?  Just to give you a flavor, here are some things I can do now that make my life a lot easier.  Since the Palm allows you to schedule a certain event on a recurring basis, I put an entry on my calendar for 7:30 p.m. on the 3rd of every month to change my furnace filters.  And I set the alarm on the Palm just as a reminder.  I also keep numerous memos, including one to write down any movies I'd like to rent when someone mentions a good one and another with Christmas ideas for my wife.  Finally, I record business expenses in it during trips, which makes filling out the reimbursement forms easier.Finally, make sure you enhance your Palm experience by checking out three sites:  AvantGo.com, Vindigo, and various shareware sites.  AvantGo offers information downloads from hundreds of sites covering general, business, technology, entertainment news, as well as recipes, jokes, airline schedules, etc.  I download main stories from cnn, reuters, cnet's technology, and NCAA College Basketball via the Sporting News.  Vindigo offers geographically based information - a way to locate restaurants, movie theaters, etc. just by telling your Palm where you are.  Much of the shareware out there is of marginal value, but I did download a neat little program that turns my Palm into a mirror (by blacking out the entire screen).In sum, I think the Vx is a great entry level device, especially at current prices.  In the long run, I worry about Microsoft's PocketPC operating system becoming more versatile (it probably already is).  But for someone moving from paper to digital, the Palm Vx is a low-risk, proven success.", "overall": 5.0, "summary": "A great device - you probably need it more than you think", "unixReviewTime": 1007856000, "reviewTime": "12 9, 2001"}