{"reviewerID": "ADP9OKUYOSYCW", "asin": "B000031KIM", "reviewerName": "Uri Raz", "helpful": [5, 5], "reviewtext": "Pros:A. Lightwight & small enough to be easily carried in a pocket. Just handle it gently - it's a delicate device !B. Lots of free or very cheap applications.I got a lot of my favourite games (pacman, space invaders, tetris, chess, etc) for free, and an excellent spread sheet software for $20.C. Infrared communication is great.I can exchange applications and data with other Palms, and even exchange info between my Nokia 3360 and the Palm's phone book (alas one at a time - a limitation imposed by the Nokia 3360, not the Palm).D. The 8MB of memory are plenty.I have an exchange compatible spread sheet application, games, a year's worth of appointments in the calender, dozens of book phone entries, a few spread sheets, etc, and use only 1.5MB.Cons:A. The major downside of the Palm Vx is that it is delicate.Though I kept the Palm Vx in the special leather wallent, the screen broke twice in eight months. As the warranty doesnt cover the screen breaking, I had to pay for the two fixes nearly as much as I paid to buy the Palm in the first place.B. Syncing the Palm to two different computers is problematic.This is especially troublesome to people who would like to keep the Palm, home computer, and office computer in sync.C. The cradle set is somewhat cumbersome.The cradle is used for both charging the Palm and to sync it with the computer. This means that when travelling abroad I have to either carry the whole cradle set (cradle, cables, and transformator which works with both 220V in Israel and 110V in the U.S.) or buy a travel kit.D. Many of the accessories for the Palm are expensive.A set of three styli costs $15, which is high for three pieces of plastic that are mass produced without human touch. A charging kit (just a transformator and a cable) is much more expensive than a charging kit for a cellular phone.", "overall": 4.0, "summary": "An excellent PDA with a big problem of being delicate.", "unixReviewTime": 1017187200, "reviewTime": "03 27, 2002"}