{"reviewerID": "A39V7MMKAIL55K", "asin": "B0000365CI", "reviewerName": "Jonason Keeton \"Jonason!!\"", "helpful": [174, 176], "reviewtext": "I must admit that I like having new electronic toys when they come out.  I purchased a digital camera in 1997 and was not entirely impressed by what 500$ got me then.  However, 3 years later, I stumbled upon the Nikon  Coolpix 800 at a great price and took another shot at digital  imaging.PICTURES: The pictures it takes are fantastic!  The 1600x1200  resolution really makes a difference when making prints.  They look like  they were taken with a 35mm.  This is not even mentioning the backing of a  quality Nikkor lens that picks up lots of detail other digicams of the same  resolution do not.  Another feature that impressed me was the fact I could  add additional lenses to it (and Nikon has 3 designed specifically for the  Coolpix 800/950/990).FEATURES: It has a lot of features of its bigger  brother like an uncompressed TIFF format, ability to take B&amp;W pictures,  and adjustable metering.  However, for a non-professional photographer, I  liked the fact the auto mode was easy to use and allowed me to take great  pictures right away.  I now can switch to manual mode to take more control  of the picture, but the camera is ready to take great pictures right out of  the box.  Unlike other reviewers, mine came with a paper manual in addition  to a CD-ROM that explained many of the basic features and taught me about  some of the more exotic ones.This is a great camera for anyone wanting a  digital camera that takes great pictures but doesn't want to spend ton of  money on features that may not even be used.  Otherwise, the CP990 and the  D1 are really nice cameras for those interested in more control.  I do  recommend getting an extra Flash card since 8 MB does run out fairly  quickly when taking pictures in FINE or NORMAL mode.  Getting a USB SanDisk  CompactFlash reader was also a big help since the built-in connection is  serial and can take a LONG time to download pictures if you have a lot of  them.", "overall": 5.0, "summary": "A great amateur digital camera!", "unixReviewTime": 955756800, "reviewTime": "04 15, 2000"}