{"reviewerID": "A1GYN77I2M4LQN", "asin": "B000038AB2", "reviewerName": "James L. Wilson \"wilson99\"", "helpful": [454, 456], "reviewtext": "I am a photographic and computer enthusiast and having these two elements come together is a delight for me. So, I have all the very expensive stuff, including KODAK's $20m commercial digital cameras. So, I know what quality  is and how much it costs. Bottom-Line as starters, the DC280 makes great  color shots with very suprising Hi-detail. The Advertisments say  &quot;good&quot; for 8x10 photos, however, as a very picky guy, when you  get past 5x7 print sizes, the pictures start to turn fuzzy. But the 5x7  prints are shockingly clear with brilliant colors. But, so what, how many  prints does one make larger than 5x7 anyway. This camera is easy to use  &amp; small, and I carry it on vacation locations, when I don't want to  carry my larger and heavier commercial camera. I was truly shocked at the  excellent picture quality of the 280. ALSO, KODAK includes great software,  so after a picture taking day/nite, one can easily connect to the yellow  video plug on your TV (or Hotel TV) for a slide show of the days  activities. I would recommend purchasing a 64MB memory card with the camera  purchase, so you'll get plenty of picture opportunities (75+ shots) without  having to worry about using up memory. In other words, since you can erase  shots you don't like, take MANY, MANY shots and pick the best ones you like  for printing or e-mailing. I bring my laptop with me on trips, so in the  evening, I can copy the photo-files to the hard disk, and erase the camera  memory card, in preparation for the next days photo activities. KODAK  provides serial, USB cables, and software to accomplish this simply.  Definitely do NOT buy a digital camera with less than 2,000,000 pixels.  (The older models, presently having good sale prices, are technology of 2/3  years ago, and you'll wish you spent the extra money for this camera).  Since KODAK has been the color business for 100 years, (well...50+years)  its no surprise that they have created an electronic imager (the CCD Chip)  with the BEST Color quality and detail. This is a must have, you'll not be  dissappointed. If you have another few hundred dollars, check out the SONY  or OLYMPUS dye-sublimation printers, which produce actual photo quality  continuous tone prints up to 4x5 sizes; These printers are not dot-matrix's  with all the little dots. The camera and the printer makes for a great  combo family gift for under $2m, that anyone in the family can use without  having to even turn on a computer, as the printer prints directly off the  camera memory card. SO that you don't make yourself craze, and since its  slightly different than a typical film point and shoot camera, be sure to  read the instruciton booklet, before pushing all the buttons. The  documentation KODAK gives you is very easy to understand, so take it slow  when you open the Box for the first time. It's so intuitive to use, after  the first 2 outings, you NOT need to keep going back to the booklets.  JLW/991203.", "overall": 5.0, "summary": "Excellent Color and Detail", "unixReviewTime": 944179200, "reviewTime": "12 3, 1999"}