{"reviewerID": "A1RVSPTDB45J2M", "asin": "B000038AB2", "reviewerName": "Nick \"ndoble\"", "helpful": [22, 22], "reviewtext": "Have you ever taken Kodachrome slides - the color saturation is upped a little, as is the contrast; everything is a little realer than real.  And why not. Kodak has had most of a century learning how to reproduce color,  and they have applied it to their new-fangled digital cameras.  You will  not believe what you see on the screen of your computer monitor - can a  digital camera really be this good?  It looks like a Kodachrome slide -  heck, it looks better!Printing is another thing.  The reason pro  photographers and serious ameteurs have preferred slides is because the  range of contrast is much greater than prints - prints can only reflect  light, not generate it, as can a slide projector or computer monitor.  So a  great deal is lost in going to prints in terms of light; and as even your  basic printer can print at 300 dpi, the lower resolution of the digital  camera makes its effects felt.  However, I find 8x10 prints at the highest  resolution of the DC280 quite acceptable (using a HP832c).  But the camera  cannot make uncompressed files - all files are JPEG compressed to some  extent, and the artifacts may show.This is a point and shoot camera;  no control of focus, shutter speed, or aperture is possible. The camera is  a little heavy, and you wish for hooks for a neck strap. You wish for more  buttons on the body of the camera, rather than having to go through levels  of menus.  The lens front is very vulnerable (and the lens cap is not  automatic) - it would be wise if the lens were protected by a protruding  metal or plastic guard, as some of Kodak's competitors do.I find the  battery life using Kodak's supplied metal hydride batteries quite  acceptable, particularly if you buy a second set; but the supplied  alkalines lasted only through the evening I bought the camera.I am a  wide angle person rather than a telephoto person, but in an ideal world, a  3x rather than a 2x would be welcome - 60mm (equiv.) is hardly telephoto.  This is basically a wide angle to normal lens.I've been a darkroom  photographer since 1952, and a sometime professional since 1959 - I am  delighted to see the end of chemical photography, with its dangerous  chemicals and the near impossibility for amateurs of getting good results  in color.  Now all you need is a digital camera and an ink-jet printer.  Prices are falling - give it a try!", "overall": 4.0, "summary": "digital kodachrome", "unixReviewTime": 961027200, "reviewTime": "06 15, 2000"}