{"reviewerID": "A1CIU572HUUE5A", "asin": "B000038ABH", "reviewerName": "Andrew Gorman \"Andy\"", "helpful": [32, 32], "reviewtext": "I really like this camera!  I am getting much better results (more natural and vivid colors) with my digital camera as compared to scanning 4x6  photographs--there is no need to worry about color adjustments!I  researched many cameras before deciding to buy. This one seemed to be the  best quality for the price.  The two main enhancements in this camera v.s.  the DC280 are the support for uncompressed pictures and the ability to  record audio annotations to accompany the pictures. These two features  swayed me to the DC290.  In all honesty, I find that I am not even using  these features.  The uncompressed format takes up way too much memory (you  would need to buy 128mb storage card to get around 16 uncompressed pictures  at the highest resolution). I have found that the best quality jpeg  compression produces fine quality (I can print great-looking 8x10s) and I  can fit 10 times more pictures on the memory card.The DC290 also has  slightly better max resolution (1,792 x 1,200 v.s. 1,760 x 1,168).  The  DC290 also supports a 2,240 x 1,500 resolution that is accomplished using  interpolation, but this probably won't produce any different results then  enlarging a 1,792 x 1,200 image using PhotoShop or some other software.I  have found that battery life isn't a problem (as some suggest) if you use  NI-MH rechargeable batteries. They seem to have a much better life than  alkaline batteries (rechargeable or not). I also limit my use of the  display, which is not difficult since I tend to prefer using the  viewfinder. This *significantly* reduces battery usage.  The only draw back  is that you can't use the digital zoom without the display.  This is also  not a problem for me because the optical zoom has been sufficient for my  usage. Also, digital zooming in general tends to produce poor quality  pictures, although I can't personally attest to quality of Kodak's digital  zooming.The one problem I have with this camera is the delay between the  time when the button is pressed and the time when the picture is taken.  It's a least a second or two, which makes taking action photos very  difficult--it's hit or miss with the timing.  I tried to use the burst  feature, but I found that to have limited usefulness. I was use to using  the completely manual, tried and true, Pentex K-1000 SLR. Without being  overburdened by a lot of electronics, there was very little latency. I  suppose going to any automatic camera, digital or not, could produce the  same frustration.All-in-all, I love this camera. It takes great quality,  high resolution pictures. However, I would also look at the DC280 as a less  expensive alternative.", "overall": 4.0, "summary": "Great Buy", "unixReviewTime": 966988800, "reviewTime": "08 23, 2000"}