{"reviewerID": "AVCLMVDU3FMSH", "asin": "B000038ABH", "reviewerName": "Kenneth Helms", "helpful": [55, 56], "reviewtext": "I'm just an amateur photographer but in the past 25 years I've owned three 35mm SLR cameras and two auto-everything 35mm cameras.  The Kodak DC290 is my first digital and it operates about the same as the auto-everything  cameras.  It can't do everything that an SLR and a gadget bag full of  accessories can do and it doesn't have the &quot;feel&quot; of an SLR.  But, it does 99% of what I want and produces beautiful photos.  I've had  mine for about four months and have taken almost 1000 photos with it.  Last  week I went to the USAF Museum and took over 300 photos, about 100 of them  with it on a tripod using shutter speeds of 0.5 to 3.0 seconds.  Fantastic  quality.  I bought an extra compact flash card (64M) and two extra sets of  NiMH batteries and took along my old notebook PC.  When the picture cards  were full, I transferred the photos to the notebook PC using a PCMCIA  adapter then erased the card.  That worked fine and I have not had any  problems transferring files to my home PC using the USB port either.When  you consider that we were spending over $200 per year on film and  developing anyway, going digital just made sense.  I like the ergonomics of  the camera and the menus are easy to use - just spend a few minutes with  the manual.  I was switching between a variety of modes at the museum to  get the best photos possible and it wasn't that difficult.  I haven't had  this much fun since I bought my first SLR.  Coworkers were amazed by an  8x10 portrait of my wife that I took with the DC290 and printed on photo  quality paper.  Kodak provides support through their web page including OS  upgrades to the camera's software.Recommendations:  Get a case and one  or two extra sets of NiMH batteries.  I haven't bought the AC adapter for  it but I can see how it would be useful to some because it takes about 8  hours to recharge the batteries.  The batteries will last longer if you use  the viewfinder instead of the LCD.  The LCD is essential for close up shots  and the digital zoom only works with the LCD.  A large compact flash card  is a good idea if you intend to use the best quality at high resolution  since the picture size in that format are usually around 500K.  The  graphics software that comes with the camera is OK but better programs are  available for any serious photo editing you might want to do.", "overall": 5.0, "summary": "Excellent Digital Camera", "unixReviewTime": 961372800, "reviewTime": "06 19, 2000"}