{"reviewerID": "A24EAAKE63MTM0", "asin": "B00003CWDH", "reviewerName": "Justin", "helpful": [1, 1], "reviewtext": "I bought this as a precaution for my home office area where I have my home networking devices and laptop set up. Surge protectors are tricky to review because you never really know if it really works until you have a power surge BUT I can provide you a few things  to keep in mind:PROS-1. Protection: rated at about 1500 Joules. For those of you who aren't particularly computer saavy (I admit I had to do some research on this) the higher it is rated, the more it can take before it fails to protect. For 15 bucks, 1500 joules of protection is a steal. Will it protect your belongings from a lightning strike on your ungrounded home? Probably not. Will it protect and prolong your devices from spikes and surges? Absolutely.2. Features & Functions: 8ft chord makes it adaptable and easy to locate an outlet for it. Ground indicator light makes me feel safe and secure ( I live in an older home while going to school and wiring is suspect). Protection light and auditory warning system nice touches to tell you if the unit needs replacing. Color coded outlets and included tags make it easy to identify wires. Coaxial a nice feature usually reserved for more expensive protectors and I haven't  noticed any Internet speed decreases from using it.3. Price: Mentioned before, but if you can get this unit for 15 bucks as I have, look no further.4. Extra goodies: Includes a Monster coaxial cable (if you are one of those people that HAS to have top of the line cables).CONS-Look: Purple and multicolored. This is purely a matter of opinion, but I prefer my other APC protector's matte black finish. That being said, it is a surge protector, not a fashion statement.1. Warranty: Do NOT be fooled by thinking just by purchasing you suddenly do not need homeowner's insurance. Monster is a business and as such WILL try to find a way to screw you if they can. Nothing against Monster, but a business is a business. They will not honor their warranty claims without making you jump through some hoops first. Read some other reviews on here for horror stories. That being said, this is the truth with most companies in this business.Conclusion: Monster hasn't developed a sterling rep for nothing. This is an awesome protector at a great price. In my opinion, they are second only to APC's protectors. But when you factor in the price compared to the protection, you really can't go wrong with this protector. I know I haven't.", "overall": 5.0, "summary": "Solid Protection For A Bargain", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}