{"reviewerID": "A1WV0XTJROAYGK", "asin": "B00003CWDH", "reviewerName": "Melanie C \"MC\"", "helpful": [2, 3], "reviewtext": "Ok, first off, this unit works well (though it does not have phone line surge protection, as others have noted). It is a larger unit, and doesn't 'hide' well, but it does have the cable F-type protector, so if you are looking for cable protection, this may be for you.That said, keep in mind, everyone is rating this unit 4-5 stars, and few have actually had a 'test situation' where you can actually address how it truly performs. It's like having a set of car tires that have never had a flat, because you've never been off-road or in rough areas, and yet you rate them as 'tough-as-nails on the trail'...how would you know?This surge bar is rated to 1480 Joules. What does this mean? Well, it means that it can provide up to 1480 joules of power before it 'pops', or protects your electronics. That is equivalent to 1480 watt-seconds, or on 110-v AC, about 13.5 amps of current.  What does this mean to you, the user? Well, it means that it will 'break' the circuit if more power than 1480-watt-seconds are sent through the line (normally, because of a storm, or a car-wreck into your local utility poles, etc.) What it will not do, is protect your electronics from mildly varying voltage swings...those that may even be deadly to your electonics. Why? because most day-to-day power spikes come in the form of voltage swings above 125-volts. For desktops and direct-ac monitors, 130-volts is the executioner's axe for them...and if you only have 5-amps drawn through your surge bar, a swing from 120-v AC to 130-v AC is not enough to trip the protection features of the surge bar...keep in mind, until you demand more than 13-amps at 110-v,(or more than a sum of 1480 watts are used or supplied), this bar will not stop it.Bottom line...surge bars are great for lightning protection...but if you think you have varying electrical voltage that is causing electronics damage on your system, get a plug-in voltage meter and check your provider's supply throughout the day for a few days.  If it goes over 130-volts at any time, notify them of this, and start looking for a regulated power supply or voltage regulator. These surge bars are NOT voltage regulators.", "overall": 4.0, "summary": "It works as advertised - But careful of ratings", "unixReviewTime": 1332979200, "reviewTime": "03 29, 2012"}