{"reviewerID": "A2D5UR2N8TYK17", "asin": "B00003CWDQ", "reviewerName": "Crackin4 \"Paul\"", "helpful": [3, 3], "reviewtext": "Well I decided to write a review on this product since I just had it blow and start squealing.I am rating it at four stars due to the fact I have to buy a new one.I have owned and used monster power surge protectors for years.  I have an older model HTS MKII 1000 that has functioned flawlessly for the past 5 years or so in Texas and Ohio now.  My home has had multiple power issues with storms etc in both states and never had a problem with it.  I also purchased the HTS 800 last year with a 60\" Plasma screen I bought and wanted to make sure I had it protected.  Attached to the HTS800 were a number of devices:  60\" Plasma Screen, Onkyo TX-SR-606 AV Receiver, PS3, HD Cable Box, CD Player, iPod Dock and DVD/DVR unit.  Well last evening as I was watching HD Television through the receiver I hear a audible click followed by a loader click almost immediately and all power in the wall unit went out and everything turned off.  I immediately heard a low squealing noise that I had never heard before.  I followed the sound to find it was coming from the Monster Power Center HTS800.  I immediately thought thankful that it turned everything off and found that I could not get it to reset the fuse or stop the squealing sound.  I then went on line and found a post that the another customer had the same thing happen and that it \"fried\" the unit and it would need to be replaced but it protected as intended.Well after plugging in my HTS MKII 1000 from my downstairs home theater system, I found that my Onkyo AV Receiver (TX-SR-606) would not come back on.  This unit has been giving me problems for a while with consistently reading a multitude of different Blue Ray players and ran very warm... could double as a space heater.  Looks like the receiver blew and from a reverse direction blew the receiver or the was a power surge that made it through (doubtful).  I just got off the phone with Monster Warranty Department and they were very friendly and courteous with me.  They will send out a claim package and will immediately send a replacement power center.  I am a fan of good customer service and monster has been a 5 star service so far.  I have a few understandable hoops to jump through i.e. fill out a claims package, get an estimate of repair for the receiver, etc but they could be sending me a check for repair/replacement costs.Now, I am not patient so I have already ordered a new AV Receiver (Pioneer VSX-1020-K due to CNET review/Amazon ratings) here on Amazon and yes i also bought ANOTHER Monster Power Center HTS800.  I believe it did its job, even though I can not reset it which is the only reason it is receiving 4 stars here.  I went with the same unit because of the sale price that I just could not pass up.  I would love to have bought the HTS MKIII 1000 which also had a great sale price, but it was almost $50 more and the 800 functioned as it was intended to protect the other valuable items in my home theater.PROS:  Sale Price, Customer Service, Lifetime Replacement Warranty on Power Center, Spacing of Outlets, Audible Alarm and Status LightsCONS:  Could not reset the unit", "overall": 4.0, "summary": "Monster Power, Power Center HTS800", "unixReviewTime": 1292976000, "reviewTime": "12 22, 2010"}