{"reviewerID": "A24RT6AVJXJZHF", "asin": "B00003CWDQ", "reviewerName": "John P. Thiel \"John P. Thiel\"", "helpful": [59, 65], "reviewtext": "The house I live in was built in 1939; they didn't have TVs back in 1939; the outlets aren't even three prong grounded except for one the landlord had to have put in with a higher capacity circuit to accomodate that new fangled gadget--the air conditioner.So when I picked up my new Sharp Aquos, 1080p, 42\" television I was very susceptible to the pitch that I should buy only the most expensive surge protector / line noise reducer possible, the more expensive the better--but I'm not a sucker so I didn't buy it right there and then.Next store, Best Buy, the salesperson recommends the HTS800 as the minimum, and he recommends more expensive ones but not with as much zeal.  The difference is that the Best Buy salesperson doesn't work for commission.  The logic is of course that if you're going to spend $1500 for a TV, you might as well spend another $100 or so to protect it from electrical surges and clean up the picture static caused by line noise in both our ancient power supply and by our cable provider.I find this on Amazon for no less than a 40 percent discount over what I can find it for anywhere else, and order it, but before I open the package I go to the Monster website to make absolutely sure this one is adaquate--and it is.  The difference between this and higher end ones is the capacity and the ability for the unit to not only shut off and sound an alarm when there's a surge, but also turn everything back on safely.This one will turn off everything that's hooked into it and sound an alarm, besides cleaning up the line noise, but that's as far as the description goes.OK, so I open the package and hook it up.  WOW.  Absolutely huge difference in the picture on the set.  I don't think a more expensive one would make a great difference or that it would be worth it for me--on my level of home entertainment--to pay more for a 'better' one.And then, one day soon after, I hear an alarm warning me about a dangerous surge, but it doesn't shut down the system.  Perhaps just to assure me, another day it does shut down the cable box only AND then came back on.But the real prize is the picture.  There is a huge difference between the quality of the picture on my HD television with this filtering the power and cable lines.  I'm thinking of buying another one for my old TV--a Sony Trinitron--because I'm sure it must make a difference there as well.BOTTOM LINE: If you live in a fairly new building, your electrical system is probably not as much of a hazard as mine, but might be just as noisy.  And surges are always a big risk, even if you have all new appliances.  For what you spend on items like televisions, stereos, and game systems, it's worth paying a bit more to protect them from the kind of damage that insurance wont cover--wear and tear--as well as allow them to perform as intended--better than they do while on display at your local electronics store in fact.This item will not only protect your sensitive electronics, but make them better as well.  Clearer images, clearer sound, and it's just plain smart design.Now that I have this one, I definitely would pay for the next level up from this model but I'm also confident that this is all I need.  A higher level one has more features, but for my home entertainment purposes I doubt it would really add anything.  If one day I really go all out in terms of buying a full home theatre system, I'll spend a couple of hundred dollars on the best one, but this one was made for people like me now who don't have such high end needs but want better-than-expected performance.", "overall": 5.0, "summary": "I noticed an immediate difference, and it adds peace of mind.", "unixReviewTime": 1215820800, "reviewTime": "07 12, 2008"}