{"reviewerID": "A3FHSLWEMH7JD8", "asin": "6301977173", "reviewerName": "Elizabeth G. Melillo \"gloriana\"", "helpful": [15, 26], "reviewtext": "This film is definitely not for anyone who is especially fond of the independent, delightfully manipulative and clever boy who was the brain child of Samuel Clemens's classic.As one example, the book has great  fun with the scenes involving Aunt Polly, a simple minded soul who thinks  herself quite clever, and the genuinely shrewd Tom, who plays on catering  to Polly's illusions about her own wit. This is a far cry from beautiful,  intelligent Celeste Holm's portrayal of Polly - and the family's poverty,  clearly seen in the book, disappears, as the Sawyers occupy a beautiful  home and are close friends with wealthy Widow Douglas.Some of the plot  is distorted in ways that remove the charm of the original. Tom's taking  off to &quot;play pirates&quot; after Becky jilts him is changed into a  troubled kid's escape after Aunt Polly tells him how &quot;no good&quot;  his father was - the humour, and the engaging portrayal of adolescent  &quot;first love&quot; is gone. The theme of Tom's learning responsibility  is overworked, and sequences that are hilarious in the book (Sunday school,  classroom, etc) are largely left out. The enchanting Becky Thatcher is  reduced to a tomboy. And isn't much of the picnic sequence ruined when a  gathering of kids is changed to a song-and-dance outing for families? (Tom  Sawyer is quite realistic in its setting forth that kids are far more  concerned with themselves than fretting about parents - let's not turn it  into a commentary on &quot;family values&quot; a la 1990s political  correctness.)Johnny Whitaker's singing voice has all the appeal of  chalk squeaking on a blackboard. His rendition of &quot;If I Were God&quot;  (aside from its text having nothing to do with the story - Tom's only  church interests are in time to play with his pinch bug) is pure purgatory  for the listener.", "overall": 2.0, "summary": "The best of Mark Twain's work - left out!", "unixReviewTime": 958089600, "reviewTime": "05 12, 2000"}