{"reviewerID": "A2I6MHMAZZDCRX", "asin": "6301977173", "reviewerName": "Mark Baker", "helpful": [1, 1], "reviewtext": "I hadn't heard of this 1973 movie version of the classic Mark Twain story until recently, but I absolutely had to see it.  After all, it had music by the Sherman Brothers (best known for their work in Mary Poppins).  And I love a good musical.The book stays very true to the novel.  Tom Sawyer (Johnny Whitaker) is a young boy growing up in 1840's Hannibal, Missouri.  An orphan, he's being raised by his Aunt Polly (Celeste Holm).  And he is quite the handful.  He regularly plays hooky to fish and swim with best pal Huckleberry Finn (Jeff East).  He constantly lies to get out of trouble, too.Through this movie, we watch as Tom struggles with his conscience after witnessing a murder in the cemetery.  He tricks the boys in town to white washing the fence for him.  And he develops a crush on new girl Becky Thatcher (a young Jodie Foster).  But will Injun Joe (Kunu Hank) get his sworn revenge on the boy?This movie is extremely faithful to the book, hitting all the highlights of the classic.  Frankly, that was a problem for me since it took a little while to get going.  Once I got into the story, I was hooked and really began to enjoy the tale.  The scenery and costumes recreate the times well.  And the acting was pretty good.Unfortunately, I found the songs disappointing.  They weren't bad, but they weren't good either.  They aren't especially memorable or singable, and they don't really advance the story.  I would rather rewatch this movie for the characters and adventures then the songs.Despite that rather major flaw for a musical, I must admit to enjoying it.  It has a sweetness and innocence that I enjoyed.  And the songs are easy to overlook since they aren't a major part of the movie.  So if you are looking for a fun version of the classic tale, you can do much worse than this one.", "overall": 4.0, "summary": "Take a Gander as Tom Sawyer Sings", "unixReviewTime": 1210032000, "reviewTime": "05 6, 2008"}