{"reviewerID": "A3DGJMO6VPG6FJ", "asin": "B00003CWDQ", "reviewerName": "Wendy & Jeff S", "helpful": [0, 1], "reviewtext": "UPDATED REVIEW:Let me say - I'm not a knee-jerk reactionary who goes around trashing products for no good reason. In fact, I get a little annoyed when people post 1-star reviews because they happened to get a 1 in a 1000 bad copy.Well, sometimes enough is enough. I ordered two of these and one was DOA as described in my original review. Hey, these things happen, right? So Amazon (not Monster) sent me a replacement. It worked. Forgive and forget. Well, because they were such a good deal, I ordered a third one. Unfortunately, I did not have a need to open it up and use it until today. Guess what? Another screaming piece of junk. 2 out of 3 DOA!  And of course it's far too late to send this one back. Monster's credibility has gone right down the toilet in my opinion (although I did also buy one of the big component boxes for my stereo rack and it has performed admirably, but I'm done with their \"power strip\" models. 2 out of 3 defective units is just poor design and horrible quality control.So, there may be a reason the price of these has really fallen.Feel free to take a chance, you might get a deal, just make sure you test it as soon as you get it instead of sticking it in the closet like I did.ORIGINAL REVIEW (3.5 stars):Because of Monster's self-proclaimed reputation, it was a bit surprising to find that mine arrived DOA. In reading the reviews, it seems this is more common than it should be. After nearly killing myself on the horrible blister pack and hooking up all my equipment, I found that the alarm was always screaming when the unit was plugged in. It was NOT the electrical service in my house.It arrived on Saturday, so when I called their customer service number, naturally they were closed. So I took the easy way out and returned it to Amazon (AMAZING service. Reported on Saturday, UPS picked up the broken one on Monday, and new one was delivered on Tuesday. No hassle. Thanks, Amazon!) New one seems to work fine.Does it improve the video and sound quality of my (all digital) home theater? Who knows. I don't want to get into that debate, but I do feel you'd have to have very high end equipment and ears to match, or have especially dirty electrical lines, or do a lot of analog in order to definitively tell.I wouldn't come close to paying MSRP, but at the fantastic price Amazon is selling these for, who cares? It's a nifty little device that offers a little extra peace of mind for only a couple of bucks more than a generic surge protected power strip.Note that it also protects your phone line (mine's VOIP, so it might not matter) and TV/Satellite cable. It includes a set of Monster cables for each (a claimed $27 value. I think it's an actual value of less than half that, but still, the cables alone make up for the price difference between this and an imitation power strip.) The stickers they give you for labeling your power cords is a nice touch too.Note: neither of the two I received was blue, as in the photo. It's dark on the bottom, and an odd halfway between gold and silver on the top. I would have slightly preferred the blue, but it's hiding behind the AV rack anyway.I'm docking them a star because of the first piece of junk they sent, and I can't scientifically attest to the quality of the results, but based on their claims, the extra peace of mind, bonus cables, and low price, this is a great deal. I'm going to buy a few more.", "overall": 1.0, "summary": "Absolutely dreadful quality control! Beware!", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}