{"reviewerID": "A291XTI6NO7DEG", "asin": "B00003CWDU", "reviewerName": "B. T. Denyer \"UX Designer\"", "helpful": [10, 11], "reviewtext": "I mainly bought this for its reliability, # of outlets and (most of all) the CleanPower feature.  Funky / dirty AC power is one of the leading causes of shortened life expectancy for electronics.  Some things I noticed:Yes, it is plastic, but it has that good, thick plastic feel, NOT the cheap thin stuff that seems like it would crack when dropped.It can be hung in virtually any direction (horiz, diag, vert) from two screws/nails by two plus-sign (+) hole patterns on the back of the unit.The cord is long and thick.  The plug is a wall-hugging 90-degree angle type that can be used in either the top or bottom outlet receptacle.  Huh?  It is not only wall-hugging but it doesnt hang straight down from the receptacle - imagine you plugged this into a clock face: the plug would be angled toward the \"4\" or \"5\" on the face so that you aren't limited to plugging it in the bottom plug.  You could actually have two of these plugged into the same outlet.  Enough about that...The plug connectors are REALLY tight fitting.  You'll see what I mean when you go to plug in the computer or whatever.  ALL Monster outlets are this way, and are intended to help keep the plug from falling out or being ripped out by accident.  Another way Monster Cable thinks about the small things that bug us.Mine came with a phone cable that was a couple feet (or so) in length.  Cool, now I can plug the fax through the connectors on the unit.  (Nothing to report there.)The power switch lights up in red.Comes with labels to help indentify BOTH ends of the power cabes you are plugging in.The three \"transformer\" positions are great for those old box plugs for the cameras and such.  Plenty of room built in.I HIGHLY recommend this unit for your computer!", "overall": 5.0, "summary": "WOW!  Solid construction, almost overkill.", "unixReviewTime": 1153267200, "reviewTime": "07 19, 2006"}