{"reviewerID": "A2J9NEE5C5D2AU", "asin": "B00003CWEI", "reviewerName": "+++", "helpful": [81, 86], "reviewtext": "It may sound somewhat surprising, at first glance, that a short piece of cable between your TV and DVD player can make a noticeable difference in the picture quality, but once you compare a cheap cable with a good one,  you'll see that there is a difference! My DVD player came with a very  cheap-looking cable with three RCA connectors on each side, and I used this  cable to hook up the DVD player to the component (RGB) input of my TV  before doing anything else. I dismissed this cable immediately as the  picture was much noisier than I expected. A $15 S-Video cable performed  better. However, I had to adjust the settings in video equalizer of my DVD  player to increase color saturation, and also had to decrease sharpness of  the picture to make noise unnoticeable. Finally, I bought the Monster cable  (don't tell my wife about it!). This cable resulted in a perfectly sharp  and clean picture without any adjustments in the CD player. Due to  double-shielding of this cable, there was no sign of the noise that I saw  with the S-Video cable either.I do not know if there is a noticeable  difference between this cable and a less sophisticated one that may cost  half of its price. I guess, everything depends on the kind of TV and DVD  player you are using. But I can say for sure that my experience convinced  me that there is a tremendous difference between this high-end cable and  those from the very low end.The last thing: I do not think that it  makes any sense to use such an expensive cable for a connection other than  component video (Y + two color difference channels), also called  &quot;color stream&quot; by Toshiba. If you do not have a component video  input, use either S-video, or composite video (Video+2 audio connector). In  the latter case (or if you need a cable to connect your VCR) a cheaper  cable would do. This one is worth the money only if you do not want to  settle for anything less than perfect.", "overall": 5.0, "summary": "top of the line product", "unixReviewTime": 963014400, "reviewTime": "07 8, 2000"}