{"reviewerID": "A3KCFRTFNBGV3L", "asin": "B00003CWFA", "reviewerName": "Pilgrim", "helpful": [54, 58], "reviewtext": "This cable really isn't that flat - it's about 2 to 2.5 mm (1/10th inch) thick, and 14mm (0.55 in) wide.  (The thickness dimension at the Monster site is wrong.)  Not really enough thinner than regular wire, and not space-efficient (see below).It may be best for running along baseboards, etc.  It's a little too thick to run under most carpets, or to paint and have it actually disappear.Monster doesn't like to tell you the gauge of cables, but these are 16 AWG.  Which is just fine for up to about 40 feet, maybe more.  Google speaker wire for some discussion on what size wire you need for a given distance from the receiver to the speaker.The design could be improved, maybe that's why these are sharply discounted lots of places.  As noted, they aren't at all Superflat.  There's a chunk of plastic down the center that seems unnecessary - maybe it's there to provide a place to attach (nail, screw, staple), but it's just taking up space that could have been used to make the wire flatter instead.If you're willing to pay a lot more (about $1/foot) you can get truly flat speaker wire.  But, since this cable is available for a fraction of list if you look around, it might suit your needs for a specific installation.The color is an off-white, with a slightly yellowish tinge.  Sort of a cream color.But - and here's another design flaw - one wire is marked on one side with a silver line, with \"Superflat Mini\" and a bunch of other text every foot.  It's much more than is needed to mark the polarity of the wire (to make sure you connect + to + and - to - on the speakers).  So it means that only the unmarked side of the wire is really usable - a 90 flat turn on a surface flips the text out onto the exposed side of the wire - unless you plan to paint this.The SFLM GP50 package includes 4 red/black pairs of straight termination pins, crimp to attach.  They don't seem designed for this wider wire, though - they're really meant for standard round wire.  There are also 4 clamps (to hold the wire to the wall) and 2 \"corner trim\" pieces (for making a 90 turn by folding over the wire and putting it into the trim).  Not enough clamps for a whole run, if you use them, but might be handy.File this under products that could be a lot better.", "overall": 2.0, "summary": "Ok for some applications, but not really well designed", "unixReviewTime": 1172102400, "reviewTime": "02 22, 2007"}