{"reviewerID": "A1ITCVZ46MUB3A", "asin": "B00003CWG3", "reviewerName": "A Hot Whizzer Summer...", "helpful": [9, 9], "reviewtext": "The point many people need to understand when purchasing a splitter is that spitters split you signal. Every split that occurs reduces the quality of that signal. Buying a better 2 GHz splitter such as this one may reduce the loss of signal quality, but do not expect miracles, after all, you are still splitting a signal without adding any power yourself.The splitter probably will not improve quality in the following conditions:1) You replace a splitter with a better one, but your tvs already have the best quality they can with the split they have.2) You replace a splitter with a better one, but the tvs require a rather low signal anyway, so any split would go unnoticed.3) The signal arriving at your house or apartment is already weak, in which case the splitter would not do any good.4) You are adding a splitter to a system that does not have one.In these conditions, you may see the best improvement:1) Have a high signal demanding system, such as digital cable, tivo, and hdtvs.2) Have your cable split to the limit, very low quality video when normally splitting.3) Have an internet line, one of the best parts of this splitter is for internet usage/tv splitting, may see an increase in speed of internet.Given these criteria in mind, I had a good experience with this device. I moved into a new apartment, which had relatively bad signal. I wanted to split it three ways, into my computer tv tuner, my digital cable box + tv, and a tv in my bedroom. I purchased this teamed with an 18 db signal amplifier (what actually does add power to a system). The signal clarity improvement was minimal, which I believe is because my apartment building does not have a very good signal before it even reaches me. However, before adding these devices, I could not plug into my computer without completely losing my signal to the point i could not watch it. This was of course with a cheaper cable company provided splitter. After replacing the splitter and adding the amp, I could set my computer up, and have all three devices on and using the cable without seeing a single drop of signal degradation.Think what you will, but I say this device is a noticeable improvement. It all depends what you think a signal improvement is worth and taking the chance that you will meet the criteria for the signal improvement. There is no for sure way to predict if a better splitter will improve your video quality. You just have to try it and find out.", "overall": 4.0, "summary": "What could you expect?", "unixReviewTime": 1183334400, "reviewTime": "07 2, 2007"}