{"reviewerID": "A2IKA32YQXLDUF", "asin": "B00003OPEU", "reviewerName": "John Ellsworth", "helpful": [5, 5], "reviewtext": "Late this summer, I was driving a rented minivan from Mendocino, CA, south to the Bay area. It's about 180 miles. I was with three other adults and three children. Instead of taking the recommended RT 128 southeast to RT 101 and south to the Bay area, we decided to take a \"shorter\" route, due east on Lake Road to RT 20 to RT 101, then south. Well, the road we chose went through deep redwood forests. More often then not, we could not see the sky. There were times when the road was no longer paved, at times rutted. It was so narrow that for most of the way it would have been impossible for two vehicles to pass (fortunately, no vehicles came our way). The road often snaked around tree trunks as large as 10 feet in diameter.This road was on both our AAA map and GPS (I had preloaded the corresponding map onto my 64mb data card from the MetroGuide CD). The going was very slow, and our \"shorter\" route soon became the \"longer\" route. We were too far along to turn around. My wife, seated in the back held the portable phone ready to call for assistance. I asked all to wait, to put her trust in the GPS. After another half hour, we came to a three-road junction--all narrow and un-maintained. One of the roads was not on the AAA map. Intuitively, it looked like the least likely road. But the GPS indicated this road would take us to the RT 20. We took it, and before you knew it, arrived at the conventional RT 20. The GPS saved the day.One of the greatest attributes of a GPS is that it allows you to explore, to go where you normally would not, and discover new vistas. Obviously, my eMap proved that.Besides this general function, there are several specific features I like about the eMap. These include its portability and its ergonomic design. The eMap has a relatively large display (which can be backlit) and it is light, just over 6 oz. When walking with this unit in a town or on a trail, I appreciate being able to hold and control the unit with one hand while always having the display in view. This is a result of the control buttons being below the screen.The eMap is compatible with Garmin's downloadable MapSource CDs. These include U.S. Roads and Recreation, WorldMap, U.S. Topo, and MetroGuide U.S.A. With the MapGuide U.S.A. CD, the eMap can look up addresses and telephone numbers for nearby services and points of interest. I like being able find a particular restaurant or street address by entering it under the find feature, then tracking it. An arrow will point in the right direction and distance will be displayed.There are many available accessories, several which I recommend. I needed a larger data card. The unit comes with an 8mb card which will give you one region. This is okay if you will be using it in a limited radius. If you go elsewhere, you'll need to load new data using a serial cable (another accessory). It is time consuming, which may suggest your getting another accessory, the Garmin's USB data programmer. I have a 64mb card which captures from Massachusetts to Maryland (8 regions). Using the serial cable took over two hours to load the data. Using the programmer took about four minutes.I definitely recommend this unit. Its portability, versatility, its adjustable detail, and its accuracy give you the confidence to venture places without getting lost. One suggestion though--don't give up the paper map. Use it to provide the fuller perspective a portable GPS lacks.", "overall": 4.0, "summary": "Off the beaten track--with confidence!", "unixReviewTime": 1041379200, "reviewTime": "01 1, 2003"}