{"reviewerID": "AHU47OI4QXLEK", "asin": "B00003OPEU", "reviewerName": "Shopping Ghoul", "helpful": [8, 9], "reviewtext": "This is a great GPS, handy and rugged. The display is larger than its more expensive counterpart. To really make yourself a road warrior, you need to get the Mapsource CD's and at least a 16 Meg card. The whole state of Michigan took lest than 12 meg, including the great lakes. Also, get the combination Cigarette lighter power adapter and data cable, [...] has it for a great price, amazon doesnt sell it. Remember the cable has to say EMAP on the box, the other combo cable has a round end and is for the Street pilot and other systems.A carrying case would be handy, but the cover of emap is pretty rugged, I've dropped it a lot and not a scratch on it. The backlight is a bit dim, but its usuable. Beware of the Mapsource CD's though, they are not the most accurate, and Garmin only updates the map software interface, not the maps themselves (as of this writing , 1/29/01). And of course, no refund of software. Thanks alot garmin, get your act together..The mapsource CD's are pricey ($99 for roads and recreation and $179 for Metroguide which you can find stuff by address).I also suggest getting the suction mount for your windshield (thegpsstore.com, amazon doesnt carry it), it holds the emap in place and lets you swivel it around. The combo power/data cable is long enough to reach my windshield from the cigarette lighter port on my Taurus.All around, its a great device for the road warrior and traveler, the waterways mapsource cd even shows shipwrecks so you can dive for sunken treasure (the emap isnt water depth resistant, so leave it on the boat).One caveat though, it doesnt work well indoors. Its built in antenna isnt that powerfull if you're under more than a car-roof. Luckly it has an external adapter port.Hope this helps.", "overall": 5.0, "summary": "Nice GPS, but the Accesories will kill ya..", "unixReviewTime": 980726400, "reviewTime": "01 29, 2001"}