{"reviewerID": "A2TLLMXNKFCHJ7", "asin": "B00003OPEV", "reviewerName": "Enchanted Tiki Room", "helpful": [41, 44], "reviewtext": "This is a nice unit, and it is interesting to read the glowing reviews of customers who have owned the Garmin eMap for two or three weeks. I have owned the unit for over a year. It works well in the US. It will not guide you street by street to a location, but it will guide you &quot;as the crow flys.&quot; You get a straight line between you and the destination. It works.It does not work well in Europe. I purchased the UK and French CDs. I installed them on the memory card and used them in England, Wales, and all over France. The first problem is that the Garmin eMap just doesn't pick up or hold on to the GPS satellites in Europe very well. It may be that they are too far south or that the antenna is designed for use in US latitudes. I have no explanation but if you intend to use this in Europe, look for another unit.The second problem is that even after loading the UK and French MetroGuides, when you press the Find button you get a list of US cities. I disabled the US city maps and I still got the list of US cities. You cannot &quot;Find&quot; and navigate to a foreign city. The only way to navigate is to know where the city is, then scroll to it on the tiny eMap screen and click on it. If you don't know where the city or tiny Welsh village is, then you are completely out of luck. Very frustrating either way. Again, if you are travelling out of the US you should steer clear of the eMap.My other problem is with Garmin's service. I could not get my eMap to communicate with my laptop. It communicated with three different workstations, but not my Dell laptop. Garmin tech support insisted that there was obviously something wrong with my laptop. I even read them the error messages from the MapSource program, which cited program line numbers with errors in them. They insisted that the problem was my laptop, not their software. I own my own software company, so I know a software problem from a hardward problem. My modem and PalmPilot work on the laptop but the Garmin does not. Garmin's support staff refused to help or even acknowledge that there was a problem. They refused to bring the problem up with a senior support person or a programmer. I got the same answer no matter how many times I called and no matter who I spoke with. A year went by and I got along by using a workstation. Recently Garmin made an update available for their MapSource program that fixed a communications bug with some laptops. I downloaded it and magically my laptop started communicating with the eMap.If you never need customer support, and you won't travel out of the US, then the eMap is a product you should seriously consider.", "overall": 2.0, "summary": "Not useful in Euorpe. Customer service stinks.", "unixReviewTime": 981849600, "reviewTime": "02 11, 2001"}