{"reviewerID": "A53GY0OZJZFZE", "asin": "B00003WGP5", "reviewerName": "Giuseppe A. Paleologo \"gappy\"", "helpful": [23, 36], "reviewtext": "I am still quite new to the magical world of GPS. I should add that I have used the little garmin, but don't own one. This, I hope, cools a bit the potential excesses of owners' reviews. I will divide my remarks into two  groups: i) general considerations about &quot;value&quot; GPS; ii) opinions  about the performance of this product.About i) I'd say that this is a  good product to start with. It has no map download ability. Yet, I used to  locate points in a city I don't know well, to find your car in a praking  lot, and to find my way back after a long drive. I can't really say how  useful such device is for hicking or sailing, although I believe it could  be a great help. Having a map of your city/area is much more useful of  course, but portability and cost suffer. Finally, this is a great first-aid  device, and a very enjoyable toy (many functionalities like speed etc. are  not that important, still they add to the fun).About this specific  system, the jury is still out. The case is very resistant and handy, but  the ergonomics is less than excellent. We are all used to front buttons for  portable appliances, like in cells phones and Palm pilots, and garmin's  seem awkwardly placed and just don't feel right. The screen is OK, but I've  seen brighter screens. Another drawback of the system is the limited  battery lifespan. 15 hours is really too short.Before I buy my GPS,  I'll try the Magellan 310, which unfortunately is not offered by Amazon  (yet! ). I't similarly priced, slightly bigger, with larger buttons and  longer battery lifespan. I would appreciate if some reader could send me  their experiences.Yet, all in all, this is really a great toy, useful to  commuters and hickers alike, and still quite affordable. As a gift, I'd  recommend it without hesitation. But if you are a conscientios consumer,  I'd suggest that you explore all your your options.", "overall": 4.0, "summary": "Good, but consider other options", "unixReviewTime": 960681600, "reviewTime": "06 11, 2000"}