{"reviewerID": "AHYETNMIB00GK", "asin": "B00003WGP5", "reviewerName": "Jacquelyn Lavaque \"buzzygirl39\"", "helpful": [118, 120], "reviewtext": "I purchased a yellow Garmin eTrex GPS about a year ago. My main reason for buying it was because I learned about the sport called 'geocaching', and, knowing little about these devices at that point, I purchased one on the advice of a couple of friends. I used it heavily for for about 5 months before coming to some conclusions about this device's capabilities.I will first list the yellow eTrex's good points:- It's cheap-- one of the cheapest GPS receivers you can find.- It's easy to find-- you can buy one at Target, or at most any sporting goods store.- It's durable. You can drop it several times or dunk it in water, and it'll still work (dry it out first before you attempt to use it again).- It has an interface to hook up to your computer to download new firmware and to download geocaching waypoints, if you have the need for this.- It's easy to use and very intuitive for first timers.Now, its drawbacks. Realize that I am rating this device from the viewpoint of a geocacher, and we're probably the most demanding users of GPS receivers out there:- It is not an accurate device if you're attempting to get a definitive lock on a waypoint within 50' of your goal. Once in the general search area, the signal will likely bounce around and give you wildly varying readings. For example, if you've entered a waypoint and get within 50' of your search area, expect to find readings bouncing around from 5-50 feet with each step you take. I used this unit in varying terrain, under varying tree/bush cover, under varying weather/cloud conditions, and in varying temperatures, with the same results. I was able to obtain two other samples of this receiver, and those tests came up with the same results, so I surmise that my eTrex wasn't just an errant sample of these receivers. Upgrading the receivers' firmware did nothing to help the accuracy.Granted, my experiences with this receiver probably won't matter that much to most of those who will purchase this unit for tasks such as finding your way around while camping, hunting and hiking. For those uses, this unit will work just fine. However, if you're a geocacher and want a GPS unit that will pinpoint your goal effectively, without bouncing your readings from 5-50 ft. as soon as you walk two steps any direction, you will want a GPS unit that has WAAS capabilities (wide area augmentation system). I now have a GPS receiver that has WAAS, and it provides a much more stable lock when in the area of my intended goal.In short, I found this unit to be frustrating to use for geocaching. There are other GPS units that will provide more stable signal-lock than the Garmin eTrex for close to the same price.", "overall": 2.0, "summary": "Cheap, yes-- but not a good option for geocachers", "unixReviewTime": 1111881600, "reviewTime": "03 27, 2005"}