{"reviewerID": "A234GO3KZYKKTE", "asin": "B00003WGP5", "reviewerName": "Nikwax", "helpful": [42, 47], "reviewtext": "Garmin designed this unit to be a rugged, low cost, small, easy to use GPS, with good basic funtionality for casual users and beginners...and that's exactly what it is. It is water and vibration proof (mine is mounted on the handlebar of my motorcycle) and fairly simple to navigate through its menus. The display is readable and gives easy to use information, yet it easily fits in a pocket and the palm of the hand for one handed operation.This is not a &quot;super-deluxe navigate the highway systems know where all the gas stations are&quot; unit. It is a basic unit designed for backpackers, canoers, campers, snowshoers and skiers. You can mark waypoints and save tracks (a record of your movements) and backtrack over a track easily. Any time it is on, it leaves a virtual &quot;trail of breadcrumbs&quot; that makes it easy to go back the way you have come.Limitations? Remember, this is a basic, low cost unit. The main limitation is memory (lack of). A long trip (e.g. a highway trip) can easily consume all of the unit's memory, so that you run out of storage space for tracks. Way points are limited to six character descriptors, and trying to come up with something that makes sense can be challenging. You cannot download or display maps with this unit.All that said, I've had mine for a couple of years, and find it very handy for traveling in unknown to me waterways and trails. I also used it on a recent long distance motorcycle tour and found the trip distance, altitude, average speed, and compass features super handy, and easy to scroll through with one hand.If you are like me and want a rugged, basic, accurate, easy to use GPS unit that doesn't consume your entire bank account, then this is s great unit. It's also a great place to start with GPSing to see if you like it/need one/want/one, and will help you know what you want to see on the next GPS that you buy.For the money, an unbeatable buy!", "overall": 5.0, "summary": "very good for what it is", "unixReviewTime": 1010793600, "reviewTime": "01 12, 2002"}