{"reviewerID": "A2A2JYDOR6GJ3E", "asin": "8862935293", "reviewerName": "Amazon Customer", "helpful": [3, 3], "reviewtext": "I've used this cover with both a Kindle (Generation 2) and a Nook. Surprisingly, this case is better designed for a Nook for two reasons:>>The sleep/power button location. On the Nook, the button is on the top center so none of the four corner holds block any button or access port. However, on the Kindle the button - which requires a slide, not a press - is towards the left of the device top and is covered slightly by the top left corner hold. This isn't a deal breaker for me, but I was very surprised at it because its being marketed for the Kindle! So when I want to wake up my Kindle I have to move the corner hold, slide the switch, and then readjust the corner hold. Not easy to do because the hold has a lot of (good) tension.>>5 way directional key. The notebooks that are included with this case slide into the case from the top and still have room to move both left and right. Because of the lining of the case and the thin cover of the notebook, it slides easily but I've never had it come out. I have however had it slide far right inside the cover, and then when I shut the cover it's at such a position that it hits the 5 way directional key and starts to advance chapters! I thought it was just a fluke at first, but then it kept happening. If I do not adjust the position of the notebook or force the Kindle into sleep then the notebook hits the key every time now. The Nook lacks this 5 way directional key entirely, so again - no issues there. (This issue might also be contributed to the \"breaking in\" of the case so that the spine is not rigid anymore and allows the front to move at angles. I don't believe I've been rough with the case though, so I can only assume its common wear).I also want to through my hat into the ring in regards to the less than compact design - though in truth I don't think it could have been any slimmer without causing negative pressure to the devices when closed.", "overall": 2.0, "summary": "Design works better with a Nook than a Kindle.", "unixReviewTime": 1284595200, "reviewTime": "09 16, 2010"}