{"reviewerID": "A3URVWPFJOHT72", "asin": "B00004L8IG", "reviewerName": "zlionsfan", "helpful": [4, 4], "reviewtext": "I started using Logitech trackballs several years ago and have never been disappointed with them - in fact, I find it hard to use computers that have traditional mice! Recently, my TrackMan Marble gave out, and I replaced it with the TrackMan Marble Wheel. I found it to be a quality product as well.Having used a TrackMan before, my thumb already was conditioned for use, but I still had to adjust the mouse settings in the Control Panel to make sure I could reach all parts of the screen. I have a little difficulty because I'm missing some muscles in my right hand, but I can still use the TrackMan well.  I also appreciated the customizable buttons - the wheel doubles as a third button, which I use as a double-click button. There are many other options available, including the ability to switch the click and right-click buttons if you wish. I was disappointed to see that Logitech didn't make this a four-button mouse; I would have liked to see the three original buttons (from the TrackMan Marble design) remain and have the wheel/button be a fourth button. Also, I found the wheel to be a bit more difficult to use as a button - I tend to scroll as I click from time to time, which causes me to open things I didn't want to open.The wheel is very valuable - I found that I missed it immediately when I went to a computer without one. The wheel makes scrolling much easier in applications, and you can set the scroll amount from the Control Panel as well, although you may have to find a compromise because you can't set the amount separately for separate applications.The quality is excellent. You certainly won't have to clean it as often as traditional mice, although it still needs to be cleaned periodically (or more often, if you're into Diablo-type games). Cleaning is easy - just insert the tip of a pen into the little dot on the mouse, and with a turn, the retaining ring pops out and the ball can be cleaned.You can use this in a USB port or as a PS/2 mouse; however, if you plug it into a USB port, understand that you may have difficulties if you have several USB devices or if you have an intensive device like a Zip drive connected. I've rarely experienced problems, but on occasion, if my Zip drive struggles, it locks up the mouse as well. This is more of a USB issue than a Logitech issue, though, as you can tell from reading the Iomega Zip reviews! Just keep it in mind.I've never felt bad after buying a Logitech mouse, and this was no exception. The only suggestion I'd make to Logitech is to design a left-handed TrackMan Marble. I like to divide my home and work usage equally, especially when a Diablo II or Icewind Dale is released, and you can't get one of these for a lefty. Other than that, I give it high marks and would definitely recommend it.", "overall": 4.0, "summary": "Very nice trackball, but for righties only", "unixReviewTime": 978307200, "reviewTime": "01 1, 2001"}