{"reviewerID": "A2Q90UILXT8BNI", "asin": "B00004OCOX", "reviewerName": "Joe", "helpful": [8, 8], "reviewtext": "I made the mistake of purchasing a Samsung player, which basically died within 2 months. While doing research for a replacement, I noticed that  lots of people had wonderful things to say about the Toshiba brands. So I  decided to purchase one and hope for the best.Well I've got nothing but  good things to say.This little player is really light, but don't let  that fool you. It has played all my DVDs with perfection, and hasn't failed  me yet. The picture is wonderful, and the sound is pretty good as well. A  couple of my discs that would freeze or skip on the Samsung player, work  just fine on the Toshiba. That was when I realized that I made a good  choice.I love the on-screen setup menus, which allow you to see the  picture on the movie that you're watching while adjusting the settings.  It's a nice little drop down menu from the top of the screen, with very  nice icons that are easy to understand. Other players (*cough* Samsung  *cough*) just blank out the picture while the setup menu takes up the  entire screen. You can imagine how frustrating it can be when going back  and forth repeatedly from the picture and setup screen, while fine tuning  the settings.Many people complain about the remote control that comes  with this player, but I don't really have a problem with it. Any remote  that doesn't use that annoying little joystick is alright with me.  Actually, Toshiba has a SD-1600 model, which, I believe are exclusive to  wholesale club type stores. It's basically the same as this SD-1200 model,  but with a better remote control. Try to find that model if the remote is  really an issue for you, or just pick up a universal remote right here on  Amazon for a few bucks.This is good player to buy if you're new to DVD,  or are looking to add a low-cost reliable system to another room in your  home. Toshiba is known for great picture and sound, so you can't go wrong  with them. As an added bonus, they've got a good warranty for it. It's good  to know that I can get my player repaired for free at a local Toshiba  certified service center if anything happens.", "overall": 5.0, "summary": "A Very Good DVD Player. Well Worth The Price.", "unixReviewTime": 969408000, "reviewTime": "09 20, 2000"}