{"reviewerID": "AIUWBR79VSZ8J", "asin": "B00004R8V6", "reviewerName": "David W. Griffin", "helpful": [0, 0], "reviewtext": "For image quality, I was quite amazed by the quality of the pictures produced by this camera. At high quality (JPEG) you can get 36 pictures on the 8MB card, and presumably, with  the 64MB card ... ... that wouldbe  288 pictures! With the LCD off, the battery usage isn't too badeither. I also find that the closeup pictures (the macro mode) is also quite good, though the flash is overpowering in these situations. I'll probably experiment with a flash diffuser, possibly something as simple as a piece of white paper over the flash in these cases.For Macs though, be prepared to work through a few problems. First of all, the cable that converts the PC serial connector to the Macintosh serial connector (for older macs like mine) isn't in the box, despite the label on the box which indicates that it's mac compatible. There's a coupon you can mail to get this connector free, but it should be in the box in my opinion. For modern macs, one would probably have to buy a USB smartmedia card reader.Knowing this however, I also bought the SanDisk FlashDisk  adapter that allows you to read smartmedia cards from your floppy disk drive (also gone in modern Macintosh computers). It too claimed to be mac compatible but it too lacked any actual support in the box. There was NO software for the mac. I had to download the drivers from the internet.Then I found the drivers claimed that OS8.6 was necessary (I was running OS 8.5.1). I was able to read single image files off the flashdisk, but not two or more. I installed 8.6 but found I had the same problem. I was subsequently able to download multiple files when I directed them to a subdirectory instead of the desktop. I can't say for sure that this alone was the cause of the problem, but at least the whole combination worked.8x10's are somewhat unsatisfying (of course) but 4x5's made with the camera are really good. It would probably make passable 5x7's. Overall, I'm quite pleased. Olympus lost a star for a somewhat complex user interface and no mac cable in the box.", "overall": 4.0, "summary": "Amazing camera for \"the price\", but some probs for Mac users", "unixReviewTime": 982540800, "reviewTime": "02 19, 2001"}