{"reviewerID": "A1M5LJSCJ19S6F", "asin": "B00004R8V6", "reviewerName": "J \"tech head dc\"", "helpful": [13, 13], "reviewtext": "First off, buy several rechargeable batteries when you get this camera! As  soon as I got mine, we played around with it off-n-on for no more than 3 or  4 hours before the brand-new alkaline batteries were useless. Flashes and  the built-in monitor really suck 'em dry.Now, besides that, the Olympus  D-360L is my first digital camera. Now I'm not really great at taking  pictures, so I put most of the settings on &quot;auto&quot; and hope that I  can Photoshop them into looking better later on. The picture quality is  good overall, but if you want any sort of details captured, you'll have to  use the largest pixel size available, and zoom in, too. So forget about  trying to get those great concert shots from 25 rows back. Most of my work  is on the internet, so it's great for web publishing, but I doubt that  these pics would look that great if they were printed out -- but I haven't  really tried yet, either.The compact design is quite good, so I can't  believe some other reviewer here said that his fell apart after a week. I  know I've carried mine around in my rough-n-tumble book bag for weeks on  end, and it hardly has a scratch on it. If you want to change the camera's  settings, there's a lot of button pushing to change the shutter,  white-balance, and image file size options. My friends have gotten quite  tired of posing and waiting for me to switch around to larger sizes, or to  zoom in, or to take the picture over again because I flashed when I didn't  want to. And there's a slight delay between when I've pushed the button and  when the camera takes the pic. &quot;Capturing the moment&quot; often takes  a couple mintues to prepare. Also, the pictures I've taken often look  fantastic on the LCD monitor, but are fuzzy when I download  them.Downloading is a snap ... sort of. Just install the software once,  then hook the cable up to your serial port and ... wait. It takes several  minutes to download multiple pictures. Heck, it even takes a while just to  view all the thumbnails in the editor. The editing software included is  okay, but it's no Photoshop.The very first weekend I had it, I went to a  crazy drunken club party and took lots of pictures of people dancing around  in an altered haze. Surprisingly, most of the photos came out great -- very  fun and colorful -- except when the flash goes off, people often have red  eye (which is fixable through adjustments) or if they are close to the  camera the flash washed them out like white ghosts. And if I didn't use the  flash, then they came out smeared because the shutter was open too long  since it was compensating for the missing light. It definitely takes some  learned skill to get great shots on the fly.In comparison, though, for  the price you pay here, you are getting a really good deal with this handy  little device. The low-light photos are a bit grainy but quite bright  considering a normal camera would show the same situation as nothing but  black. I haven't yet figured out how to get it to take pictures so that it  looks darkly lit on purpose; it always seems to automatically compensate.  Also, the multi-photo &quot;panoramic&quot; option and the &quot;action  sequence&quot; modes are fun to play with, but not necessarily going to be  useful to me in the long run. On one 8mb card, you can fit about 16 big  files, but tons of little photos. And remember, rechargeables,  rechargeables, rechargeables!", "overall": 4.0, "summary": "Good pictures, Good size, Great memory, Battery hog!", "unixReviewTime": 968284800, "reviewTime": "09 7, 2000"}