{"reviewerID": "A2B7BUH8834Y6M", "asin": "B00004R8V6", "reviewerName": "Shelley Gammon \"Geek\"", "helpful": [5, 6], "reviewtext": "Our IT vendor ordered this for  me 3 years ago (yes, the camera has been out that long... makes you think, doesn't it) when I told him I didn't know anything, but I needed a digital camera in a hurry.Having been new to the world of digital cameras at the time, I was easily impressed when I opened the package. They advertise the camera as being Mac compatible via a serial port.Well, Macs haven't shipped with serial ports for YEARS. Why not USB?!I had to buy a [price] adapter by Belkin (about the only one in existance that would connect this camera to my G3 at the time). The images download SLOOOOOOOW via a serial port. USB is a much faster architecture. Of course, firewire is 100 times faster than USB, but since Windows hasn't caught up to the technical advances of Mac yet, USB would have been sufficient for a cross-platform market.When you're using Olympus's proprietary software to download the images from your camera, you can't do anything else... it does not function in the background. Very sloppy programming... no need for such a simple process to take up so much of the system heap.The camera uses 4 (four) AA batteries, which add to the weight of the camera significantly. If you use the LED screen in the back of the camera, prepare to carry an additional 12 AA batteries with you for a day-long shoot, because you're going to be changing batteries at least 3 times in order to shoot a single day on a vacation... this camera eats batteries for breakfast.This also  applies if you use the flash. There is very little warning that the batteries are low... when there is almost no juice left, a pitiful battery icon will flash briefly in the view finder and then that's it.  This camera does not use rechargable batteries....About 8 months after owning this camera, I started noticing a delay in response time. I'd click on the shutter release and a full second and a half would pass before the picture would be taken. This is too much of a delay! The picture should take immediately... just like it does on a 1955 Brownie Hawkeye. If I'm trying to shoot an action shot or an animal or a child, every split second matters... when I click, the picture should be taken immediately, not a week later. Fresh batteries don't make a difference in the delay.The camera does take some half-way decent 640x480 JPEG shots, but the camera is slow in writing them to disk, which means you can't take the photos quickly in succession.  You also can't delete a bad shot on the camera, so even if a shot is awful, you're stuck with it until you load the disk into the computer to delete the shot... which means you have to wait for the ENTIRE roll of shots to load into the program and download in order to even delete them.There are some great bargains to be had in the computer world.... This is not the case with digital cameras. You truly get what you pay for. After being exposed to some very nice digital still cameras and digital camcorders, I can confidently say that this little Olympus is one of the worst I've ever used, and should definitely be a last choice for anyone using a Macintosh.", "overall": 2.0, "summary": "A review from a Macintosh user", "unixReviewTime": 1011830400, "reviewTime": "01 24, 2002"}