{"reviewerID": "A22JNORZI4KPAP", "asin": "B00004R8V6", "reviewerName": "Terrance Shaw", "helpful": [4, 5], "reviewtext": "Alright, I've got to say... this is perhaps the best camera that I've ever owned. A major step up from my first digital camera (a Mustek VDC-3500-which I'd highly recommend against), and even better than my Sony DCR-TRV130 Digital8 Camcorder (which isn't focused on taking photographs anyway), the Olympus D-360L is a dream come true. From the 1.8\" LCD screen to the sixty-four (64) megabyte (no, that's not a typo; the D-360L that I bought came packaged with a 64Mb SmartMedia chip in addition to the 8Mb chip packaged originally with the camera ... The photo quality of images taken with the camera is hardly anything to scoff at, and if you've got advanced image-editing software (i.e., Adobe Photoshop), then you can make an excellent image look even better!The only downside that I've managed to find to the camera, is the same problem that countless others have pointed out: the low battery life. But, as people have recommended, this problem can be overcome with nothing more than either a large pack of AA batteries, or just by buying a dozen or so rechargeable batteries and switching out between them. There are additional quirks that I've got against the camera, but nothing that can't be overcome by spending a couple dollars or so. First, it's the fact that the D-360L camera uses a serial connection for uploading images to your computer. This means that you're in for somewhat of a wait, unless you buy a SmartMedia memory reader. But no worries! You can buy an extremely affordable SmartMedia reader ...for [very little]! ... When I plugged the SmartMedia reader into my computer, it immediately picked up on what it was, and installed the drivers automatically, without any necessary disc (although a drivers disc does come with the reader), as I'm running the Windows 2000 Professional operating system. But what I found to be the most interesting thing about the reader is this: it doesn't transfer the images through a TWAIN interface, but instead, shows up as a drive in My Computer, where you can just copy, paste, and delete the file(s) right there! Now isn't that convenient?As a matter of fact, if you're a Mac user, I'd really recommend that you purchase a SmartMedia reader, because it's only an added twenty dollars, and the investment is well worth it in the long run. ... In addition to rechargeable batteries and the SmartMedia reader though, I'd recommend that you also purchase an AC adapter for the camera to save battery-life while you're transferring the images (this is of course, unnecessary if you purchase a SmartMedia reader).All in all, I'd say that the Olympus D-360L digital camera was the best [money] that I've ever spent on a computer-related gadget, and I know that, if you can see past it's few (small) flaws, you'll really love this, as it's a great product, entrance level or not. My final verdict is five out of five for the camera, and I'd encourage EVERYONE to buy one of these.Here's a bit of an update (August 04, 2002).  Recently, I went on vacation with my dad to Philadelphia.  Well, I went to visit Hershey Park to check out the Dolphin show, starring Clovis and Wee Tee.  The show was excellent, albeit rather short&#65533;weighing in at fifteen minutes, plus fifteen minutes of sea lions.  In any event, I took a LOT of pictures while I was there, and I began to notice that the camera was a bit slow with taking the pictures.  It took around perhaps two to three seconds to process each image in high-quality mode.  Although it might not seem like a lot of time in between pictures, it's an aeon, when your subjects are fast-paced Dolphins!  However, even though there is this little problem that I have with it, my review still holds at five stars.", "overall": 5.0, "summary": "The Olympus D-360L is a Direct Hit! Excellent!", "unixReviewTime": 1024963200, "reviewTime": "06 25, 2002"}