{"reviewerID": "A1E00WMEXK151D", "asin": "B00004R8VC", "reviewerName": "A. Brown", "helpful": [7, 7], "reviewtext": "I bought my Olympus D-460Z in May of 2001, so I've had it about six months.  I am crazy about this camera, and I have convinced at least three other people to buy it.The D-460Z is lightweight, comes with a flash, digital and optical zoom, and optical and LCD viewfinders.  I generally use the LCD viewfinder because it's convenient.  The camera will take low-light shots without the flash, which has been a nice transition from the 35mm film cameras I've had in the past.  The zoom is also a very nice feature that I didn't have on my film cameras.The camera uses SmartMedia storage cards, which can be bought at Wal-Mart and Target.  They're not very expensive.  The camera came with the 8mb SmartMedia card, which holds 36 images when the pictures are stored at the default size (about twice the size that I like to send in emails).  It also only comes with the serial port connector.  Many people feel that this is too slow, but I have no problems with it.  It probably takes 5-10 minutes to download 36 images from the camera.  You can purchase a SmartMedia card reader that connects via a USB port.  That is supposed to be faster, but I haven't found it necessary.I have bought a few extra components for the camera.  It does not come with a case, but it fits normal 35mm camera cases fine.  I bought a 32mb SmartMedia storage card (holds about 144 images in default size) as well as a four-pack of NiMH batteries and a recharger.  The camera came with batteries that lasted quite a long time, but when they went out, it was nice to have the rechargeables.  The rechargeable batteries will last me about a weekend of picture-taking before requiring a night in the recharger.  The camera will use regular AA batteries, but you will have to change them at least once a day.I have been very happy with this camera and I strongly urge others to purchase one as well.  I have found the software and the LCD control panel to be user-friendly and easy to navigate.", "overall": 5.0, "summary": "D-460Z is a great digital camera!", "unixReviewTime": 1002758400, "reviewTime": "10 11, 2001"}