{"reviewerID": "AHKOPVTQ3IEBL", "asin": "B00004R8VC", "reviewerName": "Baltic Books \"Vic\"", "helpful": [109, 111], "reviewtext": "After reading every review we could find, last year we ventured for the  first time into the digital photographic world purchasing the Olympus 340-R  digital camera. We were definitely not disappointed.The D460 is this  year's model improving the 340-R by adding a 3x optical zoom in addition to  the 2x digital zoom. For the price you will not match the features and  quality of this camera.After just a few days the camera accompanied us  to Ulaanbaatar, Mongolia and Seoul, S. Korea, while we nervously left our  Canon SLR at home. The camera performed marvelously. We found the optional  16MB flash memory card more than adequate for our needs, as we easily  downloaded photos each day into our laptop. An 8MB card comes  standard.We were amazed at the quality of photos even in low light  settings. We took shots at our conference including a multimedia  presentation where surprisingly the projected image on the screen was  readable! While staying in the countryside in a traditional Mongolian  &quot;ger&quot; (tent), we shot an incredible photo of the predawn sky--  even the morning stars are clearly distinguishable!Arriving home we were  completely satisfied with the photos shot at the low resolution setting  when printed out on our HP Deskjet 895 using an Epson photographic paper. I  doubt that most people would be able to tell the difference between the  prints and a standard developed snapshot. The enclosed Olympus and Adobe  software is easy to use and functional for most home use. You will  absolutely love the Quickstitch utility that simply creates oversized and  panorama shots!One of the only weaknesses we found a little frustrating  was the variance between the optical viewfinder and the digital one. If you  frame... say, a head and shoulders shot in the optical viewfinder, you will  discover that digitally the camera sees a much broader area. Olympus should  do a little better job calibrating the two viewfinders.Apart from that,  you will want to invest in the NiMH charger and at least 8 batteries-- shop  around for the best price. Also, picking up a 3.5 inch floppy adapter for  the flash memory card will be a big time saver. You simply pull out the  flash memory card, slip it into the adapter, and then slide the floppy into  any computer. You'll save time and frustration over having cords laying all  around your table, plus a significant download time.One last item-- Do  you think a 16MB memory card will be too small for your needs? You can  purchase up to a 32MB smart media card which will give you more than 400  shots at 800x600!", "overall": 5.0, "summary": "A Definite Winner-- BUY this camera!", "unixReviewTime": 968112000, "reviewTime": "09 5, 2000"}