{"reviewerID": "A1ZU55TM45Y2R8", "asin": "8862936826", "reviewerName": "J. Haggard", "helpful": [49, 53], "reviewtext": "I'm starting my review over and changing this from 4 stars (I like it) to 2 stars (I don't like it).. At first I praised it highly based upon initial expectations., but now that I actually used it for work I'm seeing it may not be the case for me.I've tried a number of cases for the ipad from a travel case to the marware eco-vue to the otterbox. I always wanted one with a notepad built in and was excited to see the Moleskine iPad case. I placed my order on Nov. 7th and after nearly 3 weeks it finally arrived.Initial reactions, I like the case. It was thick and felt pretty solid. I liked the way the case held the iPad and overall the case seemed really well built. Now, I don't have ANY issues with the build quality. The case is built very well. And others have complained about the thickness, well I expected it to be a little thick since it now has a notebook with it. My measurement, it's just at the 1\" mark in terms of thickness.What did I like:-Construction quality, very nicely made.-iPad protection, the iPad is held very securely in the case, big plus.-Love that it has a notebook, unfortunately it's not a standard size which makes this a minus as well.-Looks professional. This is one of the best looking cases I have seen.My issue comes into the issues I found while using the case.First off, the volume and mute switch are on the inside of the case. This means you need to fold open the case if you need to mute or turn the sound down on your ipad. It's a minor inconvenience, but if I'm in a meeting and my calendar app starts shooting alerts it's nice to be able to flip the switch quickly then go through opening the notebook up and having to mute it. Now in most meetings I am actively taking notes but in other meetings I'm just a observer so when I am not taking notes this issue causes more of a distraction.Second, replacement notebooks. I have been searching high and low for replacement notebooks and cannot find any. I found some small jr. legal pads and tried those and yes they work, but they don't sit as securely in the sleeve like the moleskine brand pad is and I think this could cause to ripping or sagging of the fabric. I think you are going to need moleskine brand pads or risk ruining the fabric sleeve. This is just a guess. And since you can't at the current time buy replacement notebooks you are out of luck once you run through the initial 50 pages.Third, no pen loop. They give you a notebook and a spot for your iPad, but nowhere to hook a pen. Yes I can carry a pen in my pocket, but you would think for the cost there would be a small loop to hold a pen or iPad Stylus like the pogosketch.Fourth, the true left-handedness of the case. The case can in fact be used by left handed people, but that causes a few issues. First off the back becomes the cover and now you have an upside down moleskine logo, plus the band is attached to the back so the sleek look is gone. Then my biggest complaint, the iPad is upside down when used in left handed mode so the home button is at the top. This also means the microphone is opposite the home button. So when the home button is at the top the microphone is pointed towards you. I use an app to record audio from meetings and take notes and when the iPad is faced the right direction this works flawlessly. When I use the Moleskine case in left handed mode the microphone faces me and in turn the audio is hard to hear as it is pointed away from the conversations.Fifth, no stand. It would be nice if you could somehow stand the ipad up but this case is really just meant to be used flat on it's back. It's not sold as a case with a stand, but come on, for topping the $60 mark you would think it would have one.All in all, it's  nice to finally have a case, built well with a notepad. But given the lack of replacement notebooks readily for sale for this case and no pen loop to carry a writing instrument makes it weak. I can use the case in right handed mode, but they sell it as left handed compatible and it really isn't as functional as it should be. They instead should release a second model that IS built for left handed and not make one unit semi-reversible.I may end up returning this case and going back to my marware. I'm going to keep using it until the end of this week before deciding..--UPDATE 12/9/2010--I have returned the case back to Amazon and have gone back to theMarware Eco-Vue for iPad. This out of all the cases I have use is the best for my personal situation. I wanted to like the Moleskine case but it just didn't work for me and I still can't find replacement notepads. Sorry Moleskine, perhaps revision 2 will be the one for me, but so far your case didn't meet my expectations.", "overall": 2.0, "summary": "It's an ok case, with some major flaws.", "unixReviewTime": 1291075200, "reviewTime": "11 30, 2010"}