{"reviewerID": "A3GM64N13BILUP", "asin": "B00004R8VC", "reviewerName": "Ron Cole", "helpful": [4, 4], "reviewtext": "I'll echo most of the other reviews here: like the D-450Z, the D-460Zis a great digital camera for the price. Though I disliked the switchto the cheaper plastic housing with this model, the increased ease of use when navigating the menus more than makes up for it. Like the previous camera, you still get high-quality digital pictures with a number of features including red-eye removing flash, television display of pictures, 3x optical (lens) and 2x digital (computer) zoom, and a host of other features which make this camera one of the best in it's class.But since the earlier releases in this line, digital camera technology has increased while price has decreased (thanks in a large part to earlier models in this line, which took the market by storm). You can now get cameras with a higher level of megapixels and resolution for about the same price as the D-460Z such as Nikon's Coolpix 800 and the Kodak DC280. You should go to your local. . . consumer electronics store and look at ALL of your choices before deciding on which model to purchase (and then purchase it on-line because it is cheaper ;). Even though the D-460Z is no longer &quot;cutting edge,&quot; I still believe it has enough features and stunning quality to let it surpass many of the other choices in its class.Accessories: Expect to spend a few hundred dollars in additional accessories for this camera. I recommend at least 8 NiMH rechargable batteries for power (which you can buy on-line or at your local supermarket), a USB Smartmedia reader if your computer supports USB (this greatly decreases SLOW picture transfer times from the camera to the computer), and a &quot;soft&quot; protective case for the camera (the Olympus soft leather case is nice but over-priced unless you get it on sale). As well, 2 additional 32 meg or a 64 meg SmartMedia card is useful, and will allow you to take a vacation's worth of pictures without have to delete any (at least at the rate I take pictures). The camera lets you take a little more than 2x the SmartCard's megs in super-high quality, compressed images. You can buy these on-line at places like amazon.com... but the Olympus-brand accessories tend to go out of stock quickly.  Note: the SmartMedia cards will eventually wear out, though you'll be able to take tens of thousand (or even hundreds of thousands) of pictures before this happens if you buy a decent-quality card.", "overall": 5.0, "summary": "Solid digital camera at a decent price!", "unixReviewTime": 958694400, "reviewTime": "05 19, 2000"}