{"reviewerID": "A1IBKN1GXYJ3K4", "asin": "B00004R8VE", "reviewerName": "Dave", "helpful": [0, 0], "reviewtext": "I have a C-2020, which is a slightly older version of this camera model.  This has been a fantastic camera both in terms of quality, reliability and battery life.  Between some friends and myself we have just about every model in this family (C-2000 through C-3040) and we all love our cameras.Quality: I have taken hundreds of shots, mostly outdoor.  I tend to shoot at the high-quality jpeg level so I bought a 64MB smart media card.  Paired with my HP DeskJet 952 I regularly printout 4x6 prints on photo paper that are absolutely perfect.  I have printed a few 8x10 pictures and they are fantastic.  No one can believe they were taken with a digital camera.  I have to zoom in quite a ways with my photo editing software before I can see any pixels.  The only negative thing I can say is that I wish it had a better macro mode.Reliability: It has been rained on, splashed by a wave, and dropped a short distance onto a rock.  Despite all this it is still going strong a year and several hundred pictures later with no negative affects.Batteries: I use the rechargeable batteries and during heavy use they last 2-3 weeks.  During light use they last 3-6 months.  Compare this to most Kodak or Nikon cameras that last a few days of heavy use.A few comments on my accessories:Forget the 16MB card that comes with it.  I keep only mine as a back up.  You will want a 64 MB smart media card.I bought the Olympus T-CON14 tele-converter lens 1.45x (152mm equivalent) and I am very happy with it.  It can retail up to $200 but I shopped around on-line.  My next purchase is the wide-angle lens.I bought the Olympus Accessory Kit (which is the same for C-2000 through C-3040 models), mostly for the UV filter, adapter tube and 43mm-55mm step-up ring, and AC adapter.  I bought it for about $95, which is close to what all those things cost separate.  The mini-tripod, software, and case that come in that kit are not overly impressive but I considered those `free'.  The lens cleaning kit is handy.", "overall": 5.0, "summary": "Superb camera!", "unixReviewTime": 990835200, "reviewTime": "05 26, 2001"}