{"reviewerID": "A2V5OS0QGHIUDS", "asin": "B00004R8VE", "reviewerName": "Robert Field \"leofric1\"", "helpful": [17, 18], "reviewtext": "I have just gotten this camera, and already I love it. It works well with the Viking 128MB chip (other than inability to do panorama, not much of a drawback for me) and right out of the box I was able to quickly be pointing and shooting. This is my second digital camera, and I am very impressed with it. The LCD menus are a little tricky to navigate at first, but I am quickly learning where things are. I have experimented with taking pictures at different resolutions and qualities, and also shot some movie clips. I downloaded the results to my computer with little trouble, although I think I would recommend buying either a reader or a PCMCIA adapter for the memory chip, downloading from the camera over it's USB port to the hard drive is a little cumbersome. It takes very nice photos in average lighting without the need for the flash, and I find it very easy to quickly snap a picture, especially of quickly moving subjects like children. It took me a little reading of the manual to discover that the remote only works when the timer is enabled, however once I mastered it I like the 3 second delay so you can hide the remote. I like the ergonomic placement of the controls, I can both hold the camera and work its major functions with a single hand. I didn't see any mention in the manual of the fact that the lens cap has to be removed prior to turning it since the first thing it tries to do is extend the lens barrel. Perhaps the lens cap should snap onto the extensible barrel and not the external housing? These are not major drawbacks but things to bear in mind while learning to use this camera. As a prior user of a digital camera, I think Olympus has done a good job addressing some of the shortcomings of early digital cameras, plus creating a digital camera that looks and feels like the film cameras I have used for years. The touch of the shutter button, picture resolution and recording speed are vastly superior to what I am used to in a digital camera, and compare with a good SLR. All the additional features are there if I want them, but the solid performance of the basic function is a key ingredient. I like to tinker, and having numerous overrides is great, but sometimes I am glad to not to bother with them and just click away, knowing the automatic program is making the right choices for me.", "overall": 5.0, "summary": "Great second camera", "unixReviewTime": 993081600, "reviewTime": "06 21, 2001"}