{"reviewerID": "A3H1CE8T6GDVWV", "asin": "B00004R8VE", "reviewerName": "Tool Connoisseur", "helpful": [46, 46], "reviewtext": "This is an outstanding camera.  I have been a casual photographer for many years and finally took the digital plunge - the C3030 outstrips the performance of my 35 mm SLR, and after much research, I concluded it outperforms most digital cameras as well.  I also read some of the previous reviews, and most of the negative \"problems\" people listed either weren't problems of the camera or were because the person didn't know how to use the camera.When it comes right down to it, picture quality is what makes or breaks a digital camera.  The C3030 sweeps the field.  Color quality and sharpness exceeds my 35 mm.  I took a face portrait of my son and blew it up to just his eyeball - you could count the tiny veins in his eye.  You can easily blow up pictures beyond 8 x 10 and still have sharp pictures.  It does a better job reproducing sharp, realistic colors than most Kodak film.  Low light capability is very good (even better with the new C3040 with its 1.8 lens).  The menu is easily navigated (although it will take a little study of the manual; the camera has a lot of capability) and the controls are, for the most part, very easy to use.  The camera is nicely programmable for those who want to venture there.  The memory-buffered multi-picture capability (like a fast motor drive in an SLR) is very handy for action shots.  The camera is extremely compact considering its capability and can be carried easily.  When taking pictures, it is very comfortable and natural to hold, unlike many other digital cameras.The USB transfer rate is much better than a serial cable but I took it a step further and bought an inexpensive Smart Media PC card adaptor.  I pop the card out of the camera and into the PC slot and it is a near instant download of 128 MB of pictures! (I purchased the 128 MB card and it holds a huge number of pictures).It uses up batteries, but no more than other digital cameras.  I purchased 1400mah NiMH batteries and travel charger for only $38 - it works great and lasts a reasonable amount of time; hasn't been a problem.I have taken many hundreds of pictures, perhaps thousands, without a single glitch.  One of my few complaints is the flash performance, but the camera takes such great pictures without the flash, especially with a tripod, I mostly don't use it.  Again, the new C3040 may take this even one step further.  I also wish the Macro performance was better (closer) but it has been acceptable for most applications.  My next purchase will be the telephoto lens to expand the camera's capabilities.Bottom line is you will love this camera.", "overall": 5.0, "summary": "Serious photographers will love this camera!", "unixReviewTime": 985132800, "reviewTime": "03 21, 2001"}