{"reviewerID": "A3O55EWFNKSPV3", "asin": "B00004R8VM", "reviewerName": "Z. Mahdavi", "helpful": [116, 116], "reviewtext": "I have owned a DVD-ROM drive since they were first introduced three years ago. I thought that DVD-ROM would be the standard media by now, but I guess I was wrong. The picture is very bad and movies on the player look like slide shows! So I decided to get a DVD player.I researched for several months for the right player. I researched models from Samsung, Panasonic, Sony, Toshiba, and Pioneer. I wanted to buy a player for around $250 that only played one disc (I didn't need a multidisc model) and had excellent picture and sound quality. Also, I didn't need a player with Dolby Digital or DTS decoders built-in to the player. My receiver could do that. After researching and researching, I became interested in the Sony DVP-S360, the Pioneer DV-333, and the Panasonic DVD-RV30 player. All three players are good players, but people have been complaining that Sony's &quot;PrecisionDrive&quot; is very loud especially in the quiet scenes of a movie, which could get kind of annoying. Also, many reviewers were saying that the Sony produces a nice, but &quot;soft&quot; picture, not a crisp DVD-like picture. Many reviewers complained that the Pioneer DV-333 is not built well and also produces a soft picture.Everyone seemed to love the Panasonic DVD-RV30 DVD player. They all said that it produced a very clear, crisp, and vivid picture that rivaled the $1000+ DVD players and that the sound it produced was great. Also, since Panasonic is offering a $50 mail-in-rebate, I decided to buy the Panasonic DVD-RV30.Setup took me five minutes. I took the player out of the box, plugged the power cord in, plugged the TV cable in (only composite cables are included with the player), and inserted the batteries in my remote. That was it!This player has many features including:Virtual Surround Sound (VSS): Uses your stereo system's speakers or your TV speakers to produce delays in the sound recreating a surround sound experience. This is personally one of my favorite features of the player. I thought it would be a gimmick that didn't work, but it works really well! I am amazed at the sound produced when VSS is on!Dialogue Enhancer: Dialogue enhancer is supposed to increase the center channel of your home theater system by 6 DB which allows for the dialogue to come out clearer. Even on a normal TV system, dialogue enhancer definitely improves those DVDs where the dialogue is so hard to hear. I usually always leave dialogue enhancer on. Also, at night, I can turn the sound down and yet still understand what people are saying. This way, I won't wake up my family! :-)Digital Cinema Mode: Supposed to improve the detail of the picture in dark scenes. I personally have not used this feature yet.A direct-bass output is also featured. It allows you to connect your player directly to a subwoofer to enjoy the same kind of bass effects you would only usually get through a home theater system.Other features include component video out, S-video out, and optical sound output for Dolby Digital and DTS. I am currently testing this player using just composite cables, and the picture is so amazingly clear on just composite cables! It is like you are in the movie when you use component video output cables, but your TV must support it. Check your TV manual to see whether it supports component video, S-video, or composite cable connections.The remote is very intuitive and easy to use. All of the features the player is capable of is easily accessible through the remote. My only complaint is that you can't select a chapter in any sort of one-click way. That would have been a great feature, but it is not necessary.I really like the resume feature this player has. If you decide to stop to run an errand in the middle of movie, even if you turn off the player and back on, the player will &quot;remember&quot; where you were in the movie and immediately take you there!I have to agree with all of the reviews I read. Sound quality and picture quality is superb! Details are very crisp and easy to see, and fast action scenes are like a walk-in-the-park for this player. I threw all kinds of movies at my player, and it didn't seem to stress at all with any kind of scene. Even layer changes are very smooth. I did not even notice a single hint of a layer change in the movies I watched.Finally, after playing about four hours worth of movies, the player did not get hot at all. The DVD inside the player wasn't even hot. Everything about this player seems very solid and will last a lifetime.All in all, this player has to be one of the best players out onthe market right now, literally.", "overall": 5.0, "summary": "Best DVD Player in its Class!", "unixReviewTime": 978048000, "reviewTime": "12 29, 2000"}