{"reviewerID": "A1ISUNUWG0K02V", "asin": "B00004RC2D", "reviewerName": "canaduck \"canaduck\"", "helpful": [37, 37], "reviewtext": "There are many other reviews that get into the technical aspects of the  Palm IIIxe.  I just wanted to share with you why I bought it and how I use  it.There are many good reviews here.  I didn't want to spend too much  money so I didn't want to buy a Palm V, color Palm, or Pocket PC.  I feel  that PDA will only get better in the next couple of years and I don't want  to feel guilty about upgrading later.However, I was willing to spend a  little extra money because this one had 8mb of memory.  I also considered  buying the Handspring PDA but my company would pay for part of my purchase  if I Palm PDA.I use Microsoft Outlook at work and home.  I never had  much success with using a DayTimer.  It was a real pain to write things  down in the DayTimer and then type it into Outlook.  It was also a big  waste of time to write my Outlook meeting into my DayTimer.  Worst of all,  I hated lugging the DayTimer everywhere I go.  The Palm Pilot is a very  nice solution.  You don't have to duplicate your efforts and it is very  compact.I use it to synchronize my PC at work and home.  I don't do  email with it; I prefer using my PC.  However, I do use it for scheduling,  contact lists, and tasks.  I also like the memo feature so I can make notes  to myself.  It is nice to jot things down on the Palm and then synchronize  it with you desktop.I also like using the AvantGo service.  If you  haven't heard of it go check out [...]  It lets me download  stock quotes, the weather, sports scores, BBC News, Wall Street Journal,  Slate, and the New York Times.  It comes in handy when I'm are on a train,  or in a waiting room or airport.  It is a lot less cumbersome than a  newspaper in a crowd.I purchased two accessories for it:  (1) a Palm  PalmGlove Neoprene Case - this is a very nice case, great protection and it  is waterproof.  (2) a Palm HotSync Cable - it's cheaper than the HotSync  Cradle.  I use it to synchronize Outlook on my home PC.", "overall": 4.0, "summary": "It didn't change my life but I find it handy.", "unixReviewTime": 968716800, "reviewTime": "09 12, 2000"}