{"reviewerID": "AX8SWWB9837TA", "asin": "B00004RC2D", "reviewerName": "Chris Peters", "helpful": [131, 133], "reviewtext": "This review is for PDA newbies, written by another newbie.  You might have  done some research and know a little about what you're getting into, (which  I highly recommend) but it still seems like a $300 replacement for a  Rolexdex plus desktop calendar (which is exactly what it is).  I was turned  off by some other reviews because of the sheer detail that some experienced  users go to.  People literally come to depend on this things so much that  when new features come along they go insane =)  If you are like I was, you  simply want to know if this little thing is worth the money.The basic  function of any PDA is to organize your life, period.  You will get more  use out of the basic calendar, address book, To Do List, and Expense List  than anything else.  PDAs syncronize themselves with your computer at work  and at home.  Most people don't realize how nice this is until they use it.  Now that I understand it, I do it with everything.  I download my bank  statements from the Internet into Quicken, and then into my Palm.  If I  mark a purchase on my Palm, it automatically updates in Quicken when I get  home.  At work I track everything with Excel spreadsheets, and now I can  carry my entire job at my fingertips, in my Palm.  At home, I used to keep  email addresses only on my computer, and phone numbers on a Roldex in the  other room.  Now the information is everywhere at once, and the clutter of  these extra things is gone.  Should my palm ever get lost or stolen, I've  got a hassle-free backup on my PC at work and at home.  It has freed my  life by making organization easy and intelligent.I got the Palm IIIxe  because it has everything essential, yet is cheap enough that if I found I  never used it I wouldn't feel bad about the money I wasted.  It is exactly  the same as a Palm Vx, except for a slightly bigger case and slightly  slower, but not noticeably on either account.  The Palm VII's wireless  internet feature is very an expensive extra I didn't need.  The color  screen on the IIIc is surprising functional for the cost (these little  screens can be hard to read at times). My next PDA will definitely be  color.  Oh, and don't settle for anything less than 8 MB of memory unless  you're only using the very basic functions (in which case get an M100)  Most importantly, PalmPilots offer the best experience for  &quot;virgin&quot; PDA users, hands down.  The basic features on a Palm  will never throw you for a loop.  And if you feel comfortable tinkering  with your computer, than you can visit [...] and get 1000's of  applications to make your Palm do absolutely anything you want it to.A  PocketPC offers some of the advanced features I talked about before  (importing spreadsheets and such) which come ready right out of the box,  while you have to pay extra for this on a Palm, and then have the hassle of  figuring out how it works.  Using a PocketPC is very similiar to using  Windows, but like Windows, it tends to crash.  They do have more memory  than Palms, and can be expanded if you somehow run out.  They also play MP3  music, but with the money I saved I bought a dedicated MP3 player which is  much, much better than a PocketPC could hope to be.  They also play movies,  but who on earth would want to watch movies on a PDA?  For the basic  features, they offer little over a Palm.", "overall": 5.0, "summary": "PDAs for Newbies - This Palm's for You", "unixReviewTime": 969235200, "reviewTime": "09 18, 2000"}