{"reviewerID": "AOK5FZT22IF3W", "asin": "B00004RC2D", "reviewerName": "Isabel M. Falcon", "helpful": [24, 29], "reviewtext": "If you do not have a problem with your equipment you might have a good experience with it, other wise you will regret buying this product. When I upgraded my computer and tried to install the cradle and the hotsync program, the computer did not even booth, it just went dead.  After 25 minutes of a long distance phone call to Palm support service (no toll free number), they told me the problem was the port, so they could not solve it - the port was working. I wrote an e-mail explaining the problem, the answer two days later was I did not give enough information as I did not tell what hotsync program I installed in my computer - NONE!!!, they clearly did not even bother to read the nature of the problem.  They saw a missing field and they just assumed they could not help. Eventually, after the level of complaints Palm received on the issue was large enough, they informed via the website that some cradles are defective and they need to be replaced; however, the part cannot be ordered via web or e-mail, support had to be called.  Another 40 minute long distance call, and I was informed that in 48 hours the cradle adaptor will be in my house.  After 10 days without adaptor, I sent an e-mail to support asking for it, giving it the service order number.  The answer was to call parts, an 800 number, only 15 minutes of my time were wasted before I was informed I needed to call support, as parts had nothing to do with it.  Another 20 minutes of long distance to order again the part, as the service representative made a mistake in the previous order, so it could not be processed.  When I asked for the order number they informed me that their database is down and they are just filling orders by hand and they could not give me a confirmation number. Good luck if you still decide to buy this.Five years later, I have been blessed enough not to need any more customer support, and I cannot see my life without a palm pilot.", "overall": 3.0, "summary": "Customer Support is a disaster, but I cannot live without them", "unixReviewTime": 980208000, "reviewTime": "01 23, 2001"}