{"reviewerID": "AEJAGHLC675A7", "asin": "B00004RC2D", "reviewerName": "John Williamson", "helpful": [211, 213], "reviewtext": "Putting it simply, the Palm IIIxe is a five-star device. If you want just the highlights as to why, see my Short Notes below. If you want the full review, go to Detailed Notes further down.Short Notes:- Excellent quality overall, good ergonomics.- 8 MB RAM, easily sufficient to store a wide variety of applications plus data.- Has 2 MB flash memory, enough to handle upgraded (v3.5) OS.- Sharp, clear screen. Easy to read.- Graffiti handwriting recognition is forgiving and easy to master quickly.- Great battery life - should last over 30 days.- Built-in infrared port - easy data exchange between Palm devices.- Many available software applications, often freeware.- Excellent and thorough documentation.- Easy to learn how to use it - very intuitive if you hate manuals.- Syncs well with Microsoft Outlook, if you're so inclined.- Great price - a good investment.- - - - - - - - - - - -Detailed Notes:Spent a lot of time deciding which Palm OS model to go with, and finally picked the Palm IIIxe, primarily for the newer OS (v3.5), the 8 MB memory and the new lower price. Looked closely at the Palm m110 and Handspring Visor, units which offered attractive prices, but with 2 MB RAM, felt they didn't have enough memory. Also considered the Handspring Visor Deluxe, but on the two models that I had a chance to try out, the screens weren't the same quality as those of the Palm IIIxe, and nobody could explain it.You may also wish to consider the new Palm m105. See the notes at the bottom of this review for more details.To be fair, I also considered some of the newer Windows CE devices, but was put off completely by the hand recognition software. It was too slow and hard to use, so that idea was dropped quickly. Used to use a Windows CE device made by Casio, which I put aside awhile ago. Had initially been encouraged to purchase a Palm device by one of my co-workers, but I felt that the Windows CE 1.0 device with its tiny keyboard was the way to go. Then I found out that it ate batteries at a very high rate. Lived with this for awhile, but the business of hardware ROM replacement to upgrade the unit was disturbing.The Palm does everything I need it to, and in the month that I've had it, I've been pleasantly surprised by its versatility. The quality has proven to be excellent. The case of the IIIxe, though an older Palm design, fits the hand quite comfortably.The Palm IIIxe comes with 8MB of memory. In useful terms, this means that you can store approximately 12,000 addresses, 5-10 years of appointments (that's about 3000 appointments), 6000 to do items, 3000 memos, 800 e-mails and many applications. The available memory has been ample to download and store a wide range of applications along with the room to store related data. The IIIxe (along with some other models) has 2 MB flash memory, enough to handle the upgraded (v3.5) OS and the built-in applications. I also went to the Palm Web site and downloaded the latest (v.3.5.2) OS and installed it. There were absolutely no problems like I had heard about with other &quot;Palm-compatible&quot; devices.The screen is sharp, clear and easy to read, indoors or outside. Though I might have preferred a bit stronger backlight for those times where there isn't much light, have learned to adapt to it quickly.The Graffiti handwriting recognition is forgiving and easy to master quickly. One of the reasons I went to a Windows CE keyboard unit a few years ago was fear of having to learn yet another way of inputting data. I couldn't have been more wrong - it's easy and quite intuitive. What's even more important is that I'm now taking notes in meeting with the device that used to be done on paper.The battery life is outstanding. It should last thirty days or more under regular use. Since one of my complaints with the Windows CE units was short battery life, I'm impressed.The built-in infrared port allows you to transfer documentation directly from any other infrared enabled Palm device. This function works quite well. I've transferred memos to and from a Handspring Visor Deluxe and other Palm devices.There are many software applications available for the Palm PDAs, including a lot of shareware and freeware. The commercial programs that are available are top rate, and you can even find applications that will let you edit Word and Excel files. You can even connect to Oracle 8I databases with currently available software.The Palm IIIxe manuals are excellent, and do a thorough job of documentation. You may find, though, that this device is easy to learn with little reading. Its interface is very intuitive, and that's helpful if you dislike going through manuals.This PDA syncs well with Microsoft Outlook, which is extremely useful for corporate users. This is a straightforward operation in which you place the Palm IIIxe into the supplied HotSynch cradle and push the button on the base. The HotSynch operation creates a log of what was done, so you can confirm that everything was updated correctly.Picky point - comes with a mediocre lightweight plastic stylus. Order an upgrade (or the Palm 3-pack) immediately. You won't regret it.You might also want to consider the new Palm m105. Though it has a smaller screen than the Palm IIIxe, it has many of the same features but is packed in the same case as the popular m100.If you are looking for a reasonably priced PDA that can live up to its reputation, then this is a first-rate choice. The Palm IIIxe is a solid unit at a great price - an excellent investment.", "overall": 5.0, "summary": "Palm IIIxe - excellent product and an exceptional value.", "unixReviewTime": 983836800, "reviewTime": "03 6, 2001"}