{"reviewerID": "AXT8ASWG8JZQM", "asin": "B00004RC2D", "reviewerName": "karolinatx", "helpful": [0, 0], "reviewtext": "There it was under the Christmas tree, my very own Palm Pilot! Santa had taken advantage of the wildly popular $50 rebate/amazon coupon combo! Having owned the Palm for a few weeks now, I thought that I'd write a review, from one first time Palm owner to those who might be considering it. First and foremost, it's FUN. It's just a nifty little toy that comes in extremely handy on a daily basis. Secondly, it's _really_ easy to use. I kept reading the word &quot;intuitive&quot; in reviews when I was shopping around, and that's definitely true. I was thinking about getting a Visor because of the Springboard capabilities, but I decided, as another reviewer, that it'd be better to, say, buy a seperate MP3 player, of better quality no doubt, if I ever felt the strong urge for one, rather than add on to my PDA. The Palm IIIxe's large memory really does increase your possibilities for use, if you're a little proactive and sniff around on the web for some neat third party software. I've got AvantGo on mine, which is a must. News, weather, movies, stocks, you name it, updated every time you HotSync with your desktop when it's online. I live in a large city, so I also got Vindigo, which is a great little program that lets you search for restaurants, movies, stores, and the like close to your location. I recommend their web site -- they have a demo that's just like the real thing. I also got CSpotRun, a free doc reader that I use to read ebooks. There's a lot of free ones out there -- mostly older works that aren't copyrighted. I also have a city map from Mapopolis, and some games, of course, to pass the time. As far as the stuff that's included in the Palm, it's all pretty self explanatory. It's great to not have phone numbers on the backs of envelopes scattered around the house any more. Graffiti, the handwriting software that Palms use, is extremely easy to learn, and there's stickies included with the characters to stick inside your case should you forget something. It's obviously not as fast as typing, though, so the ability to type stuff in at your computer and then HotSync it to the Palm is very helpful. The infrared beaming is a neat little feature -- my boyfriend also has a Palm so we've beamed one another shopping lists, etc. Soooo, I've only owned the product for a few weeks, so I haven't encountered any long term problems yet, should they arise, but overall I'm extremely pleased. It's fun, it's compact, it's easy to use, it's helpful, it's a way to get organized from addresses to shopping lists to to do lists. I like my Palm. So sue me.", "overall": 5.0, "summary": "First Time PDA Owner's Two Cents", "unixReviewTime": 978912000, "reviewTime": "01 8, 2001"}