{"reviewerID": "A1U5NWJOYH2QQH", "asin": "B00004RC2D", "reviewerName": "Old geek", "helpful": [0, 1], "reviewtext": "If you have a computer, and it has an open COMM port connection.  Get one of these.  Not the cheaper models, with only 2mb, get the IIIxe. It is an INCREDIBLE device.  Sure, it has Memo, Datebook, To Do lists, calculator,  and a few other built in items.  Look at it that way, and the price is a  bit steep?  BUT. Look on the web. Many many website devoded to the Palm  PDA.  On all these sites are THOUSANDS of programs and documents.  Many  good ones free.  Incredible diversity of programming, making the Palm an  amazing and useful device.  I downloaded a database, document reader,  secure memo pad, games and games, documents, magazines, ebooks, and with  one service, you can download any of hundreds of specially formatted  website documents, like news, weather, magazines, etc.  Again, it is  incredible what this little device does.  Then there is hardware for  it...modems, KEYBOARDS, etc.  Cases galore.  Many programs use what is  called &quot;conduits&quot;....connection to the Palm and it's data with PC  applications of all sorts. I have the bible, many magazines, books, short  stories...all sorts of reading material on my Palm.  When I read them, I  delete them and go get more.  You can get many free books on the net, and  many you can purchase.  There are usenet groups that are VERY busy, and  very helpful.When you get it home, try it out, you may say,  &quot;interesting&quot;.  Get on the web, download goodies, and that will  change to &quot;WOW&quot;.You will spend days (not just hours) scanning  the web for goodies.And you must get an 8mb one.  2mb is just not enough  if you are going to download a lot of documents and news.  An upgrade of a  2mb one to 8mb costs more than the 2mb Palm alone.  Get 8mb.It uses two  AAA batteries.  Cheap alkalines work fine.  The Palm even will let you  select what battery types you use (nicad, nimh, alkaline) so the battery  level meter works accurately!  I seem to get about 2-3 weeks on a set of  batteries.  PALM says about 2 months.Using the PC to load or update PC  or Palm is easy. Just put the Palm device in it's cradle (which is  connected to RS232 comm port...DB9 connector...which all computers have),  press a button..and that's it!One great device!  If you are not familiar  with them, or don't have one, hit the web and usenet. Tons of information  and programs for them.  Many sites dedicated to them.", "overall": 5.0, "summary": "If you have  a computer, you should have one of these.", "unixReviewTime": 956620800, "reviewTime": "04 25, 2000"}