{"reviewerID": "A2M5GKAGV88LWD", "asin": "B00004RC2D", "reviewerName": "Paul Bobbitt", "helpful": [59, 64], "reviewtext": "The first thing a person has to decide when purchasing a handheld device is whether they want to use the Palm or the Windows CE operating systems.  I've found the Palm OS easy to use, very efficient, and well supported by third party developers, as well as by Palm.  The number of utilities available for the Palm OS really adds value to the product - particularly the web-enhanced synching utilities offered by everyone from Excite to AvantGo.  Using this free service lets you synch with any web page you select, so you always have the most current information available.  For example, I bookmarked the movie review page of an online newspaper in Toronto, and always had the most current reviews, times and locations of movies in Toronto, even though the online service wasn't specifically designed to operate with the Palm system.  Basically, any web page can reside on your Palm just by selecting it using this software.  I provide this as an example of the benefits of owning the industry standard OS rather than the less supported Windows CE. Now that I've mentioned why the Palm operating system is your best choice, I'll focus on the different Palm products available. Having used both the Palm IIIc, the Palm III, and the Palm Vx, I've got to say that the IIIxe really seems to hit the ideal price/feature point.  With all the memory of the more expensive models, and all the benefits of built-in synching to Microsoft Outlook and other software, it's a great little machine.  It also has an infrared port built in, which I was able to use to keep my home computer and my laptop at work (it has an IR port, too) synched with each other.  By the way, the IR port is also great for beaming your electronic business card to another Palm owner, or playing Battleship against another owner head-to-head. You can even set it up to let you write email messages, which will be stored in the Palm, and sent automatically when you next synch with your computer.  I mention this because it highlights the ability to personalize your Palm to do what you need it to do.  You can easily use it as a standalone device, or it can be as connected as you need it to be. There are three concerns you should be aware of when choosing this model over Palm's other offerings.  First, this model has a greyscale screen, not a colour one like the IIIc.  If you really want colour, this model isn't your best choice.  (You can read my review on the IIIc for more information on that product.)  Second, it has a plastic case which is thicker and less attractive than the brushed aluminum case of the V series of Palm organizers, which may be a concern for the more stylish among us.  Third, this one isn't rechargeable - it takes AAA batteries.  This might not sound like much of a concern, but there's something to be said for being able to drop the device into its cradle for a few minutes to recharge, rather than trying to limit your use of the organizer to conserve battery power.  One of my friends had a non-rechargeable model for years and purchased a new one with the rechargeable function.  He said he ended up using the organizer nearly twice as much as his old one, so this is probably something you should consider in your purchasing decision.  Notwithstanding these limitations, this is a great product with a great operating system, lots of features and third-party support, and is easy to learn and use.  Highly recommended!", "overall": 5.0, "summary": "A great deal for a lot of machine!", "unixReviewTime": 977356800, "reviewTime": "12 21, 2000"}