{"reviewerID": "A2IFGGXG3YV3Y6", "asin": "B00004RC2D", "reviewerName": "Scott Anderson \"Sharpsburg\"", "helpful": [10, 10], "reviewtext": "Folks, if you are in the market for a daily organizer, date book planner, calculator, address book and email system, then this is the system for you.  I recently purchased this PDA after spending over a month comparing features with other similar products online and in the stores; and I've  been loving my IIIxe ever since.At a moment's notice, with a simple  touch of a button, my entire schedule from work to play is instantly at my  fingertips.  With the addition of the HotSync Cradle my desktop at work and  my laptop at home are now on speaking terms again!  I was forever changing  and deleting on both systems with tons of info falling between the cracks.  Now, with a simple push of a button all three systems are  &quot;Insync&quot;!  I've synchronized it with Netscape and Outlook, and  enjoy the luxury of answering email and then replying via the cradle when I  dock the palm.The 8mg's of memory, coupled with the long battery life of  two small AAA's gives this little palm tool the power to handle future  upgrades as well as the longevity to keep up with a hectic schedule.  I've  been using my IIIxe constantly for the past three weeks and still have over  80% of my charge left.  The problem with the &quot;8Dram&quot; was  addressed before my pilot hit the market, but I downloaded the test to check to ensure it was working.  The procedure  was painless and the total time invested from start to finish took  approximately 20 minutes.  I'm happy to report that my IIIxe and I are  doing well, and working nicely with no errors or glitches to date!The  Palm IIIxe gives you &quot;the most bang for your buck&quot;. I highly  recommend this item for those seriously considering purchasing a PDA.  It  will organize your life and make it that much easier!Go out and pick up  a Palm IIIxe today!  Shop Amazon.com!", "overall": 5.0, "summary": "Awesome computing in one neat package!", "unixReviewTime": 964137600, "reviewTime": "07 21, 2000"}