{"reviewerID": "A3O55EWFNKSPV3", "asin": "B00004RC2D", "reviewerName": "Z. Mahdavi", "helpful": [146, 148], "reviewtext": "This is my first handheld, and I am so glad that I did not get a Windows CE handheld.  The Palm IIIxe has over a month of battery life (compared to several hours with Windows CE), never crashes, and is so easy to use.  It syncs really well with Outlook 2000 and Outlook 98.  No problems  whatsoever.  I especially like the wide range of programs you can get  online for free or at a small cost.  Windows CE could not do that.  Now to  the Palm IIIxe itself.  I think this is the &quot;best value for the  buck&quot; Palm there is right now.  Sure, there is the Palm IIIc and the  Palm Vx, but they cost [more than this unit].  All three have 8MB of  RAM and the updated operating system.  The IIIc has the color screen, but  why do you need a color screen in a handheld?  If it is for playing games  in color, then you are wasting your money.  The Palm Vx is exactly the same  as the IIIxe, except it has the new style, but let me ask you this.  Why do  you need style in an organizer?  You may say that these two models have  rechargeable batteries, a feature that the Palm IIIxe does not have, but I  have been using Nickel Metal Hydrate batteries (NiMH) on my Palm IIIxe and  the work very well.  Get some more information from Palm users about their  experience with NiMH batteries....  After you answer those two  questions, you will agree with me that the Palm IIIxe is the best value  Palm out now.  I chose the IIIxe over the Handspring Visor Deluxe for  several reasons.  First of all, in the Visor Deluxe, you cannot upgrade the  operating system when new updates are introduced.  Handspring, however,  says that you can add in a Springboard module to upgrade the OS.  But how  will the device operate later if you switch the Springboard with another  one?  No more OS upgrade, that's what.  The IIIxe has flash memory so you  actually upgrade its operating system.  Second, I have read several user  comments on the Visor Deluxe.  Several people are saying that the Visor  screen breaks much more easily than the Palm IIIxe's screen because of its  flimsy case design.  Palm put the normal sturdy case found in the III line  on it's IIIxe.  Second, tons of customers have complained about  Handspring's customer support.  I remember one person said, &quot;There is  none!&quot;  I am very satisfied, however, with Palm's customer service,  especially their online customer service.  Take a look for yourself at the  Service and Support section at the Palm website.  So what do I use my Palm  IIIxe for?  I use it at school to keep me organized.  I am a very busy  person, but the datebook helps keep me on track with my appointments.  Also, I store my assignments on my Palm using a program called Four.Zero.  I play games occasionaly, but that was not the primary reason for buying my  Palm organizer.  The primary reason was ORGANIZATION.", "overall": 5.0, "summary": "Best &quot;Most for the Money&quot; Palm!", "unixReviewTime": 956275200, "reviewTime": "04 21, 2000"}