{"reviewerID": "AY8Q1X7G96HV5", "asin": "B00004RC2E", "reviewerName": "Chris Prinzivalli", "helpful": [26, 36], "reviewtext": "The Palm IIIc organizer is one of the smallest color handhelds on the market, and fits neatly into your shirt pocket or purse. A rechargeable lithium ion battery lasts more than two weeks with normal use, and  recharges in your HotSync cradle in just minutes a day... An optional  recharger kit is great when you're away from your PC. You can also charge  up during auto or air travel, making this the ultimate organizer for road  warriors and mobile professionals alike... Keep your meeting times,  contacts and other information organized in this elegant device with an  active matrix TFT color screen for stunning, full-color data display... The  Palm IIIc handheld also supports any of the thousands of applications  already available for Palm handhelds, with new color applications available  for download every day... Use the HotSync cradle to quickly backup and  exchange information between your PC and your Palm handheld, as well as  many popular PIMs like Symantec ACT! and Microsoft Outlook... With the  PalmModem Accessory, you can access your desktop PC remotely in just  minutes using a standard phone line. Now you can check e-mail, access  information from the office, or schedule a group meeting... Use the  infrared beam to exchange business cards, phone lists, data, memos and  add-on applications with other IR-enabled Palm OS devices... 8MB stores  approximately 10,000 addresses, 5 years of appointments (approximately  3,000), 3,000 To Do items, 3,000 memos, 400 e-mail messages and lots of  extra applications, books, language translators, image viewers,  dictionaries, games, and more... Items Included in the Box: Palm IIIc  handheld Synchronizing HotSync cradle and battery  recharger (120 VAC,  60 HZ),  Metal stylus,  Palm Desktop organizer software,  Handbook,  Getting Started Guide,  Lithium-ion rechargeable battery (internal),  DB-25  adapter,  Protective flip lid,  Palm III Series Accessory Catalog... A  great improvement to an already fantastic device, but can you really  justify the drastic price difference between the Palm IIIxe and the Palm  IIIc?", "overall": 4.0, "summary": "Palm Pilot IIIc", "unixReviewTime": 961891200, "reviewTime": "06 25, 2000"}