{"reviewerID": "A1TUUSQODOPXOE", "asin": "B00004RC2E", "reviewerName": "Frank Forrest \"Quasar\"", "helpful": [73, 84], "reviewtext": "I would ask that anyone who may be interested in purchasing this product to first try and see the unit for yourself. The reason why is that prior to actually seeing the Palm IIIc in person, I was basically going on the reviews and photos that I had been seeing in the advertisements.First of all, the screen IS NOT as bright as I had first assumed. The Palm website, the advertisements and the &quot;demo&quot; unit (a fake Palm IIIc with a printed fake screen) found at various outlets shows the screen as a brilliant white color. I thought that this was what I would see when I finally went to the store (CompUSA) to see the Palm IIIc in person.Upon arriving there, I saw the unit and picked it up. The screen was very dim and rather gray. My first impression was that the unit's brightness control was set to low. I brought up the brightness screen to adjust the unit and to my surprise, it was set on *maximum*. I asked a store rep if this unit was broken. He said no and that this was the maximum brightness. I also saw the Handspring Prism there and the screen appeared just as gray and dim.This was very dissapointing as I was expecting a very bright screen. As Palms go, it's a nice little unit. It runs the Palm software and has a truckload of software programs that are freely available on the internet. Is the Palm IIIc worth it? In my estimation, the answer is a definite NO. As this unit's primary attraction is the color screen, I find that this Palm does not meet the very basic requirements needed for a PDA...and that requirement is legibility. If you are working in a office enviornment or even in a commonly well lit area, you will find that the brightness of the screen will be a major problem...it is just too dim and lacks contrast. The screen, as I have mentioned before, is dingy looking under normal lighting conditions.The high price of this unit does not justify it's color ability. I believe that anyone in the market for this device should definitely try the unit out for themselves before purchasing it. The ads and photos you see of the Palm are very different from the real world screen of the Palm IIIc and are rather misleading.Try before you buy.", "overall": 3.0, "summary": "Try before you buy", "unixReviewTime": 976320000, "reviewTime": "12 9, 2000"}