{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B00004RC2E", "reviewerName": "magellan", "helpful": [27, 27], "reviewtext": "I just had a comment to make about the internal lithium-ion battery.I've had my IIIc for almost 18 months, which I've heard is about the life expectancy of the battery. Since it costs 1/4 to 1/3 of the purchase price of the unit to get the battery replaced, you need to factor that in to the long-term costs for the device.I still prefer the internal battery on the IIIc and the Vx to the replaceable AA batteries on the Handspring. Two other people I know have them, and at least once they've forgotten to change the batteries on their Handsprings, and they lost all their data and had to do a Hot Sync to restore it all.With the IIIc, I usually just charge it up every night so I've never lost any data. Also, a couple of times I tried running the battery all the way down until the unit won't even power on at all, to see if it would preserve the information in RAM even if there wasn't enough power to turn on the screen.That's exactly what happened. After the IIIc had recharged for about 20 minutes in the cradle, I could then turn it on, and all the data was still there. So even if it goes totally dead, if you get it on recharge right away, you should be okay. I don't know how much time you get, but I think mine was dead for at least several hours before I noticed it and stuck it in the cradle.So far my battery still works okay but it is showing some signs of aging, and I may need to replace it soon. After recharging it a few times, it refuses to charge past 65% of full, and to fix this I have to discharge it all the way, usually a couple of times, to get it to back up to 100% again.I've read that the best way to handle the battery recharges is to not discharge it completely all the time, as that is hard on the battery. You should just charge it up every day, and then about once a month discharge it all the way. Otherwise you start having the recharge problem I mentioned earlier. Still, I figure mine is still usable for another 6 months the way it is, even if it doesn't recharge all the way.", "overall": 5.0, "summary": "Some comments on the battery", "unixReviewTime": 1003795200, "reviewTime": "10 23, 2001"}