{"reviewerID": "A2UREP3Z9EU6V5", "asin": "B00004RC2E", "reviewerName": "Mark", "helpful": [38, 39], "reviewtext": "I have used the Palm V for a year and stepped up to the IIIc because the 2MB of memory on the Palm V was getting to be tight.What I noticed with the IIIc was that out of the box there is very little color support in the  standard apps. Palm provides a couple of add-ons though that show off it's  capability. Like the picture viewer. In the past months I've seen a rapid  conversion of apps to support color. From datebook software ( Datebk,  ActionNames ), to spreadsheets ( Tinysheet ) to games ( too numerous ) and  webbrowsers like AvantGo. Then there is that little handy program called  Chrome that allows you to customize colors, even the standard apps. Btw.  this is what I love about the Palm platform, whatever need arises, there  will be someone to write a piece of software to address it. In any event,  even if 3rd party software has not been converted yet, it will still run  but show in B/W. This is a good example of how Palm doesn't leave it's  customers in the cold imho. Even with the new OS there is backward  compatibility (got that, Bill?)I found the color screen a pleasure to  use. The black on white screen is very readable for e-books. Palm is  working with Adobe to convert their PDF reader to PalmOS, so 'cleartype'  technology will be available on Palm soon. The screen is really bright, I  had to turn down the brightness sometimes because it hurt my eyes, that was  good ofcourse since it increases battery life. The screen looks vibrant and  can be read even from an angle as opposed to the color screen on the HP  Jornada. Outside the screen is hard to read because the bright light washes  out the colors. This is a common problem with color screens. Make sure  whether you will use your PDA inside or outside and consider the screen you  want in that context. The screen is somewhat pixelated due to it's 160x160  resolution. However, it doesn't hurt the eyes or tire you.Battery life  was acceptable. On a 3 week business trip I had to recharge it only once.  You want to keep the brightness down to preserve battery life, but that  shouldn't be a problem since the screen is so bright anyway. You will get  less battery life if you are outside a lot because you have to turn the  screen all the way to be able to see anything.The downside for me is  size. I don't care what anyone says...you can NOT comfortably carry a Palm  in a shirt pocket. I carry it in my pants pocket, with the V I would forget  I had it until I needed it. The IIIc, it's just always 'there'. For that  reason I actually returned the IIIc and got the Vx instead. Ofcourse, this  is a personal issue, I can  only recommend to hold both a V and III in your  hand and decide what you can live with. Too me, the V is the only  acceptable formfactor, what good is a PDA if you don't ALWAYS want to carry  it with you? If it's uncomfortable carrying around, you're going to start  leaving it home. However, if you really want color, the IIIc is still the  lightest and smallest color PDA around with the longest battery life.", "overall": 4.0, "summary": "Great PDA if you want color", "unixReviewTime": 959817600, "reviewTime": "06 1, 2000"}