{"reviewerID": "ARXU3FESTWMJJ", "asin": "B00004RC2E", "reviewerName": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "helpful": [21, 21], "reviewtext": "The Palm IIIC is definitely a nice step up for Palm. Don't expect much stuff in color out of the box, though. You'll get the best results with add-on programs. DateBk4, for instance, is just superb in color. I love my  monthly view with all the little colored icons. Some of the games out now  are a delight in color, with more coming.But it's definitely not  perfect. Others have mentioned how pixelated it looks. This does seem to  bother some people more than others. I don't mind it a whole lot, but it  definitely can't compare with the great color screens on the Pocket PCs. (I  get a kick out of the uproar over the latest Jornada being 12-bit rather  than 16-bit as advertised, I would KILL for 12-bit on the Palm!)Viewing  outdoors is indeed problematic, but I found that turning the brightness all  the way up and lightly shading the screen is enough for me to use it. Not  ideal perhaps, but fine with me. I tend to use my Palm in poorly lit  situations...there the color screen is a delight versus that hideous green  reverse backlighting. Again, you can turn the brightness down when less is  needed easily enough.Looking at the Pocket PCs though, Palm has a LONG  way to go. They are pretty much the size of the Palm IIIC now, but with  more memory, better color screens, faster processors, etc. Slightly worse  battery life perhaps, but not significantly so.I am also still looking  for some REAL improvements in the base applications. Progress on the Palm  platform seems to be going too slowly for this dedicated user. Not sure I  am switching yet, but I am definitely getting tempted. If you really want  color, it just isn't that big a jump to get a Pocket PC. However, the 3rd  party apps right now keep Palm in the lead.", "overall": 3.0, "summary": "Very good, but not perfect", "unixReviewTime": 959126400, "reviewTime": "05 24, 2000"}