{"reviewerID": "A1U489SYAGQ2FM", "asin": "B00004RC2E", "reviewerName": "Shorebird", "helpful": [1, 1], "reviewtext": "The Palm IIIc was my very first handheld, and I've been using it very frequently ever since I first received it as a gift.A lot of other color handhelds are out on the market too, and some of them are even more lightweight, have 65,000 colors instead of 256, or both. Pocket PC or Palm OS. Can the IIIc stand up to and beat out the competition?You bet!The Pocket PC's are so expensive, that you could almost buy a laptop with it. The Pocket PC OS and the Windows CE OS are both VERY flawed, and a majority of the software that's on there when you buy it is Microsoft, including Outlook Express, which has a VERY high security risk and has a very bad reputation. And the screen isn't that bright.Sony Clie's screen isn't that bright, either. And the same thing goes for the Handspring Visor Prism. Those two also have 65K colors.And as for the next generation of Palm's color handheld, the Palm m505, not only does it have 65K colors, it's basically the weight of a Palm V. But, you guessed it, the screen isn't that bright.65K colors and the expansion slots are very nice features, but the IIIc's 256 colors already look great, is still lightweight, and you may not get the expansion slot, but the screen is so bright, that it comes in handy far more than the expansion slots and even more than the 65K colors.I use my IIIc a lot of times where it's pitch black, like in the car, and it shines so bright that I can see what I'm doing without any problems at all. The competition couldn't even THINK of being capable of doing that.Brightness is a key factor in selecting a handheld, and no other handheld I've seen and tried is as bright as the IIIc, and the brightness has come in VERY handy sometimes.If you buy a Palm IIIc, I also highly recommend getting two things with it:1. Palm IIIc Travel Recharger Kit2. PalmGlove Neoprene CaseThe Recharger Kit comes in really handy when you're using it a lot and when you're on the go.The PalmGlove Neoprene case is an absolute must-have case. It can resist water and is shock-absorbent. And it's made by BodyGlove, an excellent company. The cases that are made for the other handhelds pale in comparison.The Palm IIIc is an exceptional handheld and is the best I've ever seen. Ever since I started using it, it helps keep you totally organized. Its also very expandable and capable. And even for miscellaneous purposes, it's still excellent and also makes a great gift!", "overall": 5.0, "summary": "Exceptional, and by a long shot, beats out the competition", "unixReviewTime": 995155200, "reviewTime": "07 15, 2001"}