{"reviewerID": "AEPTZ4SG6U3UE", "asin": "8918010656", "reviewerName": "V. M. \"Staring into the Beyond\"", "helpful": [14, 14], "reviewtext": "Here's what you want to know.The stand is FINE.  There are only 5 working buttons on this.  This is the power button, a brightness button(s), and volume buttons.  There is no other screens, setups, no calibrations, etc.  All of that has to be done on your PC connected to this.  It is literally a straight monitor.  As advertised, not 1 dead pixel.Resolutions excellent.There is a powerbrick with this item (just an FYI).  Haven't had any issues with it.To mount the monitor on the monitor mount, put the backend on first, then put the big base on the 4 feet, screw them in (recommend using a drill on a very low setting to affix it.  The DVI connector is a good length.I'd recommend it. Went from a dual monitors at 1920x1080 (24 inch) to this beast.  Night and day.  I can have two documents up side by side with room to spare (my girl reviews allot of documents, and she was liking this hunking thing too).  It is a \"Large\" monitor (comparable to a 30 inch TV).Yes the instructions are in Korean, who cares.  The box has the whole sparta theme on it, don't care either.  It is a good monitor, good response time, awesome resolution.I would do this monitor at 2560x1600 vs a 4k monitor for 4 reasons.1) 4k monitors are $1,000+.  Yes there are cheaper ones but there cheaper because...2) Most 4k monitors run at 30hz.  Basically it means that the monitor can only display 30hz.  THIS monitor displays at 60 hz (which is fantastic).  To clarify, essentially hz is pretty much how much fps a monitor can display per second.  Now you can have a 4k monitor but if your graphics card is kicking at 1000 fps, your monitor will only support 30 fps of it (its a dumbed down version of it but hz matter, and you want at least 60, if not more3) 4k monitors may require more than 1 connection (aka 2 dvi port connections) to run well.4) 4k is still reaaaaly new.  There working the bugs out regarding creating a gaming 4k monitor that isn't over $1000.This is a 30 inch monitor, well under the 700 to 800 pricerange of other monitors that do the same thing as this one.To the gamers out there, loaded up counter strike, awesomenauts, eve online, all ran at this resolution, full screen, no bars.", "overall": 5.0, "summary": "Excellent Monitor", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}