{"reviewerID": "A1M4NJYP0WNL8Q", "asin": "B00004RC2I", "reviewerName": "Marc Ruby&#8482; \"The Noh Hare&#8482;\"", "helpful": [12, 12], "reviewtext": "I think I've had a Palm V ever since there have been Palm V's.  Now I actually have two.  Despite that, I'm not really an enthusiast.  For the most part I use the device for phone numbers and notes.  I'm not particularly fond of the Graffiti alphabet, and generally make my notes using a sketchpad utility or the internal keypad.  The Palm's advantage as far as I was concerned was that it was not a laptop, i.e., I could slip it into a pocket.About a week ago, while travelling, I wanted to write a review while the book was fresh on my mind, and I had no access to a computer.  I did have my Palm with me so I decided to write the review using it.  I quickly realized that Palms are poor tools for writing anything else but short notes.  Since I still had no desire to buy a laptop I decided to pursue another alternative first and bought the Palm Portable Keyboard.After a few moments of sticker shock, I found myself in possession of a strange box-like device that unsnaps and folds itself into a keyboard with a stand for my Palm V.  It only took a few moments to get the software for the keyboard loaded down to my Palm, and then suddenly I could have a Palm with a keyboard any time I wanted.  Considering that it folds down to less than the size of a paperback, the keyboard itself is nearly full size.  Action is pleasant and positive.  It feels a bit flimsy, which is not a surprise, and needs a firm surface under it.  Given the physical limitations, it is a tidy piece of engineeringThrough some ingenious use of special function keys the keyboard can not only enter all of the Graffiti characters, but also do a pretty good job of replacing the pen for many functions.  Don't plan on getting rid of the pen completely, though.  There are still places where only the pen can perform the needed command.  For my purpose, writing long memos, the keyboard is perfect.  Despite its price, it's a pretty ideal palm accessory.  If you use you palm mostly for keeping your schedule the keyboard is less useful, and can probably be done without.  It's nice to have the option available, however.", "overall": 4.0, "summary": "The Truly Compact Keyboard", "unixReviewTime": 1006214400, "reviewTime": "11 20, 2001"}