{"reviewerID": "AM4ZQJ0IORVWG", "asin": "B00004RC2I", "reviewerName": "Rob \"Revuman\"", "helpful": [68, 69], "reviewtext": "Do you hate it when you're using the Stylus pen on your new Palm Vx and every time you make a 'v' the palm displays a 'u' or when you make a 'k' the palm displays a 'y'?  Well palm has solved that big problem with the  smallest portable full-sized keyboard that has yet to be seen for the  Palm.Simply put, this is the best product out for the Palm so far.  Not  only is it the same size as a regular keyboard, minus the number pad, but  it also folds into one four-section square that snaps shut for easy  transportation wherever you take your pal pilot.It also functions  flawlessly with the Palm itself.  Just install the program on the disk that  comes with it onto the hard drive and then place the keyboard program on  the palm using the Palm Manager and you're all set to type away.Besides its technical strengths, it is also got a strong magnesium  casing to it to prevent damage to the keyboard itself in the event of  dropping it.  It also comes with it's own neoprene case for a little extra  padding.However, since I have to picky in order to best serve you guys  who are reading this review, it does have one or two slight problems.First, the shift button on the right side of the keyboard is a little  small.  Although aesthetically this may not be a big deal, once you start  typing you'll see that every now and then you his the up button rather than  the shift key and are typing in the middle of another sentence.Second,  although it's smooth sailing when the palm is attached to the keyboard,  taking it off and placing it on the keyboard is a little difficult.  The  reason is that the platform, although stable, is a little flimsy, comprised  of a plastic spine and a thin metal support.  One time I almost broke the  stand trying to get the palm out of the darn thing.Don't get me wrong  though.  Compared to all other keyboards (i.e. the IGo) and all the other  things that could have been wrong with it, the Palm portable keyboard is a  must buy for people who pack their palm full of notes or anything else.  It's quick and easy to use.  And although a little more expensive than the  IGo, it's worth the extra money and is a quality palm product...just like  the palm itself.  Enjoy!RevuMan:  Get out of the way Stylus, Keyboard  coming through...Peace!", "overall": 5.0, "summary": "It's Fullsized, portable, and easier than Grafitti!", "unixReviewTime": 960422400, "reviewTime": "06 8, 2000"}