{"reviewerID": "A3B0PPZOUA6U9I", "asin": "B00004RD8K", "reviewerName": "BlueIce", "helpful": [4, 4], "reviewtext": "I ordered a 3rd unit to replace one of two that had crashed (non stop scanning for a DVD until it got to 2nd machine.  I figured the 1st unit crashing was a fluke,so 8 months after getting the 3rd unit guess what  non stop DVD scanning...Cause is an obviously piss poor spindle motor being asked to be the center of a DVD Jukebox.How do I know this.. well open the darn thing up and give that little motor a bit of persuasion and presto it works and will do so for a couple hours until it sticks again.Currently have a spindle motor on order for the first ($44 from Pioneer, plus whatever time it takes me to swap it out.),  will try and see if the one year parts from pioneer takes care of the last.Why these machines have such a inadequate spin motor is beyond me. Just be warned since this motor seems to be used on the bulk of their DVD products.Other than that I love that I can have up to 600 DVD's stored and playable at the press of a button. I just want better reliability out of them.** Follow up **After shipping and everything new spin motor was $64.  It is a bit technical to install, so if you have never done anything like it suggest repair shop or someone that has.  Tools needed:  solder iron,  jewelers phillips, #2 Phillips, small needle nose, magnet or fingers for screw drivers, paper and pencil (clean place to work is a must also)To get to motor...remove cover, the entrire circuitry board sitting on top rear of machine  (4 screws),  the upper portion of the disc tray (6 screws), armature that pushed dvd into place and finally the assebmy that contains motor and disc read.To pull circuit board assembly, most connections are simple push in hardened circuit runs. There are also 4 connections with grey wire running to them that only require the upper portion of the white connectors be pulled up a bit so that the wire pulls from them. Remember all these connections and how they run, especially with the motor as they will bind up the system if you run them wrong.To get to motor there is one screw that has to be removed on the motor assembly along with a spring. Next there are 4 blue rubber shock absorbers, that can be unseated with the #2 phillips by gently poking them out. Finally just press back a tab that holds assemble in plastic mount and pull it out.You will have to look through spindle to see the 2 screws that attach motor to the assembly, they are itty bitty things so becareful. Last desolder old connections red and black wire and reassemble in reverse order, making sure everything is free to move correctly.  There is one circuit run that if not put in properly will cause the assmebly to not beable to read your disc as it will bind system up, so carfully make sure it is free to slide back and forth without binding after you reassemble it and before putting the housing back into system.Give it a good look over before firing it up and use a single disc to check it out. I had to pull cover back off as I had no remote or out put.. darn a pair of feeds that got pushed under circuit card.Everything back together and machine is working like new again (yeah) Just hope this replacement motor lasts longer than the original now  :-)", "overall": 2.0, "summary": "2nd unit of 3 to crash for same reason...", "unixReviewTime": 1298592000, "reviewTime": "02 25, 2011"}