{"reviewerID": "A2WER6C7Y0T4D2", "asin": "B00004RDL5", "reviewerName": "Dan2345", "helpful": [6, 6], "reviewtext": "I read all the raving reviews and thought this would be a slam-dunk, but no so!I had the Sony CDP-CX400 which I had for 10 years. I always loved it and it always worked flawlessly. It started to develop some squeaking noises during CD loading so I tried to repair it and broke it while doing so.Here are the shortcommings which made me decide to return the item. They might not seem like a big deal, but having used those features for 10 years I would really miss them.1) The single biggest complain I have is that you can't scroll through your CDs to see which CD to select, even if the CD's have CD Text. How am I suppossed to find a CD? The Sony has multiple functions for that. E.g. if you scroll through the CDs (even if one is playing) it shows the full CD text (or the title you entered with the keyboard) for every CD. That allows you to easily find a CD. You can also scan alphabetically, scan by artist and so on. All this is missing from this CD player. That makes is unusable. If I am missing something then please comment and let me know (I double that I will change my mind about this player though).2) One small feature, but one I used a lot is the \"delete\" option. The Sony allows you to delete tracks on a CD. That is a great feature. If you buy a CD and you only like half the tracks (or it turns out it is one of those CDs where only 2 tracks are good) then you can just \"delete\" a track and it will never play that track ever again (normal or random mode).3) The unit does NOT show the CD Text for the track! Again, maybe I'm missing something here, but the Sony does first scroll through the entire CD title and then always shows the track that is playing. The Pioneer just shows the track number. What the heck?4) The CD title (with CD Text) is only 8 characters long (it does scroll). 8 characters? That reminds me of 1980 Dos-filesystem. Come on, it is 2011 after all.5) No keyboard hook-up. Ok, so I already knew that I had to do a compromise and copy ALL my 300 CDs on my computer to get CD text. But I'm not so sure if I really want to do this. It is nice with the Sony that you can just enter the titles directly at the CD changer.6) Sound. Not quite sure, but I think my Sony sounded better. But maybe now I'm just being totally biased. Anyway, the CD changer does not sound that great and I'm using optical out into an expensive receiver.7) Cost. The Pioneer costs $100 more (65% more) then the Sony CD changer. For what? Less features?This will be the first item I am going to return to Amazon. I never bothered returning anything, but there is no way I stick with this CD changer.The Sony still has some short commings, I really thought that today they would have a CD player which you could hook up with Eithernet and update the CD titles or so. But I guess in todays MP3 world there is no incentive for these companies to invest in old school CD technology. Bummer.", "overall": 2.0, "summary": "Very very disappointed - Have to exchange it for a Sony", "unixReviewTime": 1301961600, "reviewTime": "04 5, 2011"}