{"reviewerID": "AGSC327PXS3W6", "asin": "B00004RDL5", "reviewerName": "D. Musicant \"Muse\"", "helpful": [2, 2], "reviewtext": "I've had a previous model, the Pioneer PD-F1007, also a 301 disc player (this comment is for the PD-F1009), since January 2000, and it's never let me down far as I can recall. I chose it over a Sony 300 disc player at the time, the deciding factor being that the Pioneer supports the time remaining feature on the playing track, when selected, whereas the Sony player did not support the feature. I think it was a handsomer unit, in addition, the LCDs being yellowish rather than the glaring hot white of the Sony. I paid about the same as this newer model sells for now.I never use random play, so can't speak to the complaints here about it.This player supports CD Text and that was an important factor in my decision to buy. More and more CDs support that now, and I've always burned CDRs using that feature, inputting the data (including track titles) when the original disc doesn't include it. It's a crucial feature in my opinion.There are search functions, but I rarely use them. Instead, I have a database of recordings I've inserted into the player from which I print reports. So, I can find what I'm looking for in a snap, entering the slot number on the remote.Speaking of the remote, well, my eyes aren't so good. Early on I made adjustments to the remote, cutting out sticky dots, arrows, pointers, numbers, pieces of yellow tape, what have you and affixing them to the remote, sometimes with clear plastic tape. I never mess with that stuff now, but it's all there and it helps me find the functions I use most very quickly. I was kind of lost without them. It would just be a mass of black buttons to me without them.The only lacking features that come to mind are:1. The inability to control headphone volume from the remote.2. The to me inconceivable necessity to delete CD text for a slot whose CD Text supporting disc has been removed from the player. Put a different disc in the player in that slot, and if it does not support CD Text, the player believes that the newly inserted disc has the text of the previous disc, which is bonkers. Well, it only takes a 1/2 minute to manually delete the info for that slot from the memory of the player using the remote, tapping the keys, but it shouldn't be necessary.", "overall": 4.0, "summary": "I've been very pleased with the Pioneer PD-F1007 for almost 11 years", "unixReviewTime": 1291939200, "reviewTime": "12 10, 2010"}