{"reviewerID": "A1P3DDFL423B3C", "asin": "B00004RDL5", "reviewerName": "Mitch Haile", "helpful": [40, 40], "reviewtext": "I've owned this changer for about 6 months.  My main fear of buying a large jukebox such as this was whether it would work:  Reviews on Amazon and elsewhere of Sony and JVC carousel changes seemed to indicate that failure rates were high.I was very excited about the CDText feature:  With so many CDs in the changer, an on-screen display of the CD titles without manually entering them seemed like a good feature.  Unfortunately, the changer only seems to support the 'title' field.  I wrote some scripts for Linux to munge the title field to include the artist, but since most of my music is in iTunes (and not on a Linux machine) I eventually quit bothering with CDText altogether (it would be nice if iTunes supported CDText) and just burning the CDs from iTunes.My solution is that I have a print out listing of the CD slot locations.  Not elegant, but it works well.Another concern I had when buying this changer was whether it would work with CD-Rs.  After reading reviews of other brands that claimed the changers were scratching CDs, I knew I was not going to put my original CDs into the changer.I can happily report this changer works fine with CD-Rs.  I've never had a store-bought CD in this changer.I have an optical cable from the changer to my receiver; the sound is wonderful.  Other reviews have mentioned hollow sound from this changer when using the analog connection, and I'm inclined to agree.  Use an optical cable if possible.  Regardless, it sounds as good as my other two 5 disc changers if not better (they are not high end gear, though).Other reviews have complained the changer is slow:  For me, the only place where I feel it is \"slow\" is when detecting that no disc is loaded into a slot.  Actually changing out one disc for another seems rather fast, though of course there is a delay (but it's probably not desirable for the changer to be throwing discs around quickly afterall).  Speed is not really a problem for me with this changer.Construction is solid and the remote is well laid out and compact.  This is my only Pioneer component, but I am very happy with it.", "overall": 4.0, "summary": "Excellent changer, but wish the CDText support was better", "unixReviewTime": 1139097600, "reviewTime": "02 5, 2006"}