{"reviewerID": "A1IF5UP2PK2T4U", "asin": "B00004RDMR", "reviewerName": "Bobbity", "helpful": [155, 157], "reviewtext": "First off, let me say that this camera is incredible, and worth every penny.  I've owned mine for about a week, and I've taken some incredible photos that look like they came out of a magazine (and I'm an amateur at best).Now, let's get realistic about the camera.  I want to provide enough factual information to allow people to make their decisions about whether or not this is the right camera for them.  TheCoolpix 990 has tons of great points.  Most notably, it's 3.34 megapixels (3.24 effective), and thus produces top-quality images with incredible sharpness.  Another thing that was had me sold was the fact that you can go into full manual mode with this camera.  You can choose either shutter priority, aperture priority, or full manual (including fully manual focus).  This aspect of the camera should appeal to the professional or &quot;artsy&quot; photographer who wishes to customize the camera to get the exact effect they want.After you upgrade the firmware to v1.1, the speed of certain camera operations are a bit faster, but the camera is already originally very fast.  Reviewing photographs in &quot;Play&quot; mode is a breeze, and there's not much delay when paging through them.Buy rechargeable NiMH (nickel metal hydride) batteries and a charger before your camera ships.  The alkaline batteries that ship with the camera will die within hours,guaranteed.  Also, grab the amazing Maha C204F charger.  It allows you to leave the charger plugged in with batteries in it indefinitely, without ruining the batteries at all.  The charger will save you several hundred dollars in batteries.A few drawbacks about the 990 (yes, they do exist): BSS (best shot selection) feature is kind of weak.  It's supposed to let you take 10 shots and it chooses the best (&quot;the one with the most detail&quot; I believe the manual says, whatever that means).  On some occasions it has actually chosen blurry photos over the sharp ones.  I've no clue how this works, but Nikon needs to reevaluate this function.  And a warning: don't rely on this camera for good long-exposure shots.  Shutter times of 4 seconds and longer in a dark setting will sometimes show a lot of noise in the photograph.  This is a very noisy camera (audibly and graphically), so try to limit your exposure times.  Also, please note that you will NOT be able to access the &quot;info.txt&quot; file that people in other reviews have mentioned.  Yes, the camera saves all photo details (shutter speed, ISO, flash, aperture, etc.) to a file called &quot;info.txt&quot;, but you CANNOT access the file unless you're using a card reader.  The NikonView software will only let you pull photos from the camera, nothing else.I'll conclude this here because I could rant on for a while on other great points.  The camera is truly amazing, buy it now.  Yes, it has drawbacks, but no camera is perfect--and this one comes pretty close to perfection.  This camera is comparable to the Olympus C3030, so check that out as well.  The features of the C3030 are similar, and in some ways the camera is a little better (the movie mode actually records audio!), and a little worse (uses SmartMedia only).", "overall": 5.0, "summary": "My unbiased opinion on this camera", "unixReviewTime": 972345600, "reviewTime": "10 24, 2000"}