{"reviewerID": "A1GYN77I2M4LQN", "asin": "B00004RDMR", "reviewerName": "James L. Wilson \"wilson99\"", "helpful": [108, 109], "reviewtext": "As a semi-professional commercial photographer, I know what quality is and how much it costs. Bottom-Line for starters, the Nikon-990 makes great  color shots with very (not so suprising) High-detail. The Advertisments say  &quot;good&quot; for 8x10 photos; as a very picky guy, NIKON is telling the  truth. The 5x7 prints are shockingly clear with brilliant colors. Since not  many prints are not made larger than 5x7, the superlative colors in this  print size will likely give the Film Camera buffs a challange. This camera  is easy to use &amp; small, however has an exhaustive number of features.  My wife and our 13 year old, carry it on all vacation locations; And when I  don't want to carry my larger and heavier commercial camera. I was truly  shocked at the excellent picture quality of the NIKON 990 which also  includes great software, so after a picture taking day/nite, one can easily  connect to the yellow video plug on your TV (or Hotel TV) for a slide show  of the days activities. I would recommend purchasing two (2) 80MB memory  card with the camera purchase, so you'll get plenty of picture  opportunities (an 80MB card has room for 50 shots per card at max its  resolution) without having to worry about running out of memory. So for a  day's shooting two 80MB cards will give the equivalent of four (25-shot)  rolls of film.  Since you can erase shots that you don't like, take MANY,  MANY shots and then pick the best ones you like to save, and for printing  or e-mailing. I bring my laptop with me on trips, so in the evening, I can  copy the photo-files to the lap-top's hard disk, and erase the camera  memory card, so there's room for another 50 photos available in preparation  for the next days photo activities. NIKON provides serial, USB cables, and  software to accomplish this simply. Definitely do NOT buy a digital camera  with less than 2,000,000 pixels. (The older models, presently having good  sale prices, are technology of 3 years ago, and you'll wish you spent the  extra money for a higher resolution camera). Since NIKON has been the  camera business for many, many years, its no surprise that they have  created an electronic imager (the CCD Chip) with EXCELLENT Color quality  and detail. This is must have, you'll not be dissappointed. If you're on a  tighter budget check out the KODAK-280 at less than $500 which takes  excellent photos for a 2,000,000 pixel camera. If you have another few  hundred dollars, check out the SONY or OLYMPUS dye-sublimation printers,  which produce actual photo quality continuous tone prints up to 4x5 sizes;  These printers are not dot-matrix's with all the little dots. The camera  and the printer makes for a great combo family gift for under $1,500, that  anyone in the family can use without having to even turn on a computer, as  the printer prints directly off the camera memory card. Don't make yourself  craze, since DIGITAL Cameras are slightly different than a typical film  point-and-shoot cameras, be sure to read the instruciton booklet, before  pushing all the buttons. The documentation NIKON provides is very easy to  understand. So take it slow when you open the Box for the first time. It's  intuitive to use, after the first 2 outings, you NOT need to keep going  back to the booklets. My wife and 13 year old son love this camera (as do  I)and they have no trouble dealing with the camera's features, which are  exhaustive.  This 3.340,000 pixel camera is one of the best I've tested  yet. ONE more point, the camera can twist at its middle (permitting the  lens to point up or down, with the LCD Pannel staying directly in-line with  your eyes) which is an amazing engineering idea which gives the  photographer a whole new perspective for taking pictures without having to  have the camera pressed against your face. The LCD screen is bright even  out doors.  JLW/2000/08/25.", "overall": 5.0, "summary": "NIKON's CoolPix 990 is VERY-VERY Cool.  More than Cool!", "unixReviewTime": 967161600, "reviewTime": "08 25, 2000"}