{"reviewerID": "A2AFT2VCH2S01B", "asin": "B00004RDMR", "reviewerName": "J. G. Heiser", "helpful": [66, 66], "reviewtext": "The Nikon Coolpix 990 has been a great camera-I'm extremely pleased with it.  This is a good choice for an experienced or ambitious amateur photographer.  Most of my previous experience has been with a Panasonic that cost a little over half what this one did.  In comparison to that camera, the Nikon has better color saturation, is quicker at the draw, and of course has more features....  I've been very pleased with the way that the 990 allows control over both shutter speed and aperture, color balance, focus and metering points and several more obscure settings.All digital cameras are battery pigs, and this is no exception.  A good  optical viewfinder (including support for zoom) is important in a camera like this for two reasons.  First, the color screen is useless in bright sunlight, but second, it provides you with a battery-saving option of turning off the monitor.  An LCD screen on top of the camera provides a readout on the most common settings (aperture, shutter speed, resolution &amp; quality, storage, 'ISO', flash settings, manual focus distance).  Japanese electronics tend to have lots of features, reached through obscure combinations of buttons.  While I would hardly categorize this camera as being 'completely intuitive,' most of the functions are pretty easy to operate.  The more advanced settings are reached through a tabbed menu on the monitor, which is reasonably easy to use.  I've also found that the monitor is very accurate in both brightness and tone.  The monitor has several different modes-if you leave it turned on, the default mode is to superimpose some of the most-used camera settings over the picture.  This is similar to but not a complete duplicate of the readout on the top LCD screen.  You can also leave the menu on, superimposing it over the image.  While this covers part of the image, it also makes menu options available for immediate use.  Unless you are in very bright light, what you see on the monitor after taking a picture is what you get-I've never been disappointed that a picture didn't turn out like it appeared on the monitor (brightness and hue are adjustable).  Although the monitor is small, the view feature lets you zoom in and scroll around on stored images so that you can look at them more closely.The configuration of the camera is unusual, splitting the viewfinder, lens and flash from the other half of the camera and allowing their separate rotation.  I usually don't rotate the lens, but sometimes it is convenient to do so, allowing you to take pictures over your head or around corners.  I bought a small minipod and found that the rotating lens assembly provides some extra flexibility when clamping the camera to whatever happens to be available.  The on-board flash is OK, but the red-eye reduction facility doesn't work very well.  If you don't use an off-camera flash, you're living with substandard lighting anyway, but there are more effective red-eye reduction systems on other built-in flashes.It doesn't matter how slick the controls are, or how good it looks if it doesn't take acceptable pictures.  I've been quite please with the camera's performance in many different light conditions.  I've had fun capturing the Christmas lights in Z&uuml;rich, and my best picture was a misty Fall scene on Mt. Pilatus with yellow and red leaves.  It took me 6 tries to get the exposure right (that's why you buy a camera like this), but it perfectly captured that dreamy backlit scene and its Autumn colors.  Pictures don't always come out as rich as negative film, but they aren't bad and when they are good, they can be very good.I've found that close-ups work well, and macro mode is fun.  I've even used my 990 to copy signs or even pages in a book.  It is a quick way to capture text that you need to refer to later.  After you've taken a picture of a diagram or text, view it and use the zoom function to make sure that what you've just taken is legible in the monitor.The camera has more continuous shooting options than I know what to do with.  The multi-shot 16 feature lets you create a single collage that consists of 16 pictures.  That's the kind of gimmick that you can't use very often without wearing out your audience's patience.  If you want to create a short movie, though, you can do that too.Speaking of night pictures, I had a terrible time figuring out the self-timer.  When you put it in self-timer mode, the close-up icon (flower) comes on, and so does the red eye icon.  It turns out that you are stuck with this configuration, which isn't really optimal for night scenes. ...  Given the availability of multi-second shutter speeds, and a sensitivity adjustment providing an effective speed of ISO 400, some owners will undoubtedly pay for the MC-EU1 release, and the bulb setting is pretty much useless without it.I like the USB cable.  Once you've loaded Nikon View on your computer, connecting the camera to a USB port and turning it on automatically makes the camera accessible as if it were a removable drive.  I've been traveling with just the USB cable and find it a very convenient way to pull pictures into my laptop and delete them from the memory card.  Connection of the USB cable automatically turns off the color monitor, and subsequent battery drain seems to be low....  I think most Nikon owners would appreciate a more advanced text than this, but it is comprehensive and has helped me better utilize my camera.In summary, automatic operation is very good, and if desired, this camera offers the ability to control every aspect of the photography process.  It has less waiting time than many other digital cameras I've used, it is relatively easy to use, and it takes good pictures.  It's a winner!", "overall": 5.0, "summary": "I really like this camera, good choice for ambitious amateur", "unixReviewTime": 977011200, "reviewTime": "12 17, 2000"}