{"reviewerID": "A2GHFM7D00AMGW", "asin": "B00004RDMR", "reviewerName": "M. McEachen", "helpful": [62, 74], "reviewtext": "Boy - when this camera can get a good focus lock, there's enough lighting, the planets are in alignment, and angels sing, the pictures that come out of this camera are OUTSTANDING.The only problem, though, are those pesky angels and planets. They just don't cooperate.I've used an Olympus  C2000-Z for the past year. I found the pictures to be of somewhat  consistent quality - some better than others - maybe 3-5 out of a  &quot;roll&quot; (16MB smartcard) to be worth sharing with my family.I bought the Nikon 950  before I got the Oly - and had to return it out of frustration with the  user interface and the inability of the camera to obtain a focus lock - and  take the picture.And that's if the camera didn't lock up. Heck - it's  not Windows. You shouldn't need to &quot;reboot&quot; your camera. In a  week, the 990 locked up (requiring me to take the batteries out) five or  six times. The 950 was just as bad.I found a better UI with the 990 -  but similar frustrations with focus. In low light situations, you better be  on a tripod, and have a flashlight handy to let the camera get a focus  lock. From what I understand, there are cameras coming out (Fuji has one)  that have what SLR owners are used to - a low light focus assist  illumination lamp. This camera desparately needs one.If you need to take  a picture of something moving - get a focus lock BEFORE your subject gets  into view - or the camera becomes very confused, and you're left staring at  the viewfinder's blinking green &quot;I'm not ready to take a picture - I  can't focus&quot; light. And your subjects look at you, smiling politely...  &quot;Did you get it?&quot;&quot;No.&quot;&quot;Boy, that camera is  slow, huh? I thought the box said 'superhigh performance'?&quot;&quot;Ha  ha. Very funny. Where's my old Oly? I want this shot.&quot;Anyway - make  sure you buy it at some place that has a 30 day money back guarantee. You  may need to exercise that guarantee.(Besides the bad focus  and system hangs, I also found Nikon's Windows software to be buggy. You'll  want to get a standalone USB card reader. And why didn't Nikon embrace  SmartCard Type II? I want to use that IBM microdrive, gosh durn it!)BTW  - Digital photography is GREAT. I'm hooked.", "overall": 3.0, "summary": "Hit and miss", "unixReviewTime": 962755200, "reviewTime": "07 5, 2000"}