{"reviewerID": "A36VJLLJTI7TIA", "asin": "B00004RG6K", "reviewerName": "Bill Lehecka", "helpful": [39, 40], "reviewtext": "I'll admit it, I'm a techno-junkie.  I have to have all of the new-fangled gadgets that are out there.  Call it compulsion.  I bought the Creative Nomad II for the sole purpose of having one, but after I received the product, I came away with a product I can't help but be pleased with.For such a small device, the sound on this gadget is incredible. I can't believe I'm listening to an MP3 from such a small device. Let's forget that the SmartMedia card I have holds 64 Megabytes (a feat on such a small card is just unimaginable to me).  You can control the treble and bass (along with 4 presets Rock, Pop, Classical, and Jazz).  Best of all, the skips are very rare.  Unlike what most people have said here, I've had one or two. Nothing major, but a few for some reason.  The battery was full, if you're keeping score at home.I love the voice recorder.  This innovation automatically makes the Nomad II a more useful tool outside of listening to music.  With the capability to record 4 hours worth of sound bytes (with a 64 MB card), you could record a 3-hour lecture, transfer it to your computer, and keep an archive of them, without worrying about having enough tapes or missing something in your notes.I only gave the product four stars for a variety of reasons.  Even though I marvel at the size of the SmartMedia card in relation to the memory on it, I'm always afraid I'm going to snap it in half when I place it in the Nomad II.  If you're careful, you'll be fine. I'm afraid that if I break it, I might have to shell out another ($) or so to replace it.  I also found the navigation to be a bit hairy in some instances.  Then again, I have a big thumb, so take that comment with a grain of salt.  I also did not lkiek the fact trhat I had to buy a separate docking cradle, although Amazon does have, in my research, the best price for it.Overall, this is a great product.  If you want your MP3 player to do more than play music, get this item now!", "overall": 4.0, "summary": "Amazing", "unixReviewTime": 973641600, "reviewTime": "11 8, 2000"}