{"reviewerID": "A1KZDMCI54UXIY", "asin": "B00004RG6K", "reviewerName": "Eddie", "helpful": [54, 54], "reviewtext": "Before I bought the NOMAD II, I read a lot of reviews from Amazon. I saw there were a few downsides to this product, but I took my chances anyway and I do not regret it at all. I believe this product to be the best mp3 player out in the market now.I admit, I don't know much about mp3  players (this being my first one), but compared to the reviews of the other  top selling players, the NOMAD didn't really have much drastic flaws to it.I'm not going to get all technical now, except the fact that NOMAD can  support other future formats like WMA, and most of the other top-selling  ones do not.OKay...NOMAD has a limited memory of 64MB. Most of the  others do too. Yeah, there are some that hold 96MB now, but who  knows...wait a few years and it'll probably be a couple Gigabytes...that  is, if future formats of music files do not make mp3's obsolete...or if you  really want to wait that long for it to come out. When you think about it,  it's not really all that bad. Of course, people would like the player to  hold infinite amount of music... 64MB is just not enough, I know. I'd love  it so much if one Smartmedia card could hold 100 songs compared to  12-15...I also wished CD's and tapes can hold that much at one time, too.  Speaking of that, hey...can tapes zip from one track to another? Does it  give CD quality sounds like the mp3 players do? Can tapes hold more than  20-30 songs averaging 5 minutes a piece? And CD's? Burn as many mixed song  CD's you'd like, but you can only do them once on each CD, that is, if you  do not mess it up in the process...and they take a lot of time. Plus, you  can't hold that many songs in there either. Basically, you got the same  limits as you always had with portable music players with the exception of  a lot of extra convenience involved. Believe me, this little gadget is very  convenient. It's light as a feather. It won't skip. It won't &quot;eat the  tape&quot;, wear down the motor, wear down any heads (tape heads),...no  need to clean the heads or lenses since there are no moving parts. The mp3  player isn't fragile like CD players. You bump into someone with your CD  player in your backpack, there's a pretty good chance your CD player will  be...killed. With this unit, you don't need a backpack. Just slip it into  your front pocket. Run into anyone you want and I'll guarantee there'll be  no damage to your unit...unless the person you ran into beats you up first  and punches you in the chest, crushing it. I could go on forever with this  but I must point out some other &quot;downsides&quot; to this unit.I  read somewhere that the FM radio wasn't that great on this. Works fine for  me. I mean if I were in a basement with no windows, surely I'd get bad  radio receptions. I'm not saying that the reviewer who wrote the complaint  about bad reception lives in a basement...I'm just saying radio signals  vary wherever you go or wherever you are. I get good reception where I'm at  now, but if I move south of my neighborhood, I get static on my FM  radio...as well as my cellular phone.Some reviewer said this unit  doesn't have a fast forward or rewind...YEAH IT DOES! Hold the  &quot;&gt;&gt;&quot; or &quot;&lt;&lt;&quot; down a bit and let it go.  Yeah, yeah, you see?I read the Diamond Rio unit has a problem with  battery power. It drains out quick from just transferring songs through the  USB. I've been using this NOMAD for days and the battery just keeps going  and going and going...Unlike some downsides to other units, this one  doesn't require and &quot;encrypted&quot; mp3. Just load it straight up as  it is from your PC or MAC.OK, it's time to get a little  philosophical...you can't have everything you want in life. What I mean is  be thankful for what you got. There's a lot of complaints of little petty  things. &quot;It can't hold enough songs&quot;, &quot;The batteries make it  too heavy&quot;, &quot;The headphones don't fit my head&quot;, &quot;The  buttons are too small&quot;, &quot;There's no built-in microwave&quot;,  &quot;It doesn't have a bottle opener at the end of it&quot;...too much  whining about things that aren't so serious. It plays music and is  convenient. That's what it was made for and thats what it delivers. Believe  me, no matter how perfect another player might be out there right now, the  companies who develop these little gadgets are working on another as I  speak that is ten times as advanced and tens times as perfect. You could  wait around for the next couple years waiting for better player and brag  all about it. In the meantime, me and all the other NOMAD owners will be  enjoying our music while you sit there and wait. By then you'll be sitting  exactly where we are now while another like you is waiting for the next  better player to come out after then.I don't mean to offend nobody with  this review, really. I'm just saying for those who plan on purchasing an  mp3 player, this one will do great. I think its the best one out there for  now. And try not to look for what's wrong with it. Concentrate on what is  great about it and enjoy your [money's] worth.", "overall": 5.0, "summary": "Overall, it's the best player in the market...for now", "unixReviewTime": 962496000, "reviewTime": "07 2, 2000"}