{"reviewerID": "A14VXKTBKGZ9SD", "asin": "B00004RIUB", "reviewerName": "Michael Marco \"friendly neighborhood tech guru\"", "helpful": [6, 6], "reviewtext": "If you're using Windows, installing this may be a bit of a challenge. This worked for me:1) Install the Palm Desktop software if you haven't done so already. You'll need 4.0.1 minimum. (I have 4.1.)2) Download the latest PalmConnect USB Kit drivers from the palmOne site. These are a separate download from the Palm Desktop software! The file is a .zip archive; extract the files to your desktop or any other easy-to-remember place.3) Do not connect the USB Kit to the HotSync cradle yet. Connect it to your computer first. If Windows reports that it has found a \"PalmConnect USB Adapter\", you're on the right track. When Windows asks you for the location of the drivers, give it the location where you extracted them in the previous step.4) Connect the USB Kit to the HotSync cradle.5) Right-click on the HotSync Manager icon in your system tray. Make sure \"Local USB\" and \"Local Serial\" are both checked.6) Attempt a HotSync. If it doesn't work, right-click on the HotSync Manager tray icon. Select Setup and go to the Local tab. Change the COM port until you find one that works.So much for \"plug and play\", eh? If your system has a serial port (if it's a PC, it probably does), use it instead and save yourself some cash. You're not gaining any speed at all by going USB--this product is merely a converter, not a speed booster--and as you can see, it's a lot more effort than it's worth.On the other hand, if you have a USB-equipped Mac, it works as advertised, no glitches at all. Just make sure that you install the latest Palm Desktop for Mac software first, not the outdated version on the CD! Get it from the palmOne or Apple website. I recommend the latter, since it won't require you to provide personal information. Just search for \"Palm Desktop\" from the apple.com front page, and it should be the first result.", "overall": 3.0, "summary": "Highly recommended...if you're a Mac user. Otherwise, no!", "unixReviewTime": 1118620800, "reviewTime": "06 13, 2005"}