{"reviewerID": "A2EDFATBY4VNTS", "asin": "B00004S9AK", "reviewerName": "D. Pritchard", "helpful": [2, 2], "reviewtext": "For several years, I owned and higly praised the Kensington Thinking Mouse.  An amidextrous and comfortably-fitting pear-shaped mouse, it offer 4 highly programmable buttons that would dynamically take on different assignments according to the application in use.  While that could become confusing to some, it wasn't bad at all when only 3 or 4 application sets were created.When I built a new PC and needed to maximize the available IRQs for new devices, I decided to go with a USB mouse and free up the IRQ assigned to the PS/2 mouse port.  But, the new PC had both Windows 98 and Windows 2000 on it and it turned out that Kensington really fell behind in updating their MouseWorks software for Windows 2000...in fact, only recently have beta versions become available.So, time to go mouse-shopping.  After trying a wheeled-mouse at work, I decided that was a very nice feature worth having.  Spoiled by my Thinking Mouse, I also wanted 3 or 4 programmable buttons.  In comes the Intellimouse Explorer.  I bought it only to return it after discovering that it didn't track as smoothly on screen as my high-resolution Kensington mouse did.  Also, the wheel seemed a little too &quot;loose&quot;, rotating with less &quot;feel&quot; than I like.  A Logitech mouse followed that and was returned for reasons I've forgotten.  Hoping the Windows 2000 software would be issued soon, I bought a Kensington Mouseworks 4 button USB mouse with wheel.  I didn't like the shape that well, but at least it was USB and it would work under Windows 2000 albeit without full functionality....surely the new drivers would be out soon?  Nope.Before Kensington could get out even a Beta driver for Windows 2000, here comes the Microsoft Intellimouse Optical, advertised with 25% improved response.  I bought it and found the performance claim was valid in that I no longer observed the jittery tracking of the on-screen cursor.  The shape was smaller and more comfortable to use than the Intellimouse Explorer, and although not as flexible in its programmability as my old Thinking Mouse, at least it was fairly quick to change the key programming if I so desired.  Best of all...it worked with Windows 98, 2000, and Millennium (which I had on a laptop).Overall, this mouse is very comfortable to use and response is excellent.  About the only quirkiness I've noticed is that very rapid movements of the mouse do not translate well to the cursor...it can't keep up, but such movements aren't typical of routine use.  Changing the acceleration improved this characteristic but didn't eliminate it.  I still think the wheel feels a little too easy to turn but, truthfully, I'm not sure I even think about it that often.  About the only change I'd make would affect the ambidextrous design...I'd like the right-side button to be moved more up toward the corner where either it or the upper right key could be controlled by my middle finger.  For some reason, using my ring finger to control a key has never felt that comfortable, but even this remains a petty complaint.I gave this mouse 5 stars because it is more nearly that than 4 stars.  Kensington has a new Optical Mouse Pro out that is very similar in design to the Intellimouse Optical, but the Windows 2000 drivers aren't ready yet (1 year after Win2000 release).  As much as I liked the Thinking Mouse and 5-year warranty with toll-free support offered by Kensingston (hello Microsoft??), I may likely buy the Optical Mouse Pro once the final Wind2000 drivers are released.  I'll keep the Intellimouse Optical for certain, but may relegate it to my laptop or work PC if the Kensington delivers fully on my expectations.", "overall": 5.0, "summary": "Microsoft steals away my Kensington loyalty...so far that is", "unixReviewTime": 978912000, "reviewTime": "01 8, 2001"}