{"reviewerID": "AM4ZQJ0IORVWG", "asin": "B00004S9AK", "reviewerName": "Rob \"Revuman\"", "helpful": [21, 21], "reviewtext": "It's been over a decade since the standard mouse saw any real change in design.  Sure they found a way to place 40 million buttons on the face of it without any trouble, but it still had the same problem that has been plaguing mice for years and that has landed them in the trash after about 6  months...they get junked up from massive use.  And on top of that, no one  wants to clean them.  So, as usual, the think tank at Microsoft worked it  out for a while and came back with what I think is not only the most  inovative mouse of its kind, but also the most stunning, precise, and  comfortable mouse ever made.The Intellieye, or optical eye, in the  IntelliMouse Optical is the thing that makes this mouse so great.  Using a  small motion sensor camera in the base of the mouse, the mouse will respond  even to the slightest touch and work just about on any surface.  In  addition, since there are no internal tracks or moving parts, there are no  more cleaning jobs or sticky mice.  It works perfectly every time.Also, this mouse, unlike it's larger brother the Explorer, fits beautifully  into your hand as if it was meant to be there and all the buttons are  positioned in easy to use places.  Also it is great for both righties and  lefties since the side and top buttons can be programed for either type of  user.Besides all of that, the red glow it emmits from its base  around the &quot;eye&quot; creates a very cool effect, no matter what kind  of place setting the mouse is in, and especially in the dark.  It is also  made to connect with any type of PC (PS/2 input) or Mac (USB Adapter  included) and is an all around great product.Only one little gripe, if  you happen to be one of those people with slightly bigger hands, you might  want to go with the larger model simply because you won't bump into the  side buttons as often.  However, beware, It's big and clunky compared to  this mouse. And in most cases, the IntelliMouse Optical will do just fine  even without those two extra side buttons. . . This mouse is a must  buy, even if you think you have the best mouse out, you ain't seen nothing  until you've seen this mouse in action.Revuman: I need a vacation, peace  people!", "overall": 5.0, "summary": "The 21st century mouse, which I'm using now", "unixReviewTime": 956534400, "reviewTime": "04 24, 2000"}