{"reviewerID": "A154R0EH8V8J23", "asin": "B00004SABB", "reviewerName": "Davey B. \"Gadget Geek\"", "helpful": [4, 4], "reviewtext": "I asked for the Bushnell Powerview 12 x 25 binoculars for Christmas because I wanted something compact enough to carry into concerts and plays, but high enough magnification to get up close for things like football games and nature watching.The binoculars accomplish that purpose fairly well; the case is fairly inconspicuous and has a belt loop to carry it on your hip, and the binoculars themselves are smaller than my open hand when folded up. The problem with having a higher magnification in a small body is that it's harder to keep the image you're viewing steady, however. The smaller field of view with the 25mm objective exacerbates the issue, as well. Knowing what I know now, I probably would have gone with a 10 x 50 set of binoculars instead. Yes, they'd be much larger to carry around, but the slight decrease in magnification along with the doubling of the objective size (which determines how much less or more you can see at once at a given magnification level) would have led to a more enjoyable experience for my uses.But my own ignorance aside, my only real gripe with these binoculars is the focusing. The main focusing roller works well enough, though having since used a rocker-style focuser, I much prefer the speed and viewing-stability of that type to having to roll the focuser back and forth.These binoculars also have a separately adjustable right-eye diopter focus, however. I had never seen this feature before getting these binoculars, so I searched the internet to find out its purpose.From Binoculars101.com:\"Most of today's binoculars will allow you to separately adjust the focus on one eye (usually the right eye) with a diopter. This is done to compensate for differences between your eyes so you see the clearest image possible through your binoculars.To make the diopter adjustment, pick a distinctive object to focus on that is beyond the close focus distance of the binocular, but not too far out in the distance. Initially, come to a sharp focus on the object using the center focus of the binocular (with the diopter-corrected eyepiece side blocked off or that eye closed).Once you've got the first eye focused as sharply as possible, close it and, then, open your other eye (the one on the diopter-corrected side). Carefully, without moving the center focus of the binocular, see if you can improve the image sharpness through this eye by slowly moving the diopter adjustment back and forth. Once you've found the setting which gives you the sharpest image, note it and leave it there -- you're done. From this point on, you simply use the center focus to adjust both eyes while viewing.Note: You should properly set the diopter adjuster when you first use your binocular (make note of your setting). Check the diopter setting on your binocular every so often to be sure your eyes haven't changed. Always check it whenever you share your binocular with someone else.\"The problem is, the diopter adjustment has no way to be locked in place once set on these binoculars. Inevitably, it always gets slightly turned when I'm getting the binoculars in and out of their case, passing them around to let other folks look through them, or simply carrying them around my neck with the included cord, so I have to reset my focus nearly every time I use these. Highly annoying, especially when carrying them outdoors and hoping to get a quick glimpse of wildlife that's on the move.Overall, I'd rate these 4 out of 5 stars. I like them, but I don't love them. The form factor is good, the optics are nice enough for the price, and they are light, compact, and easy to carry without looking like a wandering tourist everywhere you go. If you can get past the focusing annoyances (perhaps lightly gluing the diopter adjustment in place or making Sharpie marks on the adjustment ring and binoculars body after setting them to more quickly realign them each time), they're a good buy. Just make sure you really want and need the 12 x 25 magnification if you're getting the same pair I did, as 10 x 50 is more of the common, \"every day\" size I see most casual users with at sporting events.", "overall": 4.0, "summary": "12 x 25 version is good quality, but frustrating right-eye diopter focus", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}