{"reviewerID": "A19VISO9EHD1OM", "asin": "B00004SABB", "reviewerName": "JNieporte", "helpful": [12, 12], "reviewtext": "I was debating between these or theTasco Essentials 8x21 Binocular (Black)seeing as the specs were almost identical. I got both. This could very well be a Copy-and-Paste of my Tasco review, but that would be very redundant. The differences are:1. The Tascos feel more sturdy. There's not a durability problem with the Bushnell, but the Tasco just feel more solid.2. The Tascos have a longer span of adjustment, in both the center focus and the diopter. The Bushnell's focus is just fine for me, but it's nice to know that the Tasco can adjust to a wider range of eye types.3. The carrying case feels more durable with the Bushnell. Both cases close with a Velcro strip, but the Bushnell's are made with a more sturdy material. Both will attach to a belt, but the Bushnell's stitching is better.Both binoculars come with a lens cleaning cloth, and it seems the same for both (except the color). Typical size and quality of low-price optics, but they do the job. Both binos have the same neck strap, which is rounded and will prevent them from falling off your neck. Just don't use the strap for steadying the binos (don't pull the binoculars forward while the strap is around your neck to keep them steady) because you'll probably snap the cord. Both have rubber armoring, which is better than nothing, but nothing to really brag about. Both have fold-down rubber cups for eyeglass use; again, nothing to write a lot about.In summary, they're both great optics for under $15. There's a one dollar difference, but I prefer the Tascos. I'd give this a 3.5 star if I could, same as the Tascos, but it's hard to beat either set for the price.EDIT: After being stored in its pouch in a rucksack for almost four months, the eyepiece with the diopter (the right eye piece) came off. It can be superglued back on, but you have to be careful that you don't glue the diopter in one place.", "overall": 4.0, "summary": "Good, Good", "unixReviewTime": 1330300800, "reviewTime": "02 27, 2012"}