{"reviewerID": "A3KBJHIZCU52OW", "asin": "B00004SABB", "reviewerName": "J.O.O.", "helpful": [0, 1], "reviewtext": "This review is for the 8x21 clam version of the Bushnell compacts. It has the company name in metal color on the side of the binocs'tubes. It seems Amazon has merged this item with the (older?) 8x21 compacts with the company name in rubber relief. I believe there is a substantial difference between the two items, especially in dimensions.I bought these binocs for 14USD, and I do not think they are worth more. The current price for a factory demo version at the amazon.com is about 21USD.Pros:Very small and lightweight. I'd say up to 15% smaller than most other 8x21 compact binocs.Comfortably wide field of view. Does not give feeling of peeping through a hole.Reasonably sharp in center part of image at distances less than 100m.Correct color rendition.Robust and more \"expensive\" feel than the average compact binocs.Reasonably priced.Pouch included.Cons:Despite the wide field of view it is only the absolute center of the image that has any useful sharpness to the image. In addition, the glass gives an \"uneven\" image somewhat similar to looking through the bottom of a glass bottle. This is, however, not so bad that it renders the binocs useless. They work pretty well at shorter distances for objects centered in the image.The focus wheel tend to be less responsive. When shifting the focus direction of the wheel there is a lag until the image responds to the turn of the wheel. This makes the binocs less useful for observing non-stationary objects such as birds.In conclusion I'd say they are pretty OK for the price I paid. I love the small size, makes me bring them along in my bag to and from work every day. I would, however, not have anything against paying 3-4 times that money for the same binocs if the producer could put better glass in them [I read somewhere that they have BK-7, most mid-price binocs have BAK-4, I don't know if that would make any improvement. However, better glass would give a quite nice set of very compact binocs well worth a little more bucks]. In fact, there is a big jump in price (and unfortunately often also in size) between the ultra-cheap 8x21 binocs on the market (usually 10-20USD) until the next level above (usually (>80USD).", "overall": 3.0, "summary": "Bushnell 8x21 clam w. company name in metal color.", "unixReviewTime": 1333929600, "reviewTime": "04 9, 2012"}