{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00004SABB", "reviewerName": "Nuknuk", "helpful": [1, 1], "reviewtext": "My kids are playing with an old toy pair of binoculars. It is missing an eyepiece, it is old and abused for years.  I decided to look for a more decent pair so they can enjoy more their newly found hobby.The first entry after searching online came out to this little guy. It is only around twelve bucks at the time of this review which is just perfect for its purpose.  It also shows hundred of reviews that are positives.It came with a neat black case and a piece of cleaning cloth. Some manufacturers make them with cheapo plastics, this is made of rugged rubberized construction.  It looks like it can withstand some rough handling by my kids.Right in the middle sits a ring for  focusing. My eyes needs prescription glasses, but it provides wide range of focusing that I don't even need my prescription glasses to see clearly on it. Now, that is convenient.  You can also adjust the distance between the two eyepieces easily so it can adapt to both kids and adults.  The only thing missing is a zoom, but I often see that feature only on more expensive and bulkier binoculars.Dont expect a sophisticated lenses at this price. The lenses are basics but capable.  They are also small, making the images dimmer than those with bigger lenses.The only thing I am disappointed is the width of view or coverage.  Most of the time, when you go to a concert or a game, the only thing you will see is the head of the performer.  This is worse when you are not sitting very far because sometimes you want to see the whole body, the whole group, or even part of the stage. Well, I guess it is pretty much the standard.  But it will be great if there are other versions of these binoculars available in other magnification, let's say 4x, or 6 times.  In that case, I will grab another pair right away, specially if they offer them at the same price.", "overall": 4.0, "summary": "Good set of eyes", "unixReviewTime": 1318636800, "reviewTime": "10 15, 2011"}