{"reviewerID": "A20AAU9AUQ2ATE", "asin": "B00004SABB", "reviewerName": "Virgin User", "helpful": [1, 1], "reviewtext": "I've had these Bushnell Powerview 12x32 folding roof prism binoculars about 4 weeks.  After working out the best way to hold & adjust them to my eyes and after getting used to them, I found them easy to adjust, easy & smooth to focus, clear and conveniently compact.The binoculars are inexpensive, quick to grab, easy to use and reasonably clear & effective.  I use these for quick looks out the kitchen window at birds in nearby trees. . .short dogwoods.  They work well for that purpose (I'm not looking up into 80 foot pines with these).  I'm anxious to see how they perform out on broad water in a kayak for more distant viewing.I think I prefer the larger objectives in this compact folding roof prism style binocular (where the objective is 32 part of 12x32 or 16x32). I haven't tried the smaller objective Bushnell roof prism binoculars in this Powerview model but I never have been satisfied with similar smaller binoculars in other brands.An important consideration is the size of the image presented by the binoculars to the pupil...which is determined by dividing the objective lens size by the power, such as 32 divided by 12.  I don't want to go and get all the proper terminology but in general, the smaller the binocular's value of that ratio is in relation to the user's pupil size at the time, the less satisfactory the viewing experience is.  That's probably why I'm not happy with the smaller objective lens sizes in a binocular...the image presented to my eye probably is much smaller than my pupil -- You wind up having to hunt for the image in the eyepiece a lot.Anyways, the only thing I don't like about this folding compact style is the double hinge they all have.  When using them I sense they are folded unevenly and cock-eyed which bothers me...I like to have just a single hinge.  But then, these are \"Compact Folding\" BECAUSE of the double hinge and even if they are uneven it shouldn't affect the viewing.", "overall": 5.0, "summary": "satisfyingly compact, powerful and clear.", "unixReviewTime": 1391385600, "reviewTime": "02 3, 2014"}