{"reviewerID": "A14I1F2H7NOYDC", "asin": "9573212919", "reviewerName": "S. Dancer", "helpful": [11, 13], "reviewtext": "I purchased this player for my 9 year old daughters Acer Aspire One Netbook D255E for her to play DVDs, games and to load Norton 360 on the netbook.  Item arrived quickly in a box combined with other items from Amazon, simply wrapped in one layer of bubble wrap and put in the box.  There were no receipts etc for the shipment, and only a small booklet for installation on older Windows OS systems.  The booklet DID mention that the unit is a CD/DVD burner, but required additional software to do so (I checked on my Acer 5532 laptop after plugging it in and running a diagnostic check, it is only a DVD/CD player).  It also came with a USB driver disc which was unnecessary for my installation, and two USB plugs, one for media and one for power.  Simple to figure out though, just plug in both USB plugs and Windows 7 Starter did the rest.  However, like others with Windows 7 Starter, I had to download VLC Media Player to play DVD's.  No problem there, except for the additional junk that came with the Media player download which I immediately deleted. The CD/DVD player works great now, and sounds especially awesome on earbuds.  I have a Windows anytime upgrade from Starter to full home version ready to install, but I may return it now that I have this DVD/CD Rom working and the free desktop download correction fixed.Cons:  I was let down that so many others purchased the same unit and received a free upgrade to a DVD/CD burner.  That is not a real major setback since this is for a 9 yr olds netbook, but it would have been nice to have as a back up to our other burner.  One for all and all for one I say!Pros:  Easy,  I mean EASY setup.  Also found it nice that you do not need to utilize both USB cables, just plug in the media plug to the USB 2 and that is all required.  Great price considering the seller guaranteed it would work with my Acer One Netbook model.  Free shipping!!!!  Case seems to be sturdy enough, (just don't pick it up and turn it side to side while it is playing).  Region settings available, so it plays most everything.  GREAT DVD picture on both my Acer laptop and the Acer Aspire one netbook, very pleased!Overall,  I would recommend this to anyone needing a DVD/CD rom for the Acer Aspire One Netbook,  provided you do not want a unit for burning CD's and DVD's..UPDATE 01 March 2011:  The more I use this player the more I like it.  The picture on my daughters Acer Aspire one Netbook is sharper than the one on my Acer Laptop with widescreen HD. If you are an Acer Netbook lover, this is the external player for you.  Just a reminder, it is not a DVD/CD burner.Final Update 04-14-2011:  I finally upgraded my daughters Acer One Netbook from Windows starter to Windows 7 and the new OS picked up this player with no external help required for drivers etc.  I also upgraded to 2GB memory, (see my other reviews), which took all of about 4 minutes to accomplish!  My daughter is playing video games and watching DVD movies off this little player like there is no tomorrow!!  I am amazed that this player has performed as it has.  Total thumbs up for quality and performance!!!  I upgraded to 5 stars, simply based on the overall performance and lifespan thus far.  For the price you simply CANNOT go wrong!!!", "overall": 5.0, "summary": "Perfect for the Acer Aspire One D255E Netbook!!", "unixReviewTime": 1297987200, "reviewTime": "02 18, 2011"}