{"reviewerID": "A2X9SQSKV4WKT0", "asin": "B00004SB92", "reviewerName": "Another Weekend Warrior \"armie\"", "helpful": [9, 9], "reviewtext": "Installing this product wasn't as smooth as I would have liked.  First of all, I have a DSL connection that requires PPPoE to connect.  My provider gave me the software to do this.  However, the router takes care of this for you and you therefore must remove any PPPoE applications off your computer, as this will cause you not to be able to surf the web.  Even though I did this, there was still lingering software that kept popping up a dial up networking connection whenever I tried to enter a URL.  I then learned how bad linksys' customer service is.On average, my wait was about 40 minutes and I generally got technicians who were more interested in getting you off the line than helping you.  Sometimes, you get an operator who takes down your name and number, promising that someone will get back to you.  Hah!  They never did with me.  I admit that the problem was not their fault, and knowledge in tcp/ip still wouldn't have helped (knowledge that I do have).  However, do realize that it took me about 3 days worth of 45 minute per call phone calls to get my first pc up and running.  I didn't have the same problem on any of my other computers (including my Linux box).Also, the current software that I have (I bought the router about 1 1/2 months ago) has three small bugs in it.  First, once I make a connection to my dsl modem, the status page continually refreshes, letting me know the status.  However, once connected, the status always says &quot;connected&quot; even if I know that I'm not (like if I unplug the phone line!).  Secondly, the router doesn't save the password, even though I check the checkbox saying that it should.  So I have to therefore enter the password every time that I go to the admin page.  Thirdly, the box rarely gives accurate user info.  For example, four computers may be connected.  However, when one checks, they may see only one two or three people connected.  I only have four computers connected right now.  However, the incorrect info would definitely cause problems in a soho.  However, these bugs may have been fixed (and I may simply need to download the latest router OS), so...Overall, great product.  I've had computers collecting dust simply because it was impossible to share all of the resources before.  I've downloaded a file on separate computers, at an average rate of 55kb/sec on each computer.  Obviously, this will be affected with more users.  However, great product overall.", "overall": 4.0, "summary": "This is a great product, but...", "unixReviewTime": 979603200, "reviewTime": "01 16, 2001"}