{"reviewerID": "A2AZTRF410E765", "asin": "B00004SB92", "reviewerName": "A. Steidl \"High Tech Hippie\"", "helpful": [0, 0], "reviewtext": "/me sighs:  finally, I got good interwebz again.  Having two computers, and a neighbor with shoddy wifi, I could only get a good connection on one computer.  I got tired of this, so I ordered this, with which I have had great experience in the past, previously owning about 4 of these.  I use a lot of BitTorrent traffic, downloading and uploading different -nix distros and other FOSS and CC files, and every other router I've ever tried crapped out on me after about 5 minutes of BT traffic.  The BEFSR41 is my personal favorite, and am glad to have gotten it at a decent price here.  I definitely recommend this router.  I got this one refurbished, and there's nothing wrong with it at all, save for some minor issues setting it up.  UPnP port forwarding is one of its features I'm glad to have, uTorrent showed all green for connections.  I have not noticed any drop in network speed, like with a few other routers.  Easy install, good features, reliable performance, durable case, nice-looking case, overall A+ in my book.EDIT:  Okay, I'm sad to say that I've gotta change my review here to one of negativity.  I have been suffering from a broken GUI within the router (at 192.168.1.1).  The router does not accept UPnP, even though I've managed to set it to accept UPnP.  When I fire up uTorrent, my mIRC connection drops, and my web connection drops to about 300kbps dl speed;  after much frustration, and even a firmware upgrade, I have decided to give up on trying to make it work.  Soon as I save up some money, I'll be buying a brand-new router, and will likely hang this router in front of my archery target.The only reason I'm still giving the router 2 stars instead of 1 is, first, the one I have is refurbished, and the NIB ones I owned in the past didn't suffer these problems, and second, because my problems might be isolated to just my router, not all refurb's.", "overall": 2.0, "summary": "Will not buy refurbished ever again", "unixReviewTime": 1280793600, "reviewTime": "08 3, 2010"}