{"reviewerID": "A3S87ZOPB3UM9N", "asin": "B00004SB92", "reviewerName": "atmj", "helpful": [10, 13], "reviewtext": "Though my review below is specifically for the single port system, the only reason, I did not go to the 4-port system is that we have 5 computers that needed to be on it.  If you only need 4 this is the way to go, then you have a $20 hub eliminated. According to the computer guy that sold it to me the only difference  between the 1 and 4 port systems, is just that.I bought the DSL Router on the suggestion of the local computer company that sold me my computers. I know nothing about networks. I was told by the local cable internet provider that I could only support 3 computers simultaneously on my cable line at one time. If I wanted 5 computers hooked up simultaneously and I did, I needed to pay for 2 separate cable lines plus 3 additional IP addresses. This is because they said they could only support 3 computers per line. This would be about $95 per month.The local computer company guys told me I could use this DSL router to create my own IP addresses. All I needed was a hub that would support all 5 computers and a network card in each computer. I would need the hub and the network cards anyway for the cable connection, so this only cost me about $100 more to reduce my cable cost from $95/month to $40/month. This is a $55/month saving. On top of that I have a hard firewall and it is 100% legit. This I checked out.As my family is hard core gamers (Everquest mostly) and my daughter and I surf the net, it is not unusual for us to have all 5 computers on at once. We have not noticed any degradation in our connection. Three of the computers are on Everquest most of the time.As for hooking it up, I found the instructions to be a bit sparse, but complete (in retrospect) for what I was trying to do. I routed my cable connector directly to the DSL box and then the DSL box to the hub and the hub to the individual computers. Routing to the individual computers was the hard part. This was only because of the location of the computers and the fact I live in a center-split house.When it was time to enable it, I did need help. However, I called the local computer company that sold it to me, for assistance. I can't speak for Linksys support. But, the things I had to change were pretty easy. If you try and change the input port location on the hub and corresponding switch orientation on the DSL router you should be able to get it right, by process of elimination. There are only 2 of each. This is really all I had to do to resolve the problem I had.For usage, since we have had it up and running for about 1-1/2 months now, we ocassionally crash it. I wish I could say why, but I think it is due to a loose connection. In this case we turn off all the computers and reboot the DSL box, by turning off power to it. It has fixed it every time. The reset does not seem to fix this problem. If I was more knowledgible, I could tell you why.I can't speak for the firewall, as I have no clue how it works.All in all, this was a very good investment.", "overall": 5.0, "summary": "Great product, can save you money.", "unixReviewTime": 975456000, "reviewTime": "11 29, 2000"}