{"reviewerID": "A2SW560X584UEF", "asin": "B00004SB92", "reviewerName": "Barbara B.", "helpful": [1, 3], "reviewtext": "First off, I have to admit that I'm an intermediate (at best) user. Far from a newbie (I started back in the pre-DOS days with a Kaypro!) but I have been left in the dust in recent years.I have been using an older version of this same model router for 7+ years and found it incapable of handling my ISP's hi-speeds. I was clocking only up to about 5-8 Mbps download (my ISP supposed to deliver up to 20 Mbps).The good news is that once I managed to get this new version up and running (about 2 hours and 3 phone calls), it was fantastic. I'm getting 16-18 Mbps over most test servers.The bad news is that it wasn't as simple to install it as I'd hoped. First, I connected everything EXACTLY as the Wizard instructed. When it came to configure my router, it said it could not detect a router. I tried again. It said it could not configure the router. I tried again and again. I called my ISP to make sure the internet type, etc., was correct.Then I called Linksys and got their call center in the Phillipines. The first customer service person I called was very friendly but told me I'd need to connect directly to the modem so I could configure the router manually. Since I was having a bit of trouble doing that, I got a case number and told her I'd call tech support back.I managed to get online by bypassing the router altogether and called Linksys back. I got a guy whose accent was so thick I had trouble understanding him. He was rude and impatient. He told me the advice the first person gave was wrong -- that I had to be connected to the router in order to manually change its settings (which is, I have to admit, the correct info).When I had a little delay in reconnecting the cables (with him waiting impatiently on the line), he asked me how many cables I had. I told him I had a cable from the computer to the router and one from the router to the modem. He asked again, with clear impatience in his voice, how many cables I had. I repeated my answer. Then he said it would be best is they did a remote hookup to make the changes to my computer. I do not feel comfortable with that but, reluctantly agreed. Then he told me they'd be an extra charge for the service.I said NO, that I needed him to help me install the router. Well, I'm not saying he hung up on me, but the line went dead at that point. Coincidence? Perhaps.Anyway, I kept fiddling around, using different cables (NOT the one that came with the router) and giving my cable modem time to reset itself (that may have been the key, I don't know).Suddenly, everything was working!!!!  I'm so happy with the performance that I'm like a new mother who immediately forgets the pain of childbirth. I have a healthy 16 Mbps connection and can easily dismiss the labor pains.So, bottom line is that the router itself is excellent but the documentation and customer service stink.", "overall": 4.0, "summary": "Great ... once you can get it hooked up right", "unixReviewTime": 1252195200, "reviewTime": "09 6, 2009"}