{"reviewerID": "A14JBDSWKPKTZA", "asin": "B00004SB92", "reviewerName": "Bob Feeser \"MillCrafters.com\"", "helpful": [4, 4], "reviewtext": "I am currently using the Linksys BEFSX41, and it works effortlessly. It too is a hardware firewall based router. Two events happened that made me buy another router. 1) I needed more connections beyond the four. 2) I wanted to have audio capabilities with MSN Messenger. (A free service that gives you free audio with anyone you connect with via messenger, so you have a free long distance method.)What does all of this have to do with the BEFSR41? Simply this, I was having trouble getting the audio portion of Messenger to work on my network. A top tech site stated that if their isn't a multimedia option to allow in your router, then get the BEFSR41, which is what this review is all about. It has the multimedia option, while still having the hardware firewall.Additionally if you go to the Linksys.com site, you will see it is still their most popular selling router, next to one wireless model. With the current running rebate, it is also a steal. It's a buy even without the rebate, whereas I had paid half again as much money for my current unit.These Linksys routers hook up without a glitch. Getting a good connect speed with Verizon took a lot more effort. Not because of Verizon, but because I had some hum in my lines at home. Check your lines at home by picking up a phone, preferably one with a volume knob on it. Turn it all the way up, and press any number on the keypad. 5 for example. Then listen real hard. It should be dead quiet. If it is not, then that is wreaking havoc on your connect speed. Noisy lines are caused by running phone lines near power lines. One noisy run, will ruin the whole house. Getting off on a tangent here.I have had my Linksys router for over 6 months, it just sits there with the lights lit. It never stalls, never fails, and does a very nice job. I also like having the house set up on a network.All of my tech professional friends say, \"For professional business applications, get a hardwired version of a router, because WIFI is too easily penetrable. I must admit I set up a WIFI system for a friend of mine, with a Linksys router, and XP as his operating system, and nothing could be easier.Highly recommended. This Linksys router is the top pick for a wired router.", "overall": 5.0, "summary": "Top pick for a wired router", "unixReviewTime": 1078963200, "reviewTime": "03 11, 2004"}