{"reviewerID": "A31C4P50CH9ET4", "asin": "B00004SB92", "reviewerName": "Bob Zeidler", "helpful": [5, 5], "reviewtext": "I have had this gadget sitting under my desk for several weeks now, just waiting for Christmas so that I could give my wife her present: a new 17-inch flat-screen iMac, so that she would have her own toy with which to get on the Internet. Since I was already on-line, with my Apple Titanium G4 PowerBook by way of cable modem, we obviously needed a \"solution\" for our home-office local area network so that she could do the same.Before I actually hooked everything up, I was slightly apprehensive. The outer-box graphics for this Linksys Model BESFR41 Cable/DSL Router didn't say anything about Macintosh compatibility. And, when I unpacked it, there was this 20-page foldout full of instructions on how to install the router for Windoze PC users, with three (!) separate sets of instructions for different Windoze OS's and five (!!) pages of help for these poor souls, should anything go wrong or simply not work. And not a word about Macintosh hook-up! I even inserted the CD-ROM in my PowerBook, only to find not a single Macintosh file!Well, apprehension be danged! I powered down my PowerBook and cable modem, followed the simple cabling instructions, and then simply powered everything back up (including the new iMac for its first time). Immediately, my PowerBook was back on-line with no perceptible loss of speed.More to the point, my wife's new iMac required not a bit of configuration. I simply launched both of her browsers (Internet Explorer and Apple's Safari), and there she was, on the 'net without a single configuration step required by me; everything was configured automatically. Now, THAT'S the way operating systems SHOULD work!With both Macs on-line and surfing, neither of us could detect any loss of speed. I suppose this is attributable to, as the product description says, \"...the full-duplex speed of its built-in EtherFast 10/100 four-port switch.\" A very impressive device indeed! And, while it's a shame that not a mention of Apple is made anywhere in the printed material or on the CD-ROM, this oversight is of little consequence to Macintosh users who - like me - EXPECT that things will work properly, first time out.Two side benefits: (1.) Software firewall protection now seems unnecessary. Since installing the router, I've checked my Norton Personal Firewall access history, and have noted that not a single access attempt has gotten past the router. (2.) The size of the router perfectly solves another problem for me. With the same physical height as my external Syquest FireWire drive that sits on the opposite side of my PowerBook, I now have matching \"stands\" on which to put my new Cambridge MegaWorks 210D self-powered speakers.Now, if you'll pardon me, I'll go review the 17-inch flat-screen iMac and the Cambridge MegaWorks self-powered speakers. My wife and I really spoiled each other this year. :-)Windoze users have my sympathy. And the very first Windoze user who e-mails me can have the CD-ROM. AND the 20-page fold-out full of silly instructions. Totally free. I'll even pay the postage. You can never tell when you might need these two items.Bob Zeidler", "overall": 5.0, "summary": "It doesn't get any simpler than this.", "unixReviewTime": 1072656000, "reviewTime": "12 29, 2003"}