{"reviewerID": "A3S0Z7UOTUIP9R", "asin": "B00004SB92", "reviewerName": "Cool S. Ter", "helpful": [4, 4], "reviewtext": "When I found this product to be just what the doctor ordered for allowing clients on my LAN to access the internet through a single cable modem.  The physical set-up took about five minutes and the initial software set-up took about ten minutes. Had I not needed Laplink access to one of the computers on the LAN, the default settings would have been sufficient. Changing the settings is easy, through a browser window, to which access can be limited through customizable passwords. A basic understanding of networking principals is helpful but the onscreen help answered all of my questions. I didn't need any telephone or email tech support, so I can't comment on the quality of Linksys' tech support. In full firewall mode the computers on the LAN are virtually invisable to outsiders, yet fully available to the other LAN clients (according to your Windows sharing settings). You can also allow one or more computers on the LAN to open ports to the internet by using Linksys' &quot;DMZ&quot; function, and the administrator can easily monitor the connections to ensure that clients are getting access. I gave up on the software solutions, such as Microsoft's Internet Connection Sharing. They were too finicky and conflicted with the cable arrangement at my office building. With the Linksys Router there is no need to configure a second ethernet card in the connected computer or set the client TCP/IP numbers, unless you want to. The Router acts as the WAN connected computer and provides the router backbone for four direct connected clients. Additional clients can be added by connecting additional switches or hubs to the router, for up to over 200 clients.I didn't do a lot of comparison testing, but I read quite a few reviews and the reviews seem to be true, the Linksys product is easy and quick and probably the best for the money. A great deal at a super price.", "overall": 5.0, "summary": "WOW Ethernet", "unixReviewTime": 994291200, "reviewTime": "07 5, 2001"}