{"reviewerID": "A3GQKB1KF0CRPE", "asin": "B00004SB92", "reviewerName": "Deborah MacGillivray \"Author,\"", "helpful": [1, 2], "reviewtext": "I had it open and up and running and all my computers going on my 100MB DSL speed and was so happy.  Okay, it is easy to set up, BUT...then came the problem.  I run several MSN groups and suddenly I could not post messages!  Okay, I concede maybe not everyone expects to post at MSN groups, but.....Then WHOA NELLY - I went to Microsoft Windows Update Window and I could not access it.  It could not scan my computer.  Now wait a bloody minute!!!!!!!  Not being able to post in the MSN Groups is one thing, NOT being able to update your computer with Microsoft patches is Suicide!  I mean nearly EVERYONE needs to access Microsoft update window to keep their computer safe from all the wholes in XP!!!  THis is BAD OVERSITE.So I emailed them.  I got a quick response that I had to go and set up port forwarding yadayada....EXCUSE ME...suddenly the easy set up was NO SO EASY as promised.Yes, it is very good, yes it gives four computers 100MB speed at one and I am so thrilled.  However, this BIG OVERSITE of not being able to access Microsoft is ridiculous.  Yes, it can been fixed by changing the ports for forward microsoft traffic - but the point is WHY SHOULD THEY????  One of the most basic things we need to access Windows Update and you cannot unless you make changes.Those changes SHOULD HAVE BEEN DONE before the first one of this was shipping.Shame on them for making customers work, shame on them for not being as easy as they promised, and shame on them for ignoring nearly everyone will have to go through this and NOT GIVE any warning!!Four Stars for the product, four stars for their promt response - ONE STAR for their stupid plans on not including something every computer would need to access.  If your computers are newer you will likely want to go wireless instead.", "overall": 4.0, "summary": "Excellent but not as easy as they say", "unixReviewTime": 1067904000, "reviewTime": "11 4, 2003"}