{"reviewerID": "AS035WUAUHUOF", "asin": "B00004SB92", "reviewerName": "G. Miller \"http://madlinux.com\"", "helpful": [2, 2], "reviewtext": "I don't usually write reviews but I liked the Linksys BEFSR41 Cable/DSL router so much, I had to take the time to share my thoughts.Many of the online community are going with broadband these days because of the poor performance of modems, the busy signals and relatively high price of modem-based Internet service.Broadband with the Linksys is as good as it gets. Plug it in, and it works out of the box with no configuration but with some training, you can make the Linksys BEFSR41 do magic!The incoming cable from the cable company plugs in to the cable modem provided by your Internet service provider. (It actually isn't a modem but that's another story.)From there you plug the cable into your Linksys cable router and from there you can either plug 4 computers into that router or some hubs to attach even more people to the Internet. (Up to 254 without some special network magic.)That's the basics.What many people don't know is actually how your computer gets its address information. All computers, as we know, must have an IP address (Internet Protocol) to talk to another computer.The Linksys is both a DHCP server AND a DHCP client. (DHCP = Dynamic Host Configuration Protocol. I'll spare you the details but suffice to say, as a DHCP Server, this means that all your internal computers are given IP addresses from the Linksys router. Additionally, the Linksys can act as a DHCP client to your Internet service provider, as is generally required to do unless you have a business account and pay for a fixed IP address. That's fun!)So anyway, you're plugged in to the cable company and all your computers are happily getting IP addresses from the Linksys. Great. Well, there is a lot more.The Linksys BEFSR41 allows you to cascade up to 254 other computers to allow for access for 254 people to the Internet. Wow! Considering that a T1 or even a partial T1 line can cost thousands per month, paying 40-60 dollars a month to give access to 254 people is incredible. (The only problem might be if every user would attempt to download MP3s at one time, performance would be pretty bad but if only 20% of your users are web browsing at any given time, this would be ok.)There are other great features of the Linksys BEFSR41 like port filtering, where you can control the types of traffic that comes and goes through the Linksys. You can for example block all external traffic from getting in. OR, you can put up a web server and route all incoming traffic looking for a web server to that computer only, thus providing a nice security setup.This evaluation is getting too long so I'll send but suffice to say that the Linksys BEFSR41 is amazing and extremely easy to use. You manage it from a web browser interface and there are free software (Firmware) updates available from linksys This is important because us \"hackers\" are always finding a way around security devices. Firmware updates provide a way for the folks at Linksys to stay ahead of current \"hacker\" technology.", "overall": 5.0, "summary": "Wow! Connecting your computers couldn't be easier!", "unixReviewTime": 1011312000, "reviewTime": "01 18, 2002"}