{"reviewerID": "AJ0PG46QD33RD", "asin": "B00004SB92", "reviewerName": "James Starritt", "helpful": [0, 1], "reviewtext": "I bought this wireless router for use with my RoadRunner cable services.  I work from home and run a variety of network intensive tasks, throw in a wife and a Wii and this router has taken care of everything with only a minor quirk or two all year.At home my network consists of CentOS 5.2 servers, a Windows Vista Home Premium Desktop, two Vista laptops (Business and Home Premium), a MacBook, a Windows XP machine, and Virtual Machines up the wazoo.  The 4 ports are full, everything else is run through the wifi including the new Wii.  I port forward HTTP, FTP, SSH, Oracle, and Terminal Services through to statically assigned IP addresses and everything else is making use of the routers DHCP services.  In short -- I think it is getting a pretty good test!Setup was a breeze, but that is standard for Linksys routers I have found.  The instructions were clear and would allow an absolute idiot to set this up although I didn't need them being familiar with their other routers.I live in a largish apartment, and rather than being in a central location the router is squirreled away in the corner office on top of a desktop and below my TV - not ideal I know but the coverage throughout the apartment is always at maximum strength, is as fast as can be expected and I am happy.  I often play online games in my living room on the opposing side of the apartment without problems of laggyness.I first turned on the router in July 2007.  It is now November 2008 and it has been reset maybe four or five times during that period.  Wi-Fi services disappeared forcing me to power off and on again however considering that this is a router based on home usage rather than a fully fledged commercial enterprise I can handle that.  So yes, I don't get my 99.9999% uptime, but I think the five minutes this router has cost me over the last 16 months is rather trivial.", "overall": 5.0, "summary": "Reliable, cheap, secure, flexible .....", "unixReviewTime": 1227139200, "reviewTime": "11 20, 2008"}