{"reviewerID": "A3PZ4AXTY9J1DZ", "asin": "B00004SB92", "reviewerName": "Jason Ralsky", "helpful": [1, 2], "reviewtext": "I've had my Linksys router now for over 5 years.  While the this one is clearly a newer version (mine only has a 10Mbps WAN throughput) the overall quality has not changed, as I have sat down to tinker with the newer versions.What impresses me about this model of Linksys router is how user friendly it is.  The router design is simple, with easy to read information readouts via LED lights, and the device is light weight with ample room underneath for ventilation.Setup is virtually plug n' play.  I tend to follow this hookup for ideal connections (avoids random drops and DCHP problems locally).  Connect everything as instructed to the router but make sure all devices are off.  With all devices OFF1. Turn on the Cable Mode / DSL modem and let it connect2. Turn on your Linksys Router (it should turn on, and then detect a network aka.. the activity light is being well, active!)3. Turn your devices on.This lets the router fully handshake with your ISP, and also allows it to hand out local IP's while within the ISP's network.  Is it crucial. Not at all, but it does make for a more solid handshake which can reduce the chance of being dropped / resetting the router.The interface for the router is very simplistic compared to other brands.  While some options can be fairly advanced, for the most part the router comes pre-setup for a good experience and it is advised to put a password in the router to avoid people remotely accessing it w/o your permission.In my 5 years using the Linksys router I have yet to experience a random reset, lost connection or the router failing to handshake with my ISP.  It has been incredibly reliable.  There has been no packet loss due to the router having communication problems (multiple devices demanding information at once.. a bad router would get screwed up and start sending data to the wrong places)  This router also works for all games I've played, including WoW, LoTRO, Age of Conan, Aion etc  without having to open any ports (my old Netgear router constantly required me to open ports)** The only negative I can say about this router is that it is fairly sensitive to 'voltage' change on a line.  For example I plug a vacuum cleaner into the outlet in my bathroom to do some cleaning in the hallway.  the bathroom outlet and my PC room are linked,  when I turn the vacuum on 1 in 50 times the router will drop and go to \"standby\" (red light on activity) because it acted as if it had lost power for a moment.  My netgear didn't have this problem; but that said my netgear router lasted me 5 months before burning itself up. This has gone for over 5 years.  ** I am mentioning this because sometimes people complain a router drops a lot and resets itself.  This isn't always the router's fault as it could be that it is sensitive to voltage fluctuations; which can be a good thing as it does protect the device to a point.Anyhow!  Overall I have been very pleased with this router.  My cousins actually use the WIRELESS version of this router and for the past 3 years they have been problem free w/ no drops.  Linksys makes quality routers at a good price.  I have never had to deal with their customer service so I can't comment on the company as a whole, but their routers are top notch in my book", "overall": 4.0, "summary": "A reliable, solid router", "unixReviewTime": 1296000000, "reviewTime": "01 26, 2011"}