{"reviewerID": "A18D1RLW38LVLW", "asin": "B00004SB92", "reviewerName": "Juan Ortuno", "helpful": [1, 1], "reviewtext": "It does deliver.  It's very cheap, and installation was as easy as 1, 2, 3.  I had never connected a network before, and this took me seriously about 10 minutes...that was all!!!Now my family is able to get online with both my pcs at the same time, share my printer, share the cd-rom, as well as music & files between both of the computers.  I am also able now to enjoy multiplayer games in a different level -- with my own family in my own home.The routher is very easy to configure, and you just need to know the basics.  It does have a bunch of features like port forwarding, dynamic routing, static routing, dmz host, dhcp, and also supports pppoe connections.I have not noticed a decreased in speed -- I am still connected at a solid 1.4 mbpsFor the beginner, for the one who doesn't need the extra bells & wistles, I'd highly recommend it.  It's virtually fool proof, and it keeps your network hidden from internet attacks.Ever since I installed the router, my Norton Internet Security has not warned me about any intrusion attemps or any port searches or trojans.One thing that I would have liked better is that if it had come with a better manual -- it only comes with a setup guide that's very light on content, but still useful.You can, however, get the manual online using adobe reader.Another thing...To make VPN work is a pain!!!  I have still not been able to make a VPN connection work; and I've seen many, many users having the same problem.  The linksys website is not very clear on how to set it up.  I know the right ports to open, but it's still impossible to do.  That's one thing you might want to consider if you plan to do VPN connections.  Other than that, port forwarding, dmz, and other features work fine for me.Very nicely done by Linksys.  Would have gotten 5 stars if the VPN was easier to set up and configure. Definitely gets 4 stars.", "overall": 4.0, "summary": "A great affordable routher that delivers", "unixReviewTime": 1056326400, "reviewTime": "06 23, 2003"}