{"reviewerID": "AZRJH4JFB59VC", "asin": "B00004SB92", "reviewerName": "Lynwood E. Hines", "helpful": [1, 1], "reviewtext": "There are several things that I really like about this device.1) It actually works.2) There are lots of lights on the front to tell you what's going on at a glance.3) Good documentation.4) The case is designed for stacking.  Stacked units are stable, and have enough space around them for good air flow to keep the devices cool.5) All the wires plug into one side of the device.  This makes it much easier to hide the ugly wires and position the Linksys on your desk without taking up more space than necessary.6) Web based configuration is intuitive and easy to use.If you are looking to distribute your cable/dsl connection to multiple computers, please save yourself a great deal of grief and buy a Linksys, NOT a DLink.DLink makes a similar device, called a DI-704.  They have major quality assurance problems.  I bought two, one in Pittsburgh, PA, and one in Charleston, SC.  Both were flaky.  They would work for a while, then just die.  See my review of the DI-704 for more details.  So far, the Linksys unit is working flawlessly.The DI-704 also has terrible documentation.  Just a few pages of poorly translated text.  I had to go to their web page to get enough information to make the thing work at all.  The Linksys comes with a manual that tells you everything you need to know, including how to get certain popular multiplayer games to work without having to drop firewall protection altogether.  It even includes an appendix that shows you how to wire your own RJ-45 straight-thru and cross-over connectors, complete with diagrams!The DLink provides very little information via the lights on the front.  The lights indicate whether or not a computer is connected to the port, period.  The Linksys unit tells you that a computer is connected, whether or not it's running in full or half duplex mode, whether it's operating in 10Mbps or 100Mbps mode, and it also reports collisions, all with a few lights on the front of the unit.  Sweet!The DLink case is pretty boring; it's just rectangular.  Stacking them gets unstable fast, and blocks the ventilation holes.  It also takes the WAN connection on one side, and the LAN connections on the other side, making it hard to position it on a desk so that the wires are not in the way, and making it completely impossible to hide the wires.  The Linksys has none of these problems.Both the Linksys and the DLink have good web-based configuration mechanisms, however the Linksys one is superior.  It is easier to use, and the status page refreshes itself periodically; with the DLink you have to manually refresh the status page.Given the tremendous differences between these two cable/dsl router/gateway devices, it's just amazing to me that they cost almost exactly the same amount.  There's simply no comparison; get the Linksys and keep your hair.", "overall": 5.0, "summary": "Linksys gets it right", "unixReviewTime": 999475200, "reviewTime": "09 3, 2001"}