{"reviewerID": "A578ANR1FGHT8", "asin": "B00004SB92", "reviewerName": "Marc Cohen", "helpful": [7, 7], "reviewtext": "Customer feedback I had read on the BEFSR41 indicated a very solid product that performs well and is easy to install following the instructions provided. I love the product, but my experience with the installation was different. I had no luck at all on my own (and I even read the product manual -- PDF only, btw, nothing on paper -- in advance). The installation program (run from the CD accompanying the router) was hopeless. It tells you to start by leaving the router out of the system altogether, and connect the computer to the internet directly via the modem, which I did. The program then checked the internet connection, and gave this report: \"Your router is already connected to the internet, and nothing further needs to be done.\" How can this be? I wondered, my router isn't even connected. And when I did proceed to connect the router physically, the internet was inaccessible and the installation program would not work. So the installation program failed completely.Fortunately, a call to the LinkSys help desk solved the problem quickly and efficiently. My call was answered right away, and the technician (a charming and courteous young woman in India!) took me through a simple series of steps to complete the installation. (They involved connecting to the 192.168.1.1 web address and changing a few configuration settings.) It was laughably simple, and took only a few minutes.I mention this because I've read feedback on other LinkSys service encounters that gripe about the terrible customer support and especially about the foreign service technicians. My experience is just the opposite -- fast, friendly, efficient, courteous -- and no American support person could have improved on it.My question about LinkSys documentation is this: why can't they just write documentation as clear and simple as the help desk can provide? (I am no newbie, btw, having worked with computers and software for over 20 years. I've installed hardware and software on dozens of computers during that time, and I'm not intimidated by instructions for either kind of installation.)Bottom line: great product, great support, lousy documentation.", "overall": 5.0, "summary": "Great product, feeble documentation, great support", "unixReviewTime": 1134864000, "reviewTime": "12 18, 2005"}