{"reviewerID": "ACH1HJAM7UIZR", "asin": "B00004SB92", "reviewerName": "nishiko", "helpful": [0, 0], "reviewtext": "I've had this router for 2 years, and it has been great!...Linksys has great tech support...I did fry my first one doing a firmware upgrade, but that was because I used an old TFTP program (that they supplied with a different version upgrade) for a newer upgrade (always use the one that comes with the upgrade) (plus be carefull in other ways, by not having any other programs running (including the automatic ones in your startup folder and system tray), give your computer a fresh reboot before attempting install, etc.  Even though the router was fried, linksys just immediately shipped me out a new one and had me return the old one within 30 days (or else be charged).  Another thing about this company is... don't immediately install new firmware updates.  It's best to wait a couple-few months, then call in to their tech support to see if there are any issues with it.  Besides, unless there are new features you need or really desire in the new firmware, I wouldn't recommend upgrading anyway.Anyway, this router (and company) ROCKS! (this is based on much use AND probably 40 calls to tech support over the years about various issues (most of them short questions, I try not to abuse the customer support).  I don't know how they sell such a great product and support it so well when these things are going for such bargain basement prices now! I thought that even at [the price I paid}, and now I'm really flaberghasted.  I know that whenever I buy network gear, it will be from Linksys in the future (as long as they continue with their excellence in both product and customer service).Anyway, if you don't neeed wireless capabilities... GET THIS ROUTER for home/small office use.  If you need wireless too, then check out their BEFW11S4  (though I can't vouch for it, my bet is, if it's from Linksys, it's at least decent, if not great!)", "overall": 5.0, "summary": "Can't go wrong with this router!", "unixReviewTime": 1020643200, "reviewTime": "05 6, 2002"}