{"reviewerID": "A37I377QOTELM1", "asin": "B00004SB92", "reviewerName": "Optimus Prime", "helpful": [3, 3], "reviewtext": "I've had the Linksys router for about four months now and I'm still ecstatic with its performance. I consider myself a moderate computer user and set-up was a breeze. I was up and running in about 15 minutes (if you don't include the time it took to go outside and buy a Cat5 ethernet cable, because this router doesn't include one), and I thought the documentation was satisfactory.I've hooked this router up so that two of my home computers can share a cable modem connection, and I was more than pleased with the connection rates. I didn't lose any of the upload/download bandwidth, and I can download from both computers simultaneously at the maximum download rate. Definitely a plus.Many other reviewers are complaining of frequent lock-ups with the router, but I haven't had such an experience. One of my Win2000 computers has started to freeze considerably at boot-up after connecting with the router, but the other one still works fine so I can't say for sure if the router is the culprit.The added firewall feature is the greatest perk, I think. I've been using ZoneAlarm Pro before and after installing this router and ever since, I have not received a single hacker alert (I was getting frequent alerts before). I still keep ZoneAlarm on, but I think the router is holding up its end very nicely.As a final note, a couple of caveats. One, no ethernet cables are included, which was disappointing. You'll have to go out and buy your own. Secondly, the router itself doesn't look as great as the picture on the box. One you see it for yourself, you'll know what I mean. It's extremely light and seemingly made of cheap plastic. Not that it's flimsy, but I definitely wouldn't want to drop it even once. But the price is a steal. Compared to buying a second IP address and getting a retail fireall software package, this router definitely is the better deal.", "overall": 5.0, "summary": "Easy to setup and bargain for the price", "unixReviewTime": 1003363200, "reviewTime": "10 18, 2001"}