{"reviewerID": "A1F9YNY2KTBO5H", "asin": "B00004SB92", "reviewerName": "Robert L. Cochran", "helpful": [9, 12], "reviewtext": "I use this router to support my home network. It is connected to a Speedstream 5260 DSL Ethernet modem on the WAN side and 3 of my 4 computers are plugged into it. The uplink port is connected to a Netgear DS108 hub, to which my 4th computer and a NetGear PS110 print server are connected. Router performance is satisfactory at this time but I am only starting out with DSL.I buy Linksys and Netgear components which, for the most part, have performed well. There were some exceptions. I quickly realized that both companies have extremely poor technical support. Both companies refuse to support operating systems other than Windows (they must have a contract with Microsoft about that?), and putting in a support request of any sort will result in disappointment.So if you buy Linksys or Netgear components, remember you are on your own. Don't expect support. You will usually do better to thoroughly read the provided documentation, then coldly analyze whether your network falls within the parameters specified by that documentation and what you want it to do. If you don't understand this or that networking issue, then dig in and be prepared to learn about it -- elsewhere, on the internet -- and to experiment until you get things right. Search off usenet discussion groups for help. Always be aware that the component you buy may not be able to do what you imagine it should be doing. Always realize that networking components from these manufacturers are not going to work &quot;out of the box&quot; in your particular network configuration because there is always going to be some software configuration you will have to do. The stuff you have to do will influence component performance very heavily.I don't buy these brands because of a superior quality perception. In fact, I'm still feeling my way around networking hardware components and I'm not terribly skilled with the software side either. Both Linksys and Netgear share a monopoly on the consumer networking hardware market. Netgear and Linksys products take up most of the shelf space at your friendly CompUSA store.I'd like to say one more thing about product support in general. I'm always amazed at how people will intially send a 1 or 2 line support request, devoid of crucial details, and then become upset that their problem hasn't been immediately fixed. A tech support professional probably sees this type of initial support request 80% of the time. He or she is forced to ask questions before enough information is accumulated in order to solve the real problem. It is not his (or her) fault that the customer did little more than say &quot;I have a problem with your router. Fix it!&quot; Much more detail is needed for a technical solution.So if you put in a support request -- do yourself and the support technician a huge favor. First, carefully read the manual again to see if that helps. I promise that 85% of the time, you will find the answer to the easier problems. If you don't, take the time to carefully describe the problem and give a good background to it. Even then, do not expect stellar support from either Linksys or Netgear. But don't use this as your excuse to be a poor support customer. Help yourself and help them by doing your homework and providing important details.", "overall": 3.0, "summary": "Good Router, Think Your Install Through", "unixReviewTime": 992736000, "reviewTime": "06 17, 2001"}