{"reviewerID": "AKGGVHCCW4RKA", "asin": "9575871979", "reviewerName": "Freddy the Frog \"The Fellowship Of The Feather\"", "helpful": [47, 52], "reviewtext": "I made the mistake of abandoning my normal principal of \"you get what you pay for\"I was excited to find these so inexpensively and had planned to use them in my SU-800 master controller for photography.  The \"quality\" batteries for this unit average around $16.00 each, so the idea of getting four batteries with a charger cheaper than the cost of two normal batteries was just appealing to my \"green sense\".Now I'm back to the single use batteries, as these rechargeable's let me down time and again...  when freshly charged, they often showed voltage ratings well above 4v and this isn't workable in my units.  So, I let them run down a tad and they are usable for a blink, then run down quickly under normal use.Also, if they are not equally discharged and charged in twos, the charger will show both charged, while they are not equal upon removal... one battery showing a voltage rating of 2.2 and the other 4.0 fresh from the charger.I consider this to be a real problem and potentially damaging sensitive equipment if using a battery that actually has a overcharged condition.  Batteries rated at 3 volts shouldn't show over 4 while in service.... and again, drain quickly.I should get 1000 cycles from my SU-800 by Nikon with a fresh battery... with these, it's more like 150-ishVery disappointed.I can't provide a review of how these batteries perform in other equipment, but if you need something that performs as \"rated\" with meaningful performance life, based on my experience with this group... please continue shopping for something better.Smart Charger-  charges unpredictably3.0V batteries hold unstable charges (based on my experience with those shipped to me)Charged life- very short, around 20% of that of a normal single use battery (based on the group I received)If you need something quick and cheap for equipment with a broad operating range, then you may get something out of these.  I just can't personally recommend them.Sorry.", "overall": 3.0, "summary": "Unstable and exceed the Volt rating after charge...", "unixReviewTime": 1252281600, "reviewTime": "09 7, 2009"}