{"reviewerID": "A1AS0WT5Q7WE9M", "asin": "B00004SB92", "reviewerName": "Ron in San Diego", "helpful": [11, 13], "reviewtext": "I bought this, worked for a couple of hours, got fed up, boxed it and was going to send it back.  A computer whiz buddy of mine called, and in the conversation I mentioned what a mess the router was to install.  He said this to me.  First, make sure your automatically set up to get an IP.  So, first, left click on the start button - far left side of that bar at the bottom of the screen, then again on the control panel, then double left click on Network Connections.  Now, where you see among the many thingys (yep, I am very technical), Local Area Connection, right click on it.  Then, at the bottom of the window left click on properties.  Then scroll down to the bottom where it says Internet Protocol (TCP/IP), and left click once on it to highlight it.  Now, left click the button that says \"Properties\".  You want to make sure there is a dot next to both \"Obtain IP address automatically\" And \"Obtain DNS server address automatically\".  Then Click Ok, Click Ok again, close all of your window programs and \"\"turn off the computer\"\".  This was the hard part and it takes far more time to write than to do it, as you will see.  Now comes the really hard part.  Unplug the power cable from your internet modem that is going to your internet service provider (cable or DSL) so it's totally turned off.  At the back of the Modem, take off the cable that is linking it to your computer and plug it into the first of four holes on the router - There is a \"1\" above the hole.  Now, take the supplied (pretty blue) \"\"\"category 5\"\"\" internet cable and connect one end into the empty hole you created in your modem, and the other into the single hole in the router that says, \"Internet\" - it is kind of standing away from the other four that are close together.  Now, put the power ac plug into the router and then plug the square boxy thingy at the other end of the wire into a live AC socket.  Wait a minute or two, that's 60 seconds, while the router runs its self testing program - the power light will be flashing as I recall.  At the end of its cycle, you will have a power light on, and the number one plug light on and none will be flashing.  NOW, plug back into the modem the ac cord, make sure it is turned on and again wait a minute or so for it to cycle, reconnect to your internet service provider and then start looking for your computer, but in actuality, it sees your router and through a series of internal operations, connects to the router.  Now, you will also see the internet light on the right side front panel of the router blinking.  Once this happens, turn on your computer which will then negotiate a connection with your router and there you have it,, you are on the Internet.  Least ways, I was,, and shocked to be so too after all of the wasted time I spent not knowing this simple process.  Happy Browsing.  Ron ... PS.  I talked to the tech where I bought it and he said that though it was a discontinued model, it was known as a super work horse so his company bought a couple thousand of them.  He had no reason to just share this with me,, so,, I think it truly is a number 10 as one fellow said.PSS, You know where you found the Local Area Network before, well below it, if you are using XP and probably Vista also, is a Network Setup Wizard.  This is what I used to connect my second computer, and Yes, you will need to go out and buy a category 5 Ethernet cable for each computer you are connecting.  I just called tech support at 1-800-326-7114 and they happily helped me through the entire process on both computers.  One other possible glitch.  Since this model is out of date, you do get your full one year warranty however in my cases, I had to insist upon it as when she looked at the serial number, she said it had been purchased in 2005 and the warranty expired in 2006.  I insisted that I purchased it, that it came in a fully sealed Linsys box and I have the dated receipt for the purchase.  She noted it in the case number folks always seem to be giving out now, and said anytime I called, if there was any question, just have them look up the case number she gave to me.  So, a full one year warranty I have from the date of purchase.  I believe this is why a couple of folks were so angry saying they were charged for tech support.  Yes, after the warranty period they do charge, as all companies do, but during the warranty, you can call as often as you like and there is no charge.  Should this come up, you just have to let them know that this came in a factory sealed new box, and you have the receipt to prove the date of purchase.  They were very nice about it.  AND also,, you will not be talking to India.  You will be talking to the Philippines. They  have a Much Better understanding of English, thank heavens.  AND, last of all, yes, it is a discontinued model,, but,, It Works Like A Champ, Is a Server along with being a router thus much faster connections for all computers hooked to it,, so,, what are you buying, a model that has a long track record of working great, or something new that may or may not work so well as time goes by.  I take the one with the long track record that does what I want it to do, and does it well, and I don't care if it was manufactured in 1921. :-)", "overall": 5.0, "summary": "Awesome if you know the simple way to install", "unixReviewTime": 1208217600, "reviewTime": "04 15, 2008"}