{"reviewerID": "A2B7BUH8834Y6M", "asin": "B00004SB92", "reviewerName": "Shelley Gammon \"Geek\"", "helpful": [42, 46], "reviewtext": "About 5 minutes after I opened the box containing my Linksys Ethernet Router, I had it connected and set up without reading any instructions... the unit is clearly marked and you've really got to go out of your way to screw up.The instructions tell you what IP address to log into via your browser to get a snazzy looking login screen and administration pages. Linksys is known for its reliability and ease of use and I got recommendations from other users of this product.My less than perfect rating for this item is their total lack of acknowledgement of the Mac platform... it is to their own detriment. I have this set up with my Mac G4/400 (AGP), but mostly due to the ease of use of the Mac platform.This router comes with documentation for every flavor of Windows except 3.1, but does not give any instructions for Mac OS... not one word. It's hard to believe a manufacturer would have a potential audience of about 20 million Mac owners and not exploit the fact that their product works seamlessly w/ the Mac platform.Even their website remains silent on the Mac OS, which did leave me having some guesswork and figuring out stuff on my own as well as consulting MacFixit forums, etc.  The enclosed CD has additional instructions, but you guessed it... nothing regarding the Mac. For shame.The LEDs are pretty straight forward and it's easy to see at a glance which port is having activity. The unit is designed so that additional routers can stack and fit in an inter-locking fashion so that the legs of the unit above fit in indentations of the case below. The legs have rubberized feet pads to prevent scratching of nice desks.If you have broadband connectivity, you owe it to yourself to get a router such as this one to protect you from hackers. The Linksys Etherfast Router is known for having a dependable hardware firewall. Even if you're a Mac user, you can't do better for the price than this unit... you just may need to do some searches on the Internet for instructions by other Mac users to ease your comfort level.", "overall": 4.0, "summary": "easy to set up, nice to look at", "unixReviewTime": 1011484800, "reviewTime": "01 20, 2002"}