{"reviewerID": "A2KS0FVY2CNJ8M", "asin": "9575871979", "reviewerName": "Michael O.", "helpful": [67, 70], "reviewtext": "I've had this kit for a few months now and have recharged a pair of the batteries 3 times, and a third battery once. So far everything works as expected. I use them in a Fenix P3D Premium 100 (Luxeon Rebel LED, 11 - 200 lumens), and a Fenix P1 CE (Cree 7090 XR-E LED - 90 lumens). For me the performance is very acceptable considering how inexpensive the kit was. I get maybe an hour to 1-1/2 hours total runtime depending which brightness levels I'm using. I don't use the lights for more than 10 or 15 minutes at a time anyway so that's plenty of uses between charges for me.A nice plus is you get the car charger adapter included, too. Most kits require you to buy that separately at additional cost. Probably the only thing I would have liked with the kit is some kind of pouch to keep it all together. I made a carrying case out of an old zippered memory card/battery case I had hanging around. It just happens to all fit perfectly but it took an awful lot of finagling to make that happen!UPDATE 11-14-09I just wanted to update this review to say I am still using these cells and they are still working great. I think the runtime has improved after a few charge/recharge cycles (which is what is supposed to happen), so these are lasting even longer in my lights now. I only recharge them maybe every 4 months with occasional use of my lights. Still highly recommended.UPDATE 11-17-2010I guess it's time for my now yearly update on these batteries. They are still all going strong! I still only recharge them about every 4 months but that's because they have a very good charge retention and capacity.Another big surprise involving these batteries occurred over the summer (2010). I keep my Fenix P1 CE light on my keychain. To turn the light on and off you screw and unscrew the head slightly. If you unscrew it all the way the head comes off (that how you replace the battery). I guess the head had loosened in my pocket because one day as I was walking to my car I removed my car keys from my pocket. I stepped on something hard and happened to look down to see what it was. Well, it turned out to be one of these batteries! I had slightly deformed the top of the battery and ripped part of the plastic that makes up the case of the battery. I didn't have anything to lose so I trimmed off the plastic that was torn, and sealed the case up with some super glue. Fortunately, the battery still fit in the flashlight and it worked fine - still had a full charge! I've since charged it twice and it is still working great. STILL HIGHLY RECOMMENDED!", "overall": 4.0, "summary": "Good Kit For the Price.", "unixReviewTime": 1229644800, "reviewTime": "12 19, 2008"}