{"reviewerID": "A3MI3QBXP5I7FA", "asin": "B00004SB98", "reviewerName": "Ed Williams", "helpful": [5, 7], "reviewtext": "I used an older manual Data Transfer Switch, and began noticing Ghosts on my monitor.  After purchasing all new cables which didn't solve the problem, I figured it was the switch.  Sure enough, this fixed my ghosting problem I was having immediately.This is an easy to set up thing, and I love the ability to switch between systems with the keyboard.  However, like the other fellow stated in here, the plugs are MALE VGA.  Most of us probably are converting from older equipment, which had female AT and VGA plugs.  This has Female PS2 and MALE VGA plugs, as well as female PS2 Mouse plugs. ...You'd save half of that if you only have to convert the VGA plugs.  However, one important note, the Plug that goes to your main Monitor is a standard Female VGA plug, so you don't need an adapter for that.When assembled (especially with the gender changers), the thing takes up a huge amount of space because the plugs are mounted on the side.  If you plan on switching manually it will take a serious effort to keep all the cords hidden.  But rest assured the keyboard switching method works just as well as the manual one.  Simply hit and release, one at a time, the ALT, CTRL, SHIFT, Computer Number, and ENTER.  Switches over like magic.  So you can easily hide the whole thing behind your desk now (which is probably better anyway).There is even a LAST/NEXT mode but that doesn't make a lot of sense since the keyboard is locked until you get out of that mode.At any rate, if you're using an older switch, and notice Ghosts appearing on your screen (windows which have their white or brighter areas showing shadows of nearby window objects), this will fix your problem, but be prepared to spend a bit on gender changers.  You may want to go ahead and just switch the entire cables out for new ones, but that could be a lengthy process depending on your setup, but only a bit more expensive than all the gender changers you'd need....", "overall": 4.0, "summary": "Fixes Video Problems!", "unixReviewTime": 1033344000, "reviewTime": "09 30, 2002"}