{"reviewerID": "A3UPYGJKZ0XTU4", "asin": "B00004SC3Y", "reviewerName": "mirasreviews", "helpful": [2, 2], "reviewtext": "I had a 35 mm point-and-shoot camera for years that rarely saw the light of day. It was a nice one, too -a Leica. I didn't use it because it was too big. If I wanted to lug a camera bag with me somewhere, I took my SLR system. But if I just wanted a camera that would fit in my purse or pocket, a 35 mm point-and-shoot is too big. So I sold my Leica and bought the Canon Elph 2. I chose it because it was the smallest and the most iconic-looking APS camera that I could find. I bought the Elph for it's size, and I didn't expect it to take the greatest pictures, only to enable me to take pictures in situations where I previously would not have had a camera with me. Shortly after I got the camera, I went  on vacation. I took my Elph everywhere that my 35 mm SLR system would not go. And I used it for everything that I wanted snapshots of, as I was shooting slide with  my other camera. I had three rolls processed when I got home. And I was pleasantly surprised at the quality of the pictures! Everything  was perfectly exposed, the flash was more powerful than it looked, the grain on the 4x6 and 4x7 prints was fine. I had some great-looking shots. Pictures of a sunny beach and the interior of a restaurant came out equally well. I even got one taken through glass of the town lit up at night that came out decently. When I bought the camera I didn't think that I would find the \"H\" format very useful, but I was  wrong. The slightly wider view of the 4x7 \"H\" prints were some of my favorites. I use the \"H\" format frequently now. I suggest resisting the urge to stick to the classic \"C\" format.The Elph 2 does have some drawbacks, many of them inherent to such a small camera and film format. APS negatives are small and don't withstand much enlargement without showing grain. I use 400 ISO film, and the grain on the 4x6 and 4x7 prints is only slight and is fine for snapshots. I've never used the 800 ISO film, which would have more grain, so I can't say if it produces acceptable prints or not. The slower films, i.e. 100 ISO and 200 ISO, have finer grain, so those should be fine. I recommend against using the panorama format with APS cameras because the small APS negatives really cannot withstand that much enlargement. The panoramics are grainy. The only issues I have with the Elph 2, specifically, are: The viewfinder isn't very good -but they never seem to be in small cameras, and I've seen much worse in 35 mm point-and-shoots. And I would have preferred that the lens zoom out more. The Elph 2 only zooms out to the equivalent of 58 mm on a 35 mm camera, so you have to get pretty close to people, in particular. The newer Elph Z3 zooms out further, but is a significantly larger camera and, in my view, not as attractive. I prefer the Elph 2 for its smaller size, but you might want to check out the Elph Z3 as well.Canon makes an accessory silver neck chain for use with all of their Elph cameras. It's a great convenience to have the camera around your neck at social events, while playing with your kids, anytime you might want to literally point-and-shoot. And it saves you from having to hold onto the camera all the time. I love the neck chain!", "overall": 5.0, "summary": "Take It Anywhere and Everywhere!", "unixReviewTime": 1044489600, "reviewTime": "02 6, 2003"}