{"reviewerID": "AYWIO6OYAGFGQ", "asin": "B00004SC3Y", "reviewerName": "pm444 \"pm444\"", "helpful": [11, 11], "reviewtext": "I needed a new film camera that was truly pocket-sized, since my Sony Mavica is about as big as a videocam (but great pictures and so easy to download them to the PC).  My Dad has the Elph 2 and I was very impressed with the pictures he was getting.  Plus, I really liked the looks of the camera.  I did check out the Canon PowerShot 110, but it's slightly larger, a lot more expensive, and I really needed a camera with which I could take a roll of film, drop it off, and pick up prints an hour later.So far, I've used it mostly indoors, and am extremely pleased with the results. They are far superior to what I was getting with my older Pentax point-and-shoot.  There is red-eye with certain eye colors, but that's easily fixed by scanning the picture into the PC and manipulating the image, then having it printed from a floppy.I like the APS film format and have found that the 400 speed Kodak gets great results.  You won't even need the flash for a lot of your indoor shots when you go with the 400.  I also like getting the contact sheet instead of a bunch of negatives.  I've mainly stayed with the &quot;classic&quot; mode, but the other two are nice to have if you need a wider field of view for your shot.  I have heard that with APS you cannot get great quality with enlargements bigger than 5 x 7, but I don't usually enlarge them anyway.The best part about this camera is literally being able to take it anywhere, and being able to take candid shots without people being aware of the camera. Once they do see it, they will want to hold it and they'll have lots of questions about it, because it's so cool.If you need instant feedback on whether your shot turned out the way you wanted, then you would be better off going with the digital version, but if you want a very good film camera that is the ultimate in portability, you cannot go wrong with the Canon Elph 2.", "overall": 5.0, "summary": "Even better than I had hoped", "unixReviewTime": 997142400, "reviewTime": "08 7, 2001"}