{"reviewerID": "A2LVL416FFXCSI", "asin": "B00004SD87", "reviewerName": "G. Nolan \"Get out there!\"", "helpful": [0, 8], "reviewtext": "I had a poor experience with Sennheiser as a company. I received a pair of HD 265's. These are not inexpensive headphones and wanted closed not open headphones. I unpacked the product and put them to my ears and they broke in half. I had a piece of headphone in each hand. I called the seller and they said send them bak to the manufacturer.  Nothing like like making the customer responsible for a problem. I sent them back to Sennheiser and asked if I could upgrade to a better headphone such as the 600's and that I would be happy to pay. I have to give Sennheiser credit. They did call and offer to uprgrade for $250 plus the HD 265. I explained that I could get a pair of 600's on Amazon for less than that and keep the 265's. That did not seem to matter to them. I guess they could not follow the logic of pay more and get less.My suggestion is to stay away from Sennheiser alltogether and take a look at Ultrasone, GRADO, or Pioneer.Unlike the Ultrasone's these headphones the 600's have an in your head sound as opposed to the much more natural sounding and accurate Ultrasone's. These headphones are also very tight and uncomfortable and connot be worn for long.Although I own a pair of Sennheiser noise cancelling headphones which I like, I prefer to give business to a company with more character. I also think there are headphones with a much superior build quality and superior sound such as the Ultrasone and GRADO headphones.  When it comes to reviews most people purchase headphones and do not compare and write a review about the only headpohone they have really listened to. The initial impression of most quality headphones is mindblowing. That was my initial mistake. Now I have experiences GRADO's Ultrasone's and STAX's. Save your money and don't buy a name, buy a headphone.", "overall": 1.0, "summary": "Sennheiser", "unixReviewTime": 1159660800, "reviewTime": "10 1, 2006"}