{"reviewerID": "A2UBS120XE605X", "asin": "B00004SD88", "reviewerName": "Frank Paris", "helpful": [11, 15], "reviewtext": "I bought these as a Christmas present for someone after owning the Sennheiser HD580 and HD600 for years, both of legendary sound quality. I A/B-d these with several other headphones in this price range, including the Bose Triport and, given enough power, these sounded the best, although of course they are not as good as the HD580 and HD600, which have a more balanced sonic spectrum. The balance seems to be in the favor of the bass end, but not the really low bass: instead, somewhere in the 50-60 Hz range. It isn't annoying, however, and after a while your ears just get used to it, and they really are a pleasure to listen to, having the same open and airy sound of the HD580 and the HD600. For the money, I think they are an excellent value, provided you already own a headphone amplifier.This latter point brings up the main issue I have with these headphones. Frankly, I am puzzled by the claims of some reviewers that these headphones can be fully appreciated without a headphone amplifier. I thought my HD-600s were inefficient! But these HD570's are by far the most inefficient headphones I have ever sampled and require far more power than any portable CD player is capable of delivering that I've ever used. Even my two console CD players (no slouches either: a Harman Kardon 720 and a Philips CDC 751) have to be turned up all the way for full concert volume, and when that happens the bass just falls apart and swamps the high end in mud, as obviously the tiny amplifiers in these CD players are being over-modulated. This could explain the reports in various reviews below that these headphones have a muddy sound. However, plugging these into my Musical Fidelity X-Cans headphone amplifier, a revelation takes place: the base firms up, the mid-range becomes silky smooth and the treble bursts to life. Suddenly the HD570's become very musical and a pleasure to listen to for long periods of time.It seems a little weird to manufacture headphones in a mid-price range that require an expensive headphone amplifier to produce excellent sound. Anyone going to the lengths of purchasing a headphone amplifier is going to be looking at premium headphone performance, and because the frequency response rises in the bass area, these don't quite reach those airy heights. However, to break them in, I listened to them for eight solid hours through my headphone amp. The fact that this was not fatiguing in the least speaks to their very smooth, distortion-free sound, as well as the sheer physical comfort of the phones themselves enveloping my tender ears all these hours.In summary, I would not give the HD570's as a Christmas present to anyone who intends to listen to music directly plugged into a CD player. So what am I recommending these for? Well, these are a present for my 94 year old mother-in-law who likes to blast one of our TVs to high heaven when she visits us two or three times a year for a couple months duration each visit. This constant racket emanating from the TV is extremely annoying to the rest of the household. So my presents to her are these headphones and a nice, new, Panasonic flat-screen 27\" TV (which stays on the premises) with a headphone jack on the front. Now she can blast herself into oblivion for all I care.I tested these headphones both on the TV I bought for her and on a 20\" Toshiba with a front headphone jack. Surprisingly, both TVs had enough \"umph\" to drive these highly inefficient headphones to far beyond tolerable listening levels (just like my Musical Fidelity headphone amp is capable of doing). So that's what I'd recommend these headphones for, which is a rather limited market, I would think.What also makes these phones ideal for the hard-of-hearing television viewer is that they are extremely lightweight and so comfortable that after a while you don't even notice that you're wearing them: ideal for the 94 year old, half-deaf mother-in-law glued to the tube. They also have a 10 foot cord, which makes them ideal for watching a 27\" TV.Speaking of the cord, I would be wary of the robustness of this cord. At one time, Sennheiser was notorious for having a fragile cord that easily became shorted out when repeatedly tugged upon at the connection. This problem has been solved for the HD580 and the HD600, but I'm not so sure it has been solved for the HD570. The sample in the store was partially shorted out and to hear stereo you had to push laterally on the connector near the phones. Obviously, this connector did not withstand the rough and tumble of a store demo, so to be on the safe side treat the connection gently.", "overall": 4.0, "summary": "Sound good but WAY underpowered", "unixReviewTime": 1039392000, "reviewTime": "12 9, 2002"}