{"reviewerID": "A1EKSETIBS9ETQ", "asin": "B00004SD88", "reviewerName": "", "helpful": [4, 4], "reviewtext": "I bought my 570 way back at the beginning of the year 2000 and it still sound just as good.  The first month was a little rough, I heard way too much sounds, like hisses and every bad mp3 recording mistakes out there.  It took a month for the bass to even out and the sound became more balance.  Like jeans, speaker cone need to be worn in a little.  I was buying a lot of headphone under $50 looking for the perfect one before the 570, why spend over a $100 for a little headphone?  When I first got this at $125 my friends though I was crazy, can the sounds be any better then a $20 Sony headphone?  Over three years later, it is and I don't buy headphones anymore, maybe one or two, but they aren't any good.What to like:I take care of my stuffs and a headphone being three year old is pretty ancient.  The craftsmanship for the 570 is well design, my pair looks almost like new.  The head foam is still the same thickness; the black plastic has no nicks.  The sound has not crap out yet.  The bass is still strong and it was never overwhelming, like a koss, that you don't get tired of listening.  Sony headphone even expensive one always gave too much static, hisses and unbalance bass.  The 570 is the best fitting headphone I ever encountered.  It is light and soft on the head and ears.  I can listen and wear the 570 longer and without much ear fatigue compare to other headphones.Not to like;At first $125 was a lot, but after over 3 years it has overachieved my expectation.  So, no real negative point, I can think of.I first used this on my old Pentium II desktop with monster sound card mainly for mp3 and it made the mp3 sound a lot better.  I later plug it to my Sony ES line receiver and the sounds were a lot cleaner and smoother.  Now, it is plugged into my Pentium IV laptop and the sound is still great.  I get the nice bass balance, the cool affect of the treble, ting and the midrange.  Plug this to a weak audio component and you will not get much, it needs some power for all the sounds to come out.  No sound from any other headphones has equaled my sound preference as the 570 has.  Only my acoustic tower speakers playing in a concrete loft space have I ever heard a sound being greater.  The 570 almost match the high fidelity of the tower but not the surreal bass that a tower can produce.  You must listen to a pair of headphone yourself, everybody have different preferences like clothes.  After this pair of headphone starts to crack I am getting another $100-$200 Sennheiser, but it still have years a head of it.", "overall": 5.0, "summary": "After 3-3/4  years it is still my standard for sound.", "unixReviewTime": 1068422400, "reviewTime": "11 10, 2003"}