{"reviewerID": "A1GDAIVRFY8832", "asin": "B00004SD89", "reviewerName": "Eba \"eba\"", "helpful": [2, 2], "reviewtext": "I read all the reviews for the Sennheiser 555s, 580s, 595s, and 590s before I made this purchase.  As expected the sound quality is spectacular.  I'm a big fan of open air headphones, and these seem to be the creme de la creme of what you can get for under $500.  I've only had them for 2 days, but I can already tell that these will revolutionize the way I enjoy music.I've tried a bunch of blue tooth headphones and was fairly happy with the sound clarify of the Logitech for iPod wireless headphones.  The headband on those snapped, however, and then I started a long arduous process of searching for the best that the headphone industry has to offer.  Among bluetooth headphones, I also tried the Creative and Princeton brands, but returned both of those because the sound quality was just not up to snuff.  Needless to say, bluetooth technology isn't quite there yet, so if you're really interested in sound quality, you should go for wired headphones.  This may sound like an obvious truth to some, but it was news to me.  My last headphones were open air collaspable Pioneer ones (~$20).  I was pleased with these, and I plan to keep them for more casual use because they leak less noise than the 590s and I don't really care if they get beaten up.I'm just using the 590s with my iPod.  I don't have a fancy amplifier yet, but now I'm starting to wonder how awesome these would sound with one.  To my novice ears, these do seem to have the perfect blend of lows, mids, and highs.  I can actually hear the *harmony* of all the different instruments in a song.  It somehow emphasizes each range without overwhelming your ears.  I've noticed echoes, voices, drumlines, etc. that I never heard before.  The clarity is great too, but I've come to realize that a lot of my mp3 files are bad rips.  The bad ones tend to have a slight background buzz, but good files have utter silence during refrains.A few more notes before you buy...* The sound leakage really is significant.  More shocking to me than the sound that leaks out is the sound that leaks in.  Listening to these on a loud, crowded train was less than ideal.  I don't mind the stares, but the sound of the train started to drown out my music.  Probably better to stick with your earbuds or enclosed headphones for traveling.* The comfort is amazing, but in my case, that wasn't a major reason to buy.  I wear glasses, and I notice that they squeeze them a little bit, but still, these are more comfortable than other big headphones that I demo'd in the store.  They're much lighter than they look, and the construction is sturdy.* These work well with an iPod.  Would definitely make a great present for any music lover you know.  I've noticed that you don't get quite the same volume as earbuds, but this seems logical since the diaphragm is farther away from your eardrum.  Still, more than enough volume for me.  I listen to these in my office at about half strength, which is enough to hear the music well but keeps the sound leakage to a undetectable level.Anyway, go for it!  You deserve them.", "overall": 5.0, "summary": "Amazing clarity, better than your stereo system", "unixReviewTime": 1145577600, "reviewTime": "04 21, 2006"}