{"reviewerID": "AZ1RAP7SF84I3", "asin": "B00004SD89", "reviewerName": "Patrick H. Wiseman \"Patrick Wiseman\"", "helpful": [2, 2], "reviewtext": "Those who are familiar with open-back headphones should understand a few characteristics about these and many other open back headphones.As for cons, in general open back headphones are not useful for:1. Containing sound, I can hear as much noise in the room with the headphones on as I can with them off.  Incidentally that also means everyone in the room can hear your headphones nearly as loud as you can, in my case apparently down the dorm hall they can hear them too.The cons are quite short, but important to note, now on to the pros.  In general open back headphones are useful for:1. Accurate bass reproduction: When I am recording someone in the studio when the ambient room noise doesn't matter much I have them use these.  Most bass players that I record will usually record through these.2. Mixing concert halls, some directors will use these types of headphones because they can leave them on their head and switch on and off (you would have to buy a switching mechanism) to hear the house or monitor mix.3. Superior panning, headphones in general make it easier to localize stereo sound sources.  Open back headphones, especially these, improve upon that.  These are also the headphones that I will use when playing first person shooter where locating target can be done through the audio signal.On to the specifics of these headphones:1. I broke the cord by running it over with a chair (whoops).  It took about 3 weeks to process (including shipping back in forth). Sennheiser replaced the cord for free(though I paid for shipping to get it to them).  To do this you must try to save the original packaging.2. A very nice feature that you'll find in most of Sennheiser's high quality headphones is that if you step on the cord it will unplug from the headphones rather than rip the solder joint out.  Needless to say I don't under stand why not all headphones are manufactured this way.3.  There are few headphones more comfortable to wear than these; sometimes I forget I'm ever wearing them.4. These are a bit more fragile than a lower quality set of headphones and would cost a pretty penny to replace.  I have had mine dropped about two dozen times and they still work fine, but I know of others that have not been so fortunate.Altogether I would highly recommend these headphones to anyone who demands high quality audio.  Keep an eye out for reconditioned headphones on sale at Amazon if you find them they are a steal.", "overall": 5.0, "summary": "Very exceptional sound -- different style", "unixReviewTime": 1139529600, "reviewTime": "02 10, 2006"}