{"reviewerID": "AYLC085ZL5X5O", "asin": "B00004SD89", "reviewerName": "Towert7", "helpful": [22, 25], "reviewtext": "I have had the HD590's for about 1 and a half years now, and i LOVE THEM... i have NEVER had a problem with them.These surpase anything i have ever heard for such a reasonable price, even compared to Sony, AKG, and Beyerdynamic.They are SOOOOOO comfertable... i sometimes wear them (even without listening to music) because they are so comfertable.  I listen to music, movies, and use the Computer for LONG periods of time, and i don't even notice that they are on my head.  This is partly because they are open headphones, they do not heat up your ears, and they do not Press upon your ears, they just cup them.They are lightweight, and i love how the cord is detachable, that way if by accident i get the cord stuck, and i move my head, it does not break the headphones, it just simply pull's out the cord (which is a very cheap replacement).As far as sound quality goes, im in heaven.  I tend to be an audiophile, and i REALLY like to listen to good music, what ever it comes from.  Whether it is from my Denon Amp, or my computer, i love to hear sound the way it should be heard.  These headphones can run Very good on low power (Computer), and they work fine with Powerful amps.  Right out of the box the sounds are perfect, and every sound sounds just like it should.  The only thing these headphones can't do, is take the place of a good Surround system with a GOOD subwoofer, but what can you expect from such a small speaker?  I also like how they are open, so as i can hear other things going on.  My dad has some Sennheiser HD 280 pros, and they come no where near the HD590's.  For the cheap pirce diffrence, get the good ones...Like i said, These headphones will play all ranges of sound, flawlessly.  From deap lows, to Pitch highs.Don't let the price get you down eaither, If you can make these last, you will be Very pleased.  Like i said, i have yet to hear a headphone that \"I\" can notice any better quality with, and i consider myself and audiophile.If i could die with just one thing, ide take these, for sure.~Hope this helps", "overall": 5.0, "summary": "These are Godly!!!", "unixReviewTime": 1053302400, "reviewTime": "05 19, 2003"}