{"reviewerID": "ANQ122AO9P5BI", "asin": "B00004SGD3", "reviewerName": "Alice M. Cabrera \"tigress666\"", "helpful": [54, 58], "reviewtext": "I'd go for the Jordana over the Palm easily. First of all, it's got color  (a lot faster than the Palm Color), secondly, it seems to be a lot more  useful (more useful programs). The Palm is good for an organizer (and you  dont' pay as much), but the CE machines  seem more like a minicomputer  (plus all have the option of flash cards at least to expand the  memory).But, if you are going to get a CE machine, I say wait and try to  find the Compaq Ipaq (which is hard to find but it is far superior to the  Jornada). I bought the Jornada originally, and many factors caused me to  return it. Biggest one was the fact that it wasn't connecting to my PC. The  factors though that caused me to go try the Compaq instead of getting  another Jordana that worked:1. Jornada literally isn't viewable in  sunlight. I'm truly not exagerating here (I thought maybe others were...  they weren't. I turned it on in sunlight and I thought it wasn't turning on  until I shaded it some and really looked hard).2. Jornada doesn't  respond as well to taps (the touch screen is not as sensitive). Not sure if  this is cause the Compaq is faster or the screen is not as sensitive, but  it got really annoying. I'd try to drag something and the slightest change  of pressure it would drop the thing. Plus it felt I really had to hit it to  get it to respond. The Compaq responds quite nicely to the stylus or even  my finger, the Jornada had to have something that could create a strong  pressure point.There are many other reasons to go with the Compaq (big  noticeable difference in speed, more memory, all for the same price), but  those were the two biggest things I personally enjoy about the Compaq the  Jornada didn't give me. Oh, and the IPAQ I got came with a 39 dollar refund  if I also got the flash card reader so you may not be paying more (cept for  tax or shipping) to get the flash card reader (which will read flash card  II, the Jornada's doesn't). Basically, the Jornada was nice when there  wasn't an alternative, but I bet the Compaq quickly phases it out.Things that I would say the Jornada has the advantage over Compaq:1.  Case design: Though some have complained about the Jornada being bigger, I  really don't see this. It may have bene slightly thicker, but it was less  wide and tall and seemed to fit in my purse better (plus I didn't need a  case to protect it which adds on size). I liked the flip top, and the fact  that it didn't look so toyish like the Compaq, but looks are superficial  and when it comes to performance, the Compaq beats the Jornada hands down.  Too bad I couldn't stick the Compaq into the Jornada's case.2. The fact  I could tap to get the Jornada on. This came with HP's settings (they have  their own special ones), and I think is great. Not sure if that would work  for compaq since they don't have a flip cover to keep it from accidently  being tapped. 3. The stylus. This is personal preference though.The  Cassopia (or whatever the Casio one is) for me didn't even come in play..  it's big, bulky, and having more colors isn't all that important to me. For  those that don't mind size, maybe check this one out. I can't help you here  though cause I have never even had the chance to play with it (didn't even  seen one store display that worked).", "overall": 3.0, "summary": "It's ok, but the Compaq is much better", "unixReviewTime": 967593600, "reviewTime": "08 30, 2000"}