{"reviewerID": "A3LWC833HQIG7J", "asin": "B00004SGD3", "reviewerName": "austin_Larry", "helpful": [1, 1], "reviewtext": "Superb. That is the word to describe this product. It has superb design, performance, and utility.  The first thing to remember is this is not Palm OS, this is windows CE and that makes all the difference.I am a teacher and use my Jornada every day for tasks and for fun. First it does all the things you would expect of a PDA and does them very well. But then the real fun starts. I constantly use audio books and ebooks.  Audio books alone can justify the expsense. For a song at audible.com I subscribed to science friday for a year. The ISB cable makes transfering large files to a storage card, quick and painless. Now I can listen to this wonderful program on my schedule as well as any other audio book. The MP3 player is great, as good as it gets. Ebooks are a real pleasure. I have a 3d shooter game now that beats anything I have seen on a small screen.So for the price of 400 dollars you end up getting a PDA like Palm. PLUS the portable entertainment center with MP3, audio books, avantgo, and ebook reader. PLUS wonderful utilites like Word, Excel, and Microsoft Money.I have emailed Jornada support twice, they responded both times the next day with the exact information I needed. Note I was not having problems with the Jornada I just had questions about getting the most out of my compact flash card. I did have a Compaq Aero before this, and it just died after a couple of months. The same thing happened to my friend who bought one. I have had the Jornada for about 5 months with no problems and excellent support.HP is the world leader in calculators in my mind and that expertise has obviously carried over to handheld PCs. This product is a jewel among the ever growing world of new high tech introductions we are bombarded with every day. In my mind it was THE product of 2000. If you want to buy one high tech item that will change make your life richer this year, this is the one to get.  Just a note, to take advantage of the full power of the Jornada you need to buy a compact flash memory card but these are coming down in price every week.", "overall": 5.0, "summary": "It's not an organizer. It is a portable entertainment center", "unixReviewTime": 985392000, "reviewTime": "03 24, 2001"}