{"reviewerID": "ARXU3FESTWMJJ", "asin": "B00004SGD3", "reviewerName": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "helpful": [31, 32], "reviewtext": "I have been lucky enough to have a Jornada and lots of add-ons to try out for free. I am a long, long-time user of Palms, and was quite a devoted  user, have spent thousands over the years upgrading my Palms, buying  software, adding memory, etc. to get the most out of them. And I'm here to  tell you...there is WAY more you can do with a Palm than Microsoft would  have you believe. You can do more with a Pocket PC out of the box than a  Palm, yes, but there is TONS more you can add on to a Palm, and most at a  very reasonable price, than you can with the PPC.Having said that, the  Jornada is a great piece of hardware. The color screen puts the Palm to  shame. It almost hurts my eyes to look at my Palm IIIC now, it is so  pixelated and ugly in comparison. The size is close to the Palm IIIc  although slightly heavier. It's very nice to hold, sleek and pretty. My  main complaint is the stylus, I find it annoyingly hard to get out and I  don't like the flat shape. People are used to round pens, I tend to drop  the stylus, and have already lost one of them as a result. Would also  prefer a cover that flips all the way back.The Pocket PC OS is much  better than CE 2. However, the inability to close programs was a bad  omission, and I ended up adding Gigabar, a great program that closes and  switches tasks, among other things. While speed is better than older  versions, I still run into things that take time, where on the Palm,  everything happens almost instantly. There are a lot more things on the  Pocket PC you will have to wait for. Some add-on software I looked at is so  slow as to be worthless.Ability to play MP3s is great, if you even  consider carrying an MP3 player around. You can turn the screen off and  still listen to them, which saves on batteries. In the car, add the DC  adapter and it will charge your Jornada while playing. You can also get  small volume boosters that will run on a single AA battery that can help  with battery life if MP3s are your thing.Now, for the bad stuff. There  is not much extra software out there. Compared to the Palm, it's really,  really sparse. And a lot of what is there, just isn't that good or as easy  to use. This is the biggest problem I have with the unit. I just can't do  some stuff I was used to doing, or in some cases, it would cost me WAY  more. Some things that I used my Palm for all the time, I can't do now at  all. I miss wonderful programs like DateBk4 and HanDBase. So easy to use  and low priced. Not much like that for PPC.The screen on the Jornada is  definitely a little hard to read outside, but if you use the Outdoors  setting, it IS readable other than in totally direct sunlight. I often read  books while in my car at lunch and find it easier than my Palm IIIc to  read.I also don't like how heavily it is tied to MS stuff. I use  Quicken...the Pocket Money directions for Quicken users? Switch to Money.  Thanks, but no thanks. Pocket Quicken on the Palm does a great job for me.  Same with pretty much everything else. I prefer Eudora for email...with the  Palm, I can sync...on the PPC, I have to use Outlook. I almost feel like it  is trying to force me into using more Microsoft stuff than I already do.Finally, pricewise, it's going to cost you more. You can now get a Palm  for $150. Yes, you can expand memory on the PPCs, but it costs money. A lot  of times, you are getting more for your money...I do believe the Jornada is  worth the price more than the color Palm is. But you still have to be  willing to pay the price.So what do I recommend? It really depends on  what you want. If you love cool gadgets like I do, the PPC is a real  winner. I personally would probably recommend the iPaq over the HP for the  screen that is easy to read outside, and more memory for the price. If you  don't expect to need more than the CF I slot, though, the Jornada would not  be a bad choice. If you really love everything Microsoft comes out with and  use everything they make, this is the one to get. If however, you want more  options in terms of what you can work with and what you can do, the Palm is  probably the way to go.", "overall": 4.0, "summary": "A great choice to make if you love color and sound", "unixReviewTime": 966470400, "reviewTime": "08 17, 2000"}