{"reviewerID": "A35MUY1T5C335X", "asin": "B00004SGD3", "reviewerName": "Phaedrus", "helpful": [57, 58], "reviewtext": "I'm a die-hard Palm user, and I still keep my Palm VII around for wireless Internet access; but the Jornada really is a great device.  The backlit screen has great color; there's a slight problem with vertical banding when  there's a variety of different color brightnesses on the screen, but it's  still extremely readable, much more so than the Palm screen.The  Microsoft Reader application is wonderful; I can't wait until some more  eBooks start coming out.  A number of good public-domain books are included  with the package, though.I have yet to have it crash, but that could be  because I'm very conscientious about closing applications I'm no longer  using--something that's easy to do from the HP Settings screen, which is  called up by one of the hardware buttons.  (Most of the crashes I've heard  about seem to revolve around having a fairly large number of applications  running, until the poor thing finally runs out of memory and keels  over.)If you're a creative type like me, the built-in voice recorder is  a wonderful touch; you don't have to switch applications, or open the  Jornada's cover, or even turn it on--just press and hold the Record button  on the side and start talking.  You can later easily review the notes or  transfer them to the PC.  If you plan on making extensive use of this  feature, though, you might want to buy a 32MB CompactFlash memory card  along with the Jornada, though, as voice recordings made on the  high-quality setting can use up memory in a hurry.The email capabilities  and pocket Internet Explorer are quite nice; you'll find these features  much more useful if you're already using Outlook as your desktop email  program, or if you're willing to switch.  (Gee, two Microsoft products  working much better with each other than with third-party products?  What a  surprise. :) )In conclusion, I don't regret the purchase for a moment,  and I'm already looking for a compatible cellular phone so I can start  making full use of email and the Web while on the road.", "overall": 4.0, "summary": "Great form factor, great features", "unixReviewTime": 956793600, "reviewTime": "04 27, 2000"}