{"reviewerID": "AP6X4IJR5H92P", "asin": "B00004SGD3", "reviewerName": "Tarun Pall \"tarunthegreat\"", "helpful": [8, 8], "reviewtext": "So you are a budding poet and inspiration hits you. Got a piece of paper nearby? Nope? Too bad. But if you buy the Jornada, you can write your thoughts out instantly, or better yet, just dictate them into its mike. This is the most amazing PDA out there. Palm? Palm? doesn't hold a candle to this. Palms are just glorified address books.Why a Pocket PC puts Palms to shame:1. Word, Excel, Outlook, Money and Pocket Streets - you may want to re-read this one. Yes all the semi-decent Microsoft products which actually are useful. My favourite was Streets. I got lost in Philadelphia, and I just took out my PocketPC and figured out where I was in lovely 12-bit color2. 12-bit Color3. Built-in MP3 player, with headphones (as opposed to the miserable optional springboard module which you can buy with a Handspring)4. Built in compact flash slot, for which there are already 128 MB modules being sold.5. The built-in voice-recorder6. The brilliant hand-writing recognition software. You can write like you always have, no need to learn new shorthand(but for those already raised on Graffiti, you can use that too)7. I don't care much for e-books, but Microsoft Reader looks really good, I must say.Possible reasons that the PocketPC may cause you to tear your hair out:1. It isn't Mac compatible2. Can't see the screen in bright, broad daylight3. (this might just me my problem)The ActiveSync software raises HELL on my computer, freezing with such lovely consistency, you almost think that's part of the show(I'm using Windows ME, 64 MB and USB connection)4. You can only sync with Outlook. Meaning if you really want your e-mail on there, you can install Outlook(and not use it) and export your messages to outlook, and then sync them with your PC (or you might as well just write them out with paper &amp; pencil which will probably be less time consuming)5. Yes, you did read that price tag correctly....which is why I bought mine on eBay, hehe!", "overall": 5.0, "summary": "The Electronic Swiss Army Knife", "unixReviewTime": 981417600, "reviewTime": "02 6, 2001"}