{"reviewerID": "A3VK2YVHWSVQHB", "asin": "B00004SPUN", "reviewerName": "David \"David\"", "helpful": [130, 137], "reviewtext": "Here's my assessment of things I like and don't like about the Rio 600:Pros:*Small, lightweight *No Skipping *Decent sound quality (the above apply to pretty much any portable MP3 player) *WMA Support *USB interface for fast transfer of songs *Future support for 340MB IBM  Microdrive *Possible future AAC (Advanced Audio Coding) support *Low  priceCons: *Rio Audio Manager software is extremely cumbersome to use  *Supplied earphones do not sound good and will have to be replaced *You  cannot distinctly discern by touch what button you're pushing on the round  pad.  You'll end up stopping or pausing tracks when you want to skip to the  next track. *Only 32MB RAM standard with no upgrades available at this time  *Larger than previous model Rio 500 *No belt clip *No recording for FM  tunerThe Rio 600 is your basic MP3 player.  WMA support is nice, but  because of Digital Rights Management, the WMA format is difficult to deal  with and I'm not going to convert all my MP3s to WMA.  Someone should have  tested the Rio 600's button pad for usability.  You can't feel what button  you're pushing and because the Rio 600's body is curvy, it's hard to  discern up/down/left/right without looking at it.  You also have to use  your fingernail to push the tiny center button or you'll accidentally press  on of the up/down/left/right buttons as well.As of right now, I would  recommend the Rio 600 over any other MP3 player currently available, not so  much because it's so good in itself, but it's good when you compare it to  the others.  The things I most wish it had right now are memory packs and  better software.  I'm not sure how much the memory pack upgrades will cost,  but I'm hoping that a 32MB memory pack will not put it in the ballpark of a  Rio 800 which will come with 64MB standard and have recording  support.The Rio 600 is cheap, but if you get the Rio 600, plan on  spending more money on headphones and a memory upgrade, unless you want to  deal with the WMA format.  Faceplates allow you to change the color of the  Rio, but the standard metallic blue is stylish enough for me.", "overall": 3.0, "summary": "Rio 600 Pros and Cons", "unixReviewTime": 964137600, "reviewTime": "07 21, 2000"}