{"reviewerID": "AB2U893HHHG74", "asin": "B00004SPUN", "reviewerName": "John DiBello", "helpful": [7, 7], "reviewtext": "After months of insisting I wasn't going to leap on the MP3 bandwagon, I've become a firm convert to the joys and ease of electronic music, and the Rio Diamond 600 is a big reason why. This stylish and easy-to-use pocket MP3 player is the perfect way to listen to MP3s on the go, and shows every sign of becoming one of the top models in the field.Affordable and easy to use, the 600 packs a lot of features in a tiny package. The volume level is one of the best in the field of MP3 players: taking Spinal Tap nine better, the volume control goes up to 20, very loud in your house but sometimes necessary during noisy commuting. The controls are uncomplicated and easy to manipulate sight-unseen if you have it in your pocket, although learning how to hit &quot;pause&quot; without skipping to the next song is a talent you'll have to practice. Unfortunately there's no &quot;bookmark&quot; function, so if you stop the player in the middle of a file and want to pick up from that point, you'll have to fast-forward manually to it. The blue plastic faceplate is removable and other colors are available to customize your Rio. Earplug headphones are included (their sound quality is fine, but you'll probably want to stick with your favorite pair of stereo headphones). Contrary to the Amazon review, there *is* a belt clip--a neoprene case that attaches with a firm clip to belt or waistband. It also comes preloaded with &quot;new music&quot; that you'll probably want to replace as soon as possible--but including it gives you a nice way to test out your 600 on the way home from the electronics store.Hooking it up to my iMac was simple and fast, and I can download a full player's worth of music to the 600 in a couple minutes. (Read the system requirements carefully, tho'--you need Windows 98 or higher, and a USB-equipped Mac with OS 8.51+). A CD-ROM of bundled software gets you up and running quickly, although it's very annoying that the software is shareware and prompts you to pay the shareware fee every time you start up. When I pay for equipment and get software in a box that's absolutely necessary to run the equipment, I'd expect that software to be totally included in the price of the player.I've seen several complaints about 600s that don't work, and I must admit that my first one was defective, with lines running across the small display viewscreen. However, this was easily returned and my second model has worked fine, even with constant daily play or a few instance of dropping it on the subway.The sole complaint I have is the usual one I've seen in most reviews: 32mb of memory is far too small. You need at least 64mb of memory to get an hour's worth of music recorded at 128mps. Luckily there is an add-on backpack which can increase your total memory to 64mb, but that backpack isn't cheap (about 2/3 the price of the Rio 600 itself). Announced future backpacks are supposed to be even larger, and probably even pricier. Diamond would have made me a fan without any complaints if the memory upgrades were less expensive or even universally compatible with other players. For this reason I'd recommend comparing it the Rio Diamond 800, basically the same machine with slightly redesigned controls and 64mb of built-in memory.", "overall": 4.0, "summary": "Fun and easy to use, but could use more memory", "unixReviewTime": 984441600, "reviewTime": "03 13, 2001"}