{"reviewerID": "AEOAMS0G96E8B", "asin": "B00004SPUN", "reviewerName": "Paul Arellano \"Last Days on Earth\"", "helpful": [29, 30], "reviewtext": "Ok, I had some savings in my pocket and I thought &quot;Hmmm...what should I buy?&quot; Voila! I decided to get an MP3 player...Rio600. Let's see what problems I've encountered with this nifty device:Battery Pack: On my first night with Rio, we started having problems. I had to figure out how to remove the battery/memory pack at the back of the unit. There was this little button that you press but nothing happens. To remove the battery pack, you got to pry and clamp your nails around the edges to slide off the cover. Taking it off was difficult, putting it back was almost impossible. You have to align the connector pins between the pack and the unit and at the same time putting it at an angle so you can slide the cover back on. Too cumbersome!!! Requires getting to used to.Power Guzzler: This baby drains your batteries like hot milk. My suggestion is you buy rechargeable batteries- Alkaline Rechargeables or Nickel Metal Hydride batteries. If you dont invest on rechargeables, you'll be making frequent trips to the corner store for batteries.Now it's on, now it's off: By some weird phenomenon, my Rio600 kept shutting itself off. One minute it's playing, the next minute the system just shuts down. I reboot the unit and nothing happens. I reboot it twice, three times, and then it boots itself. Hmmmm... Off I went to the store and had it replaced with a new one. Now I got a new but the assembly was not done properly on the unit. A small opening can be seen on the sides. Somehow, somebody from Diamond Rio fell asleep while putting my unit together. Off I went again and had it replaced. Now everything's working normally.The Software, oh the humanity: DiamondRio needs to release a more stable software. It's a bit too buggy. Most of the time, the software can't detect your USB connection to the unit. THe workaround is to go to the Options screen manually select the device connected to the USB. Also, there's a bug whereby if you delete some songs in your database, it still leaves the files in your hard drive. Weird really...Now the good points:WMA Files: It takes WMA files. Since it's only 32 mb, WMA can squeeze in more music into your player than mp3 at the expense of sound quality. WMA is Windows's answer to MP3. WMA usues 64kb as opposed to MP3's 128 kb.Sound Quality: Sound is pretty decent when you listen to WMA or MP3. However, with the WMA, the cymbals and high hats sound a bit wavy rather than a consistent hissing sound of a cymbal.Volume: This player packs a LOUD PUNCH. This is really loud. I'm using a Sony WEAR headphones and RIO600 just knocks your ear drums off. Not advisable to listen to full volume on extended periods. Too risky.Overall, the device is good except for a few quality control issues. It's a shame because on the memory pack, there's a label that says ASSEMBLED IN THE USA. If you're planning to get this unit, be prepared for some surprises like returning it and getting a new one. People have already complained about the poor quality control on this device. But that doesnt mean all the units are duds. Who knows, you might be lucky enough to pick a solid one. ANyways, the device is worth the money. It's light, it's cheap, it's a got a solid sound quality.", "overall": 4.0, "summary": "A Good Product marred by poor quality control", "unixReviewTime": 972345600, "reviewTime": "10 24, 2000"}