{"reviewerID": "A243HY69GIAHFI", "asin": "B00004SPUN", "reviewerName": "tropic_of_criticism", "helpful": [37, 39], "reviewtext": "The Diamond Rio 600 is a paradox.  It's twice as good as anything currently on the market, but half as much as you need.  There's something  very right about each of the three components of the system--headphones,  body and software--and yet there are serious deficiencies with each  part.The Rio's headphones are  marginally tinny at any volume, and  stressed at higher volumes, but good enough for a portable you'll probably  use in a noisy environment anyway.  To be sure, other headphones will be  needed to fully realize the sound possibilities of the Rio, but the ones  included give you at least the beginnings of great sound.  Their rather  odd, around-the-ear construction is both sensible and awkward.  They're  perfect for using while working out, because they never fall out,  regardless of how vigorously one behaves.  But they're hard to get used to  because they do take a comparatively longer time to put in than other  headphones.  Serious audiophiles will dismiss them outright; those of us  just looking for workout music will probably get used to their oddness.The body of the Rio is its clear strength.  It's about the size of a  pager-but lighter.  Of all the portable music solutions I shopped--CD,  cassette, and digital alike-this one is the very best in terms of  size/quality ratio.  It's the best thing I've ever used for working out.  It's also the best device currently available in terms of expandability.  Though on the surface it seems to have less memory than the Rio 500, and  than many other newer .mp3 players, it has the capacity for adding on 340  mb.  Also, the fact that it takes the .wma (Windows Media) format  effectively means that you can store what would be the equivalent of 64mb  of songs in the .mp3 formatThere are some reservations, though.  First,  its small size means that the battery is tucked away in a pretty  inaccessible place.  It's somewhat tricky seating a new battery.  It's not  impossible, mind you, and it's worth the effort given the benefit of the  unit's small size, but it's still frustrating on occasion.  Second, while a  battery does actually give 10 hours of use, the unit's battery life  estimator is never accurate.  It deducts time too slowly at the start of a  battery, so that by the time you get to 6 hours of apparent time left, you  actually have only 1 or 2 hours.  It's not a huge problem, once you figure  it out, but it can be infuriating at first.  Third, the unit doesn't come  with a belt clip holder or an FM tuner.  They're both available, but  they're extra.  I can understand the FM tuner being extra, but it seems  ridiculous for a portable music player to come without the means to make it  truly portable.Finally, there's the software.  Easily the weakest  element of the Diamond Rio 600, it's only a *little* more than a way to add  on $20 to the price of the unit.  It's entirely too difficult to install  and get running.  I installed the version off the included CD.  When I got  it running, it linked me to rioport.com, which informed me there was an  update available.  This update, however, was really only for the Rio 300  and 500, and so it failed to recognize the Rio 600 as being present.  So I  uninstalled the update and tried again with the CD version.  Then after a  mere 50 rips, it told me I had to pay to \"unlock\" the program.  So I tried  to unlock, but the software never allowed me to get to the \"pay\" screen.  I  then reinstalled the update and miraculously was allowed to unlock the  program.  But this version still didn't recognize the Rio 600.  So I  uninstalled the update and reinstalled the original.  Finally, everything  worked.  Hardly an encouraging start.  Then, I instructed the program to  search my hard drives and come up with a database of playable media.  This  it did, but it found a lot of `junk' files I wanted to delete.  Unbelievably, the program doesn't allow you to group delete, so I had to  individually delete each file I didn't want.  Finally, after hours of time  and $20, I got the software set up and ready to use.  But then came another  one of those little Rio paradoxes.  One of the strengths of the software is  that it allows you to read a CD at a variety of different compressions.  You can decide to fit more of your songs on the Rio and sacrifice a little  quality.  The problem is that you might want a song at the highest quality  to burn a CD (which the software also does) but at a lower one to send to  the Rio.  The result is that you practically have to read each CD twice.  That's a lot of hard disk space to dedicate to your music library.  Hopefully updates will include some sort of converter, so that you only  have to scan CDs once.On balance, I highly recommend the Rio,  especially if you're just looking for workout music.  Be warned, however,  that it won't be quite the effortless pathway to great music that the  merchandising proclaims, and that the Rio is based on modularity.  It has  the greatest potential of any current .mp3 player--it can be worn  comfortably, has the largest potential memory, can play FM music, and can  even be used on your car's lighter--but you're going to have to pay for  each added function.", "overall": 4.0, "summary": "Easily the best portable, but there's room for improvement", "unixReviewTime": 965174400, "reviewTime": "08 2, 2000"}