{"reviewerID": "AGG6OMGC18HF1", "asin": "B00004STHL", "reviewerName": "Ricky W. Cancilla", "helpful": [0, 1], "reviewtext": "I bought this CDR775BK early in 2001 and at first it was alright until everything went to hell after about 5 Months, every time I used it I always have to worry what it's going to do wrong, ether skip during a recordng session or maybe just go into stop mode while recording or do some other cute tricks that will cause me to lose a blank CD, and speaking about blank CD's it sometimes can't read CD's even though the CD is made for this junk. I tried to email Philips to get some help and that's totally impossible, there web site don't even show anything that has to do with there audio items like it used to as if they don't want to have anything to do with these CDR's. If you called them by phone you'll might get someone that's pretty good helping you, but don't count on it. After getting contact with Philips they had me ship the CDR to there repair center, and so I did, NOT ONCE, NOT TWICE, BUT THREE TIMES I had to ship it back for repairs because I had more problems with it then ever before and then finally I got a new one (Same Model) and it was just as bad as the first, starting about the third day and up that I had it. I do NOT support buying this item because it's really that bad, as of matter of fact it's totally worthless; And i'll tell you something, after finally getting rid of this CDR, I then purchased a new CDR (Harman Kardon CDR-20) on June 2002 and what a hell of a different i'm seeing, so far, so good. I use it for dubbing, recording off from my DSS and so on and I am having no problems what so ever knock on wood. I'm not saying that Harman Kardon products is God's gift to the world because I don't know that company or there products all that good for that CDR-20 that I now have is my first Harman Kardon product that I ever owned, at this time it's about 150% better then this Philips CDR775BK. This Philips CDR is one product that needs to go back to the drawing board for a good re-engineering.", "overall": 1.0, "summary": "AN REAL ELECTRONIC LEMON", "unixReviewTime": 981504000, "reviewTime": "02 7, 2001"}