{"reviewerID": "A91LOU9XGER2N", "asin": "B00004STQK", "reviewerName": "Harold Corbin", "helpful": [4, 4], "reviewtext": "I bought the Polaroid 1100 for my son, a 5 year old that loves to take pictures. This camera seemed to have it all: decent resolution, a flash, USB connection, video cable to view the pictures on TV, 2x zoom and macro focus mode, 4 quality settings, an optical viewfinder to save batteries, AC adapeter included, photomax software, shot timer, wrist strap, and a durable case design with padded vinyl case.When it arrived, my son took about 50 pictures the first day, and although many of them were horrible, it didn't cost a thing to develop. The rechargeable NiCad batteries that I bought specifically for this camera were terrible, and they ran out after about 10 pictures... even with the display turned off. I tried some AA rechargeable NiMH batteries from my son's remote control car, and they lasted 3 or 4 times longer.With the 4MB compact flash card, you can only get 8 to 10 pictures in the highest resolution, and since we wanted to use most of the good photos in a screensaver at fullscreen on a 1024 x 768 monitor, the high setting is the lowest acceptable quality. I'll probably buy a 64MB card soon, and that will let him take over 150 pictures in the highest quality mode before the card is full.As far as the picture quality goes... you pretty much need to use the flash all of the time. You can take nice pictures  outdoors in the sun without the flash, but that's about it.The macro function works very well, but you need to make sure you are VERY close to your subject. My 3 year old daughter got in my lap one night, so I grabbed the camera and took a few pictures of her looking at me from less than a foot, and they were incredible. With my $700 SLR camera, I couldn't get that close and still be in focus, so those types of pictures will be priceless when the kids are older.My only major gripe about the camera is that it's not very quick to switch \"modes\", which requires using the display screen menu system. Then, your custom settings seem to last as long as you leave the power on, and then it reverts back to the default settings. For example, if you set the flash to \"Always On\", take a few shots, then turn the power off to save batteries... when you turn it on again a few minutes later, the flash is back in \"Auto\" mode, and won't necessarily fire on your next picture. Since you ALWAYS need the flash, this is an annoyance that bugs me. The 2x zoom feature works the same way... you need to activate this option using the menu, and when you turn the power off, the camera goes back to the default settings.In summary, considering that I got this camera for less than $100, it's an incredible bargain. I didn't expect it to capture images that I could print 8 1/2\" x 11\" photos. I mostly wanted a way for my son to take all the pictures he wanted, share them on the computer screen or TV, and possibly print a few on 4\" x 6\" photo paper. For what my son needs, this is a perfect camera at a perfect price. If you can get one for less than $120, go for it... but make sure you have some good rechargeable AA batteries to use with it.", "overall": 4.0, "summary": "Good overall value with many great features", "unixReviewTime": 1025049600, "reviewTime": "06 26, 2002"}