{"reviewerID": "A2R6RA8FRBS608", "asin": "B00004SU73", "reviewerName": "Matthew G. Sherwin", "helpful": [14, 14], "reviewtext": "I have used these cameras many times on vacation and the pictures really DID come out fairly well! Oh, sure, the quality of the pictures won't be 100% as good as the pictures you would get from a digital camera or a standard, more expensive and more professional 35 mm camera. The pictures may at times be slightly grainy but they provide excellent records and memories of my experiences.The camera also is very lightweight so you can carry several at a time in a bag as you travel. I especially like the built in flash that is easy to use (just push a button in the back of the camera and after 10 seconds or so the flash is ready). I remember my mother's Kodak Instamatic camera from the 1960s when if your flash cube had been used (after only four pictures) you were out of luck unless you had another flash cube. No such problem here! Thank goodness!The camera is a single use camera; this means that after you use it you take the entire camera to the place where you can get film developed and they will take care of the rest. No worrying about whether or not you removed the roll of film negatives correctly without exposing them to too much light. The Kodak \"MAX\" 800 film speed also makes it useful for taking pictures under a wide variety of lighting situations! You get 27 exposures, not just 24--a nice plus!  SMILEOverall, this is an excellent camera for the many, many people who want to travel light or who are on a budget. It is compact and easy to carry; keep one in the glove compartment of your car just in case there's an accident and you need to take pictures of the scene. The camera is also affordable. I give it four stars instead of five simply because the picture quality just isn't the very best although for most people like me the pictures it takes are fine. Thank you, Kodak!", "overall": 4.0, "summary": "A pretty good camera if you don't want the expense of a much more expensive one...", "unixReviewTime": 1159142400, "reviewTime": "09 25, 2006"}