{"reviewerID": "A2EDFATBY4VNTS", "asin": "B00004SV1W", "reviewerName": "D. Pritchard", "helpful": [24, 24], "reviewtext": "I bought a QV-3000EX last year, prior to a 2-month trip to Europe where I found myself using it nearly as much as my SLR camera.  The beauty of on-the-spot review and even deletion of a photo is great...something no film camera can do.  At the time and continuing since then, I have used the camera quite a bit and have a strong overall opinion of it, but with some complaints.  The complaints don't take away enough to drop my rating below 4 stars, but they do exist as follows:First, the viewfinder provides a distorted, non-linear view if the camera is not held perfectly vertical; fortunately the recorded image is still OK.  Also, while not unexpected, there is considerable parallax error with close-in photos, in which case the image on the screen should be trusted over the viewfinder.Second, there is no provision for a screw-in filter on the lens, as available with the Nikon CoolPix models. In general, neither problem is critical but rather an annoyance.  Given all the features of this camera that can pretty well satisfy even an advanced photographer's needs, the lack of screw-in filter support seems an oversight.Third, there is no external flash connection.  I've been quite surprised that red-eye in several photos has been minimal to non-existent even when the subject's eyes seem directly facing the camera.  Luck perhaps, as red-eye does still occur occasionally.  Although flash quality is good, I know from experience that it can be improved significantly and red-eye totally avoided if I use off-camera flash.  Fortunately, I was able to rig up a small flash deflector that I attach to the camera with a small strip of velcro, bouncing the flash to trigger a slaved off-camera flash unit.  That has provided excellent results and any exposure errors can be immediately previewed and corrected using the LCD screen.Fourth, battery drain:  With the use of the IBM Microdrive (major selling point of the camera), battery drain is quite significant and even with 1450-1600maH NiMH batteries, I still observe indications sooner than I'd expect that the batteries are getting low.  Those indications include the slightly longer delay time in saving a photo to disk and a prompt in the LCD screen to cancel the save if desired.  If I anticipate that as a problem for any planned photography, I switch to using a 65MB compact flash card which provides improved battery performance and faster saving of photos.  I recently purchased an external, rechargeable 120maH Sakar digital camera battery pack at Fry's Electronics, and the initial impression is that it will provide me with better battery performance than the NiMH AA batteries; the only inconvenience is then leaving the door open on the camera where the DC power cable attaches.Fifth:  Low light focusing - Quite poor.  Sometimes this problem can be worked around by selecting either the manual or infinity focus option.  More often I just have to look for some other nearby person or object at a similar distance away and in better lighting, and use that to establish a pre-focus point before returning to my subject.Those items notwithstanding, I very much enjoy this camera and highly recommend it.  Most notable is the compatibility with the IBM Microdrive, even at the expense of increased battery drain.  Lens quality (a Canon lens) is excellent and color rendition seems very good.  The 3.3MB image size is sufficient to obtain photo-quality 8x10-inch prints when printed on my Epson 1270 printer and passable 11x14-inch prints.  Using Adobe Photoshop to further edit my 11x14 prints by applying filter effects that render more of a watercolor look to the photos, I have obtained some very nice &quot;artistic&quot; prints in exchange for a tradeoff of the photo-quality sharpness. Stilhave successfully slaved my camera to an external flash in a manual exposure mode. To avoid red- eye induced by on-camera flash, I fashioned a small cup of plastic to deflect the camera flash upwards, triggering the remotely slaved flash only. The cup can be easily attached via a small strip of velcro. While I've rarely used any flash at all, the slaved flash setup does provide better results than the on-camera flash.Of special note are two &quot;hidden&quot; features of the camera that I learned of from imaging-resource.com as follows:Uncompressed TIFF Mode:  Resulting in a 6MB file size that takes 20-30 seconds to save between shots, this does provide a way to capture more detail if the need arises.  The one problem is that the TIFF is a non-standard format that many programs cannot read properly.  ACDSee and IRFanView are two Windows programs that can open and resave this TIFF format in a standard format that yields a 9MB file size.  To access this mode on the camera, press the Set and Flash buttons simultaneously in any capture mode. Turning off the camera will disable this feature.Manual Exposure:  This was particularly useful when I devised my flash deflector for the slaved off-camera flash.  If you hit the Set button and the left arrow button simultaneously while in Shutter Priority mode, you are put into a full manual mode that lets you control both aperture (the left and right arrow buttons) and shutter speed (the up and down arrows).  Using a slaved Vivtar 283 flash off-camera in automatic mode, I set the camera the the aperture setting specified by the flash expsosure calculator dial.  An advantage over an SLR camera is that the digital camera can be set to whatever shutter speed is desired; there is no focal-plane shutter vignetting of the image to worry about.So, all in all, this camera provides a wealth of features to explore but there remains room for improvement.  Would I buy it again today over the competition?  Most likely I would, but what I've learned would also find me studying all the cameras just that much more closely.  At the time of purchase, this was the only 3.3MB digital camera I could find that offered the range of features I desired and the storage capacity I sought.Finally, I've just learned about some freeware software for this camera at dicasoft.de that allows the use of a PC to control the camera automatically.  While such needs are non-existent for me at the moment, they may be fun to toy with.", "overall": 4.0, "summary": "An Excellent Digicam Prompts Improvised Off-Camera Flash", "unixReviewTime": 979776000, "reviewTime": "01 18, 2001"}