{"reviewerID": "A2DXENZNO2JT4F", "asin": "B00004SV1W", "reviewerName": "Sam Stone \"Sam Stone\"", "helpful": [1, 1], "reviewtext": "Got QV-3000EX... (no Microdrive but a 16MB CF card). We bought a 128 CF card... and a set of NiMH battries and charger.  My wife was glad to see the lable \"Made in Japan.\"  [She thinks things are better if it is made in USA or Japan.]  It comes with Canon lense! F2.0!!!The CF cards are getting cheaper.  I would rather own 3 128mb CF cards than a battry consuming Microdrive, which is also more expansive.  (Well, we are trying to spend less for the best.)  Now you can get 256mb CF cards too.  a 128mb CF card will store around 90 pics (2048 x 1536) or over 300 (1024 x 768).  So far, I don't usually need more than (1024 x 768) and don't need more than one 128mb card.  I will wait for the CF cards to come up with higher capacity, or even go cheaper.  Plus, I travel with my computer anyway.  An my IBM Thinkpad has a slot for reading both CF card and IBM MicroDrive.I popped in a set of Duracell battries while waiting for my new rechargables being charged.  I have taken 30 shots and have viewed pics on the LCD screen and the battries are still going strong.  (This is no Duracell comercial).  Comparing to my previous digital cameras, the battery comsumption of this camera is nothing.  Still I will use the rechargables to save money.I thought I had to sattle with another cheap camera because of my budget..., I've got a camera I thought I would have to spend... more on.  It was worth the research and thanks for your reviews on this site and others.  I am writing the review in return to help others.Oh, how could I not say anythings about the pictures.  A friend of mine just paid... for his Nikon 990.  The printouts from my camera made him really jealous.Of course I am also surprised why this camera does not get so popular.  In some sense, I am glad it doesn't.  Otherwise, I would have to pay more to get mine.  Hay, I have got mine now, I recommend everybody to buy this camera!  You will not regret!  My wife would say, \"Look at the bottom of your camera.  You might have a Nikon but it says 'made in Burma.'\"  Ours maybe only Casio but it is made in Japan!  Hee, hee, hee!", "overall": 5.0, "summary": "So happy with my choice", "unixReviewTime": 1010188800, "reviewTime": "01 5, 2002"}