{"reviewerID": "A2DGF0LAMJQHQF", "asin": "B00004SV1W", "reviewerName": "\"zenfox\"", "helpful": [7, 7], "reviewtext": "...Pros:-Image Quality *and* Quantity.The 3000ex is a true 3.34 Megapixel camera which will give you 2048x1536 resolution max. At this, and the minimum compression, you can achieve 248 pictures on the microdrive. If you drop the resolution to a mere 1024x768 (most likely the size of your screen, or larger) you can get *999* images on the disk. That's alot of snapping.-Features.20 second mpgs (no sound), shutter speed priority, aperture priority, clean back lit LCD screen, Panoramic(!!) shots, and special modes for Portraits, night shots, and landscapes. Color, B/W, Sepia modes, Red-eye reduction flash, macro mode, time stamp, 3x optical zoom(!!) 6x digital, and superbly done USB connectivity.-USB interface. Hate having to use a proprietary interface to get your images off a camera? You'll love this. Pop in the USB cable, and windows automatically sets it up as a removable disk drive. That's right, you can sure the camera as if it was a hardrive from inside your 'my computer'. OR, press a button, and have then all automatically loaded, and displayed.-Ease of use Even using the advanced features, it's a very simple to use camera. Everything is menu driven, and in a logical format.Cons:-Battery life. If you decide to use the LCD screen alot, the batteries do not last long at all. If you don't, on the other hand, they'll last for about 150-250 shots. Not too bad.-To get *full* 3.34 Megapixel *uncompressed* tiffs, you must find the secret option to enable it. WARNING: by enabling uncompressed tiff, you will get about 15 shots before the card is *full*. tiffs are 100% uncompressed RAW image data.-Size It's a little bit large for me. Not too bad, and for what it does it's decent, but if you're running around, it can get bothersome to carry. (The canon ELPH digital (2.1MP) is more like what I'd want to haul around..) ...", "overall": 4.0, "summary": "Need to take lots of pics? How about 248 @ max resolution?", "unixReviewTime": 995414400, "reviewTime": "07 18, 2001"}