{"reviewerID": "A2WBEJH71SND3T", "asin": "B00004SY4H", "reviewerName": "Amazon Customer", "helpful": [27, 29], "reviewtext": "There have been so many reviews here I almost didnt write one but with the lack of reviews by producers I decided to add one more to the list.If you're producing audio like myself you already know theres no replacement for a good set of monitors. That said there's a few reasons you may be mixing through a set of cans.My reasons are that my studio is sometimes mobile and that I'm often mixing in my apartment (I've found that boxers and a t-shirt are a superior choice for studio apparel).I'm running an Mbox2 with Pro-Tools 7 (sometimes switch to Nuendo... don't hate me... hush now Abelton users).I also use these with my Ivory Keys VST and it sounds pretty nice, I think they add a bit of warmth when compared to a set of Mackies, could be the spatial difference, but I actually like it better through the Senns, a bit more personal I guess.That said, I feel pretty happy with the sound from these cans.I've been using them for almost a year now, extensively.They're a bit lacking in the low-ends when I push them, but when you pair them up with an analyzer you can usually compensate pretty nicely with a combo of visual and audio reference.They are open-ear, so dont expect your vocalists to be using them in the sound booth or you'll be recording the sound coming from the headphones along with the vox. For the producer, the only real place for these is in the mix down if you're trying to be quiet... or your one of those weirdos who uses cans for some bizarre voodoo mixing ritual.(I've heard of these guys but never met one)They are definitely more comfortable than some of the other headsets I've tried, Grado's being the least comfortable, Sony's aren't bad.Sometimes I seem to put them on wrong and my ears start hurting pretty quickly but if I slide them around on my head a bit so my ears are good and centered I can wear them for a few hours before I need to take em off.I think the most important thing to note here is my experience with Sennheisers customer service.Recently I snapped the headset in half, dunno if it was from cheap plastic construction or just lots of use. Regardless I contacted Senn and asked what I needed to do, assuming I'd have to send them in and wait a week to get them fixed. Instead Senn offered to just send me a new headband and I could replace it myself.Because of the modular construction of these cans that will be pretty easy to do and lets me keep using them while I wait for my replacement.Needless to say, that made me pretty happy.The cords firmly snap in and out of the cans via 2 pronged plugs, nice for those who accidentaly step on the cord while they stand up.On a consumer level note, if you are listening to MP3's or any compressed audio format in a portable device... or any device for that matter, dont buy these, you're wasting your money.I'm not insulting you, I'm being serious.There are cheaper alternatives for compressed audio.If you like your music and can't blast your speakers for some reason or the other, then I'd say these are a pretty nice set. Not the best for sound but close enough that the price and comfort make up for the slight difference you may hear in a set of (very uncomfortable) Grado's.For those of you who are worried about reproducing the \"original sound\" of a recording, you need to laugh at yourself for a minute and realize that we process those sounds pretty thoroughly before we even bounce them to a track. Compressors, EQ's, Verbs, etc., sometimes before the signal even hits the sound card it's gone through a pre-amp. Aside from that the difference between audio still in the DAW and a bounced track is pretty dramatic. You're just not going to hear what we hear in the studio. Go with what you like.Some like it crispy, some like it warm.If you can listen to your favorite track through the headphones before you decide to buy them, do that.Leave em on your head for a while see how they fit.I recommend trying them out if your searching for a set.They work nicely for my purposes.", "overall": 4.0, "summary": "Good set for mixing and portable studios.", "unixReviewTime": 1211328000, "reviewTime": "05 21, 2008"}