{"reviewerID": "A1HD8EWSHR9FM6", "asin": "B00004SY4H", "reviewerName": "Amazon Customer \"TooCoolGuy\"", "helpful": [18, 21], "reviewtext": "I recently came across a great deal on Sennheiser HD 600 headphones. These little beauties list for something like... but can be found for a whole lot less if you shop around. When I finally came across a set in my price range (a way whole lot less) I jumped at the chance.My first impression was quality. The HD 600s come in a well constructed and cushioned jewel box of a case suitable for daily storage. The headphones themselves are attractive and of carbon fiber construction. Like all great headphones the HD 600s are of an open design. That means that outside noise will get in and enough sound will escape to possibly disturb those around you. The upside is that an open design prevents resonance distortion from within the headphones themselves. The HD 600s are also a delight to wear. They are light and comfortable enough to wear for hours and even forget that you're wearing them.Let me be clear, HD 600 is dead-on accurate and precise with outstanding detail and airiness. In my opinion there isn't anything better (for under...anyway) for listening to all flavors of good music - from a well made recording. The HD 600's will bring out every nuance and detail, and in all probability you'll hear stuff that you'd never known was there. On the other hand a bad recording will be unmasked and sound horrible. Every flaw will become glaringly apparent. Mannheim Steamroller's Fresh Aire III (my favorite test) came to life with a musical quality and airiness, and a solid yet undistorted punch on the drum beats you rarely get from headphones. I've been listening to this album for twenty years and I've heard things with the HD 600's that I hadn't heard since I moved from high quality vinyl to CDs. Equally important AC/DC's Highway to Hell had vigor and life, and Jewel's incredible voice sounded, well - incredible.Two other old favorites, Deep Purple's Smoke on the Water, and Ted Nugent's Stranglehold, displayed way too many flaws to really enjoy. Although the HD 600 is fully capable of deep bass, music that depend primarily on a driving bass just really doesn't cut it on headphones.  That's my opinion anyway.If you're looking for something for your portable or to listen to low quality MP3s keep looking. The HD 600 is way too inefficient to be powered off of a portable (try the HD 497 or Grado S60) even with most readily available portable headphone amplifiers, and way too accurate to listen comfortably to a crappy low bit rate MP3. On the other hand high bit rate MP3s sound pretty good, at least to my ear.Another word about the source. While the HD 600s sounds wonderful from my mid-range receiver, I can't help but think that they will sound even better driven from a specialized audiophile grade headphone amplifier.I would classify the HD 600's as a great general purpose and classical/new age headphone that can also deliver on rock and roll. I've read that the similarly priced Grados might be slightly better at rock - bottom line I haven't tested the Grados, but I am impressed with the Sennheisers.The Sennheiser HD 600s come standard with a two year warranty, that Sennheiser currently extends at no cost to five if you've purchased them through an authorized dealer.", "overall": 5.0, "summary": "Outstanding Detail and Airiness", "unixReviewTime": 1039132800, "reviewTime": "12 6, 2002"}