{"reviewerID": "A4GGT6O0GQNV2", "asin": "B00004SY4H", "reviewerName": "BKarno", "helpful": [2, 2], "reviewtext": "It would seem that my review has turned out to be a sort of comparison of the Sennheiser HD 598s to the HD 600s.  While it wasn't where I intended to go, I think the comparison is valid when deciding if the $200 premium is worth the payout (it is).I have owned/auditioned a ton of headphones over the years, and I currently have a pretty decent assortment in my stable.  But these HD 600s are probably going to have all those other pairs collecting dust.  About a month ago I had purchased a pair of HD 598s and they were the pair of cans that finally sold me on open phones.  I really like the 598s, and they are excellent for classical, jazz, classic rock, and many other genres music.  However, when it came to listening to contemporary popular music they just seemed to come up short.  The HD 600s are a much better \"all around\" headphone, and well worth the additional $200 (in my opinion).  Their superiority was evident from the moment I put them on and plugged them in.  I played Chris Isaac's \"Wicked Game\" and I literally had a chill run up my spine.  More bass than the 598s?  Yes; but it's not unnatural in any way whatsoever.  It just adds to the richness/quality of the overall sound.  These make everything just sound more real, and they seem to do it almost effortlessly.  After listening to the 600s for an extended period and then going back to the 598's, the differences become more noticeable.  Again,  where the 598s start to struggle, the 600s just power through.  I completely understand why so many people consider these to be some of the best phones ever produced.  I have also been tricked into looking around the room for that noise I just heard only to realize it was part of the recording.  If you need to stick to a budget, the 598s are an excellent choice and a fantastic bargain (just watch and wait for the price to dip).  However, if you can afford the premium price, the HD 600s are worth every penny.My listening setup consists of a variety of digital files played from my computer, an Onkyo C-7030 CD player, and a Nuforce Icon DAC/Headphone Amp.  I should also add that I don't use any equalization with my phones.  I messed around running the phones directly off the computer's headphone jack, and I have to say that I highly recommend a good DAC/Amp to get the most out of these cans, as the added power really brings them to life.  And remember that to truly \"Listen\" to these phones you need to be in a quiet environment.A few other observations:  The 600's clamp quite a bit tighter than the 598s, though they do seem to be loosening up a bit with use.  I think the 598s actually sound a bit wider and a touch brighter, but my 600's only have about 15 hours on them at this writing and like the 598s, I expect them to open up after more time.  I may invest in a better cable in the future, but the included cable gets the job done, and it's more flexible than the one for the 598's (which I also replaced).  I had thought about comparing these to some of my other closed phones for my review, but really, I don't feel that any of them even comes close to these 600s. I've also noticed that with the 598's it is important to find that sweet spot in the volume where the sound really starts to shine, while the 600's play much better and more balanced over a wider range of volume (high and low).I am looking forward to enjoying these headphones for many years to come.  If you have any comments or questions I welcome them and will try my best to answer.  I did extensive research prior to this purchase, so if I can't answer a specific question I may be able to point you in the right direction.Update 1:  After probably 20 more hours of listening I can clarify my comment about the 598s being a little bit brighter.  On certain pieces when I hear a high-hat cymbal on the 598's, I hear it as one sound, and mostly the sound of the cymbal.  On the 600's you clearly hear the stick hitting the cymbal, and the sound of the cymbal itself.  So, I would say the high end of the 600s may not be perceived as being as bright as the 598's, but it is much more defined, clear, and controlled.", "overall": 5.0, "summary": "Absolutely Fantastic!", "unixReviewTime": 1400976000, "reviewTime": "05 25, 2014"}