{"reviewerID": "A2KVSY1005QJDF", "asin": "B00004SY4H", "reviewerName": "Cellar", "helpful": [3, 3], "reviewtext": "I'm a huge audio enthusiast so I'm always chasing the next thing in quality. I went from Audio technica m-50 to sennheiser hd 25-1 ii. Each purchase gave me a sense of enjoyment but also a sense of need to move a step up. For some reason every time I purchase headphones I'm blown away by the sound but also not completely satisfied. It wasn't until I purchased some really nice speakers that I understood that I like the fullness of speakers and the actual way our ears perceive sound.Now these things still don't reproduce the low ends that are capable on speakers that you can feel all over your body but these are legendary in detail retrieval. After owning everything under the sun I can say that these keep me satisfied with having just the next level of detail retrieval over other headphones. The m50 and sennheiser hd25 just seem to be missing something to my ears even when they sound amazing. The soundstage and imaging just cannot compete with speakers.With that said, I do feel that these do a better job that the other two that I own. I feel as if they are another level above my headphones. My speakers aren't so clear on detail retrieval. The imaging may not be as great as the speakers but the sense of detail retrieval makes me feel as if I can see the drummer in front of me tapping the hi hats into rhythm. Sure it may be a simulation as most music is digital now a days but the fact is these things shine where others dont. Speakers, or headphone you will be hard pressed to find something that can bring out this level of clarity in music.Im a very analytical person and I love to hear every little detail in my music. Sometimes these headphones do a little too much and make the music enjoyable because I am so distracted with all the different elements going on. Some people may or may not like this. If you purchase these you will know what I mean. Every recording you have ever heard on the radio a million times you should revisit just for fun. Youll be surprise how intricate the production was done. These things WILL bring out all the little details.Also don't use cheap source. You can really hear the level of quality in your audio files from mp3 to wav. If you love music and you want to hear it in a completely different way that you have heard before get these.I also want to note that these are very nuetral and detailed headphones. I do music production and I love this quality in my headphones. It may not be for everyone however if you don't enjoy having your music presented in such a manner.", "overall": 5.0, "summary": "Legendary sound and clarity", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"}