{"reviewerID": "AX9FIZX89LNFQ", "asin": "B00004SY4H", "reviewerName": "C.V. May \"Searching for The Good Stuff\"", "helpful": [5, 5], "reviewtext": "SO, WHAT'S THE BUZZ?The Sennheiser line appears to be the Mercedes-Benz of German-headquartered headphones. Wikipedia says: \"The company has factories in Wennebostel (Wedemark, near Hanover); Tullamore, Ireland (since 1990); and Albuquerque, New Mexico (since 2000). Sennheiser's R&D; facilities are located in Germany, Denmark, Switzerland, Singapore and San Francisco, California.\"Firstly, you should know that the Sennheiser HD 600s circumaural (around the ear) headphones are often the choice of professional and amateur audio engineers and musicians recording live music or for monitoring and mixing sessions, in comfort, while in the studio for long hours at a time. Sonic precision, flat and neutral sound with little coloring is the key requirement here. This places the Senn HD 600 headphones firmly in the Prosumer class (products made for both professional AND consumer use).MUSIC HEARING AIDS: What the 600s SaidIn my first listen I did not experience any wow factor comparing them to a pair of five-year old, fully burned in closed-ear Audio Technica M50s. They seemed so distant and I could not get enough volume from them. I got up and unplugged the jack and reinserted it. Damn! I had not plugged it in all the way. I sat back down and listened to the Fleetwood Mac CD. !!!!!!!!!!! That is all I can say!Oh yes! Now I know what all the raves are about. My Audio Technica M50's are very good, but not this good. They will be relegated to laptop duty now. Are the HD 600s as good as my excellent Tekton Design Seas Pendragon loudspeakers? No, but what headphones are? None. I miss the bass I get with my full-range speakers, but still the bass was good enough for me. But what do you expect? No headphones can imitate full-range, floor standing loudspeakers, that is not the point of owning headphones. Though I must admit that headphones, the 600s in particular, often give you a more intimate audio experience than stand-alone loudspeakers. Back to what I heard.What I heard, overall, was very sweet and highly entertaining. I could easily listen for hours with these Senn HD 600s without physical discomfort or aural fatigue. They will not entirely replace my floorstanders, but for late night listening I must say that I am overwhelmed with the clarity of the highs, the detail of the mids, and the more than adequate bass. The soundstage had depth and dimension too.Over a few day's time the raw, open dynamic HD 600s became much more alive, palpable. Running the 600s directly from an Oppo BDP-105D's headphone amp section required a gain of at least 75 to 80 out of 100 possible to fully power them. It seems like Senn cans require POWER from the Oppo BDP-105D.  My AT M50s need only a 50-60 gain setting. This is not a fault, just a difference. But believe me, I could still crank up the volume to tinnitus-inducing levels if I were bonkers.So far, the Senn 600s sound sweet and airy. To be more specific now, the upper treble extension sparkles with excellent detail and are neither bright nor dark. The midrange is very neutral and natural, pure and detailed yet not at all nor artificially colored. The bass is also detailed and very deep though not profoundly so. I sense that I am being technologically tricked into believing, almost, that I am listening to external speakers though not quite yet hearing live music as if I were actually there...the trick that you want played on you, one that many of us seek in their stereo or home theater system. The soundstage is more present after the break in period, and is improving in depth, height, and width.With any quality cans, you need a powerful a quality headphone amplifier and an equally good Digital to Analog Converter (DAC), either using separates or using an integrated amp/DAC, or in my case, the Oppo BDP-105D's headphone amp section. Why skimp on a headphone amp that will make your phones sing much clearer, cleaner, and louder if you need volume. After using this pair of these cans for a few weeks now, I know that these HD 600s will never be neglected here at home. Own a pair, and you will NOT be disappointed.To back up my experiences, the below should be informative and helpful in your headphone shopping.STEREOPHILE MAGAZINE RECOMMENDEDThose of you that read Stereophile Magazine, or the online free version, probably read the cherished, annual Recommended Components list. I search the A-List first, of course. On the Stereophile 2014 Recommended Components list click on the \"Headphones\" icon. You will notice that the HD 600s are the least expensive cans in the A-class lineup.On the Stereophile 2013 Recommended Components list the ONLY A-listed, full-sized audiophile headphones shown are from Sennheiser! They are: the HD 600, the HD 650, and the HD 800. That's it! I am certain that Sennheiser's competitors are not happy with that. For me, I take that to heart. Below is an HD 600 review excerpt from Stereophile Magazine by Wes Phillips:\"Sennheiser HD 600: $399.95 &#10025;WP, KR, and ST were unanimous in calling these the best dynamic headphones they've ever heard. \"The only ones with which I have ever been physically or sonically comfortable,\" says KR. \"Sennheiser has kept all of the qualities that made the HD 580 among the best of its breed, and in several areas has even managed to better it impressively,\" according to WP. Says ST, \"The magic of the HD 600s is their midrange--a purity of tone, especially when driven by tubes, that is quite special.\"THE HD 600 VERSUS THE HD 650 CANSThe Inner Fidelity website compares the HD 600s to the HD 650 CANS: \"Yup, I'll say it, one of the worlds greatest headphones. Lush and inviting, the HD 600 is simply one of the best buys in the world of audiophile headphones. Easily paired with just about any headphone amplifier, they will sound good directly from the headphone jack of a receiver, and will improve nicely when combined with better gear. Going up on the \"Wall of Fame\" as the best open headphone in it's price range.While the HD 650 is slightly more refined sounding than the HD 600, it's also a bit warmer and thicker sounding...yes, maybe a bit veiled. While I think these headphones are very good and are well worthy of recommendation, I find the HD 600 a bit more neutral, and at $100 less, a better buy.\" Here is the YouTube version: www dot youtube dot com/watch?v=c2Es9S9tXTYAs a result, I did my homework. I searched online pro reviews, amateur reviews such as Amazon, and the very useful forum board thread discussions, especially on Head-Fi. The consensus is that the HD 600s are the sweet spot, and in some ways besting the HD 650s, some say. The 600 cans have exquisite sonics at the affordable price of $400 less a nickle, so it is said. The HD 800s, again it is said, at $1,499.95, are better in some respects. The HD 600s do seem to be rated better than the HD 650s, yet I am NOT paying $1,500 for the excellent HD 800s. For most audio hobbyists, the extremely steep incline with respect to the law of diminishing returns is working hard against that choice, economically speaking. How diplomatic of me to say.Along with reviews here from those having lived with the HD 600s, I urge you to head to the online headphone fora boards and their Senn HD 600 threads. See also the professional reviews; a must. Here is another excellent example: Google Sennheiser HD 600 Headphone Review | Audioholics, by Gene DellaSalla.CONCLUSIONThe Sennheiser HD 600s are highly recommended, and universally consumer rated as a top drawer, reference level pair of cans. It is reassuring to know that the entire Senn line is very durable, with replacement parts readily available. In my listening experience, I can tell you that these HD600s will never tire you, feel uncomfortable,  or let you down with any genre of music. The SQ is just amazing to me, as they are to so many others, and the price is very fair, quality is high, and durability is long. What more do you need? More music.I hope this was helpful to you. Please use the Comment section below and I will be glad to answer your questions._____________________________________MY BLOG: thegoodstuffreviews.blogspot.com AND thegoodstuffaudioreviews.blogspot.com", "overall": 5.0, "summary": "SENNHEISER HD 600 OPEN DYNAMIC HI-FI PROFESSIONAL HEADPHONES", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"}