{"reviewerID": "AYTGG6XTVUG7G", "asin": "B00004SY4H", "reviewerName": "Douglas A. Greenberg", "helpful": [49, 56], "reviewtext": "These are excellent audiophile headphones, no doubt about it.  Their reproduction of sound is superior, and there is no attempt to render the sound excessively bass-y or to otherwise alter/distort whatever signal the source happens to deliver.  This actually is a mixed blessing, since many contemporary listeners now seem to expect a exaggeratedly bass-heavy sound from their headphones.These are gorgeously made, high quality 'phones, but they are not for everyone. The potential drawbacks to using these headphones are several.  First, the HD600 does such a fine job of amplifying input that it will render all the clearer any flaws in the audio system to which it is hooked up.  Consequently, using these with a very cheap overall sound system can actually backfire.  Second, the impedance associated with these 'phones is very high, so they will not produce much volume when used directly with a portable cd or md player.  You NEED to use a headphone amplifier with any portable or other low-output device.  Third, the design of these headphones is of the \"open\" variety.  This helps in their superior sound reproduction, but it also means that if you are in a crowded room listening to music, everyone around you will know just what you are listening to and may not be as pleased with the experience as you are. If you need isolation, you are better off buying either \"closed\" headphones or else, even better, some first-rate (ear) canal phones such as the Etymotic ER-4's.Finally, as has already been pointed out, these headphones are quite luxuriant in their on-ear padding, but as a result they can become uncomfortably hot or itchy to wear.With those caveats in mind, these are still among the best stereo headphones currently made, and if you understand beforehand just what to expect with the HD600's, you will surely enjoy them.", "overall": 4.0, "summary": "Pricey, well-made, not for everyone", "unixReviewTime": 1014422400, "reviewTime": "02 23, 2002"}