{"reviewerID": "A2ZCWFNMC84GPY", "asin": "B00004SY4H", "reviewerName": "garbulky", "helpful": [26, 29], "reviewtext": "I bought the HD600 refurbished from amazon.com and paired with a xenos headphone amp and an audigy 2ZS (unfortunately). Long story short. You need to replace 1. the stock headphone wire on this headphone and 2. buy a headphone amplifier 3. Also, though not essential, you will gain significant benefits, upgrade your soundcard to the Asus Xonar Essence ST (thereby negating the need for a headphone amplifier).Im not even kidding. I don't believe in paying big bucks for an amazing cable but there is something wrong with the wire they send you. And yes, I have ordered replacement wire for the HD600 and same problem. I can tell you there is a HUGE difference when I switched wires. All that's required is to replace it with the HD650 wire from sennheiser website and buy the gold adapter. This will actually cost LESS than 30 bucks and less than the replacement wire for the HD600. Best decision I have ever done.First, yes, it's a 300 ohm headphone. You will get adequate amplification out of a normal output but you will completely miss the powerful dynamic capabilities of a dedicated headphone amp and miss some low and high end extension. What The advantage is a complete lack of hiss!When I first got it for about an year I was thoroughly unimpressed with the sound. Everything sounded veiled, and the high frequencies sounded like they were very veiled. The detail of different instruments, especially quiet details seemed to be gobbled up and not properly produced. Loud sounds were harsh and strained. The detail was not much better than other headphone that cost around 60-100 dollars. However, I noted that even then the sennheissers had a high tolerance to PUSH extreme amounts of volume without clipping.This all changed when I bought the HD650 cable based on recommendations. The low end improved and every quiet detail was bought. The headphones became airy and even with great high end extension. The strain and ear fatigue just vanished! In my opinion the quality of the sound improved by about 30-50% depending who you are and how unblocked your ears are!And the others are quite right. I can already tell that by its effortlessness these headphones will do much better with a more expensive headphone amplifier and a way better source than the audigy 2 (which admittedly is quite a good low cost card). I reccomend the Asus Xonar and a pretty expensive headphone amplifier.With my comparison speaker current setup it has the amount of detail pumped out by a Cambridge soundworks megaworks 510D subwoofer powering two (underused) full range Mitsubishi vintage towers which contain a 2 inch tweeter, four 4 inch mid-range woofer and a 10 inch low end woofer.  I would say you would get similar detail that my speaker setup provides from a speaker combination costing anywhere between $600-1300 depending on how you shop.Bass: My sub goes down accurately to 33 hz +/-3db. HD600 bests the 8 inch 180W RMS sub in terms of detail. ABSOLUTELY NO BOOMINESS in the bass. Clear defined bass  but doesn't quite hit the same low end extension and power by a significant amount. Once again, I think this is a problem with the bass control on my headphone amplifier which has a cross over of about 50-60hz which is not very low at all. I believe the sennheiser can reach a full octave lower and louder than it is hitting now upto at least 25hz with accuracy and precision.Mid-range: It gets very close and in cases slightly better than even than my tower speakers. However the full range towers do provide a more pleasing and more detailed mid-range. The presence of mid-range on drum tracks are more pleasing and come through with a good punch while the sennheissers don't quite capture the power of a good mid hit on a drum. Vocal performance though does go to the HD600 with clear and high female vocals. This is saying a lot as when my speaker system is properly positioned vocals float in the middle of the air very naturally.Highs: HD600 is a clear win. The highs are clear airy and defined while my two inch tweeters come a far far distant second. On the HD600 You can hear significant differences in the cymbals on drumsets according to the song you are listening. This applies to even the egg shakers or pretty much anything in the high end. You can differentiate the timbre of the same type of musical instrument. For instance one flute can be distinguished from a different quality flute of the same kind. Same goes for guitar. Listening to jcwfree on youtube is just an absolute pleasure.However, I have to say that the HD600's attention to detail doesn't make it an ideal listening environment for Rock music precisely because the sound is so clean and clear and only produces the distortion present in the recording and nothing more. In my opinion cheaper systems that distort under strain is better suited to rock guitars.All my mp3 listening had to be replaced to 192kbps-320 kbps because of this amazing preciseness of the HD600.The HD600's stregnths are instrumental music. Soft rock, Jazz, and are VERY good on bluray movies. It is VERY hard to these headphones to distort. I have to push my amplifier to the limit and only then it's the low range than distorts. I listen to very loud music and have several noise complaints against me :p and this volume where it clips is too loud even for me. The sennheissers can deafen me quite easily as it stays clear and unstrained WITHOUT boominess until the loudest levels thereby you sometimes don't realize how loud they are until you take them off and go DAMN!Build quality is very good. I've had it for three years. Stepped on it, sat on it, thrown it, dropped it from four feet, twisted the headphones (all accidentally) and this thing is no worse for the wear. Also great is that the heaphone cables split and go individually into each heaphone. The entire headphone is replaceable in parts because it is designed to be dissassembled and reassembled. The pads are replaceable all the wires are replaceable. great. Also the headphones themselves are HUGE so keep that in mind and are definitely not suitable for running as they will fly off your very easily if you shake it.The pads are also VERY comfortable. Most comfortable headphones I've tried on and they do not feel warm.A warning though, if you buy these headphones and don't use it with a dedicated GOOD soundcard without buying the HD650 replacement cables (rather than the HD600) and without an amplifier this is what you will experience:Decent, unimpressive sound that can be bought by a pair of headphones well below a 100 dollars.The bass is defined though not loud and has a low end extension of about 40-50hz though. Completely lacking any wow factor. The dynamics are on par with a headphone costing about 60 dollars. The high's are recessed and veiled. Everything sounds like it has a veil on it. Soft sounds don't quite get expressed very well. Dissapointing. Also the original cable is very susceptible to damage compared to almost any replacement.If you do take the time and money this kind of headphone is meant to be paired with source equipment + amplification worth all the way upto at least a thousand dollars easily.Update: I just upgraded my soundcard and did a bit more research. To get the optimal sound quality for these phones, I use a mp3 software player capable of ASIO or WASAPI playback. For example: foobar with a few tweaks. WASAPI is most easily setup and works if you have vista or windows 7 (you have to use ASIO if using XP). Basically what any of these things are is a way to bypass the windows mixer which actually resamples all your audio from 44 khz upto 48khz and then resamples it back to whatever output it's supposed to be going at. This reduces the sound quality IMO by about 5 to 10%. So it bypasses this and sends the audio signal directly to your soundcard for bitperfect playback.So I upgraded my soundcard to the Asus Xonar Essence ST and these are my impressions. There is a quality difference of about ANOTHER 30% at least. More importantly, right now the HD600 SPANKS my current sound system. Yes, this means it's bass output, mid-range output and high's. It's so ridiculous that I'm getting it out of this (relatively) cheap setup. Also, I am noticing a thing I've never heard before called SOUNDSTAGE! The mp3's sound completely different and I can actually sense the kind of room these instruments are being played in. I can hear tiny details like the soft inhalation out of the nostrils. Soft instruments play very clearly far away in the background while a deafening bass track and drums pound out the climax to a song.For instance I listened to TLC-waterfalls and noticed this soft piano track playing which I'd never heard before. On Outkast's ms jackson I noticed all these voices in the background that pop in from time to time softly whispered far away. And for any kind of classical music this thing is just flat out amazing. So much detail. I always thought classical music recordings sounded dull, but oh boy, not now. These things showed me that classical music had POWER and low end! (and high end too!). I don't know how I missed that all these years. Cymbals took on a new meaning. I always assumed that if an instrument was soft it sounded like it was far away and if it was loud it would move closer on headphones. Nope. Far away instruments could get really loud but still stay far away! (I don't know how this is managed but somehow it is). I can notice other things like the singer is standing slightly left to the mike and BEHIND him is a soft violin, while close to my left ear a guitar plays a very soft tune. Audience laughter is something that also took me by surprise because it immediately gave me a sense of the size of the room and the kind of auditorium they were in. I'm shaking my head as I say this because I didn't think headphones could do this.Also transient response really improved. I listened to Los lobos hotel california and some flamenco guitar tracks on this setup and on the audigy 2 it sounded very pleasing and mellow and when the guitar played fast it felt somewhat blurred together. On the xonar the guitar picks became sharp and stood out beautifully. Also when the guitar played fast every note was played out as sharp and clear as day EXTREMELY quickly. So, this just goes to show that the HD600 can really do with pairing up to some REALLY good sound sources.Oh, and also, what bass is there on the track is there on the phones and it can get REALLY low. Wyclef Jean's gone till november or Matisyahu's live at the stubbs King without a crown put out low clear bass. On the HD600 instead of hearing the low note of the bass part of the song, you actually hear and identify clearly the INSTEUMENT causing the bass. You can even define between the different electric bass guitars effects or low kick drums used.So if you are willing to spend LOTS more money after buying this headphones because you know they are not at their true potential YET, run and buy these. Sorry for your wallet :) Otherwise there are other good headphones out there that don't NEED expensive sets to sound close to their full potential and costs less like the grado SR60.Oh, I listened to an ipod nano 3g using these headphones without an amplifier and they sounded decent, not very loud though and not as much detail came through as I was used to. I listened to some bose quiet comfort headphones (which I think is totally not worth the money,) and without an amplifier the Bose actually sounded comparable though at VERY loud volumes the bose distorted on the deep bass while these did not. However, in a real contest with good sources and amplification, the bose headphones were a distant loser far away on the horizon.Second Update:(Granted, there is a good possibility that the limiting factor of my current headphone setup is my limiting $130 headphone amp than the headphones)I just got some axiom audio m80ti's with a very nice amplifier. It is with a smile that I say, I found a system that sounds better to my ears than these loyal headphones. (BTW, the comparision is unfair. 12 drivers: 4 subwoofers, 4 woofers, and 4 titanium tweeters, six tuned ports, power handling of 800 watts vs two 4 inch dynamic matched drivers, power handling of a few watts.)The sound difference is significant with the axioms and more pleasing. But it doesn't diminish how much of a deal you are getting.A xonar essence ST (with inbuilt headphone amp) + HD600 = $400-500.A xonar essence + (decent amp) + M80ti's = $1700 (and all the components used were outstanding performers in their price class giving great value for money competing with systems typically worth about $3000.)That's a price difference of over a 1000 dollars. It depends on how much you are willing to go. In terms of just headphone to headphone comparison, there are a few that compare at the price range, but just a few, and none that will soundly outperform it to a significant value...and all will most likely satisfy. I think the length and amount of time I put in this review suggest that these phones are something special. Do yourself a favor. You know you want to...Update 3: it's been well over six years now  having owned this. Nothing has broken except the headphone cables I mentioned. I got to put a good DAC on this and while it's not much better than the xonar essence st, I did hear some more details and spacial cues than I had from the essence. This could easily be the headphone you retire with though you will spend lots of money trying to make it sound even better or finding where it maxes out.I also compared these to the Beats headphones with which the senheissers beat (sorry, I had to) pretty much in every aspect. Also paired it to a emotiva XDA-1 dual differential DAC which has been sounding great. I have written so much about this guy mainly because of what a great deal it is. You will not find PC speakers that can compare to these things. Period.  I changed my rating from four (due to the cable) to five stars because, well, this thing is amazing, and something so small as a cable shouldnt be a factor on its exceptional rating. Im doing these updates several years later because of how six years later, I am still thrilled with these things. SIX YEARS LATER.Update 4: Still going strong. The only thing that has failed is the cords for them multiple times. Everything else performs like it was new and I've put it through much abuse.Here's the deal: this is worth it if you buy it refurbished but not for the full asking price of 400. Because of this. For it to sound fantastic you have to pair it up with great gear INCLUDING a really good headphone amp. One that has some serious power and clarity behind it. Right there yyou would spend another 300 at least on the headphone amp putting the price to around 700. There's floorstanding internet direct speakers like tekton design, axiom audio, and other rare units that are really good and simply sound better than this headphone at this price range and a little higher. So, that's my only caveat, it's hard to make these things sound sublime and that's what is irritating is that it can sound fantastic! The entry to that is rather high. So there's that.I plan to upgrade my DAC with a better headphone amp and when I do I shall report back. Most liklely I will be taking back my caveat. :) But for now it stands. There are audiophile grade speakers and amplifiers that if you look carefully enough that will be more pleasing on your ears especially if you look in the used market.", "overall": 5.0, "summary": "Is well worth it with proper equipment and at least HD650 replacement cable", "unixReviewTime": 1263427200, "reviewTime": "01 14, 2010"}