{"reviewerID": "A2J9NEE5C5D2AU", "asin": "B00004SY4H", "reviewerName": "+++", "helpful": [31, 35], "reviewtext": "Sennheiser HD600 is one of the best headphones in the market, which offers exceptional sound quality at a price much lower than one has to pay for comparably good speakers. They are often compared to Grado RS-1 or Sony MDR-F1. Although it is extremely hard to find a place where you can compare all three of these top-of-the-line models, those people who had this chance agree that the difference in sound quality is so subtle that it is a matter of personal taste which one to prefer.The sound quality of HD600 has been discussed in several reviews posted before mine. I can only add that the best way to hear the difference is to listen to the classical music or to jazz, where natural sound is paramount. Electronic music will sound good also in much cheaper headphones. There are several things which I learned from my experience that were not mentioned in reviews posted before mine:1. Break-in period. As taken from the box, HD600 sounded not better than $7 headphones from a local drug store, and I was very close to returning them. However, I accidentally found on the web that headphones need a break-in period, i.e., they are supposed to play for about 24 hours before they can reach their full sound potential. The sound quality transformation after the break-in period was truly amazing, and the difference between HD600 and cheap headphones became striking!2. With a 300 Ohms impedance, HD600 need quite some power. Neither portable CD players, nor computer sound cards can drive them - the volume is low, and the bass is gone completely. This was the only thing about HD600 that I got disappointed with - they can be used only with a dedicated high quality amplifier. It is possible that headphone jacks on DVD and CD players may also be not adequate. I ended up buying a Creek OBH-11 headphone amplifier in order to have something that can drive my HD600 and provides the sounds quality that I expected.3. Many people say that HD600 is very comfortable. Frankly, I saw more comfortable headphones. It may be a matter of the head size (I am a big guy), but I would be happy if the pressure on my ears could be reduced. I am getting tired of wearing HD600 after about 40-50 minutes.But the sound IS great !!!", "overall": 4.0, "summary": "be sure to get a high quality amplifier...", "unixReviewTime": 1009497600, "reviewTime": "12 28, 2001"}