{"reviewerID": "A10XB56QFYLVC8", "asin": "B00004SY4H", "reviewerName": "Jeff Chan", "helpful": [44, 46], "reviewtext": "I have been building and listening to audiophile sound systems for more than 20 years.  Having listened through Sennheiser HD580s for several years and finding them excellent, I feel comfortable saying that the HD600s are a very significant improvement in clarity and overall sound quality.  The main differences between the HD580 and HD600 appear to be in better reasonance control throughout the entire mechanical system and evolutionary driver improvements.  The HD600s do indeed approach perfection.  Their sound quality is not easily surpassed by $10,000 loudspeakers.However, several caveats are in order.  Like loudspeakers, these headphones do require several days of playing time to break in and open up, particularly in the lower frequencies.  The reason for this is simple physics: when new the suspensions are stiff and need some work to loosen up and allow larger, low frequency excursions to happen more easily.  The may sound a little cool at first, but will warm up after many hours of playing time.  They will also sound clearer.  When breaking them in, don't play them louder than you would normally listen.Second, these headphones are extremely revealing of the electronics feeding them.  An audiophile-quality headphone amplifier, such as those made by headphone.com, is necessary to get the best sound of of them.  The source electronics are also clearly audible.  It would be appropriate to use these with multi-thousand dollar D/A converters or CD/SACD/DVD/vinyl rigs.  Used with cheap or inferior source electronics, the sound will be severely limited.  It's a bit like putting ketchup on a $20 steak.Third, these headphones are extremely revealing of the quality of recordings.  Unfortunately very few recordings, especially mainstream commercial ones, have really good sound quality.  A few audiophile labels have consistently good sound such as Reference Recordings, a few jazz labels, etc.  Occasionally a large record company may have a recording or a track with good sound, but they seem very rare and almost due to random chance.  That's not a fault of the headphones, but of the source material.  It's proof that the quality and resolution of these headphones is extremely high that they can help reveal those differences to the attuned ear.Other highlights: very comfortable for most people, relatively light weight, free-space equalization, meaning the frequency balance is designed to be like natural sound in an open area.  The latter is part of the reason these headphones \"don't sound like headphones\" and instead sound like real music, along with the mechanical resonance reduction practiced throughout.Very likely these headphones will not be the limiting factor of the sound quality for most systems they are used in.  Electronics and recording sources are probably a larger factor, which is a sign that these are indeed audiophile goodies.  Given the very high quality of engineering and quality control behind the HD600s, they are a tremendous bargain even at their price.  However, their benefits will not be fully realized in less than excellent systems.", "overall": 5.0, "summary": "Outstanding headphones", "unixReviewTime": 1105833600, "reviewTime": "01 16, 2005"}