{"reviewerID": "ACIAP3IPPGK27", "asin": "B00004SY4H", "reviewerName": "John Smith \"Bimkoblerutso\"", "helpful": [3, 3], "reviewtext": "I'm generally of the opinion that the word &#34;classic&#34; gets thrown around too often in the world of headphones, but I have to say, for as old and storied as the Sennheiser HD600's are, they truly embody the title in every way possible. As far as &#34;mid-fi&#34; headphones go, I don't look to any other can out there, and to tell the truth they're actually my most used pair of headphones simply because the sound signature is so appealing and easy to listen to and appreciate.Sound:Obviously this is the most important aspect of headphones past a certain price point, and as I said, the HD600's don't disappoint in any discernible way. Sure, you're going to get better clarity and imaging as you go up in price, but for what they are, the HD600's have a truly outstanding sound signature.Highs are dark to the point that some would say they suffer from the infamous &#34;Sennheiser veil,&#34; but that term honestly means less and less to me everyday I use these. The highs are about as articulate and detailed as you're going to get at this price point, only they're not &#34;up front&#34; like you hear from the likes of Beyerdynamics, so there are never any bursts of shrillness from the likes of cymbals and hi-hats. For the longest time, the promise of &#34;darkness&#34; from these cans scared me away, but I have to say, it's hard to listen to brighter headphones after hearing these. It's all of the detail without any of the bite.Mids are perhaps slightly overextended, especially on the higher end of the mid-range spectrum, but not to the point of sounding unnatural. Just to the point of becoming a preferential option when considering different headphones. Overdriven guitars sound especially fantastic. As a testament to their greatness, I actually disliked the Black Keys until I heard &#34;Gold on the Ceiling&#34; through these.Lows are in keeping with the &#34;neutral&#34; sound of the HD600's. They never overpower anything, but they're there when they're supposed to be, and focused and tight to boot. Considering their open design, I have no complaints with the lows whatsoever, especially coming off more bass-anemic cans like the AKG Q701's. Obviously they are not basshead cans, but they still deliver what they need to.The soundstage is wonderful as well. It's not as wide as the Q701's (though to be fair, that's the widest I've ever heard), but it's natural, airy and articulate enough to create a very pleasant stage overall.Also, it's probably obvious if you're looking to spend this much on headphones, but a good headphone amp REALLY brings these alive. They are actually surprisingly easy to drive, but a good amp and DAC really makeComfort:No need to spend too much time here. These are Sennheiser headphones. They're most likely going to be some of the most comfortable headphones you ever put on your head. Though I will say that these in particular need a little &#34;bend-in&#34; time to really get comfy. Everything is padded very well, but the clamping force right out of the box is slightly too strong, but thankfully becomes a non-issue after ten or so hours of use.Build Quality/Features:&#34;Features&#34; isn't really a strong suit of most Sennheiser headphones (not that that's a particularly bad thing), so I'll just say feature-wise, they terminate in a 3.5mm plug and come with a 1/4&#34; adapter that fits nicely over the 3.5mm. That's about it, honestly.The build quality is great, though they are a bit more plastic-y than I would like. Other than that, I have no complaints here either. The velour pads are affixed nicely to the cups, the aluminum lining in the headband seems very sturdy, and even the plastic itself feels at least high quality and hearty. Also, it's worth noting that the binding method on the headband is totally different from Sennheiser's lesser HD models, so that infamous &#34;headband cracking&#34; you seen occasionally on the 598's, 595's and 555's is non-existent in these.Conclusion:I can't recommend these enough. They will most likely be an outstanding step up from whatever you're upgrading from. Some of my favorite headphones ever.", "overall": 5.0, "summary": "These are great...GREAT headphones.", "unixReviewTime": 1363910400, "reviewTime": "03 22, 2013"}