{"reviewerID": "A2SDA5LOD7577T", "asin": "B00004SY4H", "reviewerName": "Kon Peki", "helpful": [6, 6], "reviewtext": "My new HD600 arrived with the sound cutting in and out on the right side. I feared I would have to exchange them but Googled for the problem and came across the Head-fi guide which said this:\"Troubleshooting/Known Issues:Some HD 600s are known to ship with the cable inserted loosely. This can cause the sound to cut out of either side when the cable is moved. To fix this, push the cable in hard, not just a little hard, but push it in with the angry fist of a god hard. Once it's in hard, it should stay that way on it's own.\"Sure enough when I pushed the cord in hard on that side, it moved further in by almost 2mm, and the sound has been rock stable ever since. I wonder how many people return or exchange these thinking they are faulty when all it would take is one good hard push to seat the cable properly!Now onto the brief review...Sound: These headphones produce the most natural sound that I have experienced from headphones.  Nothing is exaggerated.  The mids are beautiful.  Vocals sound incredible.  Highs are less sparkly or less harsh depending on your perspective.  Bass is a bit loose when plugged directly into my Macbook Air or phone but tightens up considerably with my Schiit Asgard 2  amp.  These shine on just about any genre with the exception of the sub-bass being inadequate for a small subset of my rap and electronic music (but still great on most rap and electronic and virtually all rock, pop, jazz, funk, soul, classical).  I don't hear quite as much detail with these as with my Beyerdynamic DT880 Pro (250 ohm), but there is plenty of detail there, and I wouldn't call them veiled.Build: Light, seems solid, fully modular with parts available for replacement.  Cable is very long, thinner/lighter than some of my other headphones, and seems to resist tangling.  Cable can be replaced like everything else.  Very comfortable on my big head and ears though not quite as comfortable as my Beyerdynamic DT770 and DT880.  The Beyers totally encircle my ears, hardly touching them.  The HD600 is more snug, touching all the way around.  The marbled finish looks okay in person.  From the pictures, I thought it was going to look terrible.Most headphones in my collection and nearly all popular headphones these days have a V-shaped sound, emphasizing bass and highs.  The HD600 are a wonderful contrast to that, with an overall neutral signature and the gorgeous mids.", "overall": 5.0, "summary": "The Natural", "unixReviewTime": 1394582400, "reviewTime": "03 12, 2014"}