{"reviewerID": "ATEDSY50EDAMI", "asin": "B00004SY4H", "reviewerName": "Owen Oyer \"q3catscratch\"", "helpful": [46, 52], "reviewtext": "Well, if you're here, then you probably know what you're looking at. If not, let me explain.The HD600 was introduced by Sennheiser as the replacement for their highly acclaimed HD580. It was essentially the HD580 Jubilee edition, but re-dressed and re-badged. As such, it shares nearly everything with the HD580 Jubilee, and shares it's drivers with the HD580. The HD600 has been on Stereophile's A list for ages, and hasn't budged despite passing years and many new models from competitors. It has also been the golden standard for neutrality and accuracy in recording studios worldwide.What does the HD600 sound like? Quite simply, it sounds much like the components that you have upstream, but with more weight and body to the sound. The HD600 is uncolored enough that every change in your signal path results in a different sound signature. You hear exactly how your CD player sounds, how your amp sounds, how your cables sound (yes, I know this statement disqualifies me with the audio cynics... well, so be it). In my experience with hi-fi and more specifically headphone hi-fi, I've yet to find another headphone that sounds so neutral, so very \"right\" with everything that I throw at it.It is detailed, but presents detail in a relaxed manner. It is very airy and open but doesn't sound thin. It has a strong bass but it's quite clear and well defined. It has a melodic midrange but it's clean and articulate. It has exactly the right tone and tembre on every instrument. And it does it all in a very coherent, integrated fashion. Everything is part of a greater sonic whole, and works together in a coherent fashion to recreate beautiful music. Most prominently, it has a sense of weight and solidity to every sound that is very much speaker-like. I have heard this kind of solidity in other headphones, but in many cases it has worked detrimentally to the music. In this case, it adds a sense of magical realism that's hard to find elsewhere.You probably are aware that this headphone needs an amp. That's definitely true. Don't connect it to an mp3 player expecting it to sing, because it won't. A dedicated headphone amplifier is a must. I will also go further than that and say that a dedicated hi-fi source is a must, since this headphone does, once again, sound like it's upstream components.Here's what I suggest for building a good headphone rig around the HD600:Start with an inexpensive source with an optical line-out. A cheap Sony D-NE920 will do quite well, or any other PCDP with an optical line-out. Next, get a standalone DAC, either a portable battery powered model like a Headroom MicroDAC (amazing little product) or a full-size jitter-immune DAC like the Benchmark DAC1. Next, if you're going the portable route, get a good portable amp - I use the Ray Samuels Hornet currently, and it's a killer piece of amplification. If you're going with a stationary home DAC, then make sure that it has balanced outputs, and get a true balanced amplifier (Headamp GS-X is a good model, as is the Heardoom Max Balanced, or perhaps a cheaper but still excellent SFT-build balanced M^3). Finish it off with a decent set of IC's (Grover Ultimate Reference is a great inexpensive cable), and replace the dinky cable that came with your HD600's (I like the Moon Audio cables myself). You'll need an XLR-terminated cable for your balanced amp. You can throw in power conditioning if you believe in that sort of thing, but it's really up to you. Lastly, throw on your favorite recording, relax, and enjoy. For this is what the HD600 will do - relax and let the music flow.I've heard some very serious phones - the Sennheiser Orpheus, Sony MDR-R10, Sony Qualia 010, together with countless less-expensive phones. Properly amped and properly driven, the HD600 can play with the best of them. It's a real steal at the price, but make sure to pair it with quality gear.****Let me address some previous reviews.To the gentleman who claimed that this sounds muddy next to Stax headphones - I agree. Stax headphones really are unique in terms of clarity, but since they're electrostatic, this is to be expected. However, driven balanced, the HD600 can come close to this sort of clarity, and will be more realistic in terms of tembre and texture. I prefer it in some ways over the SR-007, and I own the SR-404 myself, so I'm no stranger to Stax.To the reviewer below who claims that the A900 and MDR-V7506 are better phones: I suggest you get your facts straight. The HD600 is used nearly as much as the V7506 in the studio. I also happen to own the A900, and I honestly cannot say that it sounds just as natural as the HD600. It has an upper-midrange honky coloration that is distinctly artificial. Having played piano for 13 years, I know how the instrument is supposed to sound, and the HD600 is it. The A900 isn't. But, I will agree with you, to some extent, when it comes to the HD650. This latter phone is voiced rather differently from the HD600, and does sound colored to my ears.", "overall": 5.0, "summary": "The King", "unixReviewTime": 1146009600, "reviewTime": "04 26, 2006"}