{"reviewerID": "A2JMSJO1Z8C8ZQ", "asin": "B00004SY4H", "reviewerName": "Steve", "helpful": [2, 2], "reviewtext": "I tried the HD600s years ago and disliked them. To me, they sounded a bit dark and slow--so I returned them. The problem wasn't the HD600s, it was my pathetic amp. It was a cheap little NuForce USB amp. After some research over the years, I discovered that the HD600s will not reach their full potential until they are powered by a good amp. Since these are high impedance headphones, an OTL amp is best. And based on my research and experience, a tube OTL amp is even better.For those of you using the HD600s with a cheap Fiio or similar amp, please do yourself a favor and look into a good OTL tube amp and these headphones will amaze you. That's no exaggeration. If you own these headphones, you likely paid around $400 for them (new). If you spend around the same amount on your amp, you can get a decent OTL tube amp, and you will take your HD600s to an entirely new level of performance. With a good amp, you will laugh at the thought of the HD600s having a \"veil\" and lackluster treble performance. A good OTL tube amp makes these headphones sparkle. The beauty of having a tube amp is that you can change the tubes and tune the sound to get exactly what you want. Need deeper bass? Need smoother treble? Want more clarity? All of these can be done by changing tubes.Right now, I'm listening to my HD600s with a Schiit Bifrost DAC and a Woo Audio WA3 amp. With this combination, the HD600s sound amazing for both rock and classical. I also upgraded the cable to the HD650 cable.I've listened to the HD600s on a Beyerdynamic A1 amp, a Bottlehead Crack (without the Speedball upgrade), and my Woo Audio WA3.  The WA3 is by far the best of these three amps.  It is magic with the HD600s.  However, the Bottlehead Crack is also VERY good with the HD600s.  Frankly, I didn't particularly like the sound of the A1 amp; it seemed lifeless to me.  I prefer tube amps.", "overall": 5.0, "summary": "Do yourself a favor and get a good amp", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}