{"reviewerID": "A2BIQJIXLDSJSE", "asin": "B00004SY4H", "reviewerName": "Travis S.", "helpful": [12, 12], "reviewtext": "Wow, It's been over a year since I started my Hi-fi journey, quite hard to believe for me. Before I owned the HD600s, I had exclusively been listening to theBrainwavz B2 Dual Armature Noise-Isolating Earphones. I heard the HD600s for the first time in mid-July, and while I wasn't blown away at the first listen, I definitely knew I needed something other than the B2s, because the treble spike in the B2s was starting to get on my nerves. After doing a bit of research, I finally settled on the HD600s.Main equipment used in this review:iPod classic 6th gen 80gbObjective 2Fiio L3/L9 LOD cablesMusical preferences:Classic Rock (Beatles, Stones, Steely Dan, ELO, CCR, ect.)J-Pop/Anisong (ClariS,OPs and EDs for Anime)Indie (Mumford & Sons, Black Keys, Awolnation, Modest Mouse)Classical (Just starting out)Jazz (Just starting out)Metal (Mostly soft stuff like Metallica)Video Game/Anime/Visual Novel OSTsBuild Quality/Design:While I don't think the HD600s are built poorly they aren't the final word in build quality. The glossy plastic material used for most of the headband feels very sturdy and durable, but the black plastic surrounding the driver does not feel quite as good. That particular plastic looks cheaper, but still doesn't feel too bad. You won't break them with everyday use though.The overall design of the HD600s is very good to my eyes. Most of the pictures online make the blue marble finish seem way brighter than it actually was with my unit. While they don't scream durability or style, it shouldn't be enough for you to discount them entirely yet until you hear them yourself.The cable is detachable and is very good quality. I have not and will not use anything other than stock cables, as I believe they're a waste of money.Comfort:The HD600s are the most comfortable headphones I've ever worn. Although that doesn't say that much considering I haven't listened to too many cans. The clamping force is average to me, and the headband is very comfortable to me. Even though my ears and head are relatively large, I never experienced any discomfort issues. My ears also fit comfortably within the earpads. As a frame of reference, after listening to the Q701s for about an hour, the headband would start to hurt my head.The velour pads are also very sturdy and don't make your ears feel hot after extended use.Sound Quality:Well, this is the big one. So far in this review you'd wonder why anyone would ever spend $400 on a pair of headphones with average build quality and good comfort! Obviously the most important part to many of you is the sound. I will try to do my best to explain the sound, but keep in mind I haven't heard any other headphones in the price range, my closest frames of reference are $150 IEMs.-Bass:The bass of the HD600s has good texture as well as extension. While sub bass is lacking, mid bass is well controlled and provides a nice punch. Bass is definitely good, although it doesn't satisfy my basshead craving. Instead, it stays relatively contained and provides a nice warmth to the sound without being anywhere close to overpowering.-Mids:The mids are the focal point of the HD600s, and they are wonderful. All of the instruments sound completely natural. The timbre on every instrument sounds awesome. While with the B2s some instruments sounded a bit weird, and some not completely natural, the HD600 absolutely dominates everything I've heard to date. This is the selling point of the headphones for me. The other thing that sold me on the HD600s was the vocals. While they aren't heavily forward per se, they are very intimate and engaging compared to the IEMs I own. I will discuss vocals more in the soundstage section.-Treble:The treble of the HD600s embodies a love/hate relationship I have with them. The treble is somewhat recessed compared to the mids, although there are various spikes which I find add a small amount of sparkle to the sound and also make the cymbals crash with some authority. But these treble spikes are only a couple decibels, and so the HD600s will never hurt your ears with too much treble if you're sensitive to treble spikes like I am. Obviously, the advantage to having laid back treble is the reduced chance for fatigue after long listening sessions as I have noted above. However, the treble is also not as detailed as other headphones that have a more balanced treble.-Detail:When listening to the HD600s, I often struggle to find microdetails in recordings such as when the vocalist takes a breath, but instrument detail is fairly well done. While I find this somewhat annoying, I find myself not paying too much attention to the small details nowadays, and instead listening to the bigger picture.-Soundstage:The HD600s are obviously open backed, so the soundstage isn't bad. While I never got the feeling that the sound was too far away from my ears, I don't feel that the soundstage is closed in at all. The soundstage is better than any of the IEMs I have tried. I also feel that the center stage is very well done. Vocals and instruments that are supposed to be in the middle of the soundstage sound much more intimate and engaging than anything I have previously heard. Overall the soundstage is above average, but still not perfect.Musical Pairings:The HD600s sound awesome with just about any genre you throw at them, whether it be electronic or jazz. The only area the HD600s lack in is genres/songs with a lot of sub bass, which is relatively quiet.Closing Thoughts:These headphones are simply excellent any way you look at them. While the build quality might not meet military standards, they should last you a long time. Besides, you weren't planning on taking your open back HD600s into combat with you, were you?", "overall": 5.0, "summary": "Simply amazing sound quality for the money!", "unixReviewTime": 1353888000, "reviewTime": "11 26, 2012"}