{"reviewerID": "A2R6RA8FRBS608", "asin": "B00004SYKO", "reviewerName": "Matthew G. Sherwin", "helpful": [7, 7], "reviewtext": "Maxell manufactures excellent blank VHS tapes for all purpose general recording of audio-visual media. They may be \"standard grade\" quality; but don't be fooled. These do a really good job recording things; and they're not that expensive. As long as you have the right kind of equipment, these tapes record television programs off TV or they can be used to make copies of a non-copyright protected VHS tape. These tapes are very flexible in that they have up to a total of nine hours worth of blank recording space; and this is useful when recording longer or multiple television shows, for example. You get up to nine hours of recording time if you choose the longest recording time option on your VCR recorder/player.Of course, the best image quality will be at shorter recording times (the three hour recording time gives you the best picture, some say) but many people are still satisfied with the image they get using the longer recording time speeds.Maxell blank VCR tapes also give you long life out of these blank tapes; you can use these to record things over and over again. As long as you're careful with them, the material you record should look \"sharp\" and in focus, too. As you may know, to preserve important recordings, just push in the tab on the narrow spine of the tape and nobody will be able to accidentally record over something that is important to you. Change your mind? Just put some tape where the tab was and you should be able to record onto the tape again.Overall, Maxell makes a great choice when you want reliable, blank VHS tapes to record television shows or anything else that you can record onto a blank VCR tape. I have used this brand for some while now on one of my two televisions; and I cannot think of any major complaints. I highly recommend Maxell three to nine hour blank VCR tapes.", "overall": 5.0, "summary": "excellent VHS video tapes for recording...", "unixReviewTime": 1230422400, "reviewTime": "12 28, 2008"}