{"reviewerID": "AY62TN9VGKI2Z", "asin": "B00004SYNW", "reviewerName": "Mitchell Small", "helpful": [2, 5], "reviewtext": "This is my first disappointment from D-Link. I've come to rely on their  switches, hubs and NICs for my home network. I decided to add the DI-701  after I got a cable modem installed.Physical setup of the unit is a  snap, earning D-link one star. All parts attach as advertised in the  manuals with one caution: check the cable from your your cable modem to the  computer: despite what the manual said, my cable turned out to be a regular  patch cable, not a crossover cable. Installing the software was also very  simple and setting the configualtions on unit was trouble free, therby  earning the DI-701 its second star.The only problem encountered was a  major one: my system never saw the connection to the Internet through the  DI-701. All indications were the unit was functioning perfectly: I had  flashing lights indicating traffic between the Internet Modem and the  DI-701 and the DI-701 and my hub. I could ping the unit by IP address, but  not by name, even after adding appropriate entries to the hosts file. No  amount of fiddling with the PCs routing table helped either.After  spending four days and trying to connect it to my usual computer on the  network and three other computers in various configurations, I gave up and  requested a refund from Amazon. I've read other successful reviews, so  obviouly it works for some configurations, but not others. The one major  difference I noticed between my setup and the suggested directions is I  have my own domain and am using my own DHCP server and not allowing the  DI-701 to be the DHCP server. It may be that if you are using a peer  network, the DI-701 will integrate just fine. If you have a domain setup,  the DI-701 does not appear to be the correct solution.If it works for  you, it is a great solution. If you have a single computer, you should try  it. I am now going in search of other hardware firewall solutions to the  Internet security problem.", "overall": 2.0, "summary": "If It Works For You It's A Great Product", "unixReviewTime": 969321600, "reviewTime": "09 19, 2000"}