{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B00004SYVH", "reviewerName": "magellan", "helpful": [10, 10], "reviewtext": "This is one impressive device. I am a devoted Palm user and have owned several, but I have to admit I am very impressed with the power and  capabilities of this PDA.First, the screen. I own a color Palm IIIc, and  overall I am extremely happy with it. However, the screen resolution is  only 160 x 160, and looks a little grainy, but it's okay. By comparison,  the Casio is 240 x 360, and is just drop-dead gorgeous. No contest  there.My Palm IIIc has only 256 colors but the Casio is full 16-bit with  64k colors. By comparison, the Compaq iPAQ is only 12-bit. The HP is also  12-bit (not 16-bit as advertised--a little scandal there). Still, I would  kill to have 12-bit color on my IIIc. The Casio's screen is active-matrix  but the Jornada is passive-matrix, so it &quot;washes out&quot; when viewed  at an angle. Still, the screen brightness is very good. Not sure about the  iPAQ, but the Palm does have an active-matrix screen, and the screen  brightness is excellent. In fact, it will light up a whole room in the  dark. But the Casio's screen brightness is also excellent.I noticed one  thing about the new iPAQ's screen. Although it is noticeably brighter than  the Casio's, because it is backlit, it looks somewhat &quot;milky&quot;  under lower-light conditions. I work under somewhat low-light conditions  much of the time, so for me the Caso has an edge there. The iPAQ is better  for bright light conditions. Still, both units have excellent  screens.The Casio has 32 megs of RAM. The HP and Compaq have 16, and the  Palm has 8 megs. The just-released iPAQ 3600 ups this to 32, like the  Casio. However, you're going to need that 32 megs of RAM, since the  memory-hungry Windows CE apps will eat that up quickly. On my Palm, I have  over 100 apps and utilities in only about 7 megs of space, and still have  1.2 megs left over for other stuff.I haven't tried the MP3 capability  yet, but I read that a couple of songs will pretty much use up all the RAM.  Also, I understand downloading is slow, up to a half hour for a single  song. So I'm not sure how practical this feature is yet, but still, there  is no doubt multi-media is part of the future of Palm-top computing.The  battery life at 6 hours is acceptable. My Palm Vx will go for 40 hours or  about a month between charges--but this is a monochrome unit, so it's not a  fair comparison. However, my IIIc color unit, although Palm states 8-20  hours of battery life, really won't go more than about 2-3 hours on full  intensity in my experience. Most of the time I find I can run it at about  2/3 intensity and extend the life somewhat.The Casio at almost 10 ounces  is heavy compared to the Palms, which range from 4.4 at the low end with  the Vx to almost 7 ounces at the high end with the IIIc and the wireless  VII. You can carry the Palms your front pocket, but this is really not  practical with the Casio. Still, I don't mind the extra bulk given all the  additional power and capabilities. Iin my opinion, it is powerful enough to  substitute for a laptop on most trips.The final thing I wanted to  mention is the natural handwriting recognition is very nice. The Graffiti  system on the Palm takes some learning and getting used to. At this point I  am pretty expert with Graffiti, but I found it was nice to use my own  handwriting for once. There is a program for the Palm, called Jot, that  will allow you to use your normal handwriting. I've tried it and although  it's an excellent program, it's still not as good as the Window's CE  devices.Although I love my Palm, I have to say the Casio and similar  devices really look to be the future of Palm-top computing. The high-res  color screen, the multi-media capability, the digital voice recorder, the  ability to use Windows apps, the ability to use a fully graphical web  browser instead of a web-clipping app like on the Palm, and the ability to  add IBM's 340-meg Microdrive through the Type II slot are all powerful  features. None of these features are really available on the Palm.All in  all, this is a great PDA. Whether you're a died-in-the-wool Palm  afficianado or a recently converted Pocket PC user, you're looking at the  future of Palm-top computing. And in this device most of that future is  already here.", "overall": 5.0, "summary": "Pretty awesome", "unixReviewTime": 966729600, "reviewTime": "08 20, 2000"}