{"reviewerID": "AM4ZQJ0IORVWG", "asin": "B00004SYVH", "reviewerName": "Rob \"Revuman\"", "helpful": [111, 122], "reviewtext": "Note: This is actully a 4 1/2 starsThere are two types ofpeople, those who are organized and those who aren't.  For thosepeople who aren't, one of the best solutions, at least to get your days activities in order, is to buy a PDA.  But then there is the problem of which ones to choose.  Right now there are two that top my list: The Cassiopia E-115 and the Palm Vx (that review will be up shortly after this one).A Powerhouse in a rather small package: Sporting a very high 131 mhz processor and 32 Megs of ram, a fancy 16 bit screen as well as the new OS avidly named &quot;Pocket PC&quot;, the Cassiopia E-115 has almost gotten to that fine line that's one step above a PDA and one step below a laptop. Not only does it have programs built into it like outlook, notepad, word, and internet explorer pocket, but it also allows you to play MP3's and movie files on it in full 16-bit glory.  Also, unlike it's rival PDA, the palm Vx, it recognizes your style of writing, freeing you from having to learn the grafiti handwriting style programed in Palm Vx OS.  And switching back and forth between programs has been made even easier by the addition of a navagation wheel that is located on the front of the Cassiopia.  For instance, if you're using internet explorer pocket and you want to get back to word, simply press the button and the screen changes back to word (and Vice Versa).Trouble in Paridise: Like it's previous models, the 100 and the 105, the 115 has a rather short battery life of only 6-8 hours, which means that after a full days use it has to be recharged.  Also if you use it's modem (sold seperatly), mp3 player, or video player during the day, it will use up the energy in the battery even quicker.  Another problem...it's rather bulky and heavy, at around 10 to 12 oz with the battery, compared to the Palm Vx at only 4.5 oz with the battry.  Finally, the transfer rate between the Cassiopia and the computer, with the included cradle, is rather slow, at only around 28.8 kbps, which can make mp3 or large file transfer tedious and time consuming when compared to the transfer rate of the Palm Vx (although it can't play MP3s).Which one is for me?: The answer to the question of which one to buy comes down to what you really plan to do with it.  If you need a very powerful and easy to use portable device that can replace your large laptop, then you need the Cassiopia.  However, if you want a slim and stylish PDA that is very simple to use and that will organize your life rather than complicate it with more programs and systems than you need, Get the Palm Vx.  (my review on that one should be up soon...).The Highs: Great OS, beautiful visuals, powerhouse of a PDA...The Lows:...However it's a bit pricey at around 600 dollars, short battery life, relay between computer and PDA is slow, not a huge jump from the E-105 except for the extra 16-Megs and the OS.The Lowdown: Casio has been able to create a great line of PDA's that have a nice blending of the best of Palm with the best of a laptop.  However, it may not fit the likes of everyone who tries it.  And until the price comes down a bit, you might want to go with the E-105...  And [for its price] the Palm Vx still leads overall in the PDA department.Power: 10Organization: 8Style (ie. looks, weight, etc.): 7 1/2Extras: 9Visuals: 9Overall: (Not a Sum) 8Revuman: Too much of a good thing is never enough...peace!", "overall": 4.0, "summary": "A wonderful product, but maybe more than you wanted in a PDA", "unixReviewTime": 957052800, "reviewTime": "04 30, 2000"}