{"reviewerID": "A1GYR0Q9BRCNQ4", "asin": "B00004SYVH", "reviewerName": "slkx", "helpful": [5, 5], "reviewtext": "I am so glad I finally bought this device after so many months of scrutinising the competitors. I almost settled on the EM500 until a comparison of specs showed it to be virtually the same in look/effect but an inferior unit in grunt (only 16MB of internal RAM).EASE OF USE: The E115 is **very** easy to use -- a pulldown Start menu at the top left will get you in or out of any program instantly. The down side is there is no little 'x' at the top right to close your programs, and you can either live with them simply opening on top of each other, eventually slowing you down (or so I'm told), or you can make six (yes six) taps to get to the correct setting option to shut them down. While this sounds immensely annoying, I discovered it wasn't really and I just adapted, only going to close programs when I got to more than three open at once. And even with six programs running, I noted no discernable loss of speed. Further, the downloadable TaskPro Navigator program was written to fix this CE problem, for those who go nuts with more than one open program and want to close as they go.READIBILITY: The color is fabulous -- and books/documents/report reading, one of the two main reasons I bought this, are excellent on the eye, even after two or three hours of reading. Nice big screen -- no green/grey backgrounds the early Palms et al which make me drowsy and my eyes achey after twenty minutes. E115 comes with Microsoft Reader so you can also download books for even easier-on-the-eyes reading. I love Reader mode. Top marks.DESIGN FLAWS: There are five obvious design flaws: One, the AC adaptor plug is on the bottom, left side of the device and, when propped up in bed reading, you get it jabbing annoyingly into your chest. Sometimes I run it on batteries just to avoid the digging in power cord.Two, the power button on the left side of the device can be bumped easily. While it doesn't matter if you bump it off (it always restarts with exactly what you had on your screen when working -- even your music starts up exactly where you left off! BRILLIANT.) It does have a problem that when you are sliding the unit into the case provided, it can bump 'on' and without knowing it, it could be powered on inside the case, draining down the batteries. Thus I now put it in the case and try and sneek a peek to see if it is on. (not easy) And yes, I immediately ordered a different style of case ASAP to prevent this.Three:  Serial port connection? Not a flaw so much as a bad decision. God, you could grow old and grey waiting for this thing to download an MP3. Takes me an hour on average for a four minute song. I want a USB cable!! Still, when you think about it, once you've downloaded all of what you need, like your favorite songs, you're all set. Apart from the occasional report (which in contrast takes only a minute or so to download) you won't really spend your life downloading stuff onto it. And if you want more than a dozen songs, constantly updated, you probably should consider buying an MP3 player instead.Four: The record button is on the left of the unit -- handy if you want instant access I suppose, but given most people aren't journalists needing that quote in three seconds or less, a less accessible record button would be preferable. I am often bumping it and recording instantly a marvellous assortment of background sound without intending to. Nice waste of memory space that, if you're not careful. On the other hand, it is a pretty fabulous function in the first place and I like how you can easily name your sound bites and treat them like any other program.Five: When you listen to music, the three front buttons are instantly reconfigured and can be reprogrammed as a mini remote. Therefore the button you usually use to scroll down in a document may be, for example, programmed to fast forward. Now what if you wanted to read a document AND listen to music? Setting the button at NONE in the program still disables it from its non-music scroll mode. So you have to use your pen to scroll down the document, while listening to music, regardless of whether the buttons are allocated a new function in Windows Media mode. Another small aside -- sometimes the music pauses as you open and close new programs.INTERNET and EMAIL: Those wanting this unit for the Internet browsing ability when you buy optional extra the modem card, I do not recommend it. It's taken an eternity for me to configure this correctly to go online and it still won't let me access some sites, like hotmail and google, for no reason I can fathom. Some tell me it's just the nature of the Windows CE environment. If this is so -- and net browsing is why you bought it, it's a rip-off. Fortunately it wasn't what I needed it for, so I don't care so much. And it may just be (my) human error, so do more research. Meanwhile I still can't figure out how to configure it to send an Outlook email from it (despite reading every instruction I could find), although mercifully there are some sites I can surf to and send an email from there, so it's not an impossible problem. Meanwhile its synchronisation between PC and unit with Outlook Express is trouble free, but it won't synch with any other mail programs you might use on your PC like Eudora.PICTURES: Nice clear vivid images. You'll love how they come up.SOUND: Oh baby, here's where I go nuts. A built-in MP3 player that you don't HAVE to use earphones to use! You can just hit play and wow a roomful of your friends. It's excellent. Lovely quality and it compares well with the top-of-the-line Iomega hip-zip mp3 player I also own.CALENDAR/APPOINTMENTS/CONTACT: So easy to use and sort it was a godsend. And with the Today menu button you can always see at a glance what's up with your tasks, appointments and mails. Excellent. Contact list is brilliant and you can store multiple phone numbers and emails for the one person.SUMMARY:  The flaws sound worse than they are. This has proved to be a most savvy purchase. With 32mb inbuilt and endlessly expandable thanks to the type1 compact flash card slot on the back, you'll be set forever if you want. The AC adaptor means even if you kill the battery and can't find a new one, you can still use it till the day you die. The color is so amazing you have to see it to believe it; and the MP3 player is of a fine quality. For those who need it to read lots of stuff this is absolutely the right unit. Accept no substitutes. There's plenty of programs to download, too, and I doubt I'll ever tire of it. Unless I/they fix the internet problems, (depending on who is responsible) I wouldn't recommend it for this. But for every other function, I'd give it 10 out of 10.", "overall": 4.0, "summary": "Brilliant little unit", "unixReviewTime": 983145600, "reviewTime": "02 26, 2001"}