{"reviewerID": "A1AOK8IY4F9OKZ", "asin": "B00004T0RC", "reviewerName": "J. I. Doumet", "helpful": [15, 16], "reviewtext": "So I finally managed to get my hands on the iPaq pda. I was tempted to  write a completely un-objective review but after a day with the new gadget  I think I will do just the opposite. At a local cafe I sat down with a  frapuccino and the new package to see what was it all about. The packaging  is very nice, divided between the hardware from Compaq on one side and the  software bundle from Microsoft on the other. Compaq included a very nice  demo CD of the product, which pretty much goes through all the details of  setting up your iPaq (nice job.) They also included a booklet for the  accessories, service and a quick tips card.Microsoft's software bundle  was a little more on the mass-market side (you know, less details...). This  includes the active sync CD and the software license for Outlook 2000. The  CD also includes some extras like the Avantgo client (highly recommended)  and about 10 megs worth of e-Books (mostly classic novels.)My wife saw  the iPaq and went nuts, she just loved the look and the guy sitting next to  me at the bar was watching the entire process through the corner of his  eye. I think I was more interested in finding about what I can do with this  thing. I can tell you nothing much at the time 'cause when I tried to turn  it on I could not: There is a switch at the bottom that you have to move  before using it.The iPaq is very nice looking, but you will have to  get used to it, especially if you come from Palm land. It is not a pocket  pc, despite whoever says otherwise. It is just about the same size of the  Palm IIIc, and only wearable when you have a jacket on. The rest of the  time you will have to carry it on your hand or in a briefcase or purse.The quick access buttons are very small and on the iPaq I still don't get  what the arrow means, nor the italic Q isotype. The logos on the Calendar  button and Contact are very un-expressive and reminiscent of the Outlook  icons for both apps (not very good father figures.) The arrow button will  launch a Quick Launch manager with all your apps, (you have to create a  shortcut every time you install a program...absurd!) The Q button launches  a QMenu with some useful choices.The iPaq does not have a direct  button to the Programs window and this makes it difficult to navigate,  especially if you don't like the Compaq QStart utility like me. You have to  go through the Start menu pretty much for most of your choices, and it  still doesn't include all of them, so be prepared to do a few clicks to get  to a program you have not recently used. There are no direct buttons to the  volume control nor to the brightness utility; and there are only few quick  access buttons so it pretty much rules out reprogramming them. (I guess  Compaq engineers forgot these are consumer products!).Finally, I guess  most of the bulk of the software I want is on a Pocket Pc Pack that you get  if you register via the Pocketpc.com website. The thing is they are going  to ship mine in THREE WEEKS. Don't you think it should be included in the  package? I guess Microsoft wants to know who is buying these things, since  they are the deliverers.To conclude, the quick access buttons need  some revision (not to mention they should put some more), the screen is  simply a Palm killer, kudos for the silver Vader, gothic look, and the  software still needs some more brain storming. `Simple is better' hasn't  gotten Palm to 7 million fellows for nothing. If you have a Palm V, you  will definitively want to carry that one on you, and the other on your  pocket (your briefcase pocket that is.)", "overall": 4.0, "summary": "Finally,", "unixReviewTime": 966729600, "reviewTime": "08 20, 2000"}