{"reviewerID": "A19VISO9EHD1OM", "asin": "B00004T1XE", "reviewerName": "JNieporte", "helpful": [1, 2], "reviewtext": "The good old $10 transistor radio. That's what you get here. For that, it's nice.The Panasonic RF-P50 is 4-5/8\" tall, 2-3/4\" wide, and 1-1/8\" thick. Fits in a jacket or jeans pocket. Too tall for a T-shirt pocket. It's contoured nicely, with no sharp corners. It runs on two AA batteries, and I can get about 26 hours of constant use out of Rayovac alkalines.Assuming you're looking at the face of the radio...The left side has the On / Off dial, which is also the Volume dial. Under that is the audio jack, which is monoaural only. This means that with headphones or earbuds, you'll only get sound out the left ear. If you want sound out of both ears, buy a 3.5mm Female Mono to 3.5mm Male Stero Adapter for three dollars. Right above the volume dial is the wrist strap. It's a simply nylon cord, about 6\" long. In the rear of the left side is the antenna. It folds out, but doesn't swivel. It extends to 22\" long.The right side has the Tuning dial, underneath that, the AM / FM band selector switch. The back of the radio has the battery compartment. The speaker built into the P50 is 2-1/4\" in diameter and projects sound from the front. It's not too tinny, and is decent for the price. The product description lists two LEDs; one for signal strength and one for battery life. I can't find the battery life LED. It's nowhere on the radio, and nothing pops up when the radio is in use to indicate battery life. The signal strength LED (marked TUNING on the front) does work, but is a little deceptive: it lights up when you have a strong signal, but it gives no indication of the clarity of that signal. So you could get a perfectly good signal, but it's not clear enough to make anything out.The FM on this radio is acceptable, but the AM is just garbage. In the basement, on the porch, in the backyard, or in the car all get the same abysmal results on AM. The AM band maxes out at 1660KHz. The tuning dial is a little stiff, making it easy to skip past the channel you want.As a whole, the P50 is okay. I like the size and everything, except the AM is so bad it brings the rest of the good features down. For $10, the Sony ICF-S10 MK2 or Kaito KA200 are better.", "overall": 3.0, "summary": "Inexpensive, But Bad AM", "unixReviewTime": 1370563200, "reviewTime": "06 7, 2013"}