{"reviewerID": "A1IICUMRPXC4AL", "asin": "B00004T1XE", "reviewerName": "K. Barker", "helpful": [269, 272], "reviewtext": "I recently purchased the Panasonic RF-P50 because I was in need of a portable radio that has a built in speaker.  I have discovered that this is hard to come by in a brick and mortar store.  So I did a little search on Amazon.com and came across this product.I also own its direct competitor - the Sony ICF-S10MK2.The Panasonic radio is great because I can carry it around anywhere and always have music with me where ever I go.  I especially like to use it in hotel rooms when I go on trips, but it's also nice to have in order to listen to music in all of the rooms of my apartment.The Panasonic RF-P50 has a telescoping antenna which can be swiveled back and forth, and on/off/volume switch, band selector, and tuning dial.  The speaker measures at 2 and a half inches.I live in a basement apartment, so it is not always easy to get a fantastic signal.  I have discovered that this radio pulls in all the major FM stations quite easily - although sometimes I have to fiddle with the tuning and antenna to get a good reception.The few local AM stations can be pulled in as well.The appearance of this radio is quite nice.  It appears that Panasonic has taken some time into building a radio that is pleasing to the eye.  It's a pocket radio with a nice contemporary look.  The radio frequencies are listed on the unit quite clearly - much bigger than what I've seen on similar units from other companies.  Also the tuning light, which lets you know when you've locked on to a strong station just right, is bright and easy to see.This Panasonic pocket radio comes with a wrist strap.  This is one of my only gripes.  I wish it came with both a wrist strap and a belt clip.  Another nice feature that would make this radio better is if one could remove both the wrist strap and belt clip.How does it sound?  Keep in mind, it's a pocket radio, you're not going to get huge sound as you would with a stereo system.  However, for its tiny size, the speaker sounds surprisingly good.  The sound quality sounds clear, but not too tinny.  I've ehard models with much harsher sound.  Also don't expect glass shattering bass, you won't find it here.  But as I said, for its size, it has a pleasant sound.In comparing this model to the Sony competitor, I notice a few things.1.  I like the appearance of the Panasonic model over the Sony model.  I just feel that the Panasonic model looks nicer.2.  In terms of when I'm holding both radios in my hands, the Sony model seems to have a better build quality (harder plastic, less flimsy feel to the radio).  However, I've had the Panasonic model for a while and have had no issues with its build quality.  Of course, I'm very careful with my electronics, I don't abuse them.3.  Both models seem about equal in terms of receiving FM signal.  Both models pull in the local stations quite easily.  The Sony model seems to have a slight advantage in pulling in the slightly weaker stations but this could be due in part to the fact that its antenna is longer.4.  AM reception on the Sony is much better than the Panasonic.  It seems to be able to pull in the stations with more clarity.  But again, the Panasonic radio can pull in the strong local AM stations just fine.5.  To my ears, both of these models sound exactly the same.  Sound quality of music/talk shows sound the same with both units.NOTE:  People should note that the headphone jack on both of these models are in mono only.  This means that when you plug stereo headphones in either model, you'll only get sound in one side of the headphones.  Please bear in mind that this does not mean the radio is broken.  These units were designed this way.The Bottom Line:  I definitely consider the Panasonic RF-P50 a steal at ten bucks.  It's a small sized radio that you can carry with you anywhere to listen to music, or get the latest news.  Both the Sony and Panasonic models are what I consider to be excellent deals.  I prefer the Panasonic over the Sony model though.For most cases I'd recommend the Panasonic model.  But if you're looking for slightly better build quality and better AM reception, then I'd recommend the Sony model.  Of course get the Sony model if you prefer its appearance over the Panasonic model.", "overall": 4.0, "summary": "A fantastic radio at a great price!", "unixReviewTime": 1203120000, "reviewTime": "02 16, 2008"}