{"reviewerID": "A3MRKZ1RR1G9K3", "asin": "B00004T1XE", "reviewerName": "Matthew", "helpful": [2, 2], "reviewtext": "UPDATE: 05/24/12Okay so after trying several other radios (Kaito K200, C.Crane Solar Observer) I feel like Panasonic did not really step up with this product as much as it could have:1) The reception on this product is not as good as it could have been. If you want something with a better reception get a portable Sony.2) The red ban on the dial is tilted sideways. I don't know if it is only my product but it gets pretty annoying after while.Otherwise if you care about a decent FM radio and okay AM radio then this a product for you. However given that SONY ICF-S10 has much better reception and is cheaper, then there is no reason to go with Panasonic. Unless of course you like the looks, in that case Panasonic might be the winner.--------------------------------------------------------------------------------So my first impression was - this radio looks quite nice! I like the size to sound quality compromise. The speaker is entire width of the radio. The size of the radio is large enough to give good sound and small enough to fit into back pocket and use it outside. The FM reception is good enough for the radio to be used with antenna retracted. The antenna is also screwed in so if you do break it, you can simply attack a copper wire for replacement. And you won't be shipping the radio under warranty because shipping is more expansive than the radio itself.As for AM reception it is also very good, I pick up tons of stations in NYC and most of them clearly. There is a little red diode that indicates when you have maximum signal strength, it's quite useful. The battery life, is like most small radios amazing.Quality control seems good. There is no loose parts, no dents and no scratches. The only downside is the red station indicator. It's not mounter perpendicular to the analog dial. This is quite annoying because whenever I change stations it flops to the right a little bit. Im not sure if this is quality control issue or by design there is only one string pulling it left or right.", "overall": 3.0, "summary": "well constructed radio with great reception", "unixReviewTime": 1336867200, "reviewTime": "05 13, 2012"}