{"reviewerID": "AI0BCEWRE04G0", "asin": "B00004T1XE", "reviewerName": "Stoney", "helpful": [19, 20], "reviewtext": "SUMMARYIt is a terrific \"transistor\" radio.  Turn it on, dial in your station, enjoy memories of a simpler time---particularly these days when you can't set the time on a typical wristwatch without the manual which you lost three years ago.  On/off/volume with plenty of volume if you want it.  Great manual tuning---the radio won't \"forget\" your station when you change batteries. There is even a little red diode which helps tuning in exactly on your station.  Two AA batteries seem to last forever.TUNING AND RECEPTIONThe manual tuning is straightforward and easy, albeit sometimes it is hard to exactly tune in a weak station near a strong one, in part because a slight touch of the dial changes the frequency.  There are no presets---so, if you listen to several stations, write the frequences down on a label and stick it to the radio (and protect the label with clear tape).  Just dial in the station you want.  Reception is usually very good, even without the telescoping antenna (just leave it collapsed), but it is very much appreciated when you need it.ON/OFF VOLUMEOne of the particularly good features of the Panasonic is plenty of volume.  You can place the radio anywhere in the room.  I consider it to be a \"shop and patio\" radio.SOUND QUALITYThe sound qualtiy is good, not great.  This is a radio for listening to news, talk radio, or ball games, not classical music.  Music is acceptable, particularly at modest volume. If you want to listen to music, buy an MP3 player with a built-in FM reciever and a good set of headphones---or a fancy Bose, etc for 20 times the price.BATTERIESThe Panasonic uses two AA batteries which last forever.  Honest---at least a month using the radio several hours per day---even with rechargeables.  Nevertheless, having a set of 4 rechargeables means you are never out of batteries.Sanyo Eneloop 4 Pack AA NiMH Pre-Charged Rechargable Batteries w/ ChargerUSING HEADPHONESThe headphone (\"earphone\" in transistor days) is mono, and no earphone is included mono or otherwise.  Which means you have to plug in your (stereo) headphones---but then, you only get sound to your left ear, nothing to your right ear.  Why?  I've had mono voice recorders for years, which nevertheless had the proper socket for stereo headphones (you got mono, but to both ears, which was fine).  If you want an AM radio to use with headphones, I suggest a Coby CX50---which is also mono, but to both ears.Coby CX50 Compact AM/FM Radio with Digital Display, silverCARRYING IT AROUNDThe Panasonic is nicely pocket-sized and slides easily in and out of shirt pockets.  It's a bit large for pants pockets.  The strap is rather useless, and can't be removed.  There is no easy way to carry it on your belt.  I've placed a strip of self-adheasive velco tape on the back, and mating velcro tape the several places I use it (e.g., in my shop and on my hammock)Velcro Sticky-Back Hook & Loop Fastener Roll In Dispenser Box, 3/4in X 15 Ft., Black (VEK90081)OTHER FUNCIONSThere are no other functions.  If you want travel--alarm clock--radio, I again suggest a Coby CX50Coby CX50 Compact AM/FM Radio with Digital Display, silverI happily use both radios.", "overall": 4.0, "summary": "Just a bit too retro", "unixReviewTime": 1167609600, "reviewTime": "01 1, 2007"}