{"reviewerID": "A27N36BPXB2EKB", "asin": "B00004T8R2", "reviewerName": "80sGuy", "helpful": [2, 4], "reviewtext": "I bought a set of these for someone that has problems wearing earbuds (IEM), as well as staying away from my JVC-HAFX67B. These phones are perfect for the pc or laptop if you're looking for a 'quick' and simple device to catch news-feeds or watching tutorial videos. Please note that these are not noise-canceling headphones, but for the price with shipping, you really can't go wrong and they are pretty comfortable around your ears!About the phones:Works well with computers but I wouldn't recommend tagging it along with your portable music device -- such as an iPod. The reason being is that they do not do a very good job of suppressing or isolating sounds, which means you can still hear ambient noise and people sitting around you can also hear them. The earcups are designed at an angle facing inwards from the front (shaping your ears) and out towards the rear, this is good for people with flappy ears, but not for me and probably the majority. To get the full sound I'd have to press and hold them in flat, the XBS Bass effect works well but all other frequencies quickly becomes muddled, and surely one can't be doing this all along while wearing it.In retrospect, sound quality is decent, from a scale of 1 to 10 (being best) I'd say 6. You can hear the Bass but you won't feel it, it is there, only not as rich and tight. The Trebles could be better if it weren't for the Mids being a bit too high which resulted to somewhat of an overall 'flat' sounding device.Back to the design as I mentioned before, the angled-cup design could be a small problem to some people. It is certainly for me because this also reduces the overall volume decibel compared to my uber-rich soundingJVC HAFX67Bwhich at 25% volume level, I get a fairly high sound decibel as apposed to 50% level with the Panasonic. Also, I didn't like the angle plug, this could be a plus or minus to some. The reason: when it's plugged in to my Nano next to its charging socket, the angle-plug prohibits me to lay the Nano down on a flat surface, or I'd have to swivel the plug opposite but it'll stick up in the air (see my photos). In case you're asking, it CAN'T be swiveled to the sides because it is very tight with the charger plugged in, if I try, it WILL bend and damage the socket and phone jack plugs!Pros:Price, price and price (under 5 bucks)!Free shippingDecent soundBass (okay, but not rich or tight)Cons:Ear cup designAngled Plug (may or my not be for others)Flat soundingSound escapes even at decent volume levels", "overall": 3.0, "summary": "Good and decent, but not for everything", "unixReviewTime": 1290729600, "reviewTime": "11 26, 2010"}