{"reviewerID": "A3DU46KRC2JFKH", "asin": "B00004T8R2", "reviewerName": "Charles Dickens", "helpful": [1, 1], "reviewtext": "I just have to respond to a review a little further down that says these headphones are almost identical in sound quality to the legendary Koss PortaPro, which is 6 times more expensive. I got these headphones as a temporary replacement for my PortaPro as I send it out to be replaced by warranty. The headphone wire has lost some connection and I have to wiggle it in order to get sound out of the left ear (my fault, I was always a little rough in pulling it out by the wire and not the plug. Now I know better). Just to see if this reviewer was right in his comparison of these two headphones, I listened with each pair of headphones one after the other (out of tradition I always use \"Here, There and Everywhere\" by The Beatles, remastered, lossless version, to test audio). Now, I'm not a big audiophile. I'm not picky at all. But in comparing these two headphones, the PortaPro is RIDICULOUSLY better than this Panasonic. The sound is so much richer. The Panasonic sounds downright thin and weak compared to it. Again, I'm not being picky or imagining things like a wine taster, the sound is LITERALLY much weaker and thinner. I was LITERALLY hearing much more going on in the background of the song. I even ramped the volume up just to see if that would help, but it didn't. The richness just wasn't there. These are very poor compared to the PortaPro, which is the best pair of headphones I've ever used (the quality of a big, fat pair of headphones with the portability of a small pair).However, for the price, this is an absolute steal. As long as you don't compare it to the sound from a better pair of headphones, you can't go wrong with keeping a pair of these babies around as a back-up. Actually, these could be the only headphones you own. The sound is as good as you need, really. You'll fully enjoy any music on these. I've just been spoilt by a better set of headphones.", "overall": 5.0, "summary": "Average sound, but phenomenal price", "unixReviewTime": 1301529600, "reviewTime": "03 31, 2011"}