{"reviewerID": "A3ENO7ZDMZ62TK", "asin": "B00004T8R2", "reviewerName": "David N. \"Dark Eskimo\"", "helpful": [0, 0], "reviewtext": "I am very impressed with these headphones for many reasons and I will go ahead and generalize my reviewfor the common consumer. I'm going to be using a rating system of 1 (lowest) and 5 being the highest. Thereview will discuss comfort, durability, burn-in (before and after), & sound.Comfort: Rating 4As a person who wears glasses and having a big sized head, these are very comfortable for the price. Myonly concern is that I have long hair and my hair tends to get tangled between the clip selections/settings.I use mine on \"click number/setting\" four and this gives you an idea of how above average my head is. If youhave short hair and a small head then these are perfect you, but once you run into the category of havingglasses and an above average head with long hair then problems may appear that negates the comfort of theseheadphones.Durability: Rating 3Opening the package, I can already feel the cheap plastic of these headphones. I had to be VERY careful whenI was opening the product to prevent a break in the chord or the cheap plastic parts. After the puzzleof removing them from the packaging and two months of use I am impressed as to how long they have held.Granted, I use them only on my laptop during the evening or at night before I go to sleep, these have heldvery well. I do not use them for exercising, nor do I use them for walking around the house or outside.I have been strictly using them while sitting down in bed or at my home office.Burn-in:This has no particular rating because sound is all based on personal exposure and taste. As mentioned, I havebeen using these headphones for two months, which has resulted in a good amount of use. The sound remains thesame, in my opinion. No difference in my experience with out of box stock use to burn in use.Sound: Rating 3I own several headphones and I will post a few headphones in my arsenal at the end of the review, but firstlet's get to the main event of these headphones. Sound.... I was impressed with these headphones when I pluggedthem into my hacked 2nd generation ipod using Rockbox and playing FLAC files. I will say for 4 dollars, the soundis SLIGHTLY above average, I will not say great or amazing...it's manageable.Treble: The highs are bright, but it lacks clarity. You can hear the treble in the music, but that's just it...too much treble without clarity is pointless. Yes, the treble and the mids are there, BUT where are the details.It's great to hear a guitar distorted for rock, grunge, or pop/rock; however, the details are just not thereor more like forgotten. Example, I was listening to No Doubt's \"Don't Speak\" and the whole song soundedgreat rhythmically speaking, yet pay attention to the lead...you can hear it, but it's not as balanced withthe rest of the song. It seems that if the headphones start to reach a peak for the lead guitar the soundbecomes strained.Bass: For $5.00 or less, I cannot find another pair of headphones that will give you the bass that theseheadphones will give to you. I am satisfied with the bass and have yet to find another pair of headphonesthat can carry this much bass for this price. If I had to rate the bass, I'd give it a 4 rating largelydue to the punch it packs for it's price range.My headphone arsenal:Koss Porta ProsSony MDR-V6Sony MDR-EX310LPSony XBA-1Klipsch S4Panasonic RP-HT21Koss KSC75Favorite Headphones: Toss-UpKoss Porta-Pro or Sony MDR-EX310LPIt all depends on my mood of whether I feel like having an in ear headphone or over the ear. I favor bothvery much the same in terms of sound, comfort, and durability.", "overall": 4.0, "summary": "A general review for the common consumer.", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}