{"reviewerID": "A1B58TDQ0XQGU6", "asin": "B00004T8R2", "reviewerName": "J.C.", "helpful": [0, 1], "reviewtext": "I gave these a 3 star rating but only because of the low price, otherwise a 1 or 2.Pros:Lightweight (but what headphones in this class aren't?)Cheap ( but what &#34; ... )Top band and slider rails appear to be made of HDPE plastic which is more flexible, won't become as brittle over time to reduce # of areas likely to break, and yet the top band would be even more durable made of spring metal and then it could hold an adjustment for optimal tension to suit your head sizeFair amount of bass for the cup size and price, not especially boomy, not out of control bass trying to make up for the shortcomings of a small driver and thin/light low volume plastic cupsFair cord length for portable use, ought to be 1' shorter for that but the extra 1' might help if your source is in a bag rather than a pocket nearer your head.90' plug doesn't stick up as far on portable players so they seem less bulky and there's less stress to the headphone jackFairly conservative design, no silly colors or shapes for niche artistic styling that not everyone would like, rather than the purpose of headphones.  They don't look &#34;as&#34; cheap as some in the same price class.Foam cushions are a little higher density than some, letting them sit closer to your ears.You won't care much if you break them or if they are stolen, except then you have no cans till you find a replacement.Cons:Lightweight - They have that empty tin can sound accentuating upper midrange, and they could have put a bit more plastic into the pieces that hold the cups only the adjustment sliders for more durabilityNo strain relief on the wires where they exit the cups.  If you coil your cord up for storage during portable use, you will find this to be one of the early failure modes.Clunky size adjustment, the notches in the HDPE rails are large and HDPE doesn't mold into distinct notches as well as other plasticsPre-molded angle on cups seems a little large compared to many cans, if your ears don't stick out a lot you may find they don't sit as flush against your ears as many cans despite the slight amount of swivel present, which results in loss of hearing much of the lower midrange and bassWhile the bass is fairly controlled for this price,  their marketing dept. fails with the feature &#34;XBS port&#34; because the bass is fairly poor relative to almost any (even slightly) larger cupped cans.  Small, light and portable is good but if you can accept an ounce of weight and a few millimeters size increase there are huge bass improvements to be had on cans with only slightly larger cups, and yet the price on those goes up some too.Although they are inexpensive, it would only cost a few cents more to make them more durable and improve the sound quality.  This seems like a false economy to me, my body and gear weigh dozens of pounds so why is shaving fractions of an ounce off their weight so important?  It isn't, this is just about saving a few cents in manufacturing cost at the expense of the aforementioned details.Overall:It's tempting to pick a product based on the lower price, but often you only get what you pay for.  Yes you could pay the same for inferior cans but don't let some of the more positive reviews fool you, these don't sound good at all relative to cans costly only a few dollar more.  They sound only slightly better than any $2 generic cans you can find anywhere.Despite all the pros I listed, they just don't meet the core purpose of providing good audio.  It is distracting how terrible they sound.  To be fair I would write the same about any $5 cans I've ever heard but on most I didn't see so many positive reviews that misled me into hoping these were different when they aren't.For a reference point, many consider me an audiophile.  My standards seem to be higher than average, but I'm not an elite snob about certain makes and models.  I've owned many a pair of cans and build some of my own audio gear and modify the rest.  Even so I am not trying to compare these against $40 cans, let alone more costly pairs.  They just don't sound good enough to use even if they were free, unless you're only listening to audible books or similar voice.  I would have returned them except that they are so inexpensive that it wasn't worth the bother.", "overall": 3.0, "summary": "Only Because Of The Price", "unixReviewTime": 1361232000, "reviewTime": "02 19, 2013"}