{"reviewerID": "AZJFWALLYUEUB", "asin": "B00004T8R2", "reviewerName": "J. Helgeson", "helpful": [2, 2], "reviewtext": "Yeah, I said it.  These sound an awful lot like the Koss PortaPro, for about a sixth of the price (and the PortaPro is cheap as it is!).  I've A-B'ed them, and the bass is *almost* on par.  Seriously.  The big difference in sound signature lies in the mids.  I think these have more pronounced mids.  They seem a smidge more fatiguing to listen to in general, but nowhere near enough to be concerned.Fit might be objectionable for some--they're super-light, but the drivers are actually tilted *backward* slightly, such that the clamping force of the phones presses only against the area in *front* of your ear--not really *on* the ear itself.  The drivers definitely rest over your ear, but the \"on-ear\" pressure is negligible.  The only pressure at all is closer to your temples.  Personally, I love this design, because it shifts any pressure to a nice, flat bony area (at least on my head), rather than into my ear cartilage.  But I could see some finding the fit to be strange.So no, they don't fold flat like the Coby CV185, or clip into a cool ball like a PortaPro, and no, they're not quite as comfortable as a KTX1Pro, but then, what is?  (I have a very tall head, and I think the KTX1s are just about the most comfortable set of cans under $100, but that's just me.)  These cans' back-to-basics design is outright refreshing.  So, of the three (the Coby, the PortaPro, and the KTX1Pro), I have to give these the nod for street wear.Oh, and did ya notice that they're RIDICULOUSLY cheap?  For the price of a swanky cup of coffee, there's not much to lose.  If you really have money to burn, try the RP-HT46(?), which is the same as these, only there's a volume control (I think), and they FOLD!  But if you're just skatin' on the seriously cheap, yeah, these are them.", "overall": 5.0, "summary": "A (really) poor man's PortaPro", "unixReviewTime": 1299974400, "reviewTime": "03 13, 2011"}