{"reviewerID": "A290RDSYTFRU7J", "asin": "B00004T8R2", "reviewerName": "K. Watanabe", "helpful": [1, 1], "reviewtext": "These ultra-cheap headphones have no business sounding as good as they do.  Very light (because it's so \"plasticky\") and comfortable, for this type of \"old-school\" design.  Reminds me of the ol' Walkman days...Sound is remarkably good to my ears.  At very high volume, the high end gets a bit shrill and the low end gets a bit muddy, but that's beyond my normal comfort level.  At my usual preferred listening volume, the sound is quite enjoyable for all types of music that I listen to.The cord is about 50% longer than most \"earbuds\"; I can use it comfortably with my desktop Mac without needing an extension.  The plastic \"handle\" around the plug is larger (wider) than it needs to be, which could be a problem.  For example, on my iPod nano, when something is connected to the dock connector (like the sensor for the Nike Sports Kit), the plug does not fit into the adjacent headphones jack.  I'm not going to use these headphones for running, so no big deal, but I can't see any advantage in having such a \"fat\" plug connector.Because these headphones have larger speakers, and they sit on top of your ears, there is sound \"leakage.\"  If you play your music loudly enough in a quiet environment, people near you will be able to hear what you are listening to.  So these headphones may not work well in some places that are meant to be quiet.  Also, it takes a higher volume setting (on the player) to achieve the same \"perceived\" loudness (compared to typical small \"in ear\" headphones).  If you like your music really loud, the desired volume may exceed the maximum setting on the player.  Again, this is not a problem for me, but I noticed that I could set my iPod nano to play through these headphones at highest volume setting without \"making my ears bleed.\"I gave it five stars taking into account the price I paid.  Not taking its extreme value into account, I would rate it four stars.", "overall": 5.0, "summary": "The price is almost free...!", "unixReviewTime": 1356825600, "reviewTime": "12 30, 2012"}