{"reviewerID": "A1FVN80HHHR3RA", "asin": "B00004T8R2", "reviewerName": "P. Killion", "helpful": [10, 11], "reviewtext": "So I've recently received my Panasonic RP-HT21 Headphones, and I've gotta say, I'm impressed! Cheap headphones have come a long way, but these really do take the cake. I've had dozens of headphones in my life, and working in the video production field, I've used some really pricey ones (don't get me wrong, there's a big difference between this type of headphone and high-quality monitor headphones).These are the perfect music/leisure headphones. They have great sound, but the surprising part is how much bass these things put out! It's like having a sub right next to your ear! However, I will point out, these things do put out a little too much bass to be accurate right off the bat, but an EQ can fix that if you prefer a more \"harmonious\" sound; if you like your bass, then you won't have to do a thing. The overall sound output is pretty decent: lows, mids, highs, they're all there. Now, these are cheap so accuracy is a different story (these are slightly muddy compared to more expensive headphones), but like I said, these are leisure headphones, which work excellent for listening to rock/pop/rap, etc. Unless you plan on dishing out $40+, you won't find anything better, and those still might not be great for music listening, since you kinda want that accentuated bass/booming tone for most music (or at least I do).So, these are cheap headphones, don't expect them to last forever, but if taken care of, there's nothing mechanically flawed in the pair. This is the old-school defacto design, and it kinda makes me laugh to see we've moved away from this design for buds (which, at least they have improved, but still don't compare). Since these aren't buds or noise canceling, others will be able to hear your music at higher volumes, but it really isn't that bad, since these have \"ports\" I figured it might be louder externally than it actually is.I believe another reviewer pointed this out already, but the title is misleading, the port is merely referring to a literal \"port\" or hole, so that bass can be amplified in the compact design; there aren't like extra plugs or anything wacky on these headphones, just the normal 3.5mm headphones jack. The packaging doesn't even have any mention of the port, which I'm assuming they removed due to confusion; I only knew what XBS was because they used to have it slapped on their products. Also, the cord is 4.5ft in case you wanted to know, I couldn't find that anywhere on Amazon, had to go to another site to find that out; that length is perfect for me, since they are plugged into the front audio jack on a PC sitting on the floor. My previous iPod buds were 3ft and I had to tilt my head to use them.So, all in all, you should buy these. I'm glad I bought them, may buy half a dozen more to be honest, I really enjoy these little headphones!", "overall": 5.0, "summary": "These things ROCK!!!", "unixReviewTime": 1294358400, "reviewTime": "01 7, 2011"}