{"reviewerID": "A23W4SGMFMSE5N", "asin": "B00004T8R2", "reviewerName": "Verminator \"VerMin\"", "helpful": [0, 2], "reviewtext": "I searched for \"folding headphones\" in electronics, relevance.  These were NUMBER TWO in the resultsPanasonic RP-HT21 Lightweight Headphones with XBS PortSurprise!!!  If they are folded,  most likely they are BROKEN.  Mine do not fold.  That was over 90% of what I needed these headphones for.  I needed to be able to slip a small pair of headphones that fit on the head & over the ear inside of my tote bag for use with my iPod & iPhone.I pretty much have everything in the tote, sans the kitchen sink (at this time) and I did need something small to fit inside of the tote.Sooooo  for the price I paid, less than a full Lincoln, I will be keep them.It would cost more to return the headphones in postage than to keep them.Maybe I can give them away to someone that needs a pair in a hurry & does not have time to stop at a store or just needs a pair of headphones!Others have given these headphones great ratings on sound.  I cannot give a review about the sound................This review is not about the sound...........This is about a pair of headphones that were purported to have a feature that they obviously do not have........I will say that they feel very lightweight in the packaging, look comfortable to wear.The style & color are nice.  Their appearance is attractive, & fairly up to date.These headphones are not a pair I would be ashamed to be seen wearing in public!They are nice looking!So if you are looking for a nice, fairly stylish, comfortable pair of earphones to buy for an *EXCEPTIONALLY* low price I can recommend these.Fellow reviewers, almost 84% gave them either a four **** or five ***** stars so they have a high approval rate by other consumers.My main reasoning for writing the review was to spare another person from buying these headphones under the [mistaken] impression that they will fold down.If that is an important feature in your purchase choice, look for another pair.I want to save someone the time and in the current economy *the expense* of a purchase that will not meet those needs.Amazon, as always in my experience, service & speed of shipping & packaging gets five stars for their end of the purchase / transaction.Happy St Patrick's Day to all!", "overall": 3.0, "summary": "If your search was \"folding headphones\" in electronics, relevance, keep looking!  These DO NOT FOLD!", "unixReviewTime": 1331856000, "reviewTime": "03 16, 2012"}