{"reviewerID": "A1N2D7LLBAY25B", "asin": "B00004TBBA", "reviewerName": "Black Cat de La Bear \"see that dark shape o'r...", "helpful": [0, 0], "reviewtext": "1/09/01 If you own a socket 7 motherboard and only have a 1.0 compliant slot(although it says 1.1) this will be the only option you have of the higher-end video cards. However, 4 sample anti-aliasing is the only real advantage of this card to your older 3D cards. As far as frame rates, my Tnt2(non ultra) performs almost as well in Ultima Ascension but has screen tearing and other ugliness where as the voodoo 5 allows me to use lower res and 4x anti-alias and looks about 5 times better. Turn down the clips and you've got a good game. As for Quake III their is choppiness and sound stuttering in heavy fights(like Voyager Elite which uses Quake III engine) Baldur's Gate II does not work any better than any other card I've chosen, but that's probably my low-end AMD K6/2 400 mhz and lowsy 1.0 compliance only AGP mother. All-in all if you got a raw deal of a mother like I did, get this card, it'll solve your problems, you can play your old 3d fx and newer titles of 32 bit as well. It doesn't work on Redguard though.Review UPDATE 7/13/01. this is writen after the discontinuation, but hopefully Voodoo 5 will be back on the market. still 3 stars***I have put this thing to work.  It heats up even with the twin fans.  It is noisy and it should only be used in ATX style cases.  If you are planning on buying a new system, don't even bother with this thing, get a Geforce3, it's expensive but its well worth it. If, however you are stuck with a 1.0 AGP(low voltage) this is the only card in the known Universe that will work on your system.  Their are no TNT Ultra's no Geforce 1's(except that one on this site that is over priced) Last year's computer upgrades have been discontinued and abolished!(makes me sick)  An AT case will need extra cooling(odviously) I have a slot exhaust fan and a frontal mini case fan on order(hopefully) when I recieve these things my case will be able to use the Voodoo and it will work for more than two frigg'n hours before blacking out.  My baby AT case is unusually large(17'' long) so it might not work in yours, measure it.  Like I said with the Geforce DDR-DVI  DO NOT OVERCLOCK the Voodoo 5500. It is hot.  It is dangerous.  And besides that it is already fast.  In my opinion it is already overclocked and runs Diablo II satisfactorially on a low-end system.  Ultima also runs quite well at this time.  As for Elite Force(Quake III) heck, my Radeon 64 GTS cannot run that game with my PC either. Again you need a 2.0 AGP(higher voltage to video card). In the case of running a Quake III engine, or a BGII infinity engine well.  Your 1.0 should work with the Voodoo on other games.", "overall": 3.0, "summary": "A fair card", "unixReviewTime": 978998400, "reviewTime": "01 9, 2001"}