{"reviewerID": "AX8SWWB9837TA", "asin": "B00004TBBA", "reviewerName": "Chris Peters", "helpful": [12, 12], "reviewtext": "Four Words - Full Screen Anti-Aliasing (FSAA).  This card does it the best.  The drivers are rock-solid, and FSAA works with every game I own, in Direct3D or Glide.  What's more, FSAA makes older games look better, which is important to me as I check out the bargin bin every now and again.  Although the Geforce2 is faster, it's also more expensive, doesn't work with as many games, and it's FSAA isn't as good.If you have never seen FSAA in motion, it removes the jagged edges in 3D games, making the game look like it is running at a much sharper resolution than it actually is.  Depending on the game, this makes a big difference.  For example, Homeworld has a lot of straight-line laser beams contrasting sharply with the darkness of space, and is hugely improved with FSAA.  Older games that don't support high resolutions will look sharp as a whistler with 4x FSAA.  Newer games with more detail and thus more edges will also benefit.FSAA is not the same as turning up the resolution.  Running a game at 640x480 with 4x FSAA looks better than 1200x800, because the basic problems of any resolution are effectively erased.  However, FSAA won't make distance objects have the same detail as a super high resolution, but unless you are a hardcore online sniper, you'll prefer the FSAA.  However, FSAA will do nothing for old, blurry textures.  They will look exactly the same as before.  If there are jagged edges inside a texture, they will remain.The Voodoo5 5500 also supports 32 bit color and large texture compression, although I still am not finding a lot of games that support large textures yet.  It doesn't support hardware T&amp;L, but no game supports this fully yet.  Also, the card is BIG - like Sound Blaster 16 big.  Get the measurements, and check the size of your computer case before you buy it.", "overall": 5.0, "summary": "I am Very Happy I Bought This Card and Not a GeForce2", "unixReviewTime": 972172800, "reviewTime": "10 22, 2000"}