{"reviewerID": "A2M7NKO97UIVAH", "asin": "B00004TBBA", "reviewerName": "Deinabo D. George \"DDG\"", "helpful": [8, 8], "reviewtext": "3dfx's Voodoo5 5500 is a masterpiece of silicon engineering.  This final  iteration of the venerable Voodoo Graphics core has been reworked and  retooled into the VSA-100 chip (Voodoo Scalable Architecture).  The board  uses two VSA-100 chips in SLI (Scanline Interleave Mode) and comes equipped  with 64MB of SDRAM.  The core clock speed runs at 166MHz while the RAMDAC  refreshes at 350MHz.  It can process two pixels per clock which means it  has a maximum theoretical fill rate of 667 megatexels per second.The  Voodoo5 5500 finally supports a full OpenGL driver as well 32-bit true  color in 3D.  Additionally it also supports 3dfx's exclusive T-Buffer  technology, which allows for visual tricks such as softshadows,  depth-of-field blur, motion blur, and soft reflections.  The biggest  feature touted is it's hardware-based full scene anti-aliasing.  Anti-aliasing is a feature that smoothes out jagged lines in a 3D game  scene, allowing for a much more realistic image.  However, there's a  performance hit when this feature is enabled; thus 3dfx gives the user the  option of using 2X or 4X anti-aliasing.  Basically this means that either  two or four samples are jittered together to smooth out the scene.  Games  look magnificent with this feature enabled but flight sims, space combat  sims, and racing sims seem to enjoy higher frame rates with it enabled  also.Nvidia's GeForce2 GTS-based cards are faster in terms of raw  performance and they even support anti-aliasing.  The difference is that  it's not supported in hardware (it's software based) and it doesn't work as  well in Direct3D as it does in OpenGL; 3dfx's solution works well in  OpenGL, Glide, and Direct3D and it works with nearly every game currently  available.  Moreover, the driver suite is quite stable and the image  quality is much better than any video card on the market (with the possible  exception of ATI or Matrox).  As a plus, you can find the card for well  under the suggested retail price or $300 dollars with a little searching on  the Internet.The Voodoo5 5500 is your best bet for new video card. It's  fast in 3D as well as 2D (Word, Excel), ships with stable drivers backed  excellent tech support, and can be found for a cheaper price than some of  the GeForce2-based cards currently out there.  Get this card and begin to  sing its praises!!", "overall": 5.0, "summary": "Believe the hype.", "unixReviewTime": 968025600, "reviewTime": "09 4, 2000"}