{"reviewerID": "A3I1BJIFFM4S21", "asin": "B00004TDL2", "reviewerName": "Atomicwasteland", "helpful": [149, 149], "reviewtext": "I have had my Jornada for a month now and I have been nothing but pleased.  It has exceeded my every expectation.  The color (12-bit) is wonderful, the sound from the built-in speaker (and headphones) is surprisingly good, and the functionality is astounding.  Make no mistake, you are not buying an organizer --you are buying a COMPUTER.  133 mhz processer, 12-bit color, 32 mb of ram --is it just me, or wasn't that a top-of-the-line desktop computer 5 yrs ago?Well, I won't go into the basics -other reviewers have done a good job doing so --let me focus on other areas.Buying extra memory is a must if you download a lot (MP3s or books).  (I filled up my memory within 2 weeks after downloading 9 books, 2 songs, and 5 extra games...  Books seem to be 500k to 1 mb, MP3s are 4-6MB and games are less than 1MB) I'd recommend going with the maximum upgrade of 128 MB flash-card --you could put 2 hours of MP3s on that card! This is great if you always wanted an MP3 player, as I did, now I can just roll the functionality of my Jornada into my portable music station.For downloading books I recommend checking out the great FREE selection on Amazon.com.  (Another good place is, egads!, Barnes and Nobles.com) There are some great books just worth keeping in the memory in case you are stuck somewhere with time on your hands.I highly recommend getting the FREE Pocket PC expansion pack offered by Microsoft --it contains some games (Chess is great, Hearts is great, Pac Man is alright --but is meant to be played with a joystick), but more importantly, offers a lot of other great software, free.  There is a &quot;paint&quot; program -it offers simple drawing in many colors (but no paintbrush or sprayer), the e-book reader program (allows you to display e-books), a great &quot;slide-shower&quot; program (I put family pictures in here in 5 minutes) --there is a full screen mode which allows you to page-through slides, and is really impressive.  There is even an ADOBE ACROBAT reader --quite amazing, though I wonder how documents will look on a small screen.The best thing about the Jornada is that it is very intuitive.  The internal file system is set up just like your home PC -with a version of &quot;explorer&quot;.  This allows you to open an &quot;explorer&quot; menu (when your Jornada is &quot;synched&quot; with your computer).  The advantage of this is you can just open folders on your big computer's screen and drag and drop PHOTOS, E-BOOKS, MP3s, and M-PEGS just as easy as that.  One of my best comments about this product is that I didn't need the instruction manual.Other highlights --the COMPLETE synchronization with Microsoft's products is absolutely wonderful.  Outlook is FULLY synched --alerts, contacts, and tasks to remember are added to your home computer (after you've added them to your Jornada).  (By the way, you receive the FULL version of Outlook 2000 for free when you purchase your Jornada).  Word and Excel allow you to open e-mail attachments as well as create new documents.  Microsoft Money requires a separate purchase of Money 2000 (or newer) and is really cool.  It keeps your whole checkbook, basic stock information, and lists of Payees and Expense categories available at your fingertips.The Jornada can be extensively customized, I found THAT very attractive --a variety of sound, backlight, password, and hotkey settings can be changed quickly from the internal menus.Surprisingly, the calculator is one &quot;widget&quot; that I've used more than anything else.  It really feels natural, and gets a LOT of use in restaurants...The weight is nothing you can't handle, but is noticeable --it is heavier than it looks, and I wouldn't want to put it into a shirt pocket, or try to squeeze it into a pair of jeans.  If you drop it on a hard surface, good luck, because it looks like it'd shatter --it is heavy.The cover is very nice.  It is sleek metal, which is great protection.  One drawback is that it is not something that is easily removed (though you can --with care), and doesn't move back more than 90 degrees when opened.I like the stylus.  It is very easy to pull out and use, and stores very well.The best program is the built-in &quot;NOTE taker&quot; function.  You write on the screen and your strokes are captured exactly as written--no &quot;graffiti&quot; or &quot;keboard&quot; needed here (though these ARE an option).  This is the fastest way to take notes --basically just drawing on a touch-pad.  Also, another neat function is that you can press the red button on the side and RECORD voice messages that are saved with specific notes--really cool!  You can even record messages when the machine is off --just press the button and you can record for as long as you have memory!Every morning I plug it in and it automatically downloads 500 web pages for view later --it takes less than 5 minutes on a 28.8 modem.  This is the best part --I was astounded how fun it was to read news on the metro on my handheld.  (Every time you &quot;synch&quot; outdated web pages are deleted, and new ones stored).Go to Avantgo.com, and you can choose a variety of web sites to be AUTOMATICALLY downloaded to your Pocket PC --this is just the ultimate in usefulness.  I entered my zipcode and now articles are more relevent to me.  Just an example --I said I wanted to see Hollywood.com, and now I get all the movie summaries, locations, and movie times downloaded to my Pocket PC --no more looking through the paper... You can download book reviews, news, business, sports, and weather.  You can also get ALL of your articles on your MY YAHOO site (if you have one) --this was a REAL plus.  The New York times offers a LOT of features, as does MSN.One last thing --you can download MAPS -this blew my mind -there were maps of all major cities available --you just drag and drop the ones you want onto your Pocket PC.  When viewing a map, just click on the spot you want to see, and you can zoom in.  You can get to individual streets, and it looks stunning in color --I really love this feature.  No more carrying outsized maps with me (and looking like a tourist) when I'm in the city.  Wonderful!More to say, but not today.  I am one satisfied customer.  A purchase for someone who wants more than just an organizer... a LOT more.", "overall": 5.0, "summary": "Absolutely Fantastic -continues to surprise me", "unixReviewTime": 975024000, "reviewTime": "11 24, 2000"}