{"reviewerID": "A2L9O39O92M77C", "asin": "B00004TDL2", "reviewerName": "Narilka", "helpful": [9, 9], "reviewtext": "I've had my Jornada for about a year now, and while I don't use it all the time, I at least always have it with me.  It comes with fairly useful applications already on it, making it very useable straight out of the box -- no need to download several programs just to get it to do all the things you want it to.  In fact, the only other programs I've put on it have been games.  With things like Word, Excel and Outlook functionality, in a Windows dominated work world it's good to be able to drag and drop and not worry about having to figure out if you'll need to convert it or download a seperate application to your PDA just to view it.  It also has MS Money on it, which I had never used before.  I now use it all the time, as it lets me keep track of finances, and if I'm out shopping I don't need to call the bank to figure out how much money I can spend.The battery life is fairly good -- the last time I charged it was about a week or two ago and I still have about 75%, though I haven't been using it much lately.  The screen is pretty bright, and I haven't had a problem using it in any lighting condition.The writing recognition is far superior to that of a Palm Pilot, which I had before my Jornada.  When I took the Jornada out of the box and ran through set up, one of the first things I tried was to write.  Surprisingly (after trying to do the Palm Pilot grafiti I was used to), I found that my normal handwriting was recognized.The Jornada is pretty flexible -- it does the standard email/text document/caluculator functionality of a PDA, but also offers a lot more.  It can store and play mp3s or wma's (windows media format), eliminating the need for a seperate mp3 player.  Voice record is good for taking notes if you don't have the time write or catching that bit of song you'd like to look up later, just make sure you set the quality to one of the higher settings -- the default is pretty scratchy.While the Jornada is a bit heavier than most PDAs these days, it also makes it more durable.  I am apt to throw my electronics in a purse or backpack (and with my Jornada, it's more often my backpack), and the included screen cover protects it nicely.  I have bent the case once, when it was in my backpack without any protection and I forgot.  I dropped the backpack (all 30 pounds of it) on the floor, and the back of the Jornada dented a bit, though it hasn't affected the functionality at all (and that was about six months ago).Overall, I've been very happy with it.  I've never had it lose data or freeze up, it reminds me when I have to be somewhere, and it keeps me from bouncing checks.  All without having to add anything on.", "overall": 4.0, "summary": "A good PDA, if you can stand the size.", "unixReviewTime": 1011830400, "reviewTime": "01 24, 2002"}