{"reviewerID": "A1SAQB40R8C44A", "asin": "B00004TDL2", "reviewerName": "Phil W.", "helpful": [25, 32], "reviewtext": "I really wanted to like this Jornada. But when I got it it just didn't feel right in my hand. The cover - which apparently others like - I hated it. The requirement to store the stylus in the cover is okay, but when you don't use the cover and put it in a pack or case there is no where to store  the stylus - that can be a problem.The screen is not as bright as I had  hoped. I am new to Windows based handhelds, but in PocketPC OS it is  EXTREMELY difficult to shut down an application, and when you get 10 or so  different things running it gets SLOOOOOOOW.HP usually turns out  intuitively designed products, but the wheel for scrolling is useless due  to its placement. The aforementioned placement of the stylus holder was an  issue, and then comes my biggest complaint: the CF slot cover. This little  flimsy piece of plastic which is designed to cover the empty (or full) CF  slot, but it is very cheaply made and poorly attached - I gave it about a  week before it would have broken off; and its placement was such that I hit  it all the time.The multimedia was fair, mp3 files sounded good with or  without the headphones, but the player ... [is poor] and I never could get any sort  of avi or mpeg video files to play as indicated. Even with USB connection,  it took forever to download mp3s to the 548.COST - VERY EXPENSIVE! For  that price it should be manufactured with better materials.There are  virtuosly no accessories for it. An external keyboard is nonexistant. There  are two companies with ads in the Accessory guide who show external  keyboards, but upon further checking - neither makes one for the 540 series  of Jornadas.If you want to really be efficient, I would reccomend the  HP Jornada 690 it has the same memory with better battery life, an internal  modem, a built in keyboard and more.It works as promised, but isn't as  exciting or valuable as it claims. In time, I am sure there will be better  accessories and programs, but for now - I'll keep my paper organizer and  pen, its faster, cheaper, and unlimited storage! Palm organizers are  simpler and, in most circumstances, better; unless you NEED color and  multimedia.", "overall": 2.0, "summary": "I really wanted to like this device, BUT.....", "unixReviewTime": 959126400, "reviewTime": "05 24, 2000"}