{"reviewerID": "A1G18MU8RQQ4GY", "asin": "B00004TDL2", "reviewerName": "S. Gibson \"Online envoy\"", "helpful": [61, 64], "reviewtext": "I love my Pocket PC. I use this thing more than any device I have ever owned. From the moment it arrived it became much more than a gadget. I have owned lots of gadgets, including the palm. They were great to carry around and show off but the pocket PC is the most useful thing I have ever owned. Here is an example of how I use it through out my day.  5:00 AM: Wake up to the alarm. It plenty loud enough to rouse even me.  7:00 AM: Listen to MP3,s or sometimes audio books on my drive to work.8:00 AM: Pop it in the cradle and sync with my Outlook at work. All my email, Calendar, task, web pages, files, etc...  9:00 AM: go to daily morning meeting with nothing but my Pocket PC. I have all my status reports in MS word. When we discuss an email someone sent out with an attached excel spreadsheet I just open it on my pocket PC and review. I open up the note pad and take notes through out the meeting.Oh yea, sometimes I get bored and play games with the sound off. It look like I am taking notes.  10:00 AM and throughout the day it goes with me to all meetings. Taking notes on it is a breeze. It is as close to actual writing as you can get.  12:00 Noon: Take it to lunch. If I am alone I read through the days news on Pocket Internet Explorer. Its updates every time I sync so I always have the latest news and movietimes, weather, etc...If it is a business luncheon I exchange contact info with partners and clients via infrared. I can exchange even with Palm owners thanks to Peacemaker. 6:30 PM: Go home and listen to MP3's on the way. 8:30 PM: Read books using the MS Reader. So far I have read. Tom Sawyer, Timeline, Fredrick Douglas, a good portion of the bible, part of the Koran, Thus spake Zarathustra' Albert Einstein's Quotes, Shakespeare's  Sonnets and Digital Times.I own the Jornado and it is in my mind the best. The Ipaq and Casio are great in many respects but no one beats the form factor, styling and slickness of the Jornado", "overall": 5.0, "summary": "Love it.", "unixReviewTime": 971049600, "reviewTime": "10 9, 2000"}