{"reviewerID": "A3URVWPFJOHT72", "asin": "B00004TDL2", "reviewerName": "zlionsfan", "helpful": [27, 28], "reviewtext": "If you're looking for a PDA that is designed to sync with Microsoft applications on your desktop, this is definitely a good buy. However, you will pay for the privilege - as you can tell by shopping around, the Jornada 540 series is not at the low end of the price scale. If you've got the cash, this is definitely worth it.For starters, make sure you get the 548 instead of the 545. The extra 16 MB ROM is a must. With 32 MB of ROM, you'll be able to run most applications without a problem, and you can have several open while still using a good portion of the memory for storage. Eventually, you'll want to get a CompactFlash card - I recommend the Viking 128 MB card. Again, a little expensive, but you'll want all the storage you can get, especially if you're planning on using the Jornada as an MP3 player.The speaker is functional and serves its purpose, but the real value is in the headphone jack. Plug in the included headphones and you get your money's worth, but beware - using the Jornada as a jukebox will drain the batteries, so keep it plugged in if you can. The speaker does work well for reminders, whether as an alarm clock or as an appointment book.The included software is very nice - Outlook 2000 is included, which makes the cost more reasonable, as well as Pocket Excel and Pocket Word. Pocket Money also comes with it, but you may have some problems synching your data if you have Money 2001 on your desktop. I've not been able to get the combination to work regularly.The interface is workable - you can use the on-screen keyboard for typing, you can use single-character recognition, or in certain apps, you can use handwriting recognition. It takes a little practice to get the strokes down, but it's worth the time. You can also record and play back audio notes if you prefer.The size is very nice - it fits in my pocket easily, and the weight helps keep it in place. It is a little heavy to hold in your hand for extended periods of time, though. The stylus is held in the cover, which is helpful.The package comes with a USB cradle for synching to a desktop PC. One drawback I found was that you can only sync to PCs in the same way - for example, you can't sync your Contacts, Inbox, and Calendar at work and only your Contacts at home. If you're just synching to one PC, this is a fine arrangement. Make sure you follow the installation steps _exactly_ - I had some difficulty getting my PC to recognize the Jornada at first.Finally, make sure you get screen protectors with the device! As you may see in other reviews, you can scratch your screen through extended use without the protectors, and they're very inexpensive. Make sure to remove the green film before using them.Overall, I feel that I've gotten my money's worth out of the Jornada. If you're looking for a Pocket PC and have the cash to spare, you won't go wrong with the 548.", "overall": 4.0, "summary": "Good for Microsoft fans, but pricey", "unixReviewTime": 978307200, "reviewTime": "01 1, 2001"}