{"reviewerID": "A2XYGJ7FAK0QR7", "asin": "B00004TDL2", "reviewerName": "Zossima \"Zossima\"", "helpful": [13, 13], "reviewtext": "I used to carry a laptop and a Franklin planner almost everywhere.  Now, my Jornada and the Targus keyboard are all I usually need, unless I'm doing a presentation to a client.  The Pocket PC is a marvel of convenience.  Here are common things I do on my HP Jornada:* All MS Outlook related activities (appointments, tasks, meeting notes, and contacts)* MS Pocket Money: I get a receipt, and I enter it before I leave the location.  No more piles of receipts to process at the end of the month so that I can reconcile my accounts.* Pocket Word: keep my personal journal, jot down notes, write business documents, etc.  The formatting isn't anywhere near as powerful as the desktop version of Word, but it won't take too many more features for this to be a highly functional word processor.* Pocket Excel: Track mileage.  Pocket Excel is a very basic spreadsheet, but it does a great job for simple spreadsheets.  I expect future versions will be better.* Download web pages for viewing: Using AvantGo, I routinely download the Economist, New York Times, CNN, and many other sites.  And if I travel, I can download restaurant and entertainment info for the city I go to.* Track billable hours: Using a great FREEWARE program for Pocket PC, I can track billable hours for clients, projects, and even activities associated with projects.* Brainstorm: I use a mind-mapping Pocket PC program to brainstorm and develop mindmaps and preliminary project plans for myself and with clients.* Listen to music: A 64MB flash card can hold a decent amount of MP3 files!* Show off my new daughter: I have a digital camera, so I can transfer images of my daughter to my Jornada to show pictures to my friends and associates.Additionally, with a Pocket PC, you can do many other things that I don't yet use the Jornada for, including view PowerPoint files, edit databases, edit html files, edit images, send and receive emails, view live Internet, watch mpg movies, and make cellular phone calls.  Great!The Jornada really has revolutionized my life.  That said, there are some cons (which is why I didn't give it 5 stars): 1) The biggest flaw is that the screen is virtually impossible to view in sunlight.  The Compaq iPaq's screens are much better.  2) The Windows OS is a bit clunky.  It's hard to exit programs or switch between programs.  I haven't seen the new Pocket PC 2002 OS to see if they've improved on this.The benefits far outweigh the flaws, however.  Pocket PCs are a great productivity tool, and the HP Jornada is a great product.", "overall": 4.0, "summary": "Revolutionized my life", "unixReviewTime": 1008201600, "reviewTime": "12 13, 2001"}