{"reviewerID": "AUQ222SF27VCL", "asin": "B00004TDLD", "reviewerName": "Leo Spaceman \"Leo\"", "helpful": [135, 145], "reviewtext": "Sum Swamp isn't *so* much fun that, say, they'd ever want to make a movie about it.  I don't think you're going to see Liam Neeson and Jennifer Lopez starring in a summer blockbuster thriller about a magical swamp where you have to roll dice and get through it, and need to find the magic combination to get out of the \"endless\" loop.On the other hand, playing games with your kids and teaching them basic math can be pretty mundane, if not boring, if you don't have some sort of story.  So, as far as an activity goes to make this easy and fun, Sum Swamp fits the bill.  The are charming aspects to the board, for instance, that make it play a bit like Candyland (possible \"short cuts\").The game is remarkably simple.  A board, two numbered dice, a plus/minus die, and four character pieces for the players.  Theoretically, you could build this game on your own if you were so inclined, say, with a bunch of toy cars or ponies and call it Sum Race.  The plus/minus dice would be hard to procure, though.The best part, though, kidding aside, is that my kid actually asks to play this game preferentially over, say, other lame-u-tational games like Sequence, SuperWhy ABC Letter Game, etc.Part of the charm, also, is that the game takes maybe a grand total of 5-10 minutes to get through a game, if you're efficient about it.  So it's not going to stretch on and on without some sort of redemption, like a bad movie might.  More reason why they probably shouldn't turn Sum Swamp into a movie.  Unless, maybe, if they had Samuel L. Jackson in it.Here are the directions straight outta' the box:- Each player chooses a game piece and places it on start.  Players roll a number die and the player with the highest number goes first.- The first players rolls all 3 dice and creates a number sentence by placing the highest number die first, the operation die second, and the smallest number die last.- The player then adds or subtracts the numbers, and moves ahead the sum or difference.  For example, if a player rolls 3+2, he/she moves ahead 5 spaces.  If a player rolls a combination that equals 0 (5-5=0), heshe does not move.  Then it is the next player's turn.- The first player to reach the finish space is the winner!Special spaces on the board\"Evens\" or \"Odds\": if a player lands on one of these spaces, heshe rolls one die.  If a player rolls an \"even\" or \"odd\" number as indicated on the game board, he/she moves ahead that number of spaces.  If an evenodd number is not rolled, the player must wait until his/her next turn and try again!Number Space: If a player lands on a number space, he/she rolls the operation die.  If the player rolls a +, he/she moves ahead the number indicated on the space.  If the player rolls a -, heshe moves back that number.\"Short Cut\": If a player lands on one of these spaces, he/she follows the arrows as indicated on the board.\"Endless Loop\": All players enter the loop as the arrow on the board indicates.  Players continue moving counterclockwise around the loop.  If a player lands on the space marked \"exit\", he/she can exit the loop on his/her next turn.", "overall": 5.0, "summary": "Elegantly simple fun that isn't boring to play", "unixReviewTime": 1281312000, "reviewTime": "08 9, 2010"}