{"reviewerID": "AV0D9NPLN8BIL", "asin": "B00004TDMX", "reviewerName": "Leo Lam", "helpful": [252, 258], "reviewtext": "I bought the Visor after my Philips Nino DIED after less than two months of service.  The short battery life of the Nino wasn't nice, but the short life of the BACKUP battery definitely hurt!  I didn't bother getting it  changed, the Nino is in the bin.So, I had the obvious choice of the Palm  platform.  It is robust, no crashes (yes, CE crashes big time), highly  compatible (CE has compatibility problem with Win NT! ) and has extremely  long battery life (2 months, versus 2 days for CE powered devices).  The  obvious choice was Palm IIIe for a no-frill technology minded engineer like  me.  However, Handspring popped up on my screen at the right time.  Now  this is what I call value.Handspring was established by the inventor of  the original Palm Pilot and the team consists of all the key personnel of  Palm Computing (before they left!).  The Visor, from all that I have read,  was developed to OVERTAKE Palm, in terms of productivity, infinitely  upgradeability and value.  The Visor is selling at around the same price as  the Palm IIIe and has about the same specifications.  However, while the  Palm IIIe will always be what it is, the Visor can be upgraded through the  purchase of SpringBoard modules.  These modules include memory, backup  software, games (like PGA Golf), digital camera (you read RIGHT!) etc etc,  and a lot are on the pipeline.  And remember, anything that runs on Palm  will run on the Visor, they use the same operating system.  Also, Visor  comes with the IMPROVED version of Datebook, called Datebook+, and it's  more useful than ever.  It is so user friendly it requires NO learning on  my part and I could almost run it straight out of the box.Now you know  why the Visor is a better choice than Palm III, and even Palm V.  Identify  your need.  If you see less than 1200 friends normally, I guess you would  be very happy with the normal Visor (also, really great for college  students, believe me).  If you are the gadget guy, go get the Deluxe  version (with more RAM and comes in five tasty colors).  Still want to get  the Palm?  Well, feel free...I stick with my Visor, with a big smile  knowing that it is 110% well worth the money.", "overall": 5.0, "summary": "Not only better than WinCE, it's better than Palm", "unixReviewTime": 960249600, "reviewTime": "06 6, 2000"}