{"reviewerID": "A1JJOV69MAU2J2", "asin": "B00004TDMX", "reviewerName": "Steven Dennis", "helpful": [10, 11], "reviewtext": "The Visor is basically the 2 MB version of the Visor Deluxe.All Handspring models run variations of the Palm operating system, and have all of the PALM functions people havecome to know and love -- calendar, addresses, to-do lists, and access to a variety of downloadable programs.However, the 2 MB of memory doesn't go far when you want to take advantage of some of the more interesting programs, such as Avantgo (a free service thatallows you to download publications like the New York Times, CNN, Sports Illustrated onto your Palm for free) or street maps from Mapopolis.com or Vindigo, a city guide that gives restaurant and movie reviews and showtimes. You can fit one, maybe even too such problems onto your Handspring. But pretty soon you are running up against that memory barrier. That would be extremely frustrating for me (I have the Deluxe, a friend has the Visor 2MB and recently upgraded to a higher end model in part because he wanted to add more programs...If you do that, in the end buying the low end model will actually cost you money).The Handspring models have the best features for the money. They have a noticeably larger screen than the m100 and m105 (which Ireturned after a week), expandability (which I have yet to use, although I long for the GPS attachment from Magellan --maybe when it goes on clearance?)These models only get four stars, however, because they do have two significant shortcomings.One is bulk. The Visor, Deluxe and Neo are significantly larger than the Palm V, which is significantly more expensive.The PDA still fits in my chest pocket, though. (I don't recommend you do that...today mine fell out of my pocked and the screen cracked. I called Handspring and they are sending me a replacement for $85 -- Argh).Also, unlike the Palm V, 500 and 505, the Visor, Deluxe and Neo require new batteries after about two weeks of relatively heavyusage. That can amount to $20 a year or so on batteries alone. The Palm V has a lithium rechargeable, and the new Palm500 has an even better battery, but I can't justify paying that kind of money for what is still basically, at heart, anappointment calendar.Also, since this is the ultra-low end model, keep in mind that you need to have a computer to back up your data and to download features to your Visor. Note that the Visors come with fast USB hotsyncs -- which come on all new computers made in the last few years, while the Palm M105 and m100 come with seerial hotsyncs (slower, but almost every computer ever made has a serial port). Palm and Handspring charge you extra if you want the other type of hotsync, so that my influence your decision as well.BTW, I am a newspaper reporter who previously had four Rolodexes on my desk. No longer. No longer do I misplace names, numbers, or dates. I also don't get lost as often with Mapopolis at my side. This thing has changed and organized my life in ways I didn't expect -- just ask my wife.It's basically an extension of your brain -- now isn't that worth a couple hundred smackers?", "overall": 4.0, "summary": "The best PDA for the price...", "unixReviewTime": 1001980800, "reviewTime": "10 2, 2001"}