{"reviewerID": "A6FIAB28IS79", "asin": "B00004TDN0", "reviewerName": "Samuel Chell", "helpful": [23, 24], "reviewtext": "If you're shopping for a handheld you've got a tri-level decision to make.First, should you get a Pocket PC or a PDA?  I wanted broad-based, dependable consumer support at no more than three hundred dollars.  Hence, a PDA.Second, should you go Palm, Handspring, or Sony?  Rather than download everything, I wanted to slip in some of the existing modules, currently available only from Handspring.Third, should you consider a Neo, or even a Pro or an Edge?  I did, but there's no accounting for the premium prices.  A physician I spoke to says he downloads &quot;ePocrates&quot; into his Deluxe and has yet to use more than four megs of memory, so eight megs is plenty.  (Eliminate the Visor Pro.)  Moreover, he said he'd rather change batteries than fool around with recharging them. (I agree.)  Finally, he suggested these devices do wear out and that it's more likely that you would want to replace it in a couple of years than repair it. (Makes eminent sense.)Not I that needed any more convincing, but here are a few items I discovered on my own: 1. The inarguably sharper graphics of the Sony Clie are compromised by its slightly smaller screen (the Palms also have a smaller screen); 2. The attractive thinness of the Visor Edge is neutralized by the adaptor it requires to run a Handspring module; 3. Everytime Palm drops its price, Handspring does the same, pricing its model just under the comparable Palm. 4. Young sales clerks are invariably &quot;gadget junkies&quot; infatuated with Sony products, so take their recommendations with a grain of salt.Finally, if you receive ANY of the above as a gift, you're likely to be satisfied--providing you discover your life requires the organization provided by a PDA and you have have the time and discipline each day to update and consult it.", "overall": 5.0, "summary": "The Inescapable Choice.", "unixReviewTime": 1008374400, "reviewTime": "12 15, 2001"}