{"reviewerID": "A2AFT2VCH2S01B", "asin": "B00004TDN2", "reviewerName": "J. G. Heiser", "helpful": [27, 27], "reviewtext": "Moving to an area that doesn't have Palm VII coverage, I decided to buy a smaller &amp; lighter unit that had more RAM and better battery life. Maybe it isn't fair to compare the Visor to a Palm that cost twice as much, but here are the issues that I've had with the Visor during the first month:1) Difficulty installing USB driver on Windows 2000 (blew up during install).  Took some searching on message boards and Handspring's site to learn that I needed to download the latest version of the desktop (which includes the driver).  It also contained the clue I needed in order to remove the partially installed driver so that it would reinstall.2) Overall cheap feeling, and little silver flecks are already falling off the logo.3) The stylus is uncomfortably scratchy.  I usually use a Lamy or Rotring, but sometimes you just want to use the one that is included.  The Visor stylus is awful--sets my teeth on edge.  I swapped points with a Palm stylus, but this means that you are no longer carrying around a reset pin, which is a problem because...4) It locks up regularly, requiring resets at least once a week for me.  Once I have had to do a hard reset and reinstall everything from scratch.  The Palm needed resets sometimes too, but not this often.  (Fortunately, my CyberTool includes a stainless steel pin, as does the Swiss Card and most Victorinox knives with cork screws--get one to go with your retrofitted Visor stylus.)5) Sometimes you have to do a reset in order to get USB synch to work--even when the Visor appears to be operating normally.6) All my friends with Palms are using Ir to synch with W2K, but this is problematic with the Visor.  I did try Irlink, but still couldn't get it to work.  Visor tech report responded VERY quickly, explaining that I should try the new desktop software from Palm, which does have an Ir option (although it does NOT support USB, so it would be either/or).  I had actually tried this, because it was what the Palm owners are using, but I couldn't get it to work.  I don't want to give up USB also.7) No little ribbon to help pull out the batteries.  You have to dig around in there with a screwdriver or something--hard to get out with your thumb nail.8) The modules are kinda silly.  A vibrator? Hubba! A set of Star Trek books? I've never been able to finish an e-book on one of these little screens. The idea of the backup module isn't so bad, and maybe I'll need another 8 Meg someday. I loved the wireless on my VII, but the idea of a modem doesn't appeal to me because I always have my laptop.  I'd buy the GPS if it worked in Europe.  But it doesn't right now.  Maybe something cool will come out next year.So, the thing works OK, but if I had to do it again, I'd probably buy a Palm.  There doesn't seem to be an advantage to the Visor if you don't play with the modules. Maybe I'd feel differently if I'd bought some color other than Graphite?", "overall": 3.0, "summary": "Not as nice as the Palm", "unixReviewTime": 976579200, "reviewTime": "12 12, 2000"}