{"reviewerID": "A3FTI86WAVJOLG", "asin": "B00004TDN2", "reviewerName": "John A. Radi \"jradi\"", "helpful": [216, 230], "reviewtext": "I was one of the initial customers of the Handspring Visor and I have NEVER regretted my decision.  Since that time I have managed to sway almost all new PDA purchases towards Handspring (they owe me big time!).I think that alone says something about this product.A few of my thoughts from  owning this device: 1.  If you're a WinCE user, you'll be AMAZED w/ how  much faster the palm OS is.  I actually use it MUCH more often than I did  my WinCE device.2.  It comes w/ software to sync w/ a desktop program  (also included) called Palm Desktop.  There are &quot;conduits&quot; that  will help you sync w/ Outlook and many other PIMs - Lotus Notes, not  included.3.  You might want to consider purchasing Intellisync - but  first buy the device and see if you'll need it.  Just keep that filed in  the back of your mind that this $70 software might also be necessary.  However, this is NOT a mark against Handspring - because if you find you  need it - you would've needed it for any other PDA device - Palm or  WinCE.4.  If you're buying it for the modules - take a look at what's  available right now.  There's LOTS in development, but I'm still waiting  for something useful.  I am happy just knowing that I won't outgrow this  device anytime soon.  Friends who bought the Palm V are already in trouble  because that 2MB of ram ran out.5.  If you're new to Palm - the memory  goes a LONG way.  2MB can actually be plenty - you just have to manage it  more.  I have the 8MB version and I'm just over 2MB - that's w/ a few  ebooks, tons of [...] web pages, tons of contacts, and even MORE  shareware loaded up.  I keep just dumping stuff on it to see if I like it,  then I'm too lazy to delete it.  That's what happens when you have too much  memory.END", "overall": 5.0, "summary": "A solid decision (graphite is probably the way to go)", "unixReviewTime": 959299200, "reviewTime": "05 26, 2000"}