{"reviewerID": "A1MJMYLRTZ76ZX", "asin": "B00004TDN2", "reviewerName": "magellan", "helpful": [126, 127], "reviewtext": "I have looked at every PDA on the market and the Handspring Visor Deluxe is the best value in a PDA out there. While you can get the regular Visor  model with only 2 megs of RAM for about $170, the extra 6 megs is well  worth the Visor Deluxe's higher purchase price of $250.So reach down  deep, scrape up the extra green stuff, and go for the big VD! (Visor  Deluxe). You'll be glad you did. I can fit 100 different utilities and  programs into that 8 megs of RAM and still have 1.2 megs of space left for  data and other stuff. This is a lot of extra real estate and you'll  appreciate having it down the road.The other great thing about the  Handsprings vis-a-vis the Palms is the Springboard slot. You might not need  it now, but the capability to add another 8 megs of RAM is nice.But the  coolest thing for me is the 8-meg backup module. This device is  non-volatile and can be used to backup your data to the module, almost like  a hard disk. That way if you have to do a hard reset sometime, you can get  all your programs and data back. (There is a gotcha here--just make sure  you remember to copy over the module's backup program to the module  itself.)The module comes with software that allows you to manage all  your files and programs. You can copy one file or everything at a time.  Great for on the road or wherever.A couple of reviewers here have  commented that the Visors are 30% to 50% faster based on their benchmarking  programs compared to the Palms. I haven't tried running these benchmarks  myself, but I would say just looking at the screen refresh rate on a Palm  Vx compared to the Visor Deluxe, you can see it is at least 25%  faster.Another thing about the screen, although it isn't a big  difference, the Visor screens look a little brighter to me than the Palms.  Considering that you're looking at blackish-green font characters on a  pea-soup colored, greyish-green background on these little devices, every  little bit of extra visibility helps.I also like the parallel lines on  the side of the case, which make it harder for the unit to slip out of your  hand, compared to the Palms.The Visor's ability to hot-sync via USB  interface makes this process significantly faster than on the Palm devices.  Another plus.My only reservation about the Visors compared to the Palms  is that the Palm OS resides in flash ROM, which means you can update it  yourself. The Visor's is in ordinary ROM, so you are stuck with the current  version. The Palms are shipping with Palm OS 3.5, the Visors with 3.1.  Although OS 3.5 represents an advance over 3.1, this shouldn't be a big  deal, as the older OS has a reputation for being more stable.Whatever  Visor model you decide to buy, you'll be happy you did. These PDA's  actually make it fun to get organized. Try one and you'll see how good it  feels knowing everything is in one place where you can find it, instead of  in three different notebook-style organizers and 40 Sticky Notes on the  walls of your office.Also, the ability to search all the internal  databases is a very powerful feature. How many times with your regular  organizer (or worse, on notes scattered around your office) have you tried  to find a particular memo or note but couldn't find it? The search feature  eliminates this problem. And there are even more powerful search utilities  than the native app that you can add on that will do more, such as  accepting wild cards. The value of this feature relative to the normal  binder/organizer cannot be overestimated.", "overall": 5.0, "summary": "Best Value in a PDA", "unixReviewTime": 964483200, "reviewTime": "07 25, 2000"}