{"reviewerID": "A2B7BUH8834Y6M", "asin": "B00004TDN2", "reviewerName": "Shelley Gammon \"Geek\"", "helpful": [14, 15], "reviewtext": "I was issued a Palm Pilot at work and made a lot of use of it. I was going to buy my own... one that had more memory than the 2MB version they gave me at work, but a co-worker showed me his Handspring and I was in awe. I then did a lot of research and read the specs on many hand-held devices... Handspring was the clear winner.You still get the benefit of the very popular Palm OS which already has literally thousands of programs available... many at no or little cost... AND you have the ability to upgrade the pants off this thing.The Springboard slot at the back means that you can pop in modules that contain memory, programs or devices such as cameras, phones, pagers, GPS devices... absolutely revolutionary.I've had my Visor Deluxe for 2 years now and I would be lost without it.My less than perfect rating comes stems from these issues:1.) the screen scratches BADLY. It looks like the same material that's used for the Palm Pilot, so either it's the screen or the Handspring stylus... something about the plastic surface of either the screen or the stylus will grab any bit of microscopic debris and score a heavy scratch into the screen. I still use my Palm from time to time and I have no scratches other than normal use wear that looks like mild tiny scratches you can only see if you hold the Palm at an angle under a light.2.) The Springboard slot should have been designed so that it inserted from the side OR should have been more narrow so that the infrared beam port would not have to be on the side.  This makes beaming awkward when beaming info to and from other Palm users... either you or the Palm user has to turn the device 90 degrees in order to make a successful beam, which means you have to read side-ways.3.) the decals or screen printed ink or whatever it is on the silver buttons rubs off. In only 2 months of ownership, the phone and checklist buttons were blank with no icons on them... very frustrating. Considering greasy fingers are going to be on the buttons all the time, perhaps they should have been embossed w/ the symbols instead if not just using more durable ink... my Palm does not have this problem after 2 years of use.4.) Mac tech support from Handspring is ABYSMAL. I had some problems getting my Handspring to synch when I first got it. I struggled for several weeks. I e-mailed Handspring and I got a number of replies that showed that not only did they not read my e-mail, but that they had poor command of the English language. I finally was able to get my Handspring to synch w/ my Mac by messing with settings on my own... Handspring was totally unprepared to provide support to Macintosh users... this gave me a really bad impression of their consumer relations department and their company philosophy.Despite these problems, this is a fine piece of equipment that I've really found indespensible now that I've been using it for so long. I also got a Targus Stow-away keyboard for it (also available here on Amazon) which was a fantastic investment in my continued enjoyment of this PDA. Compared to Palm Pilot, Handspring wins the contest hands down.", "overall": 4.0, "summary": "Fantastic alternative to Palm!", "unixReviewTime": 1013040000, "reviewTime": "02 7, 2002"}