{"reviewerID": "A1JJOV69MAU2J2", "asin": "B00004TDN2", "reviewerName": "Steven Dennis", "helpful": [81, 81], "reviewtext": "At these fire-sale prices, the Visor Deluxe is a steal for folks who have missed out on the PDA revolution because of the cost.It wasn't that long ago that this model was selling for twice the price, following the latest deep discounts.Make no mistake, with a little patience, this is a device that will change your life. After a transition period, you will be able to toss away your Rolodexes (I used to have three) and your paper calendars.First the two weak points (and the reason why this doesn't get 5 stars):-- The Visor Deluxe has 2 AAA batteries instead of a rechargeable battery. You have to replace them every couple of weeks of medium to heavy usage, which can cost $20 a year.-- The case is relatively bulky, although it will still fit in a shirt pocket.Now, for the many advantages:Unlike the bargain-basement Palms, the m100 and the m105, the Handspring Visor Deluxe, and all other Handspring products, have a FULL SIZE SCREEN. I returned my m105 (a gift) after a week of squinting.I can't emphasize that enough. With a monochrome screen to begin with, and the built-in difficulty of pointing and clicking on a Palm device, size matters.BTW, unless Handspring cuts the price of the Visor NEO, it is not worth the extra bucks just for a faster processor. All Handspring models also have an expansion slot for adding everything from memory to a cell phone to GPS. You will also need the Visor Deluxe's 8MB (the regular Visor and Palm m100 model only come with 2MB) if you want to run some of the cooler downloadable programs for your Palm. Three free programs that I use all the time are Mapopolis (free maps from mapopolis.com, streets are searchable), Vindigo (a restaurant and city guide with movie reviews and showtimes at vindigo.com), and Avantgo (a news service where you can get the likes of The New York Times, the Weather Channel and CNN on your Palm).If you want to stay with Palm, but can spend a few dollars more, consider the Palm Vx. Although lacking in expansion slots, it comes in a super-slim package with a rechargeable lithium battery and a full-size screen.I recently bought one for my wife and another for me. The Vx's downside is that it comes with a slow serial cradle instead of the Handspring's speedy USB.I also have a friend who is very happy with his snazzy, expandable new m505, but in that price range I think a PocketPC might make more sense. Here's a basic product guide:Palm m100/Handspring Visor -- Bargain basement models with 2 MB of Ram. Good starter models for the price.Distinguishing characteristics: Visor has significantly larger screen, expansion slot and fast USB cradle. Palm has slower serial.Palm m105/Visor Deluxe -- Workhorse models with 8 MB of Ram (plenty for monochrome models). Visor Deluxe has bigger screen/USB/expansion slot, and is, for now, cheaper.Palm m125/Visor Platinum/Visor NEO/Sony Clie Monochrome -- Upper middle class models. Visor Platinum and NEO have larger screen. All have USB/expansion slot, although Sony's slot is only good for memory. NEO and Platinum are virtually identical. Sony has lithium rechargeable battery, others don't.Palm Vx -- Classic, not significantly expandable. Smallest full-function PDA with lithium rechargeable battery. Still the standard.Visor Prism -- Cheapest and brightest color Palm-branded OS, but bulky for its pricetag.Visor Edge/Palm 500/505/Visor Pro/Color Sony's...consider buying a Pocket PC instead, unless prices drop substantially.Good luck!", "overall": 4.0, "summary": "A steal at this price!", "unixReviewTime": 1006732800, "reviewTime": "11 26, 2001"}