{"reviewerID": "A5RIO7FOCJVAL", "asin": "B00004TDN4", "reviewerName": "Andrew C. Yao", "helpful": [0, 0], "reviewtext": "Good points:-1 touch backup -- everything's automated.  You just hit `backup' to backup your ENTIRE handheld, or `restore' to restore your ENTIRE handheld and it's done.  No worrying about compatibility conflicts.  You may have apps that may not be compatible with your Visor, but it wouldn't affect the function of the backup module-It's thorough -- EVERYTHING gets backed up, including but not limited to all PIM data (can't speak for outlook users, as I don't use it, but my guess is that that's also covered), various settings in the \"pref\" icon, applications, as well as all its data.  Examples include your ToDo entries, entries you've made in Bankbook3 (banking software), and even your saved game sessions and high scores from games like Space Trader and SubHunt (for the games part, hotsyncing only restores the actual game only.  You'll need to start all over from scratch).-Works right out of the box -- no extra drivers or updates are required.  It's true plug and play just like the vast majority of Springboard modules-Has limited but nice user error checks -- the only ones I know of are:&gt;being able to recognize that it (the module) is working with a different handheld/user, so you won't accidentally wipe out your (or someone else's) data on the Visor or backup module.&gt;being able to recognize that your request to backup stuff is much smaller (like files are missing) than what's already backed up.  Good example to illustrate this would be when I deleted whole categories of bank records I didn't need anymore.  Before the backup started, it ran a warning that I'll be losing a lot of info on the module if I went through.  Deleting all the info was purposely done, but it's still nice to see such checks take place to safeguard your data.-Fast restores -- Despite the slow backup process (described below), restoring takes considerably less time.-I've had mine for over 3.5 years, since I had my Visor, and switched to my Visor Neo over 1.5 years ago.  I haven't done a lot of restores, but it has been just as reliable, if not more as Palm Desktop and my handhelds.Bad points:-Backups are relatively slow -- I have about 5.9MB of used memory on my handheld, and each backup session takes almost 4 minutes.  This figure is better on the Original Visor or other Visors with less used memory, but it's still going to be pretty slow compared to hotsyncing.  Some of you may replace hotsyncing with backup modules for various reasons, but I'll bet that you won't be backing up on the module that liberally.  This takes much more patience, not to mention more battery power.-All or nothing -- Mentioned in another review as well.  Restoring/backing up the whole handheld is generally the ideal thing you want, but suppose you accidentally delete an app, or it'd be easier to just restore an old version of some set of records rather than manually undoing everything.  You'll get those modifications you done to be undone, but so will everything else you've done since that time, like new appointments you set up or new phone numbers you recorded since then.-Kinda bulky -- In the age of high capacity SD/MMC cards and DVD +/- R/RWs, one would scoff to see only 8MBs in such a plastic cartridge.  There aren't many other backup modules for Handspring though, and the smaller SD cards mean u just lose them easier.WHO SHOULD BUY THIS?-People on the road, going through extended periods of time without having access to a laptop or desktop to synchronize their info-People who have, foresee, or are worried of their desktop AND handheld crashing.  (For me, it was using Win98 SE, loading a bunch of 3rd party games and apps, and having to reset both of them often)-People who find forty to sixty-five dollars a small price to pay for losing extremely critical data-People who REALLY want to keep their high scores (expansion flash memory cards are another alternative)ADDITIONAL COMMENTS-Unless you're handheld is constantly bugging out (in which case you should consider getting a new unit that's more stable), than it'd be wise to keep that and the module apart for as much as possible.  Specifically, if you're out on the road and keep the module plugged in, you'll be defeating the purpose of utilizing a backup module if your handheld (and the backup that's plugged into it) gets stolen, lost, or falls into a wishing fountain and shorts out everything.  Technically you &gt;could&lt; restore from you're desktop, but the whole idea of having a backup is so that we wouldn't have to place all our trust in our desktop AND handheld right?-If you feel you have a solid, stable PC and/or handheld, then you could easily get away with making backups every 2 weeks or once a week.  If you just added a lot of important data to your handheld, then backup right away.  Otherwise don't bother.  The slow backup process will seem much less painful if you cut down on the number of backups you need to perform.-Obviously, apps and files only on plugged in expansion cards aren't backed up, but those files on expansion cards would be backed up already in the case that you lose handheld and desktop information.-In case it's not mentioned, this product has 8MB of memory, so it'll work for every type of Visor handheld except for the Visor Pro.  For original Visor users, you don't get to save 2 - 4 profiles on there.  Only one just like the rest of us.", "overall": 5.0, "summary": "HIGHLY recommended for those who value their handheld data", "unixReviewTime": 1076630400, "reviewTime": "02 13, 2004"}