{"reviewerID": "A1RPTVW5VEOSI", "asin": "B00004TH2W", "reviewerName": "Michael J. Edelman", "helpful": [241, 243], "reviewtext": "I've been watching the digital market waiting for interchangable lens digitals to fall below that magic thousand dollar price point for some time. Although it's probably going to happen soon, I realized I still needed a simple point and shoot digital with decent resolution that ddn't cost an arm and a leg- with casmera getting cheaper every few months I didn't want to spend too much on a camera I might be replacing in a year. Still, I wnated something with more than enough resolution for high-quality web pictures, and maybe even 4x6 prints, which meant around 1.3-1.5 megapixels.I also decided I wanted a simple, removable media with no moving parts, and some degree of manual exposure control. It looked like I couldn't find what I really wanted under $500- and then I found the Fuji.I've been shooting this marvelous package for a week now, and it's lived up to my expectations in every way. Focusing is fast and accurate, with an optional macro range for closeups. Color accuracy is first rate, contrast is superb, and the finished prints need very little, if any, correction.  Battery life is the best of any of the digital cameras I've tried- turn off the LCD monitor and a st of 4 AAs will last 450 shots! That's a lot better than my Agfa, which ate a pair of AAs with every 16 shots. The supplied software includes a program to download and manage pictures directly and a copy of Adobe's Photo Deluxe, which is looking moe nad more like Photoshop all the time.It's a measure of the camera's human engineering that I used it for a full day before I opened up the instruction manual. It's just that intuitive. Turn it on, and shoot. That's it. The zoom control falls right where you need it, under your thumb, and the opticla finder zooms with the lens. No need to turn on the LCD unless you want to edit in the camera or check a precise closeup shot. (You can also zoom in, crop, and do other edits on the image while it's still in the camera). If you want to take greater control, there are menus that let you vary exposure, flash behavior and many other variables as well.The supplied 4MB SmartMedia card holds 12 high resolution, standard compression shots. You can increase or reduce image compression to get higher quality or more pictures, and you can switch to a low-resolution mode when you need to squeeze a lot of pictures onto one card. The standard compression mode gives such good images that I wouldn't hesitate using high compression for web photos in order to double the card's capacity.I'd suggest a few accessories that I found made the camera easier to use.First, another SmartMedia card. A 16MB card (available for around $30) rives you 49 high-res, standard compresion shots- enough for a whole vacation for some. Second, an accessory SmartMedia reader. While you can download directly from the camera to your computer, an accessory reader (around $50 or less) works much, much faster, and saves camera batteries, too. Last, a small well-padded case with a strap, and preferably with multiple compartments. I carry mine in a Domke bag that has room for the camera, a couple of extra media cards, a cell phone, pens, pencils, the instruction book (there's a lot this camera can do I haven't even explored yet) and a set or two of spare batteries. I'm thinking of adding yet another SmartMedia card, too; with a 32MB card I'd have a total of about 160 shots, or the equivalent of between 5 and 6 rolls of standard film. Not bad.", "overall": 5.0, "summary": "An excellent value in a general purpose digital", "unixReviewTime": 972777600, "reviewTime": "10 29, 2000"}