{"reviewerID": "A1E71PU53N45Y0", "asin": "B00004TH2W", "reviewerName": "Ralph Thayer", "helpful": [162, 164], "reviewtext": "The Fujifilm FinePix 1400 Zoom digital still camera is a sleek and handsome device styled with a familiar &quot;point-and-shoot camera&quot; sort of design. Controls are reasonably well laid-out and fairly easy to  handle, even for middle-aged hands and thick fingers like mine.For the  record, this is my first digital camera. I regard myself as an  &quot;intermediate&quot; amateur in 35mm film photography, and desktop  computer operations.Though I have not yet made any prints from the  digital images I have taken with this camera, I am very well satisfied with  the color and sharpness in the daylight macro images taken in my rose  garden as I view them on my iMac. The attempt to photograph my nephews'  graduation from the bleachers of a high school gymnasium, however, revealed  the limitations of the modest built-in flash, and the lens' ability to pick  up &quot;ghosts&quot; of the overhead lighting.The camera can take  pictures in your choice of three quality levels (basic, normal, or fine)  and one of two pixel sizes (640x480 or 1280x960). A 320x240 file size can  accomplished by editing a recorded image using the &quot;resize&quot;  function. Indeed, any larger size can be reduced to a smaller size (to the  minimum 320x240). This can save space on the SmartMedia card, or reduce  transmission time over internet email, for instance.The camera comes  with one 4MB SmartMedia card. According to the owners manual, the  &quot;standard&quot; number of 1280x960 images which can be recorded in 4MB  ranges from 6 &quot;fine&quot; to 12 &quot;normal&quot; to 23  &quot;basic;&quot; and the number of 640x480 images ranges from 23  &quot;fine&quot; to 44 &quot;normal&quot; to 69 &quot;basic&quot;. The  manual goes on to say that actual capacity &quot;varies slightly depending  on the type of subject.&quot;The highly recommended purchase of a 32MB  card increases 1280x960 &quot;standard&quot; capacity to 50  &quot;fine,&quot; 99 &quot;normal,&quot; and 180 &quot;basic&quot; images;  and 640x480 &quot;standard&quot; capacity to 180 &quot;fine,&quot; 330  &quot;normal,&quot; and 496 &quot;basic&quot; images.An indoor flash  picture of a furnished room revealed some barely detectable  &quot;jaggies&quot; along the edges of a lamp shade in the  &quot;normal&quot; mode. Switching to &quot;fine&quot; eliminated these  altogether. (BTW, in a normal-size room, the flash exposure was ample.)I  must agree with the many reviewers who have written that the LCD display is  a bit too small and not bright enough to see easily in full sunlight, but I  have found that a &quot;banker's visor&quot; or &quot;big bubba&quot;  billed cap can help.The optical viewfinder is another solution, and is  especially useful because it actually &quot;zooms&quot; along with the lens  in pseudo-SLR fashion. But unlike a true thru-the-lens viewer, the parallax  error in this camera is significant. Because the &quot;film&quot; does not  &quot;see&quot; exactly the same &quot;frame&quot; as the optical  viewfinder, you might end up cutting off Aunt Mildred's head in that next  photo if you don't take care.The camera manuals, though they still sound  a bit &quot;translated,&quot; are actually very informative, well  organized, and well thought-out. The installation of the software drivers,  and downloading over the USB interface to my iMac with MacOS 8.6 went  without a hitch.Besides a larger SmartMedia card, other recommendable  additions include one (or better yet, two) full sets of rechargeable  batteries with recharger. And, if you plan to spend time using the  in-camera editing features, consider getting the AC adapter,  too.Playback functions include a nice nine-image LCD  &quot;thumbnail&quot; display mode. And those with advanced interests might  want to take advantage of the camera's ability to edit various Digital  Print Order Format (DPOF) settings.My verdict on the Fujifilm FinePix  1400 Zoom is that it is a very good value as an entry-level digital camera  capable (within reasonable limits) of capturing excellent images for  computer viewing. In today's marketplace, there are but two or three that  can directly compete with it for price and features - especially for owners  of USB equipped computers.", "overall": 5.0, "summary": "Good Value in this Entry-Level USB Digital Camera", "unixReviewTime": 961113600, "reviewTime": "06 16, 2000"}