{"reviewerID": "A1L65N1MS8WRGZ", "asin": "B00004TH2X", "reviewerName": "J. Fraser", "helpful": [32, 32], "reviewtext": "If you are looking for a quality digital camera that can replace replace a 35MM at less the $1000.00, you found it. The picture quality is just fantastic, it is very easy to use, is loaded with features and the USB and  smartmedia storage disks make it painless for photo storage and transfer. I  was looking for a 2+ mega pixel camera (this unit is 4.7!) that was small  in size (about 1 1/4in think and could fit in my pocket), had USB and  smartmedia disk storage, a 2\" LCD screen, a optical view finder, an optical  zoom lens for less then $1000.00.  This is one impressive camera. I have  been experimenting with it for about a week now and have tested all its  many modes. The ONLY weakness where a high end 35mm can out shine this unit  is in very high-speed action. I was not able to adjust the shutter speed to  freeze the blades of a spinning fan, I could do this w/ my 35mm. BUT IN  EVERY OTHER CATEGORY I think this unit is easier to use and produces as  good if not better then most 35mm. I am not kidding.  A few notes:  Batteries last a lot longer then other dig cameras I have seen due to power  saving features,  The optical zoom is nice (3:1) It has a night mode that  takes great night shots. It has a nice macro mode (for close up photgraphy)  A portrait mode that has great skintones. A landscape mode that config's  the unit to take great outdoor very sharp images of scenery.  Built in  flash autotimer and alot more! Short movie capability w/sound! It is a  small AVI format movie (only 320X200) but it is great for a short clip to  email to a friend. It very easy to use. It has easy to use software for  your PC.2 LCD panels, a 2&quot; one for photo viewing and a circular one  for camera operation.Modes of operation. There are 3, fine normal and  basic. Use normal for just about everything, except a special shot that you  know you plan to blow up then go to fine. The normal mode is nearly as  clear and sharp as the fine except when enlarged. In a 4X6 test series I  took no one could tell the difference between the 3 pictures. The Default  is set at 2400X1800 \"file size\" (2400x1800, 1280X960, and 640X480 are the  choices (IMO use 2400x1800) and quality set to normal. This is the best  choice IMO (normal w 2400X1800 file size) for most if not all shots. In  this mode you can store 77 photos on a 64MB disk! (19 on the 16 MB) (In  basic mode from 180-996 images on a 64mb disk) Transfering the photos to  your computer is a snap. When you plug in the USB cable to you camera the  software fires up and you see the pics. Click and drag to where you want  them. I also bought the Snadisk smartmeadia reader so I don't have to use  the camera to transfer them. (Looks like a mouse with a 2 in slit in it)  These smart media storage cards are the way to go..the y are about the size  of a large postage stamp and about that thick too and hold 64 MB. I can't  say how pleased I am with this product. I think this is the first real step  in consumer digital cameras that will rival any 35mm out there.  To date I  have been printing them on my HpR80 office jet (an ink jet) w/ suprisingly  good results. My next purchace will be a dedicated dye sub photo printer.  But the inkjet does a great job. Viewing the photos on the computer screen  or on a big screen TV is a blast.Go digital, it is the way to go... it  really is quite good now and reasonably priced.Good luck to you. Jim", "overall": 5.0, "summary": "Digital photography is really here now!", "unixReviewTime": 961718400, "reviewTime": "06 23, 2000"}