{"reviewerID": "A1HCMIM33ZPNWR", "asin": "B00004TH9M", "reviewerName": "Cary Majano \"Photography Student\"", "helpful": [1, 1], "reviewtext": "I thought I'd write a review of the Canon Elan IIe since so many are from the year 2000 and really have no merit compared to today's standard of technological achievements when it comes to camera tech. In 2000, the DSLRs were only 3 Megapixels, maybe 6, and Digital cameras were in their infancy. Film camera manufacturers were, at the time, taking advantage of this by innovating new ways to photograph with film incorporating things like face recognition, smile detetion, blink detection, etc. But the Elan IIe was released in 1995, this was way before all the fancy stuff and digital cameras taking off, so how does this compare to today's Advanced digital camera? Here's my review,I bought the Canon Elan IIe to pry myself from my DSLR. I admit it, I'm a DSLR junky lol. I own a Canon Rebel XSi and 4 lenses, plus many accessories, except a flash. I like DSLRs a lot because of convenience and ease of use. All you need to do is choose exposure, shoot, and chimp (Look at LCD screen to see if you got the photo). That is it! Then all you do is plug it into the computer and download the photos, then edit, then print.The Canon Elan IIe is a different beast altogether. It takes film, and it has no fancy LCD screen to view photographs, or has an insane amount AF points. To a Novice this camera would be a pass up, but that's where they would be wrong.The elan IIe is an astounding 35mm SLR with amazing features that NO DSLR up to now has. It makes loading film a breeze, and even allow you to save your film for later if you don't finish it and need a different roll without overlapping. It allows multiple exposures, up to 9. and its coolest feature and probably its best is Eye Controlled Auto Focus. No DSLR has Eye Controlled Auto Focus! what is that? It allows the photographer to select AF points with their eye movements. This is an insane feature that takes getting used to and requires calibration, but it works! If my Rebel XSi had eye control, I would have rarely missed a shot, that's how good it is. I am going to be using this SLR for now on as a primary and using my DSLR for my other projects. This is a camera ahead of its time and even today can produce great photos. Bravo Canon for making an exceptional SLR.", "overall": 5.0, "summary": "Amazing Camera, Just Amazing!", "unixReviewTime": 1343692800, "reviewTime": "07 31, 2012"}