{"reviewerID": "A234GO3KZYKKTE", "asin": "B00004TH9M", "reviewerName": "Nikwax", "helpful": [3, 4], "reviewtext": "I've been taking 35mm pictures for 35 years, and this is my favorite camera so far. I shot a couple of hundred rolls of film with this and it really feels like an extension of my vision. The light metering is sophisticated and usually does a great job even in tricky situations, the optical quality of the 28-105 Canon lens is stunning, and the frame is sturdy and durable. What's not to like?Well, there's the manual to begin with. There is no way you can access and understand all of the features that this camera has (and there are a LOT of features) by reading the manual. They just do a poor job of explaining, for example, the three metering modes and the three autofocus modes. I've had mixed sucess with the eye-controlled autofocus and find it a distraction now, and poor luck with the depth of field mode (if I could only get eye-controlled depth of field to work reliably). Depth of field preview? Pretty basic, my 35 year old SLR had it, the IIe's is not very functional. And for all the ballyhoo about the autofocus modes, the predictive focus mode hunts around so much that your subject will be long gone before the camera locks on to it (just try taking pictures of a puppy).Comparing this camera to the Rebel, I would wish for a combination of the two: I would like the light weight and functionality of the Rebel with the sturdyness and some of the flexability of the IIe. For a beginner, stick with the Rebel and a good lens (NOT the 28-80), you'll be much happier. As for me, I should be hunting up one of those MagicLantern manuals for the IIe and practicing with the eye-controlled autofocus.I would rate this camera 5 stars for what it can do, but decided on 3 stars based on what it should do and doesn't or says it can do but doesn't do very well.", "overall": 3.0, "summary": "great quirky confusing", "unixReviewTime": 1009411200, "reviewTime": "12 27, 2001"}