{"reviewerID": "A1D75IF0B4H4L", "asin": "B00004THCX", "reviewerName": "TX-One", "helpful": [22, 22], "reviewtext": "I haved owned the Canon EF 28-80mm f/3.5-5.6 V USM Standard Zoom Lens for Canon SLR Cameras for nearly one year.  I purchased this lens used for a very small amount of cash. After learning what this lens does best ... I have been generally pleased with the exposures that I have made with it. Sometimes the exposures with it really pop and that has kept me from selling it.  This is so even after I have purchased \"better lenses.\"  I did take some test shots to post.  See the bougainvilla, cat, and \"Wild Thing\" test images above.  Before uploading they looked a lot better. It is unfortunate that Amazon is unable to display good images.It has been my lot (my budget) to own a few of what the world has labeled \"bad lenses.\"  In general, I have not found the  lens to be \"bad\" but instead to be a \"good lens when used appropriately.\"  It does have its problems and it is not an L series quality lens.  But, I try to subscribe to the old quote that goes something like this:\"It is a poor workman that blames his tools.\"I am going to share excerpts from a posting that I read that has kept me from selling this lens.  I read this \"johnhopkins\" posting about this lens on the \"fredmiranda-com photo site.\" Johnhopkins from the United Kingdom posted it Sep 20, 2005 according to \"fredmiranda-com.\"  The poster \"johnhopkins\" stated that he had tested this lens against a Canon 24-70L.  He found that:\"The 28-80 could not match the Canon 24-70L in colour and contrast, but at f/11 there was no difference in resolution anywhere in the zoom range. At 28mm the 28-80 performed pretty respectably (though not as well) relative to the L zoom. Resolution at f/11 was identical to the L and only a little worse at f/5.6-f/8.Performance drops off further in the zoom range. At 50mm the 28-80 performed as well as the 24-70L at f/8-11 but resolution tailed off at f/5.6 and especially at f/4.5. The corners especially were poor.At 70mm the 28-80 only really performed well at f/11. Resolution was still OKish at f/8 but tailed off badly at f/5.6.\"My recent tests of the lens and my use of the lens for the most part confirms the (fredmiranda-com,johnhopkins) conclusion that:\"If used at f/11 anywhere in its zoom range or at f5.6-f/11 at 28mm then this lens can produce very decent results. Set the camera to Aperture Priority f/11 and leave it there if possible.\" I to have also found that my copy has decent performance at 28mm.I think that this lens is a good value for just a little cash.", "overall": 5.0, "summary": "A Diamond in the Rough: A Good Affordable Tool When Used To Advantage", "unixReviewTime": 1286236800, "reviewTime": "10 5, 2010"}