{"reviewerID": "AASSDFY9K6G2T", "asin": "B00004THCZ", "reviewerName": "Abdulrahman Aljabri", "helpful": [1556, 1591], "reviewtext": "No it's not especially if you take into account its intended users. If you use a Canon digital SLR and are satisfied with the kit lens (18-55) then buying this lens can be the perfect next step for you. Practically speaking, you will be able to increase your zoom reach to the point where you can A) photograph birds in moderately distant trees, B) be able to zoom in on the other side of a valley and frame something of your interest. Those are just two examples. One thing you will NOT be able to do effectively with this lens, however, is to take sport shots with it. How so? Consider some of the following weakness:*At 300mm zoom range the highest aperture is limited to 5.6 (You will have to use very slow shutter speed to snap fast action shots; remember the inverse relation between aperture and shutter speed.)*The lens size/weight combination makes it hard to hold steady when attached to a camera like the Rebel XT*Slow and often inaccurate auto focus (I just don't understand why Canon makes a USM version of this lens for $20 more, but never includes it in the triple rebate program)*Chromatic aberration is significant in high contrast lighting like in full sun (if you do not know what Chromatic aberration means search the term online or check out my review of the Canon 28mm 2.8 on Amazon, but to summarize, it would be a discoloration at the fringes of objects in your picture)Those kinds of weakness will limit your ability to use this lens in all sorts of other situations/circumstances. As a practical rule to follow, if the lighting is less than ideal this lens will give you a hard time. Meaning, it will be possible to use it, but you may get too many blurry images because of shake from slow shutter speeds. As for what are ideal lighting conditions? That would be full sun with few or no clouds and with the light bathing your subject/object from the front or the side.So is this lens that bad? Not really, as with many other lenses, when the lens is coupled with a good camera it still out performs most Point and Shoot cameras. Plus it provides results at par or slightly below the kit lens (18-55). So if you are satisfied with your kit lens, which provides you with a zoom range comparable to 3X zoom (55/18= 3), why not add another lens that will expand your zoom range by another 4X (300/75=4)? Nothing wrong with expanding your horizon!PS. TWO MORE POINTS ABOUT USING THIS LENS: First, if you're confident you can handhold this lens at slow shutter speeds (I know I can't) then the low maximum aperture shouldn't be a major problem. Second, if you're fine shooting at high ISO (more like 400 or 800) then again the low maximum aperture shouldn't be a problem. The nice thing about photography is that you can do one thing in so many ways, so don't be afraid to explore with this lens!", "overall": 3.0, "summary": "Is this lens as bad as some people say it is?", "unixReviewTime": 1144454400, "reviewTime": "04 8, 2006"}