{"reviewerID": "A3UA33R5UOA8RC", "asin": "B00004THCZ", "reviewerName": "Anand Muralidharan \"anandm78\"", "helpful": [46, 50], "reviewtext": "Every person that buys an SLR camera invariably ends up with lenses that cover focal lengths of 28mm to 300mm - a 28-90mm and a 70-300mm lens.  This one fits the latter requirement.  For 170 bucks you get a long 300mm focal length.  But that's about it.The slow autofocus aside, this lens is extremely soft at all focal lengths above 150mm or so.  I recently made the biggest mistake of taking this lens to an airshow. I thought the light weight helped me with the maneuverability of the camera but then when I saw the pictures I was terribly disappointed.  There can be nothing more disappointing than figuring out that you've done your part well (composition, exposure, etc) and then find that your lens failed miserably.  The F-18 jets had soft edges and looked like they were portraits of women. I had to apply unsharp mask filter in photoshop several times to get something that I could put on the web.IMHO, Canon really failed on this one and I guess it's time they replaced this lens with something better.For those of you that are reading this review and are looking to purchase a lens in this focal length range (and price range!), I strongly suggest the Sigma. If possible, get one with the APO designation on it.  I guess it costs $50 more.  But the quality of images it produces is far better than this Canon. As a nice add-on it also offers a macro switch that enables close focusing to achieve a 1:2 magnification.I know there are brand afficionados out there that will buy nothing other than a Canon - good or bad.  If you are looking for quality in a lens of this focal length and price range, avoid this lens.  Also don't go to eBay and buy the IS version of this lens - it's got the same bad optics.  Canon recently replaced it with a 70-300mm IS.  I guess that is very good.  Of course, the legendary 100-400mm IS with a price tag of $1400 is stunning.", "overall": 2.0, "summary": "Canon failed in this one!", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"}