{"reviewerID": "A4WEZJOIZIV4U", "asin": "B00004THCZ", "reviewerName": "Chuck Bittner \"Disabled comedian & gamer!\"", "helpful": [4, 4], "reviewtext": "If you're new to photography: This is a great telephoto lens for the beginning photographer. If you're new to photography and want to zoom lens this I don't think is a bad place to start. The f-stops aren't superlow but it will still work and if you're in the beginning stages of photography you'll just want to have a lens you can practice on. Another thing to note is the glass and this is not the greatest glass (the quality of the glass really affects the clarity of your pictures) is not a Canon L lens by any stretch but again it's good enough for the basic beginning photographer. And it only $150 at the time of writing this review it's good.You should always buy a UV filter to protect the glass. This in my opinion is the one thing everybody who purchases an expensive lens should do. UV filters don't affect the photographs you take but it's a layer of plastic between the scratchable glass and the world around you. It's a MUST BUY.This is another great lens for about $100 more:Canon EF-S 55-250mm F4-5.6 IS STM Lens for Canon SLR CamerasThis is a better lens and I recommend this one over the 70-300mmIf you're more advanced: If you're not new to photography and you're looking for something with better picture quality and faster motors (ultrasonic motors aid in the autofocus process) then this lens is probably the one you want to get but it costs over $500 at the time of this review. It also has image stabilization which helps in low light environments.Canon EF 70-300mm f/4-5.6 IS USM Lens for Canon EOS SLR CamerasAnother option you might want to consider is this lens here:Canon EF 70-200mm f/4L USM Telephoto Zoom Lens for Canon SLR Camerasit's a Canon L series and while it only has a 200 mm max zoom it has a constant 4 f-stop which allows for faster frame rates on all zoom levels. plus the glasses just better and it has watertight construction. the only real drawback to this lens is that it's over $600 but again it's really high quality.I have purchased all three of these lenses and my favorite is the the 70-200 mm Canon L lens it's just such a nice lens (plus you look really bad ass using it)If you have any questions feel free to leave a question here and I'll get back to youThanks for reading", "overall": 4.0, "summary": "A great telephoto lens for beginners BUT more advanced photographers might want others.", "unixReviewTime": 1388880000, "reviewTime": "01 5, 2014"}