{"reviewerID": "A2GGKJ318HO2GE", "asin": "B00004THCZ", "reviewerName": "Michael Horn \"mikie\"", "helpful": [17, 18], "reviewtext": "On a tight budget when I purchased my dRebel almost two years ago - this lens looked very attractive. Since owning it for two years - it seems to go further and further to the back of my equipment bag - and not taken in my backpack at all unless the climate is too harsh for my more expensive lenses.In fairness to the product - it is very GOOD for what it cost and how it is designed. It makes no pretension to be anything other than an AF f5.6 >75-300mm&lt; telephoto. The construction has remained solid - the zoom (fairly stiff or tight when new)sometimes makes funny noises from grit lodged in the 'nether regions' of the lens barrel (I am a defense contractor who travels to some pretty rotten climates). Dust and dirt do not seem to be a serious problem with regular maintenance of brush and blower around the rotating parts of the lens barrel.Things I enjoyed with this purchase:1. Light weight, solid construction2. Acceptable optical quality in sunny outdoor use3. Accepts the same filters (58mm) as my dRebel kit lens4. Affordable for those on a tight budget5. Compatible with the dRebel autofocus and auto exposure system6. Expendable (if something bad happens) in harsh climates7. Draws absolutely no attention from customs inspectors, (or anyone looking to steal your stuff) when clearing security at ports of entry or return. Clears airport security without manual inspection.Unsatisfactory/annoying qualities that quickly became evident:1. f4-5.6 limited my use indoors or low light. Plan to spend much time in Photoshop to save your pictures2. Length of lens made it unusable with the dRebel pop-up flash (lens shadow). Immediate purchase of a 420EX Speedlight ($177+ see my review) cured this problem3. Front focus rotating lens element limited my filter choices to UV (haze) filter only4. Annoyingly SLOW auto focus5. Tripod is almost manditory with lower shutter speeds (see f4- 5.6 limits). The 1.6x magnification factor when seated to the dRebel brings the focal length out to over 450mm making off tripod use risky* Use of a BGE-1 battery grip ($100+ see my review) with this lens - lowers camera center of gravity-extra counter-weight makes lens use less stressful.Good price - fair optics - limited overall performance. Limits for the serious photographer make one want to look elsewhere. SIGMA has superior product in this price category, as well as the house brand at Ritz/Wolf Camera chains-while the discriminating photographer who has the resources should look seriously at Canon's \"L\" series (as I've done) or 'IS' series as suggested by other experienced reviewers.", "overall": 3.0, "summary": "Good Price - Fair Optics - Limited Performance", "unixReviewTime": 1118880000, "reviewTime": "06 16, 2005"}