{"reviewerID": "A1PR7UDVQ8QSFF", "asin": "B00004THCZ", "reviewerName": "Michael J. Wood \"Flight Surgeon\"", "helpful": [4, 4], "reviewtext": "Bottom line up front:  A very good, if underrated, telephoto zoom lens.  Highly recommended for beginner to intermediate photographers.  Best choice for the second lens you purchase.The Canon EF 75-300mm f/4-5.6 III USM should be a strong contender for the second lens you own for your Canon DSLR camera.  Your first lens was probably a kit lens, typically a standard zoom lens that has a range starting around 20mm and goes to around 80mm, give or take a bit.  You've enjoyed that lens, but you're looking for something else...something with more distance, something you can really zoom in to see the action.  You want a telephoto lens.  (You're also probably wanting a wide angle zoom lens, something that will pull in that grand vista in front of you...that's a different review, but also a good choice for a second or third lens).So you start looking at all the different lenses out there, trying to find the best one for your money so you can take those photos you've been dreaming of taking.  But it gets confusing.  So many numbers.  You're just starting out, and you're wanting to make art, not do math problems!  And so many different opinions!  What is best?So here's my two cents.  It's biased, like everyone else's opinions here, but I'll try to tell you what I'm thinking and why.First, pick a lens that goes with your camera.  If you own a Canon camera, in the long run you'll be happier with Canon lenses.  I've owned a few other brands for my Canon cameras, but they've sometimes disappointed me.  Canon lenses usually don't.  There are several reasons for this, but the most practical is that your camera is a system.  The Canon camera &#34;talks&#34; electronically to the Canon lens and the Canon flash best, so if you're using *any* automatic settings, you'll get the best results using Canon products.  You *can* get just as good of photos using different lenses and different flashes...but you have to do all the work of communicating with the system by using manual settings.  Not a problem if you know what you're doing, but if you're new...you'll want to use Canon products to help with the workload and learning curve.  Even if you're experienced, it just makes everything significantly easier.  So, I'm biased there, but you at least know where I'm coming from.  My wife calls it &#34;lazy,&#34; I prefer to call it &#34;efficient.&#34;Next you need to think about what you want to do with the lens.  Since you're looking at this lens, you're probably thinking you want something that will give you the ability to take photos of things far away, or at least make something that looks small look a lot bigger in your photo.  A telephoto lens will do this.  For me, at least, this was the perfect second lens option.  Getting futher away from things usually was easier than getting closer, especially with wildlife.  So what kind of telephoto do you need?  For most folks starting out, a zoom telephoto (as opposed to a prime focus telephoto) is a better option...it allows you to zoom in and out, and better frame the photo you'll take.  So you'll be looking for a lens that shows a range of focal lengths (say, picking some random numbers....75mm-300mm).  The trade-off is that you'll have larger focal ratio (f-stop, f-number...it's called lots of things), which means you'll need longer shutter speeds but that's going to hold true for all zooms.  Image stablization will help with that some, but in practice if you're using bright light (like sunlight) I haven't found it makes that much difference and it costs significantly more.So that brings us to this lens.  It's an inexpensive telephoto zoom lens compared to other lenses out there.  It's no frills, and does the job.  It's also more light weight than most telephoto zoom lenses out there, which helps when you're holding the lens and camera by hand (remember, higher focal ratios mean longer shutter speeds...meaning you have to be more steady for longer).  Yes, there are &#34;better&#34; telephoto lenses out there...but you'll pay more for them.  And the big secret?  You'll not get that much better photos.  Don't get me wrong, I have some &#34;L&#34; lenses as well, and they're wonderful...but I don't necessarily get better photos from them.  I've had the Canon EF 75-300mm f/4-5.6 III USM lens for almost 20 years, and I've taken some amazing photos with this lens.  Why?  Because I take a lot of photos, so I have a lot of practice with it.  It also helps having steady hands (although being a doctor and an expert military marksman means I have some practice there) and/or a tripod, but really there is no substitue for practice.  That goes for any lens, but if you're new to SLR photography, a good inexpensive lens like this to practice with will more than pay for itself.Telephoto lens.  Light weight.  Inexpensive.  Good quality.  You can ask for more, but you'll pay for it.  This one does the trick and works well.  Great to start with, and the skills you'll develop will translate when (if ever) you upgrade.", "overall": 4.0, "summary": "Best telephoto lens for beginner/intermediate photographers", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}