{"reviewerID": "A2PZ3URE2O6S8G", "asin": "B00004THCZ", "reviewerName": "Scott T. Shea \"MH53Eflyguy\"", "helpful": [5, 6], "reviewtext": "I should start off stating that I am a newbie at SLR photography, but with the basic rules underneath my belt of focal length and shutter speeds figured out, I decided I could graduate to this lens.  This is my first external lens purchase for my Rebel 1Ti SLR outside of the 55-85mm stock USM IS lens.  I had read all the reviews for this lens on here first and decided to take a chance with this lens.  I did not see anyone mentioning using this for aircraft or aviation photography, but since this was the least expensive lens, I took the gamble.The lens fit my SLR fine and was simple to figure out.  My first test subjects proved to be impressive, and I think make a good case for this lenses strong point!  The pictures were of common household goods such as ceiling fans, my dog, etc.  It is good to know that this lens will function \"well enough\" for those purposes, but I noticed that it would hesitate, and not accurately focus.  It would \"hunt\" for the focus for a few moments, and only rectified by changing the zoom on the lens.  I wasn't too concerned here, as I specifically bought this lens for aviation photography.  I was not concerned with the lack of IS, as I keep the shutter speed fast for the majority of the shots. (1/500).After shooting a few hundred pictures today at the local regional airport, I came home to discover only 4 somewhat usable photos.  Almost all photos were either too soft, too blurry, or too out of focus.  Granted, I did use the auto focus feature on the lens exclusively, but the lens was taking soft photos throughout the various shutter speeds, focal lengths, etc.  I did intentionally vary shutter speeds and f/stops, but all \"action\" shots were blurry, including ones in the action shot setting on my Rebel.  Again, Even with the college class I took on photography, I'm not a pro and I very well may have changed a setting, however, with so few usable shots from today, I'm certain I did everything textbook.  I don't know if stopping it down would have yield any better results, but after doing all the tricks i could think of in the field, I was confident that I would have had at least a set of good pictures.I must state this, I was aware that the quality might not have been all there due to previous reviews, but as with I'm sure most of us, I cannot justify to my wife buying an L series 70-200mm lens (or better) now, and unfortunately after today's follies, I do not think she will let me ever take that step.Bottom line, this lens would be great for close-up still life (flowers, portraits, macro-attachments, etc) but NOT good with anything of movement or at distances, regardless of settings.  Also, AF is garbage.", "overall": 3.0, "summary": "Not good for Aviation photos, but might be ok for portraits", "unixReviewTime": 1252022400, "reviewTime": "09 4, 2009"}