{"reviewerID": "AO8IMELSF9A7F", "asin": "B00004THCZ", "reviewerName": "Theodore Fugate", "helpful": [0, 0], "reviewtext": "First off I'm going to say that I bought this lens used for $100. I read plenty of reviews and most of them talked about how the amount of sharpness gets really low when you get around 300mm. This is true. From my testing, 75-200mm seems to be the sweet spots for this lens. I shot a few pictures out in the woods at 75mm f/4 of my Dad and the bokeh was pretty awesome. I also shot some pictures of birds at 300mm and it's just very unsharp the second you crop. The only way I've found to get good bird shots is to be really close to them. This is very difficult unless you're at a popular park where the birds are fairly used to humans. Here is a picture I took at 300mm and is only very slightly cropped [...] I was only a few feet from this bird. As you can see it's a sharp image due to VERY minimal cropping. It is difficult to fill the frame with these little birds let alone get close to them. Here is another bird at the same exact place [...] This was shot at 155mm, it was at Clingman's Dome in Gatlinburg which is a very popular place which makes these birds fairly used to humans. I put down some nuts right next to myself and it walked right up and took them and that's how I got this picture.Pros and ConsPros:Takes great portraits at 75mmVery inexpensive for what it isFairly well built for the priceCons:You lose almost all sharpness once you crop above 250mmThe zooming is not very smoothOverall, who would I recommend this to?I would recommend this to any beginner photographer who wants to take pictures of their family or friends that may also enjoying wildlife photography. This would also be a great lens for someone who doesn't really care much about photography but wants a nice zoom lens to sit on their porch and take pictures of wildlife from far away (birds, deer, etc)TL;DR: Overall great value, absolutely worth the buy.", "overall": 5.0, "summary": "Value", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}