{"reviewerID": "A3BQPLQONW58RK", "asin": "B00004THCZ", "reviewerName": "Vinay Patil \"Vinay\"", "helpful": [35, 36], "reviewtext": "For the price range of $150-200, this lens is the cheapest in the Telephoto zoom lens range Canon offers. The cheaper price is because this lens does not have a quiet-n-fast focusing Ultrasonic motor (USM) and neither does it have an in-built Image stabilizer (IS). Instead it has a comparatively noisier DC motor which is not quickest to focus. Also the lens exterior surface is mostly made up of plastic and appears little cheap compared to the USM version or the IS USM.But in terms of picture quality this lens is not bad at all. In bright light with high shutter speed the lens performs at its best. The pictures come out sharp and clean (please check out the pictures I uploaded). In day light condition and at high shutter speed (1/100 sec and above), you can shoot really good pictures (even without a tripod). But I concede that in low light areas/overcast conditions/cloudy and evening light the lens shows its weakness. You will desperately miss the Image stabilizer function. But if you have a tripod then the lens works even in low light conditions and at shutter speed 1/30 sec or lower and an exposure of 1 sec to 15 sec.Now for the whiner's who have been complaining: When you see a Canon Telephoto zoom lens displaying a price tag of $150-200, what outstanding features do you expect in it? As I said before, this lens does not have an IS or USM, then how can you expect it to focus quickly like the expensive ones. Apart from the picture quality and the zoom capacity, it's basically wrong to compare the features in this lens with other advanced & expensive Telephoto zoom lens. Given its DC motor and as a Non-IS lens of course this lens is not meant for Sports photography. If you're a sports photographer then why be stingy and then whine? Go for theCanon EF 70-300mm f/4.5-5.6 DO IS USM Lens for Canon EOS CamerasorCanon EF 70-300mm f/4-5.6 IS USM Lens for Canon EOS SLR Camerasboth lens are great for Sports photography. But keep in mind, those two lenses are comparatively heavy to carry around as they weigh 25.4 ounces and 25 ounces respectively.  Compared to those the Canon EF 75-300mm f/4-5.6 III weighs only 16.8 ounces.So the bottom line is, if you're a photo enthusiast beginning DSLR photography, looking for low budget zoom lens, then this one will work best for you. For the given price and as a Telephoto zoom lens the Canon EF 75-300 f/4-5.6 III does what it's supposed to do.", "overall": 5.0, "summary": "A Telephoto zoom lens to begin your journey in DSLR photography", "unixReviewTime": 1233878400, "reviewTime": "02 6, 2009"}