{"reviewerID": "A312JTRQVEA4G7", "asin": "B00004THDE", "reviewerName": "Farb", "helpful": [16, 21], "reviewtext": "Originally ordered the Canon 18x50IS as an upgrade to my superb Canon 10x30IS.First 18x50 pair: ok for terrestrial use but displayed flairing on Jupiter through the right eyepiece (left was ok).  I exchanged them.Second 18x50 pair: Jupiter flaired in both eyepieces.  I then noticed that the flairing only happened when I turned on the IS.  I returned them for a refund.Ergonomics: the rubber eyecups must be folded back for these binoculars to be usable.  This helps make the eyepieces so big that there was not enough \"nose relief\" to get the binos close enough to my face to see the whole FOV without really jamming the binoculars in to my face (they left red marks on my nose).  After some searching, I found that many others had experienced the same problem, some literally took a pair of scissors to the the eyecups to increase the \"nose relief\".  Not a good thing to do to such expensive binos.On a clear night from my urban (Sacramento) back yard, I used these binoculars to detect M51 - something I never thought binoculars could do from my location.  Keep in mind that this feat took about 5 minutes of focused study knowing exactly where to look, and the indications of this faint galaxy that I managed to pick up were only perceptible 20% of the time.  While these still perform more like binoculars than a telescope, you do get that feeling of \"now your cookin with gas\".  Too bad my samples had bad optics and the ergonomics didn't fit my face.One more thing: these are heavy enough that after the novelty of a new toy wears off, you wont want to travel much with them.  The only use I see is astronomy, where you are reclined in a lawn chair with armrests on which you can comfortably brace for extended periods of time.I give my existing 10x30 Canon IS 5 stars, but cant recommend the Canon 18x50.", "overall": 2.0, "summary": "Two optical defects and a design flaw", "unixReviewTime": 1300233600, "reviewTime": "03 16, 2011"}