{"reviewerID": "A20DHSLIR6QPO0", "asin": "B00004THDE", "reviewerName": "Jimmy Dean \"Jimmy\"", "helpful": [2, 2], "reviewtext": "Just received the bins last night. I carefully opened the box and it was packaged very well. Kudos to the Canon Team! I was expecting a brick and it would weight a thousand pounds but based on the 12x36 I picked up in Las Vegas last week I knew it wasn't going to be an issue for me. I'm a big guy but not like Arnold and thought it was pleasant weight-wise. I actually thought it was light which could be a first! I thought I would try my rechargeable's at first and was disappointed that they didn't have enough charge. I tested the rest of my batteries and found a few that had a bit more charge. Unfortunately the Canon wanted even more charge as they only lasted 10 seconds so I broke out the batteries that came with the bins. They are 'not for resale' Panasonic alkalines. The 'lock' sound of the IS was much reduced with new batteries and the IS kicked in within a second or two max. Since it was night I pointed the bins to the sky and started to look around. Stars that you couldn't see with the naked eye magically appeared in the bins. It was stunning. And bright stars to the eye really popped in the bins making the 15x worth it and the brightness of the 50mm objectives definitely appreciated. The IS really really helps as the stars were shooting all over the FOV. It wasn't perfect but the shake was greatly reduced. The focus knob was perfect and it was easy to find the sweet spot. The pupil distance function was very easy to do too though it is different than other bins I've used. No issue there either. I actually like the eye cups and thought it would initially be an issue. I was happy this wasn't going to be an issue for my eyes (no glasses). I kept them extended and didn't roll them down. The front plastic caps fit as well as could be expected. I purchased the Canon objective plastic covers and they fit well. No issue there. I am giving this initial review a 4-star but after review of the bins during the day and I get better familiarity with the IS function with the batteries it may change (probably go up). I consider a 4-star very good only after using them for around an hour but only 15 minutes outside looking up in the sky.", "overall": 4.0, "summary": "Initial thoughts", "unixReviewTime": 1324425600, "reviewTime": "12 21, 2011"}