{"reviewerID": "A3BHLQE9PAJI0", "asin": "B00004THDE", "reviewerName": "M. Kelley", "helpful": [2, 2], "reviewtext": "I just picked up a set of Canon 18 x 50 Image Stabilizing Binoculars.I am really pleased with them so far. The pair is heavy at around 41 oz and solid as a rock build wise. The eye cups, as others have said are lacking. They crunch together on both sides of your nose as you press your eyes in to get a full field of view. They are less a problem with glasses as they are folded down and the distance between your eyes can be easier adjusted. I use glass about half the time. There is no front caps. I use some 58mm lens hood to protect them and cut down on glair. The unit comes with a tripod socket. I use it to attach my Black Rapid strap to it which seems to work better for me and allows me to carry another small binocular or camera around my neck.I have tried Canon's 10 x 42 IS, 10 x 30 IS, 12 x 36 IS and a pair of Fuji 14 x 40 Techno-Stabi IS binoculars. The Fuji pair is the only other IS binoculars I retain now. After trying all the different lower power units I came to the conclusion that the IS was more effective at the higher power. True the IS works great in the lower powers but I can hand hold them quite easily. I found my self spotting birds and things with the low power binoculars and then grabbing the high power ones to study what I saw. So I  dumped my money on the more powerful ones and use  the normal binoculars I already had (no IS) for locating targets. These are lighter and have a more familiar form factor.You might say - Why 14 and 18 power? They seem pretty close to the same magnification. I will try to explain.Canon's Image Stabilization is different from that that Fuji uses. The Canon binoculars lock down solid on your target like the things are on a tripod. But, they have a really tight effective sensitivity range of about 1% of vertical and horizontal movement freeze. The Fuji Techno-Stabi on the other hand have around a 5% effective range of steadiness. It is a pretty much \"like your floating\" sensation. I plan to use the 18 x ones for general use and the 14 x ones for use on the water (they are completely water proof) and for tracking fast moving birds and race cars and the like.I hope you find this blurb useful.The 18 x 50 is Canon's most powerful IS binocular. You will be happy with them if you take the plunge.", "overall": 5.0, "summary": "Hand Held Happiness", "unixReviewTime": 1399939200, "reviewTime": "05 13, 2014"}