{"reviewerID": "A3U760Q06JVW92", "asin": "B00004THDE", "reviewerName": "Tahir J. Naim", "helpful": [10, 32], "reviewtext": "Update:  I own them now! Bought the filter covers for the main lenses too and the lens caps. As some reviewers have noted these binos weigh a bit more than other binos due to the IS. Not too burdensome for a decent hike if you carry it postman-style over your neck and under an armpit and can still bring it around quick enough.  All things considered though I wonder if a spotting scope and a light monopod might not be a better choice for weight and magnification.  Perhaps for some, so far I'm sticking with this (and it's paid for).Original: First, I don't own these binoculars (yet), due to the cost and weight (they're over 3 pounds), but I've started saving my shekels based on the Bezos review and the Canon name.  Also, please note that these binoculars are 18x (not 50x as another reviewer suggests).  For bird-watchers it's worth mentioning that one should keep in mind the difficulty that many have in finding a bird through higher power binoculars after spotting the bird with one's eyes.  I have a pair of 12x50 Pentax binoculars that I like a great deal and have had only minimal trouble finding birds that I've spotted.  Others, however, don't have the same good fortune and so they prefer lower-power binoculars.  The Audobon Society (the last time I checked) recommends 7x35 binoculars, but the average age of their membership is somewhere north of 50, so most likely their reviewers are unable to hold steady the higher power binoculars (however, even our nation's elderly should do fine with these as they have image stabilization).  I'm curious to know how bright the image is (as I've read somewhere that 12x50 represented the best compromise between magnification and image brightness).  From the other reviews it certainly sounds like that's not a problem.", "overall": 5.0, "summary": "Suitable for bird-watching and 18x magnification not 50x", "unixReviewTime": 974592000, "reviewTime": "11 19, 2000"}