{"reviewerID": "A17HMM1M7T9PJ1", "asin": "B00004THDE", "reviewerName": "Timothy B. Riley", "helpful": [47, 47], "reviewtext": "I have been an avid birder watcher for several decades. I've owned most of the top-of -the-line European binoculars (Zeiss, Leica, etc.) over the years.  I purchased the Canon 12x36 IS binocs over 2 1/2 years ago and I love them.  However, thinking that more magnification would be better, I ordered the 18x50 IS pair a year later.  I have since sold them and use mostly the Canon 12 power.  Here are a few reasons why they were not right for me:*  Bigger is not always better.  The extra weight and size caused me to leave them in the closet and take the 12x36s, one of my other pair, or worst, no binoculars at all.  Even the best optics are no good if you don't have them with you when you need them.*  Smaller field of view.  It takes some practice seeing a bird with your naked eyes and then swinging the binoculars up smoothly so that you keep the bird (or any other small subject) in line with your vision.  As experienced as I am at this I found it harder to accomplish with the narrow view of these powerful optics.  Sometimes all you get is a few seconds to spot and identify a rare bird.  Quicker is better.*  Shallower depth of field.  With greater magnification the accuracy of your focusing becomes more critical due to a reduced range of focus.  With distant objects I found myself fiddling with focus knob more than I would like to.*  Less than the best optical performance.  Don't get me wrong, these are very sharp, high quality glasses, just not the best.  When viewing objects against the sun you can get a color flare, or ghost image (chromatic aberration).  Only the highest quality optical designs get close to completely eliminating this problem.  When you are trying to tell one bird from another closely related species, color is often all than you have to go by.I am still a big fan of the Image Stabilization technology and I still use my 12x36 IS binoculars daily, however, the idea that more magnification is always better, especially for birding, is misleading.  I am planning to buy the Canon 10x42 L series binos. In the past this magnification has been my favorite and the added benefit of IS will make it an even better choice.  The biggest reason for this decision is the superiority of the L class optics.  I own several L lenses for my Canon digital SLRs and they are superb.If you don't mind the size and weight, or you really need the extra power (like for astronomical observation) these are great binoculars to add to your collection.  If you looking one pair to use on a regular basis and you want the best optical quality combined with image stabilization, I would go with the 10x42 IS L glasses and save yourself the time and expense of buying the wrong pair.  But that's just my opinion. If you can, take a look at both of them in person before you buy one.Canon 10x42 L Image Stabilization Waterproof Binoculars", "overall": 4.0, "summary": "Great, But Not My Favorite Canon IS Binoculars", "unixReviewTime": 1212537600, "reviewTime": "06 4, 2008"}