{"reviewerID": "A2BFQZMGDGXC2M", "asin": "B00004THM7", "reviewerName": "S. J McCartin", "helpful": [38, 38], "reviewtext": "I just bought a digital rebel about a month ago.  Love the camera, my old 380EX speedlight integrates with the camera but just doesn't offer enough cycle speed to keep up with continuous mode on the Rebel. This flash does the job for the Rebel and the plug for the external battery pack promises even better performance once I grab that item.  Another big selling point that really makes this unit worth the cash, is that it has its own infrared focus assist lamp which the digital Rebel lacks.  When this flash is mounted on your digital rebel, you don't get that annoying set of quick flashes that the camera has to set off to focus in low light when using the built-in flash.  The Rebel body uses the infrared focus assist on the 550EX to focus the lens; this feature alone is worth the big bucks this baby costs.  The flash has tons of features that most of us might never use, but as a advanced amateur I'm glad they're there so I can play with that if I should choose to try out some fancy stuff.  The wireless slave capability is handy but you've got to have at least one more 420EX, 550EX or 580EX to use that. I like the digital readout on the back of the flash and also the two way bounce head, it's important to note that you have to press a button to make the head turn either side to side or up/down---this should make the head sturdier than I've seen on some units that get loose after awhile and drive you nuts. This unit is a HONKER--really big, and, no lightweight either.  Get yourself a big deep camera bag if you want to lug this thing around with you.  What's the difference between this and the 580EX? The 580 has very slightly faster cycle times and offers some fancy new automatic flash exposure bracketing modes, for me anyway it wasn't worth almost two hundred dollars more for the 580. All of the newer EOS camera bodies are fully supported by this unit, it also works on older EOS bodies but there are functions available on the newer ones that aren't there on older stuff.  I like this flash it covers well, cycles fast and the controls are fairly intuitive and easy to use.  When you get yours don't lose that book, Canon doesn't seem to have them online anywhere I can find and I've seen places that want to charge you 18 bucks for a new one.", "overall": 4.0, "summary": "Expensive but worth it, especially for eos digital rebel", "unixReviewTime": 1100736000, "reviewTime": "11 18, 2004"}