{"reviewerID": "A208OZ5XMMPKGS", "asin": "B00004TJ7O", "reviewerName": "\"smackdown221\"", "helpful": [46, 46], "reviewtext": "I had a very hard time deciding on just what digital camera I was going to buy.  Should I get a 2.x megapixel cam  or should I spend a few extra bucks to get the C-3000 zoom, which happens to be the lowest priced 3.3 with the features that this camera has.  Well, obviously I chose the C-3000 and I could not have made a better decision.  All of the features and extras are just the beginning of this cameras greatness.  I was absolutely stunned by the incredible quality of the pictures that this camera produces.  With a good printer and some photo paper, you won't even notice the difference between homemade pictures and professionally developed film pictures.  Even large 8 X 10 pictures are crystal clear with this cam.  When you first use this cam, you may be confused by the many options you have, but after a day or two of playing around and reading the instruction book, you will be able to make the most out of every photo.  If you are one of those people who absolutely hate auto focus, don't worry.  It has it.  It also allows you to control aperture and shutter speed, allowing you to leave the shutter open for a full 16 seconds, allowing you to create amazing effects.  By the second night I had the cam, I produced a neat looking picture of a car with the appearance of the lights tailing behind it thanks to the control you have of shutter speed and flashing.  If you just want simplicity, the C-3000 can do that too.  If you are not into being in control of your photos, just point and click.  If you do not like your photo, you can immediately view and delete it to avoid wasted space.  I can't even estimate how much film I have lost because of bad pictures that I wish I could take back.  If scenery is your thing, then you will love the panoramic feature.  With the aid of a tripod, you can make full 360 degree panoramics.  You take each part of the panoramic individually with the aid of the veiwfinder, and the computer software will combine the pictures allowing you to create a true panoramic, not the fake kind found in Advanced Photo System cameras.  If taking a panoramic seems to complicated for you, then just switch it over to movie mode.  Depending on the memory you have, you can record anywhere from 30 second to 10 minute video clips, all with sound.  If I were to continue listing all of the features, my hands would fall off from typing too much.  Whether you are an avid photographer looking for complete control of every shot or a person looking for a simple digital cam that takes great pictures, this cam is perfect for you.  There is one question about this camera that I do not feel that I could answer.  What can't the C-3000 do???", "overall": 5.0, "summary": "What are you waiting for?", "unixReviewTime": 981763200, "reviewTime": "02 10, 2001"}