{"reviewerID": "A1JUJGHMNIUSWR", "asin": "B00004TL5Q", "reviewerName": "John A. Johnson", "helpful": [0, 0], "reviewtext": "After two full days of fussing, I cannot get the Targus Wireless Keyboard to work with my Casio E200 or my son's Casio E125. I bought this keyboard after reading dozens of reviews of different wireless keyboards because the features looked good. There was some ambiguity about its compatibility with the E200 on the Targus web site, but the package itself lists the E200 as a compatible PocketPC.I first had trouble with the software installation program provided on the CD. The first window asked me what kind of operating system I was using, so I checked PocketPC. The next window popped up behind the first, almost totally obscurred, and all attempts by clicking or switching windows failed to make it visible. When I used the Task Manager to end the process that was listed as nonresponsive, another process took over and seemed to finish the installation properly. But when I tried to use the keyboard with my Casio it did not work.My next problem was with the support area on Targus. None of the FAQ seemed relevant to the problem. The best suggestion was to uninstall and reinstall, perhaps without any memory cards. So I did this (and uninstalling was not easy), but still had problems with the obscurred window and frozen process.Next I checked for an updated driver installation program. There was one, so I downloaded it and tried again. This version did not produce an obscurred window and did not freeze, so I thought I had it by now. But the E200 still did not work with the keyboard. I checked everything--the batteries in the keyboard were good. My IR port worked with another computer. I just could not get a connection between the keyboard and my E200.My son owns an earlier version of the Casio PocketPC, the E125. I tried using the Targus with this version, and it still failed to work.I looked around the Targus web site for a way to ask about the problem and found nothing. I can find no help from other Casio users on the Internet. It seems that everyone else is using either USB keyboards or a different wireless keyboard. I feel alone and depressed after looking forward to using this product. It does seem to have great features. It got some great reviews by users running the same operating system software on different pocketPCs, so I can't believe it doesn't work on mine. I wish I could figure out what is going on.", "overall": 2.0, "summary": "Does not work on Casio E200 or E125", "unixReviewTime": 1063497600, "reviewTime": "09 14, 2003"}