{"reviewerID": "ALRBBAELSG0X6", "asin": "B00004TL5Q", "reviewerName": "miradu", "helpful": [9, 9], "reviewtext": "The Visor is a perfect thing to help you in school. It isespecially good for taking notes. But what if you aren't that goodwith Graffiti? What if your writing is slow and you can't keep up withthe teacher? That's why the Stowaway exists. It is a full sizedkeyboard that folds up into a unit just larger than the Visor. Trustme, it's not just for students, anyone who needs to write more than afew pages a week will benefit from this.  The Stowaway is the bestportable keyboard I've ever used. It is rated for up to 7 millionstrokes per key. which is plenty. I don't think that you will be usingthe same Visor in 10 years, with the rapid increase of PDA technology.It uses the same keys as the IBM Thinkpads, but even compared to anylaptop I could get my hands on, I find the feel of it is unique in awonderful way. It might be that it uses a special kind of key, sothat, no matter how you touch the key, it will go down in a parallelfashion, so that all keys go down the same way. This is unlike theGoType keyboard, which uses a different kind of key, that is cheaper,and does not go down evenly. It's amazing that it's full size, and yetcan still be as small as my Visor. (Actually, it's a tad bigger thanmy desktop keyboard!). I've tried the GoType keyboard in stores, butjust couldn't get used to the small keys on it. The Stowaway is a workof art; it was even featured in a recent exhibit at the New YorkMuseum of Modern Art!I use my Stowaway everyday now, in school,at home, on the bus. (I'm writing this review on it RIGHT NOW!) It'samazingly simple. You unfold it, snap it together, bring out the standto hold the Visor in, and then you plug the Visor in.  Because of theinguinty in it, the Stowaway won best design for a computer product,from PC Magazine; Beating out the iPaq, and the Apple G4 Cube! It is alittle hard to get used to, try rotating it in, one side first, andthan the other. Turn your Visor on, and you are ready. The angle inwhich the Stowaway holds the Visor is just perfect. It is easy to readand to use. It's actually so nice, I now read all my Avantgo andeBooks with it, just tapping the down key to get more. It's a loteasier to read when it's propped up in the Stowaway...", "overall": 5.0, "summary": "Stowaway in use everywhere. In use at school It's awesome!", "unixReviewTime": 985910400, "reviewTime": "03 30, 2001"}