{"reviewerID": "A2AFT2VCH2S01B", "asin": "B00004TL5W", "reviewerName": "J. G. Heiser", "helpful": [11, 12], "reviewtext": "One of the annoyances of the Visor is the lack of implicit support for Ir synching.  I'm a big fan of USB, but it would be even better if I didn't need to carry any extra hardware at all.I lived for over a year with a Palm, and immediately dropped the cradle in favor of a cable.  This was the first accessory I purchased for my Visor.  Unlike the Visor itself, and the rip-off belt clip, this seems to be a very high quality product.  It snicks securely into the base of the Visor, and is easily removed by grasping both sides of the connector, which releases two pins on the inside of the connector.Many have complained about the difficulty of using the Handspring cradle.  Take heart, this is an easy in and out every time--it provides positive indication of physical connection.  The cable rolls up neatly and fits into a laptop bag.If you have only used a cradle before, it may take you a couple of minutes to get used to a cable.  It doesn't have a button.  When you synch, you'll need to turn on your Visor and tap the HotSync icon (mine's on the System menu).  Then click on the LocalSync icon.  Other than this minor loss of convenience, it works just like the cradle.Handspring support claims that it is possible to do an Ir synch, but I had already failed at the procedure they suggested:  buy the commercial IrLink software and download the latest desktop software from Palm.  If you do want to try this, beware that the Palm software doesn't support USB.  If you want to experiment with this before purchasing the USB HotSync Cable, you don't have to worry about losing data when uninstalling and reinstalling different Palm Desktops and HotSync Managers--I went back and forth several times, and my data and configuration were not changed.  Once you're thoroughly frustrated with that, buy the USB cable.", "overall": 5.0, "summary": "Get one if you travel--nice little cable", "unixReviewTime": 977529600, "reviewTime": "12 23, 2000"}