{"reviewerID": "A1RMT8M3X6SYFN", "asin": "B00004TRD9", "reviewerName": "Amazon Customer \"mobilvolt\"", "helpful": [1, 1], "reviewtext": "I admittedly bought this in a bit of a hurry, as it was for a nearly-late birthday gift for my son, who had just moved into a new apartment and wanted a router for his new cable service. The reviews for this model sounded good - and I have another model from Linksys that works fine - so I took the bait. Bad decision! If I'd read the review dates more carefully, I'd have noticed that most of them were many years old, going back to 2001 or earlier! This I failed to do, however (my bad, I know).I knew something was out of whack when I opened the sealed package, and discovered a layer of dust coating the top of the router. The included ethernet cable refused to plug into the back of the router - a bad cable end - so I replaced it with a cable of my own. Entering setup, I found a primitive UI and limited set of choices; there was enough there, though to set it up for what he wanted. But it was all looking older and older. . . !Unfortunately, the router wouldn't work right away, and after getting information from the cable company to no avail, we called Linksys support to get configuration help with our \"brand new\" router. We were told that it was out of warranty! No, I said, it's brand new! Checking the model and serial numbers, the tech assured us that it was indeed well out of warranty and offered to provide support for a charge of $29.95We turned down that generous offer and figured the configuration out for ourselves. Properly configured, it has worked fine for the last week. But I call it unethical to fail to mention in the product description that the new product you are purchasing is NOT COVERED by the expected manufacturer's warranty. Knowing that would have altered my buying decision.Prospective buyers, be aware that you will not be able to get support for this router without paying a fee - this thing has NO WARRANTY COVERAGE from the time you open the box. It may be new to you, but not to Linksys.", "overall": 2.0, "summary": "Blow The Dust Off, First. . .", "unixReviewTime": 1247184000, "reviewTime": "07 10, 2009"}