{"reviewerID": "ATW2I5S6S2PFA", "asin": "B00004TS16", "reviewerName": "A. Bowman", "helpful": [23, 23], "reviewtext": "I bought this camera at the end of August.  With the camera I also bought a 128MB compact flash card, an extra battery, and a carrying case.  I also recently bought Viking's IntelliFlash Memory Reader.The camera:Amazing size; it is literally about the size of a deck and a half of cards.  It fits into my pants pocket or my chest pocket without a problem.Great pictures, especially in daylight.  I went for a walk with my dog today and took a picture in the midday sunlight and I got back and it was fabulous.  But pictures with the flash aren't that great, unfortunately.  The foreground usually gets too bright and the backround not light enough.The 2X optical zoom is great but the 2X digital zoom doesn't do much I've found.  The resolution is good enough so that you can take a picture using optical zoom and then crop the part you want and it will still be a good sized picture.The software that comes with camera is adequate.  It lets you view the pictures you take and then edit them a little bit, extract redeye was the feature I used most.  But there are many other great features that I haven't really explored, but I have played around with a little.The battery:It probaly lasts about a half hour using the LCD screen.  But if you just point and snap using the traditional viewfinder the camera lasts very much longer.  It takes about an hour to charge with the included charger that plugs right into any outlet.  I would recommend buying an extra battery.Also I would recommend buying a carrying case, the Canon Powershot case is an excellent fit and also has a small pounch on the front for an extra CF card and/or battery.  I bought a 128MB card which is great when you go away for a while and won't have access to your computer.  But I found that I rarely fill up even half the card which holds 210 pictures at medium resolution.  The Viking Flash Reader is a nice touch, although definitely not needed.  It allows you to upload pictures a bit faster without wasting the battery of the camera.All in all here's what you really need:1. An extra battery pack.2. A bigger CF card, 48MB is sufficient, 64 is really nice.3. A carrying case to protect your investment.It's a lot of fun too!", "overall": 5.0, "summary": "Great camera, but some cons.", "unixReviewTime": 1010016000, "reviewTime": "01 3, 2002"}