{"reviewerID": "A11D3W4CFYZNHM", "asin": "B00004TS16", "reviewerName": "Bill T", "helpful": [0, 0], "reviewtext": "I've got a couple of digital cameras.  An Olympus 2500 and an Olympus 620.  Really like them,  they work well and the macro function of the 2500 really helps my Ebay biz.  BUT they are big cameras,  they have to reside in a large case,  they need all kinds of batteries,  in short they're a pain to lug around.I found the Canon on closeout at Compusa for a crazy low price. Should have bought every one they had, but lacking the bucks, I picked up one, intending to play with it for a day or two and then sell it off at Ebay for a nice profit.I'm still using it 4 months later.  I can't bring myself to sell it.  I've never opened the included 8mb CF card as it's stupid for Canon to even include a card if they're going to put one in that small,  it won't hold the equivilent of a roll of film.  There are lots of sellers of CF cards now priced right. I put a 128mb chip in that cost me less than $50.I've read some complaints about the battery.  I don't think those folks know what they are talking about.  As long as you are not messing around too much reviewing photos,  the included battery will last you all day. If not,  get a converter and plug your battery in your car for a quick recharge. No big deal.The lens is a bit slow,  and it really doesn't have the reach I'd like,  but that's fixable.  (...) buy an adapter and one of his monocular lens add ons. Works very well, but it's a bit of a pain to focus. Once you figure out how it all works together you can get photos of birds in the tops of trees with no trouble. Better buy a little tri-pod though.The best photos are taken by the camera you have at the time you need to take the photo. This camera and the others in it's line are pocketable and built to be hauled around. This is the camera that will take the photo you would have missed! The only reason I put this camera at 4 stars is the little 8mb cf card that comes with it. If they'd put a 32, I'd given 5 stars.", "overall": 4.0, "summary": "Need a tiny camera? Need  a Tough Camera? This is the one", "unixReviewTime": 1006041600, "reviewTime": "11 18, 2001"}