{"reviewerID": "A213UFMBOI3IUF", "asin": "B00004TS16", "reviewerName": "Bruce Boyes", "helpful": [34, 37], "reviewtext": "I was looking for a compact, rugged (I carry it hiking, skiing, boating, etc) camera which is easy to use. I wanted standard memory expansion (CF cards), macro mode, and if possible, a waterproof housing (for kayaking). This is the only camera with all these capabilities. Even with the waterproof housing it is small. The lens retracts and has its own metal cover so you don't need to fuss with a lens cap. The metal housing seems very rugged. Turn-on to ready-to-shoot is about 3 seconds. I'd give it  5 stars if the automatic modes were better and if there were true manual focus and exposure modes. For example, in auto mode you can't use the flash redeye reduction, you must be in manual mode for that. The auto color balance is often fooled by dense clouds. You need to use the manual exposure adjustment in backlight or bright light conditions such as with snow in the background. The dynamic range seems not quite as good as the Kodak DC260. The macro mode works well, although it takes some practice since the camera doesn't clearly indicate when it can't focus. The white-LED backlit LCD is very bright and crisp, even in sunlight, and relatively easy on the battery. The panorama modes are wonderful. Buy at least two batteries and you'll never run out in the field. High-res photos take 1-1.5 MBytes each so you want a CF card sized accordingly. It's so small and light, even with a spare battery, you really can take it anywhere. In auto mode anyone can use it as a point and shoot camera. The manual modes give you a lot of control over exposure and white balance (but there is no manual focus or manual exposure). 1600x1200 means really good, cropped 5x7 prints and acceptable 8x10s. There are better cameras but none anywhere near as light and compact. It's a little jewel.", "overall": 4.0, "summary": "Smallest digital camera which is any good - &amp; waterproof!", "unixReviewTime": 975024000, "reviewTime": "11 24, 2000"}