{"reviewerID": "A3TRPVAGT3NWBS", "asin": "B00004TS16", "reviewerName": "Cliff Bauer \"Cliff\"", "helpful": [12, 12], "reviewtext": "My first impression of Elph S100 was that there couldn't POSSIBLY be room in the thing for anything other than a battery and a memory card. Somehow, the engineers at Canon did it, and the results are nothing less than astounding.Three things make this camera a particularly good buy:First, and most importantly, its size makes it SO CONVENIENT. I have had absolutely no qualms dropping the S100 in a bag or pocket and walking out to a birthday party, a sports event, or whatever--space simply isn't an issue with this camera. As a result, I have taken some of the best shots of friends and family with the Canon.Second, the feature set is basic, but very easy to use. The power button is a simple button--no toggle thumb switches with multiple settings that can sometimes be confusing. Switching between viewing and capturing modes is simple and straightforward, and even the more advanced features (such as changing the flash mode) are easy to figure out even without reading the manual.Finally, the &quot;built in&quot; lense cap is a big plus. I didn't realize how nice this &quot;feature&quot; is until I briefly used a friend's digital camera and had to remove and replace the lense cap WITH EVERY SHOT. The built in cap seems insignificant with light use, but when taking many shots over the course of a few hours, the S100 really shines.Photographers should be warned, however, that the S100 is not a professional-level camera by any means. The 2.1 megapixel resolution, while not meager, is not enough to yield even high-quality 5x7's. Serious cropping of a photo is usually out of the question because of the limited resolution.So, if you will be using your camera as a &quot;fun&quot; camera--for casual pictures--look no further. This is the one. If you're serious about picture quality, compare the S100 carefully to its larger siblings--the S20, and the G1.Overall, a fantastic little camera.", "overall": 5.0, "summary": "The Perfect Camera for &quot;Fun Photos&quot;", "unixReviewTime": 992649600, "reviewTime": "06 16, 2001"}