{"reviewerID": "A11HV501OX9MNV", "asin": "B00004TS16", "reviewerName": "Dani Nymeyer", "helpful": [4, 4], "reviewtext": "I bought this camera for the same reason many of you are considering it, or have already bought it--it's size.  It is amazingly small, it's hard to believe all that has been packed into this camera.  I take it with me everywhere,literally, it is so small that I am able to keep it in my pocket, and I don't have to fear that it will get ruined in my pocket because it is so durable. There is also a small covering for the lens, so you need not worry that the lens will get scratched.The picture quality surprised me, when I first saw this camera I saw how small it was an instantly assumed that the picture quality would not be good--but I was wrong!  The picture quality of this camera is outstanding (taking its' size and price into consideration).However, I do have a few things to complain about...First off, the battery.  This camera uses a lithium battery, I find lithium batteries to be highly inconvenient; because what if you are on vacation, where the nearest place to buy batteries is just a gas station--there is no way that you are going to find lithium batteries there.  Not only is it inconvenient, but also the battery life span is short.  The longest I've had it work was about 1 hour and 45 minutes.  This isn't uncommon in cameras, though, just as long as you bring your charger and spare batteries, you should be fine.Another problem I had with this camera was the zoom function.  Such a small zoom length that you would think that the zoom would be silent since it hardly zooms in...wrong!  Very wrong.  The zoom function on this camera is so loud that sometimes you will be unable to use it if you find yourself in a situation where you must be quiet.  Even just turning the camera on will move the lens a little, resulting in a noisy start-up.The flash is very weak.  Really dissapointing. If you are inside, you can't be any farther away then 10 feet in a lit room.The last problem I found with this camera was the macro function.  The auto-focus on the camera seems to have trouble focusing on the subject.  To make matters work, there is no manual override to overcome this problem.  The focus is great, though, if you are not taking a macro shot.These are all the flaws I found in the camera, it's not my first choice in cameras, I have come across many other beginner cameras that I prefer over this camera, but the thing you have to keep in mind about this camera is the size.  If you are just looking for something to keep with you at all times, then this is a great camera choice.", "overall": 4.0, "summary": "One of the better *compact* cameras for beginners", "unixReviewTime": 1103673600, "reviewTime": "12 22, 2004"}