{"reviewerID": "A3EJDV2RTFROU4", "asin": "B00004TS16", "reviewerName": "David Hurwitz \"DaveH\"", "helpful": [7, 9], "reviewtext": "I have had a Canon Digital Elph for several months and am thrilled with the camera.  While it has its limitations - lack of a good zoom, anemic flash and hard-to-see viewfinder, it takes great pictures and is exceptionally easy to tote around.  I have not used the highest resolution mode and have been quite satisfied with 8X10 prints printed on my HP 890 or sent to Ofoto.  The panorama mode can produce spectacular results and by the way is an easy way around the limitations of the camera's 2.1 megapixel resolution.  If you play around with the size of your panoramas, you  can print pictures larger than 8X10 that will be as sharp as your 8X10's.  If you don't have a large format printer, use a printing service for that special photo.  I have been blown away by the instant feedback I get from a digital camera and the Elph has made photography a lot more fun.  Often, it's the only camera I carry, but I still lug around an APS SLR with a big zoom when I'm doing serious photography.  I have been rather surprised how well some hand-held night shots come out.  I've gotten pictures at dusk that are reasonably sharp and show much more detail than I would expect from the camera's ISO 100 rating.  It is essential to have a second battery as your battery will always run out when you need it.  I use Lexar CF cards, they come with a USB cable and transfer pictures 3x faster than the camera.  Set the camera in &quot;manual&quot; mode, which is still basically automatic, as it allows you to choose all the flash modes available.  In addition, set the camera to remember the last settings or you will have to put it into manual mode each time you turn it on.  Unlike a lot of digital cameras on the market, the Elph is easy to use and carry and feels like a camera.  Its menus are a little complex but people who don't find features that are there and complain about difficulty of use just haven't studied the manual.  I have recommended the camera to my friends on this basis:  in 5 years it will be obsolete but it will still fit in your pocket and you will still be using it for snapshots.", "overall": 4.0, "summary": "Canon Digital Elph", "unixReviewTime": 981763200, "reviewTime": "02 10, 2001"}