{"reviewerID": "ATWGAAUYYLACR", "asin": "B00004TS16", "reviewerName": "H. Prinsloo", "helpful": [23, 23], "reviewtext": "I ordered this camera and received it not even a week ago. I have seen photo's on the internet but believe me..there is nothing like the real thing! This one truly makes you fall in love with it the first time you see it.When you buy this cam...also get an extra battery, flash card and protective case. Many tips has already been said in these reviews so I'm going to add to it. One review said that the person had tremendous trouble installing the software on a Win98 platform. My first installation was succesfull. I used Win98 second edition to help with the installation. Something you should keep in mind. The SP100 only supports USB transferring of data to your PC. So you need a USB port attatched to your motherboard. The latest boards has a USB port. But the older ones ( which is not that long ago ! ) does not have a port and you have to buy a USB card to plug into your motherboard. I had to do that.The rest of the installation and connection to the camera is mind blowing easy and quickly ! Downloading photo's to your pc is like saying 1,2,3.Then something another reviewer said. Sometimes the photo's tend to be a bit dark. Quite true. But you CAN force the flash to stay on. You also can set the flash on Slow-Syncro mode which adjusts itself to the slow shutter speeds. You can also set the exposure compensation and the white balance.There are a few more things the cam can do. I will name some of them. Shooting continuously, ( 2 images per second until you release the button), a timer ( takes a photo after 10 seconds ), shooting close-ups, stitch photo's together, replay images on your TV (realy cool), and taking black and white photo's.The software is okay...nothing to rave about ! What would I like to see improoved.....definetely the zoom capabilities !!But overall...a beauty !", "overall": 5.0, "summary": "Dynamite comes in small packages...", "unixReviewTime": 983318400, "reviewTime": "02 28, 2001"}