{"reviewerID": "A8EDTKSPOMRWK", "asin": "B00004TS16", "reviewerName": "hyperbolium", "helpful": [29, 29], "reviewtext": "I replaced my Canon S10 with an S100 within only a few months of the initial purchase.  Even with its relatively compact size and rugged construction, I found myself leaving the S10 behind more often than not. It was light, it was small, but it wasn't light enough, and it wasn't small enough.The S100 solves that. For the most part, it is an S10 in a smaller, lighter package. Slipped inside your coat pocket, or hanging off your belt in a case, it's barely noticeable.  But take it out to shoot, and the quality and flexibility will astound.As with the S10, the S100 is easy to learn.  Unlike the S10, there is no secondary display on top to provide information on shooting mode, pictures remaining, etc.  The color LCD on the camera's rear shows overlay menus and stats to provide this. In other digital cameras, this might be a serious negative: using up valuable battery power. But given how miserly the S100 is with electricity, the arrangement doesn't seriously impact the number of pictures you can take.And you can take a lot of pictures.  By adding a larger compact flash card, such as the Viking 128MB, you can capture a short vacation's worth of pictures without downloading.  A choice of three different resolution/compression settings helps conserve memory.  The rechargeable battery (included) will nearly see you through the entire 128MB, depending on how much you use the LCD display for shooting and editing.  With a second battery, you're virtually assured that you won't run out of power during a day out. The recharger is multi-voltage, so with a plug convertor, you can recharge your battery in many foreign countries.The electric frugality also means that you're free to edit your shots on the go, snapping a half dozen or more in any circumstance, and deleting all but the best.  This is great for shooting pictures of the camera shy.  They're assured that you're only keeping the &quot;good&quot; shots.  It also works well with children, as you can provide them the instant gratification of seeing the picture only seconds after it's been shot.  (This isn't particular to the S100, obviously, but its battery life helps!)A few negatives of the S100: (1) the flash slot is CF1, rather than CF2 (as in the S10 and S20), which means no microdrives. (2) The flash is weak, as might be expected in a camera of this size, and located so close to the lens as to just about guarantee red eye. I've gotten some spectacular examples of the latter. With post-processing you can mitigate the red-eye, but it often takes an artist to really eradicate it. (3) The controls are small, and may be difficult for some fingers. (4) The shutter lag is substantial, making it very difficult to capture action (although the continuous shooting mode helps).  (5) The 2x zoom often leaves me wanting. The 2-megapixel resolution helps, as you can often blow up the middle of a shot and still have sufficient pixels for a smaller print.The programmed exposure modes are adequate, and the manual settings can help, but at its heart, the S100 is a happy snapper. Great for snapshots, but frustrating for sophisticated photographers who find themselves in unusual lighting.  The panaromic mode, combined with the photo stitching software works well.One can discuss the merits and demerits of the 2- and 3-megapixel cameras on the market, but if portability is your primary concern, the S10 is hard to beat.  No matter how good your camera, it won't take good pictures while sitting in a drawer.", "overall": 5.0, "summary": "The &quot;take everywhere&quot; 2.1 megapixel choice", "unixReviewTime": 990662400, "reviewTime": "05 24, 2001"}