{"reviewerID": "A1EARN5PUVIF1S", "asin": "B00004TS16", "reviewerName": "Jerry P. Danzig", "helpful": [63, 64], "reviewtext": "I'm a writer and new to digital photography.  I've owned a few 35mm cameras over the years, including one SLR and two point &amp; shoots.  I had been waiting for the prices of digital cameras to come down before  taking the plunge.  This year, with a cruise to Nova Scotia coming in  August, I decided the time was right and just purchased a Canon S100  Digital Elph.  I must say, I think this is the coolest camera I've ever  owned!  First, it really is tiny; the size of a pack of cigarettes, maybe  a scooch deeper.  The included battery charger is larger!  Second, it is  incredibly easy to use.  I just went on a quick photo shoot in NYC's  Central Park today, and what a bunch of beautiful photos I took, if I do  say so myself (and I do!)  The camera is as easy to use as a point and  shoot, and with instant review on the LCD screen, you can retake any  flubbed shots on the spot.  The two-times optical zoom operates smoothly  and quietly, and lo and behold, a two-piece shutter-like cap automatically  slides closed over the lens when you turn the camera off. I also had no  problems installing or running the camera software on my PC.  I'm still  learning about file sizes (and how large is too large to email), and I did  erase one photo I wanted to keep as I was getting used to the menu system.  But otherwise I am thrilled to have taken the plunge into digital  photography.  And there are two more advantages to digital photography  which I hadn't anticipated, beyond the lack of film and developing.  One is  the lack of censorship of your photos -- time for some, uh, fashion  photography of your wife or girlfriend, if that's something you both would  enjoy!  Another is the ability to upload images from your PC to a memory  card in the camera.  This is a great source of personal entertainment for  travelers, if you catch my drift, and you can zoom in on the LCD images!  I  would also recommend Canon's soft case for the camera, which has a slot to  attach to your belt along with a second nicely finished compartment to hold  an extra battery or memory card.  As other reviews have noted, you will  definitely want one or more additional memory cards.  I've found I can get  from nine to twelve compressed 1600 X 1200 photos on one 8MB card, or 28  images uploaded from my PC.  At any rate, if you have been interested in  digital photography but the price and confusion have held you back,  consider the Canon S100 Digital Elph.  It really is the perfect travel  camera, plus it offers the convenience of digital photography.", "overall": 5.0, "summary": "The World's Smallest and Cutest Digital Camera", "unixReviewTime": 964137600, "reviewTime": "07 21, 2000"}