{"reviewerID": "A3FTI86WAVJOLG", "asin": "B00004TS16", "reviewerName": "John A. Radi \"jradi\"", "helpful": [99, 102], "reviewtext": "It's the same body as the popular ELP2 APS camera (take a look at a standard credit card from your wallet and you'll have an idea of the front profile!).  A 2X optical zoom (you can pretty much ignore any time a  manufacturer refers to &quot;digital zoom&quot;)Size naturally means  pricey - [and] may seem a little bit much for a point and shoot camera  but but it has one feature which sets apart from all others: it's small  enough that you'll have it with you!  Being a gadget guru - I've owned  about a dozen cameras and this is the first one that I always carry around.The next two features which are equally important in any digital camera  you're considering:2.  Compact Flash Support - Smart Media memory is too  expensive, in short supply, and doesn't seem to be growing in capacity as  quickly as Compact Flash.  So CF seems to be the way of the future in  &quot;digital film.&quot;3.  USB support.  Sure, there are floppy  adapters and serial cables which are cheaper - but they're SLOW!  Imagine  copying a 2MB picture through your floppy drive - it would take several  MINUTES vice a few seconds via USB!  If it's cumbersome, you're not going  to use it.  Not only does this have built in USB support (great for sharing  files w/ other PC's), but Compact Flash USB readers are getting cheaper and  that'll save you battery life when downloading to your own pc.The rest  of these features are all on the same level.... 4.  Rechargeable battery.  While it's more convenient to have a camera that uses generic batteries (AA  or AAA) that usually means bulky and not as efficient.  This camera has a  proprietary rechargeable Li-ion battery that comes with a little device so  you can plug it right in the wall and recharge it.  Very compact, recharges  in about 2 hrs, if you're just taking shots using the viewfinder and  letting the camera show you the shot for &lt;2 seconds (best method) then  you can average over 250 shots per recharge!  If you're using the camera's  LCD to take shots then you'll drain the battery in about 85 shots (not  recommended)5. Built-in lens cover.6.  All metal housing - very  durable.  Except for the Compact Flash door - which is plastic (why! ) it's  a very durable casing - unfortunately I'm a little worried about that CF  door!Comments:**No LCD to view memory status, etc...  However, the  LCD window is used to display information.  Can hardly blame Canon, this  thing is so small there's no place to put an LCD panel!**Very few manual  controls, and image quality settings.  There are 3 settings and on the 8MB  included card you can store 4 / 12 / 46 photos depending on which  resolution you choose.  I'd recommend buying a 64MB card asap, and just  take all photos at the highest resolution - you can always decide later to  scale down photos on your pc...**Playback mode.  I had my first camera  for nearly a year before I realized what a benefit it was.  On the fly  share your photo album in anyone's house in their living room, vice  computer desk - makes it easy for sharing with a lot of people.  The Canon  has a unique feature which allows you to flip Vertical pictures (when you  take shots with the camera held vertically).**Very Quick Camera.  The  Elph has an large image buffer so you can take rapid series of photos  quickly.  Depending on image setting, anywhere from 3/9/45 shots before it  dumps to CF Memory (which takes 3 seconds).  Other cameras don't have this  feature and you might have to wait 3 seconds per shot!**Image Quality.  On a scale of 1-10 I'd give it a 9.  Highest resolution prints decent  8x10's which is about all I'd ask from a digital camera.  It's fixed at ISO  100, so it's not exactly a lowlight camera, but it does fine with flash.That's about it - I hope you enjoy yours!", "overall": 5.0, "summary": "Who says size doesn't matter!", "unixReviewTime": 966643200, "reviewTime": "08 19, 2000"}