{"reviewerID": "AHY2KG32696ES", "asin": "B00004TS16", "reviewerName": "SL", "helpful": [19, 21], "reviewtext": "If compact size is your highest priority in a 2-megapixel camera, the Canon PowerShot S100 Digital Elph is a standout choice and aptly named for its diminutive design. The S100's image quality rates in the middle of its class, but it can still be a reasonable choice for students, families, or small businesses looking for an ultra-portable camera that weighs less than half a pound with media and battery pack.The jury rated the S100's prints in the middle of the pack, but its overall image quality results fell at the low end of the midlle for 2-megapixel cameras. Color balance measured better than average, with a noticeable blue cast in images shot under outdoor lighting conditions. Though the S100 only offers center-weighted metering, we overcame a tough indoor-exposure situation by using both exposure and focus locks. Other 2-megapixel cameras offer a more powerful zoom lens and more image-control settings.The flash worked fine for shots taken at the maximum-rated distance under indoor lighting conditions, but it overexposed images taken inside at the minimum-rated macro distance. We were impressed with the sharpness of macro images captured outdoors with no flash. Standard shots taken without flash under outdoor lighting conditions showed slight underexposure but accurate color. The S100's panorama mode worked effectively, as did its burst mode, in which we captured one shot per second at the high-resolution and high-compression settings and three shots every 4 seconds at the high-resolution and low-compression settings.The S100 feels balanced in its shiny stainless steel case and flattens to a smooth, flat box when the lens retracts; an integrated cover protects the lens when retracted. External control buttons are minimal, because you adjust most of the setting through menus, but, unfortunately, the relatively small LCD and small menu font present an operational challenge.The S100's bright LCD displays a graphical menu system which attempts simplicity, but misses the mark and leads you back to the User Guide to clarify navigation and features at every turn. It can be frustrating to use the small LCD to take advantage of the camera's effective panorama mode, but better that than using the viewfinder in this mode. The S100 can be ready to capture your first shot in 3 seconds and subsequent shots every 7 seconds.Compared to others in its class, the S100 is well equipped and designed, with both a USB interface and convenient access to batteries and media when the camera is mounted on a tripod. The included software bundles together a valuable mix of applications, particularly the effective image-stitching software for panorama-mode shots.", "overall": 4.0, "summary": "not bad--for better quality pics get 3.1Mpix or higher", "unixReviewTime": 985564800, "reviewTime": "03 26, 2001"}