{"reviewerID": "AASSDFY9K6G2T", "asin": "B00004TVSP", "reviewerName": "Abdulrahman Aljabri", "helpful": [17, 17], "reviewtext": "This two page review contains two sections. The first section details the benefits of flash photography over household bulbs. The second section reviews the Vivitar flash. The bulk of this review is dedicated to the first section. When I first researched the Vivitar 285HV I was completely new to flash photography. In the process I wasn't completely sure if this flash would be good upgrade. I am pretty sure most people researching this flash are also new to flash photography. So I have included the first section to help them understand the benefit of flash by answering the same question I had back then. Overall I think it's a good upgrade.Whether you are upgrading from household bulbs or following Strobist this flash is an excellent choice. The Vivitar 285hv is affordable, reliable, and to an extent versatile. For me this flash has solved many problems I was facing with household bulb lighting including:FIREPOWER: flash produces much more power in an instant compared to household bulbs; by as much as 10 stops more vs. a 250W bulb. For example, I used to shoot portraits at 5.6 1/60 @400iso. Now with the flash I can go 11 1/200 @100iso using at full power, that's a big improvement! I don't have to worry about soft pictures because of camera shake at low shutter speeds as flash fast duration takes care all of that up to 1/1000 of a second. Neither do I have to worry about getting noisy pictures because of high iso.POWER RANGE: This flash can be controlled by 5 stops. Actually 4 stops but with a 5 stop range as follow 1/1, 1/2, 1/4, 1/16. I am not sure why they skipped f8 but the flash can be made to fire at that power level by setting it to 1/4 and inserting a 1 stop gel in front of its lens to reduce its output to 1/8.CONSISTANT COLOR: To control the lighting ratio between main, background, hair, kicker, etc I used different bulbs with different watt output like 250 main 100 background. Different bulbs have different color temperatures and that introduce major color balance problems. Even worse as time goes by same power rating bulbs would shift in color temperature. Using this color balanced flash minimizes this problem to no more than 200-400k which is in the range of tolerable.HEAT & CONSUMPTION: bulbs used to heat up the subject so much and they were really bright, so bright that most people would quickly start to sweat and squint. Flashes don't have model lamps and their burst is so short that it's impossible to be annoyed by it unless looking directly into the flash lens.This flash also opened many new opportunities for me including:COLOR EFFECTS: I can insert gels in the included wide angle holder to obtain any color I want. The flash will work with the Rosco sampler nicely. I also can color correct my flashes to balance with ambient light. For example, if I am shooting in a fluorescent lit room I can always slip a green Rsoco gel from the same sampler to make the flash light match room lighting in color temperature. Since the Rosco sampler gels are a bit smaller than the lens surface area they have to be placed carefully to fully cover the center of the flash lens. That is where the light originates from so that section has to be fully covered with the gel. I could not do any of this with bulbs because the continuous heat would gels would melt.MOBILITY: This flash is small relative to a light bulbs plus fixture and reflector. Even better it works off batteries so it's very easy to take it anywhere. In general I get between 150-200 flashes from a fresh 2000 nimh batteries. Now I can go out of my home studio and do on location photography like office portraits very easily. One padded gym bag is all I need to include everything.MODIFIERIS: This flash is easy to use modifiers as there plenty made for it like Honol snoots and grids and Lumiquest reflectors, etc. Also it can be adapter to work with standard studio equipment like umbrellas and softboxes. Plus they don't emit any heat that would otherwise damage modifiers.SIMULTANEOUS EXPOSURES: Since flash is controlled by aperture only (shutter speed remains constant at camera sync 200 or 250 for most cameras) reducing the shutter speed allows more ambient light in the same scene. You have to try this to understand how versatile this is. For continuous light photographers this is a game changer. You have to experience this yourself to understand its value.In a sense all flashes offer the same benefits listed above. The Vivtar, however, stands out in value and reliability. For a price below the one hundred mark, the Vivitar 285hv is the only flash that offers a) 60Ws power output which is at par with Canon and Nikon top of the line flashes, b) full manual control with proprietary sync plug, and c) tilt and zoom head.Additionally the flash is made of high quality plastic. The finishing is equally well made and doesn't feel like cheap plastic at all. The head tilt and zoom action is very solid. New models are camera sync safe, as they have voltage below 6V. This is important to pay attention to because after getting your first Vivitar most likely you will look for adding 1 or 2 more to your camera bag. If you decide to buy used you have to watch out if the model is old as they can have sync voltage as high as 250V, which can fry your camera.Except for sync voltage this time tested flash didn't change much over the years. Old models still fetch 50% value in the used market which is a testament to the quality and reliability of this flash. Hence, I consider buying Vivitar flashes new a good learning investment because they maintain high resale value when you decide to upgrade to studio lights for example.Plus you can grow with this flash for a long time because allot of dedicated and third party accessories are available to keep you busy experimenting with it. Best of all this flash is very consistent in power and color temperature output. Hence, there is really no reason for replacing them with more professional options.On the down side, the Vivitar doesn't come free of some disappointments. The most apparent of which is the missing 1/8th power level. The flash power dialer skips that setting because Vivitar decided to skim on the cost of the dialer. It's also missing a rotate head which is standard on modern flashes and mono or pc connection. Instead the flash comes with a proprietary connection that requires a cable to be connected to the flash to which a pc cable can be connected. This cable comes standard with the flash, but it's annoying to use because it's easy to lose the small cable and worse it doesn't provide a very secure connection. Make sure you are looking away from the flash as you connect that cable because it has a habit of firing the flash prematurely.The Vivitar 285hv doesn't come with an optical slave. The most practical slave for this flash is the Wein peanut which very small and plugs directly to the proprietary connection. Its so small and convenient to use that you can literately forget it's connected to your flash. There is one problem with this slave it doesn't work with the new Vivitar when the flash is being powered by rechargable NiHM batteries. With such batteries the produces less than 6v through the hot shoe. In order to use the peanut you have to use disposable alkaline batteries. There are, other slaves that will remedey this problem but none are as small and convenaint to use as the peanut.Recycling times are a bit slow. With fresh batteries installed expect to wait few seconds at full power. Side note: the optional Vivitar Power cord will only work when alkaline batteries are inserted, which somewhat defeats the purpose, but improves recycle speeds. The flash is also pretty bulky when compared to modern flashes and weights considerably more.For manual flash photography the Vivitar 285hv is only second to the Lumopro 120, but for the price it's the best deal around, period.", "overall": 5.0, "summary": "Second best manual flash on the market", "unixReviewTime": 1246665600, "reviewTime": "07 4, 2009"}