{"reviewerID": "AII45TUQ5UKPS", "asin": "B00004TVSP", "reviewerName": "Duncan C. Spaulding \"Duncan\"", "helpful": [0, 0], "reviewtext": "I'm going to briefly describe my level of photography before I dive into this review to put this into context (if you don't care about context just skip to the next paragraph). I've been into photography for two years. During that time I've been \"bitten by the shutterbug\" as they say, and I've devoted myself to photography: pouring over dozens of books, thousands of articles, and countless images learning the art. I'm relatively new to strobist photography; I got an SB900 for Christmas and since then I've fallen in love with off-camera flash. This Vivitar 285 HV is my second flash unit. The camera I primarily use is a Nikon D300.REVIEW:It's clear this flash is from a different era (The instruction manual is Copyright 1985) . At one point in the instruction manual it says something the long the lines of \"try shooting a roll of film to experiment with this feature.\" As such, there is no iTTL/eTTL. *GASP* You'll actually have to decide the proper exposure for yourself. As my technique improves and I gain more experience with off-camera flash, I noticed that I relied less and less on the SB900's TTL capabilities. I'd shoot manual at the camera and manual on the flash.As I said before, this flash is old, but it feels like a workhorse in your hands. With a solid build and sturdy mounts I've read reviews of people who have been using a Vivitar 285 HV for 15+ years and it keeps slugging away.The power of this cheap flash is incredibly powerful. I've done an experiment comparing the flash output of the SB900 to the Vivitar 285HV, and I must say I'm quite impressed (please see this link for the test: [...] )It's pretty clear that with the extra $300 you'd drop for an SB900 you're paying for the optical slave, and the fancy iTTL electronics. Buy this flash.", "overall": 4.0, "summary": "Inexpensive-- not cheap!", "unixReviewTime": 1282003200, "reviewTime": "08 17, 2010"}