{"reviewerID": "A2MCZOZ2X2ZQYK", "asin": "B00004TVSP", "reviewerName": "hobbyist-2006", "helpful": [101, 101], "reviewtext": "I compared the 285HV with Sunpak 383 Super and I found out these differences and similiraties:1. Both are non-brand specific Manual/non-TTL auto flash for use in practically any camera with standard hotshoe.2. Both have the same Guide Number of 120.3. In Manual mode, they can slice their power output from 1/1 to 1/16th except that the 285HV is missing 1/8th.4. In non-TTL auto, the 285HV has four auto-aperture settings while the 383Super has only three.5. The 383Super can do vertical and horizontal bounce (swivel) while the 285HV can do vertical bounce only.6. The 285HV has zoom positions to cover 35mm, 50mm and 105mm focal length lenses. It also includs an extra-wide flash head adapter to cover 28mm focal length. The 383Super has no zoom position and can cover only 35mm focal length and up.7. I havent measured the sync voltage of the 383 Super but I am sure that the 285HV has a sync voltage of 6V DC as I measured it myself.8. The 383 Super locks on the hotshoe by turning a screw while the 285HV has a one-action locking lever.9. The 285HV has a lovely illuminated (yes!) calculator dial which is practically a tiny work of art! Its a pity though it has no varnish of some sort to protect its surface markings from scratching.I can live without 383 Super's additional swivel and 1/8th power ratio. I need the 285HV's direct, brute light power when shooting inside high-ceiling rooms and dim conditions where I cannot approach my subjects. The zoom-capable flash head helps in this situation because it boosts precious flash range just a bit more than what the 383 Super can.I can also use the extra-wide adapter when using the 18-55mm lens of the D40 at 18mm. In film terms, 18mm focal lenght on the D40 is 27mm- just perfect for the 28mm extra-wide adapter.I prefer the one-action locking lever of the 285HV. The locking lever makes the flash more stable as compared to the turn screw on my other flash.Of course, the 285HV has none of the programmed high-tech artificial intelligence of expensive flashes (say,a Nikon SB800 or a Canon 580EX), other than its auto-thyristor and manual controls. However, in its auto thyristor mode, I found it to be accurate. Sometimes in tricky situations (say, a white board behind your friend) it under-exposes, as expected. But thanks to the digital SLR where I attach it to (Nikon D40), I can quickly make corrections on the spot by examining the LCD! Easy!Although plastic, Vivitar build it well. Solid feel with no loose parts which are not supposed to be loose. Overall, a beautifully made simple flash. But for what it was made to do, from my experience a least, it does very well, consistently and reliably.", "overall": 5.0, "summary": "Vivitar 285HV or Sunpak 383 Super? Your Choice", "unixReviewTime": 1195689600, "reviewTime": "11 22, 2007"}