{"reviewerID": "A2TLISI5OZ83UK", "asin": "B00004TVSP", "reviewerName": "Thomas Ford \"rcman50166\"", "helpful": [3, 4], "reviewtext": "I had a change jar where I collect all my change. By the time I dumped it I had $95. I went to a coinstar and, to avoid the coinstar tax, got an Amazon receipt. With the money I got this flash. It is very affordable (obviously) and there is a reason. The majority of the adjustments you need to use yourself. Call me inexperienced but I still can't figure out how the calculator on the side works. But nonetheless I get excellent results. The light fill is equivalent to any Canon Speedlite. The reason, again, for the Vivitar's relatively cheap price is because most of it's controls are manual, where the Speedlite is automatic. BUT, this can be a good thing. If you are looking to your first flash this is a good candidate. With it's lack of automatic control, the user can learn how the amounts of light can affect a photo. It is a good learning experience and I have learned a lot. (This being my first external flash)The build quality comes across as cheap. Possibly a 6 out of 10. It is made in Japan (Good quality camera equipment usually comes from there. If it's made in China STAY AWAY.) The foot is made of plastic so one drop will probably break it. So just be careful when handling it. It uses 4 AA batteries. It says not to use rechargeable but I do and it works fine with no ill effects. It comes with a slide-in diffuser. Lets just say I'm getting a better one for Christmas. I have also heard these make great satellite flash units because they are plentiful and cheap. The Vivitar 285HV is not damaging to the camera because there is no high voltage feedback.A bit of my background for credibility's sake. I own a Canon SX10IS and photography has been a hobby for around 9 months now. I realize I have a point and shoot and should have a DSLR. But I do not have a lot of money and wish to pursue photography more. So, for now, I use a high end point and shoot. I have submitted my photos to many places, including my university. Many of my photos have been published in news articles. (Probably just because I have my camera all the time so I get rare shots)Edit:It has been 4 years since I wrote this review. This particular unit still works! The plastic foot i worn out at this point though. The lock doesn't do anything. I am now a professional photographer and own three Vivitar 285HVs. They are still my light of choice as they are very easy to use. I use them in my portable studio with umbrellas. The 6000K bulb temperature makes it very easy to white balance. It is only 500K off from natural sunlight (5500K). The Vivitar 285HV has held up to the test of time. This only confirms that this flash is a great product.Since I last posted my camera, I have upgraded to a Canon 40D and 60D.", "overall": 4.0, "summary": "Very Good Flash", "unixReviewTime": 1259539200, "reviewTime": "11 30, 2009"}