{"reviewerID": "A2SIYIHLRRM7J1", "asin": "B00004TVSP", "reviewerName": "Travis N. Nelson", "helpful": [3, 3], "reviewtext": "I looked into purchasing this flash on a recommendation from a friend who is into strobism.  At the time, it didn't seem like Amazon carried it (which was unfortunate because I had a gift card to use).  Then on a whim a few days later I decided to take a look again and there it was, so I scooped it up right away.  I have a Cactus (Gadget Infinity) wireless trigger kit on the way as well, which should be here this week.I got the flash today and have been playing with it and learning a bit more about it.  I was curious if it would work on my Canon Digital Rebel 300D (6V max hot shoe).  I did some digging around because I was afraid to damage my camera, and found information on how to check the voltage given off by the flash.  Some places said all 285HV flashes are &lt; 6V, and some places say they can be as high as 12V.  To be sure, I used a voltmeter to check it a few times (search online for \"voltmeter 285HV\" to learn how), and it came in at only 4.5V.  I tried it on the Rebel and it works GREAT.  Based on what I've read online though, if you do buy this, make sure you check it.  As low as mine registered, apparently some can be slightly over 6V.  I'm not sure I'd be fully comfortable using it on my 300D if it was even slightly over.  If I understand correctly, newer models of DSLRs, including the XT and XTi, can accept up to 250V.  Make sure you find out and test first!I have much to learn about using the manual flash, but a few photos into it I was able to get some good pics.I haven't taken too many shots yet, but so far so good.  If it holds up, I've no doubt I'll be very happy with this flash long term.  This thing is BRIGHT.At the price you can get it here at Amazon, it's well worth it.  I will likely pick up another soon to upgrade my strobist set.", "overall": 5.0, "summary": "Just got it, but so far so good! (Works on Canon 300D!)", "unixReviewTime": 1209600000, "reviewTime": "05 1, 2008"}