{"reviewerID": "A2R6RA8FRBS608", "asin": "B00004TWVY", "reviewerName": "Matthew G. Sherwin", "helpful": [14, 15], "reviewtext": "TDK manufactures excellent six hour blank VHS tapes for all purpose general recording of audio-visual media. As long as you have the right kind of equipment, these tapes record television programs off TV or they can be used to make copies of a non-copyright protected VHS tape. These tapes have up to six hours worth of blank recording space; and this is useful when recording television shows, for example.In addition, you can record onto these tapes using different speeds so that the tape records two hours worth recording time, four hours worth recording time and six hours worth of recording. (You use your VCR to set this.) The best image quality will be at two hours worth of recording time but many people say they're satisfied with the image they get using the six hour recording time speed.The tapes allow you hours upon hours of viewing enjoyment because you record onto them over and over again countless times although after some use the picture quality will eventually begin to gradually deteriorate.Unfortunately, these tapes cannot produce the same quality recording reproduction as a digitalized copy would give you. This means that if, hypothetically, you were to copy a DVD-R onto another DVD-R instead of a TDK blank VHS tape, the quality of the audio-visual media on the DVD-R copy would be sharper and clearer than a TDK tape or any other brand of video tape could give you. Moreover, VHS tapes can break if not handled with care. These shortcomings frustrate me and therefore I will have to take off one star to make this a four star review.The tapes have small pieces of plastic on the narrow front edge of each VHS tape which you can punch out easily so that accidental recording over an existing recording is impossible. If you do wish to record over an original recording then you can merely place a small amount of regular tape over the hole. The VHS tape is now ready to record a fresh recording.Overall, TDK makes a great choice when you want reliable blank VHS tapes to record television shows or anything else that you wish to record. I have used this brand for many years and I cannot think of any major complaints. I highly recommend TDK six hour VHS tapes for you to use when you need to record something onto a VHS cassette tape.", "overall": 5.0, "summary": "all right by me !!!", "unixReviewTime": 1197936000, "reviewTime": "12 18, 2007"}