{"reviewerID": "A2SD0UPTBP3T0F", "asin": "B00004TX6Z", "reviewerName": "Stephen Dupre", "helpful": [3, 3], "reviewtext": "The Pentax K-x (and Pentax SLRs in general) are small.  With the 18-55 lens and lens cap & filter on, this Mini camera bag is a tight fit.  You can't really use the inside pocket in the lid, because it makes the compartment even smaller.Pros- compact, well padded, great price.Cons- I question the use of a zipper on the ~4\"x3\" lid flap (even though it's covered with a quarter-sized leather flap). It's just one more thing that can scratch your viewfinder over time.  (most of the 1-star deduction is due to the poor implementation of this storage feature)- hard to get my K-x camera in it in a hurry.  The camera strap needs to be carefully put in around the edges of the camera for the top lid to close...  It's hard to avoid scratching the viewfinder with parts of the strap.- for the K-x, only the outside pocket of the holster is useful, not the lid pocket.Given the small size (mostly height) of this holster bag - for arguably the smallest SLR camera - it seems this bag was designed - and is more suitable for - the \"super-zoom\" - SLR-like style cameras that are generally not as tall from lens to viewfinder.This is a great bag for a not-too-expensive SLR if your camera fits, with the caveat of that semi-exposed internal zipper.  I wouldn't put a $500 or up camera in it.Update: 3/6/2010:  I decided to move up one size larger to theLowepro Topload Zoom 1 Camera Bag (Black)bag.  The specs say it's 1.25\" taller and a bit wider than the Mini.  But, having both side-by-side, and because both are wedge-shaped, the Zoom 1 is *noticeably* wider and taller than the Mini.The result:  The Zoom 1 has at least 1\" spare room at the top with my Pentax K-x inside (w/18-55 lens) and at least 1/2-1\" more  side-to-side for the camera strap.  Ahhh...Also, the LowePro Zoom 1 bag has 2 1\" -removable- inside Velcro'd straps at the top of the bag to stabilize the camera position.  The LowePro Mini does not.The Velcro strap feature makes the Zoom 1 a much better choice than the Mini for securing your mid-priced SLR, and is worth the extra buck or two over the Mini.", "overall": 4.0, "summary": "Little snug for the Pentax K-x with 18-55", "unixReviewTime": 1267660800, "reviewTime": "03 4, 2010"}