{"reviewerID": "A2Y9CTL628GL7K", "asin": "B00004TX71", "reviewerName": "M. Donnelly", "helpful": [3, 3], "reviewtext": "I'm a somewhat new and budding amateur photographer, and to go along with my Canon XSi (Rebel 450D) I decided to pick up the Lowepro Topload Zoom 1 (TLZ1) camera bag.For those who don't like reading long reviews, I'll say it upfront--this bag was exactly what I expected it to be.  I bought my XSi with the kit (18-55mm IS) lens, and the camera body with lens attached fit perfectly.  The bag is not too large to carry around, and easy enough to open.  It holds the basic accessories--extra battery, extra SD card, Lens Pen, and even my user manual--I'm new and always curious about the settings in my technology, so occasionally I'll use it as a quick reference.I do like the design of opening away from the body--this allows a bit easier access since the flap falls away from you.  This keeps the bag open a bit better when trying to fish around, though I don't really keep anything in the main compartment other than the camera/lens, so there's rarely any fishing to be done there.The size of the side compartment is nice, and since it has small pockets within the zippered compartment, you can organize a bit more neatly if you have a system.  (Used/full battery/memory cards on one side, empty on the other, etc.)  It's never that tough to access either since it's in the side that faces away from the body when strapped on the shoulder.My one problem with this bag is in the interior main compartment.  I do own another Lowepro bag, and inside the main compartments of both are small subspaces for memory cards, etc.  In my other Lowepro bag, made for more carrying space, the subcompartments are velcro, and there is a microfiber cloth that can be lain across the top of the camera to prevent scratches to the screen if the camera is positioned in a vertical orientation and the LCD is facing upward.  This bag, on the other hand, has a zippered compartment, with no microfiber cloth.  In the closed position, this zipper is covered by a small flap that should prevent scratches, but I am just slightly uneasy about it, because if I forget to zip it ALL the way closed, the zipper may be loose enough to scratch.  Also, the actual material of this subcompartment makes me a little nervous--it's RELATIVELY soft, but it doesn't take much to scratch or scuff LCD screens if pressure is added, so I am a bit more cautious when using this bag.  Still, the interior does feature two velcro pieces which can be moved in order to properly support your camera inside the bag, which is always a nice feature to have, even if you rarely or never adjust them.The only other minor gripe I have with this bag is that the strap leaves a bit to be desired.  It's a bit thin, and the padded section isn't that well padded.  However, since this bag is of a smaller variety, you probably won't be carrying as much weight, so it may not feel too harsh on your shoulder.  On a long hot day, however, it may become a bit of an irritation.  I'm considering swapping the strap for another, since it's relatively easy to do.  Note also, I'm somewhat new to DSLRs, so I'm still adjusting to the weight of the camera in the first place.  After time, this strap irritation might go away just from becoming accustomed to the camera's weight in general.  But again, the strap is a minor gripe since you can replace it with ease for not too much money.I would like to note that larger lenses may be a problem for this bag.  In trying to fit my new Canon 70-300mm 4.5-5.6 IS lens in the bag attached to the camera, it is simply too long for the bag.  The bag may be able to squeeze closed, but it wouldn't be something I'm comfortable doing with such an expensive piece of equipment.  I would expect anything an inch or two shorter would be fine, but my lens, even when taking up the least space possible, fully retracted, simply will not fit.  However, this is made to be a more compact bag, so it was to be expected, and this does not detract from its overall use.", "overall": 4.0, "summary": "Solid Bag at a Low Price", "unixReviewTime": 1250985600, "reviewTime": "08 23, 2009"}