{"reviewerID": "AAJIGWE242MSN", "asin": "B00004TX7E", "reviewerName": "C. Stoneham", "helpful": [49, 50], "reviewtext": "OK, in an attempt to find the \"perfect\" backpack, I ordered this one (LowePro Mini Trekker AW), the Tamrac Expedition 5 and the Kata R102.  I ran them through their paces and guess what I found?  None of them had everything I wanted.  That being said, I settled on the Lowepro.  Details below...BACKPACKS IN GENERALThe Bottom Line:Simply put, it seems that it's nearly impossible to find a backpack that combines comfort with capacity.  The Kata R102 was, by far, the most comfortable, study backpack of the 3 but was hands-down the \"smallest\" pack space-wise.  There was hardly any room for manuals (my D70 manual and SB600 flash manual bulged the one pocket) and very little storage for \"trinkets\" (it all fell loose).  The Lowepro and Tamrac packs had ample room, but were only semi-comfortable on my back compared to the Kata.  So I had to decide between capacity and comfort.  Since I really want a \"carry everything\" pack, the LowePro won out (being cheaper when compared to Tamrac and having a better \"fit\" on my back (6'4\")).THE LOWEPROThe Good:Of the three, only the LowePro was configured in a way that you could carry two \"ready\" cameras.  Of course all 3 would carry a second body and lens, but not \"assembled\".  The LowePro has room at the bottom for a second camera pointing toward the top of the pack.The LowePro has the best \"non-camera\" storage system, with a system of mini slots and pouches for things like PDAs, iPods, books, etc.  The Tamrac had this, but it was one big compartment where they would all jostle around.  The Kata's was non-existent (literally).The LowePro and Kata both have a true weather-proof cover but the LowePro stores it away in a built-in pouch in the bottom instead of taking up a \"lens slot\" (like the Kata, which is already space-limited).The LowePro is the cheapest of the three (always a plus)The Bad:Not much \"bad\" that I can see, aside from the fact that it's not THE most comfortable of the three, but it certainly beats out the Tamrac which was the least comfortable of the three (for me)The Ugly:Of the 3, the LowePro has, by far, the worst tripod carrying system.  Sure, the \"hideaway\" tripod puch is nice, but the supplied system of *elastic rope* is flimsy and seems to have been included as an after-thought.  The compression straps can be crossed and hooked to the \"wrong\" side as a fix, but one shouldn't need to \"fix\" anything at these prices...I decided on the Lowepro (as I said above) because I wanted a \"carry everything\" bag that would fit on my back.  What I get is a nice \"gadget bag\" that fits comfortably on my back for a run through the airport.  I do NOT have a backpack, however, that would work for a several-hour hike.  I have a pack that's good for the State Fair so I have what I need and my wife can fit a few things she picks up as well.  It will NOT be good for a day-trek through Paris.  Then again, if I'm hiking in the woods or sight-seeing through Paris, do I really want EVERYTHING camera-related on my back?  Probably not.  I'm more likely to carry a small sling/fanny-pack for the camera, a zoom lens and maybe a flash.When all was said and done, the LowePro struck the best balance of comfort and space.  Space management was best in the one and comfort was second only to the Kata (which I preferred most of the three but lost out because of severe space restrictions).Bottom line: You're not gonna be satisfied with what you get ;)  At this price range, none of the backpacks serve up everything (my Dad and brother, who are also amateur photogs agree).  The LowePro WILL, however, serve your immediate needs and save you a few bucks to investigate other options.  It's sturdy and wears well for short periods of time (maybe an hour or two tops) and will DEFINTELY carry everything you might for a two-camera system (assuming you can share secondary lenses between the two).Hope this helps!PS I have no clue why this pack is showing up as \"unavailable\" on Amazon at the moment.  Odd...", "overall": 4.0, "summary": "The \"perfect\" backpack does not exist (for under $150)", "unixReviewTime": 1136160000, "reviewTime": "01 2, 2006"}