{"reviewerID": "A1F9Z42CFF9IAY", "asin": "B00004TX7E", "reviewerName": "T. Tom", "helpful": [2, 4], "reviewtext": "I actually use the Canon 200EG photo backpack and it's about the same as this Lowepro, but for a lot less money. Sure, it's not quite as well made and sturdy as this Lowepro but it's also not nearly as expensive. While I wouldn't really hesitate to buy this Lowepro, especially if it were a bit cheaper, I'm very happy with the Canon backpack as I get nearly the same functionality (minus the built-in all weather sheath) for a lot less.A note about the layout-I like this style photo backpack better than the type where the camera gear is placed in the bottom of the pack and the top part is for other items. This style is more space efficient-it can hold more lenses and photo gear in the main compartment, yet the outside dimensions of the bag are less. Granted, you do have to take the pack off and set it down to access it. But I tried a Tamrac backpack (the kind where the camera stuff goes in the bottom part of the pack) before buying the Canon one and I found it way too big and not any more convenient to use as I had to also remove that one from my back to access it. In the end, the Canon pack (and this Lowepro) holds extra stuff too. In the flap pocket, I can fit a shirt, light lunch and other items like a magazine. In fact, I can even fit a small laptop in the main compartment (in a separate laptop slipcase for protection). I would say a 13\"-15\" laptop would fit fine, but not a 17\" or larger one.If you want something that you can work out of without having to take it off and yet carries all of your photo gear, I doubt you will ever find it. I would instead recommend a shoulder bag that you carry only one or two lenses in (for weight reasons) for walking around with, and a back pack for transporting all your stuff. I also use the backpack for long walks/hikes and it works fine not fully loaded too. In other words, just because you can take every single photo item you own, doesn't mean you have to or should.", "overall": 4.0, "summary": "Great quality backpack but a bit expensive", "unixReviewTime": 1177200000, "reviewTime": "04 22, 2007"}