{"reviewerID": "A1B00KVE1YFKCR", "asin": "B00004TY7Q", "reviewerName": "Michael B. Carroll \"hobbitt\"", "helpful": [9, 9], "reviewtext": "EDIT (2006-03-26):After a couple more weeks, I have to downgrade this to 1 star.As noted below, this is a headless 'pod and your camera attaches directly to the unit.  Friction is what holds the two together and so the two have to be screwed together firmly.The problem is this: the screw on the 'pod is a bit less than 1/4\" long (4mm actually).  This isn't long enough to get a solid connection with my camera (Olympus SP-500UZ) and the threads on the camera socket have been stripped by tightening the pod/camera connection.  I can no longer use this 'pod with my camera.If your camera can handle the short screw, this is a 5-star monopod.  Otherwise it's not usable; 1-star (and don't bother buying it).Unfortunately, Amazon won't let me change the product rating.----------I've been using this unipod for a couple of weeks now and I like it.  Lightweight, sturdy, compact, great price.My digital camera weighs just under a pound.  When attached to the 'pod (it screws directly onto the top), the assembly can be easily balanced in one hand as I walk.  Expand it fully and it gets a bit unwieldy, but nothing major.I'm six feet tall.  When the 'pod is fully expanded, the camera monitor is at my chin so I sometimes need to stoop a bit to get a good view of my shot.  Not a big deal.  Shorter folk can adjust the 'pod to exactly the right height.A unipod is not going to replace a tripod for stability.  But it has helped the photographs I take using 10X zoom, which is why I bought it.  (I find the 'pod helps up/down; less so forward/back and left/right.  All what you'd expect.)I've carried a smallish tripod on past walks. The unipod weighs less and sets up easier.  I like it better, even with the lesser stability.  The clips are quick, if a bit stiff, and I can work them with my gloves on.One thing to note is that the unipod is \"bare head\".  Your camera will attach directly to the 'pod.  There is no pan, tilt, etc., except for what you do by tilting the 'pod.  This can be difficult when shooting shots close to straight up or down.  You can buy add-on heads, but I don't know what that would do to the weight and balance.I've seen a review someplace that mentioned using the 'pod as a walking stick.  It's pretty sturdy, but I don't think it would stand up to trail abuse.  And I sure wouldn't like my camera getting jarred every other step!The foot of the unipod is a plastic bumper.  It screws upward to reveal a small spike -- presumably for better traction, but perhaps because the designer had a fondness for James Bond-ian gadgets.  No idea if the airline security folks would allow this as carry-on.", "overall": 5.0, "summary": "My first (not-so-great) unipod", "unixReviewTime": 1142294400, "reviewTime": "03 14, 2006"}