{"reviewerID": "A2V2XRUGEYYCGG", "asin": "B00004TZJI", "reviewerName": "Thomas Glebe", "helpful": [0, 0], "reviewtext": "I know (though not epistemologically speaking) there are probably a LOT of older style, studio monitor, aging hipster, over the ear, cushioned headphones out there, but for the price, these Panasonics are great.  For 99.99 percent of you out there looking for this STYLE/TYPE of headphones, but aren't Bill Gates, you can't go wrong here.For one thing, the overall sound reproduction is fantastic.  Bass is favored here over high treble or midrange frequencies, so if you have an equalizer on your computer or music playing device, it might help.  For those with such cababiltiies, you will be in headphone heaven with these.  I use these mostly for computer music/sound, so computer programs with equalizers work perfectly.  Still, even when I use them on my stereo television, the bass is in no way overwhelming without equalization, and in fact, these actually add to the in-home theater sensation of watching films originally in movie houses but now so easily available on video or DVD or cable.  Even watching various TV programs broadcast in \"stereo\" is a kick, as these have great left and right channel separation.  While wearing these and remoting through various cable channels, you'll immediately know (and how) whether you're tuned to a mono or stereo broadcast station.These are very comfortable headphones, and can be adjusted as much as one needs to, and the inner cups are large enough to not cause earstrain stress on anyone except Dumbo the Elephant, I'd suppose.  In other words, these are great for extended listening.The really long cord allows one to watch TV or play video games from an extremely convenient distance.  There is also a cool but small volume control about a foot or so down from the actual headphones, which means that if you're a distance from your remote or TV and want to increase or decrease the loudness, it's very easy.  The long cord CAN get in the way sometimes, and is way too long for use with portable devices (though you can always just use a twist tie to shorten the cord length), but for computer and/or TV use, you can't go wrong for the relatively low cost of these headphones, and I have little to complain about here.  These are easily worth twice what they're going for.If you're looking for an older style, over the ear, noise cancelling pair of headphones with great sound, comfortable fit, and long cord for both computer and tv/home theater/video games use, buy them now.  I seriously doubt you'll be disappointed.", "overall": 5.0, "summary": "Excellent for the price!", "unixReviewTime": 1105228800, "reviewTime": "01 9, 2005"}