{"reviewerID": "A2STLT852H9K75", "asin": "B00004TZJQ", "reviewerName": "Jane Avriette", "helpful": [71, 71], "reviewtext": "I recently purchased this model after comparing to the Koss unit. What clinched the purchase for me was actually going to Panasonic's site and checking out the specifications. This is the headphone they sell with their portable DVD units. I bought this set of headphones to go with my new laptop, which also has a DVD player, and I thought they would be useful for that task.The effect of the noise cancellation is very nice and something that isnt very easy to describe. The best term I can come up for it is &quot;active silence.&quot; You can &quot;hear&quot; something in that the &quot;something&quot; you hear is different than the ambient noise, but its just dead quiet. Very useful when youre working around computers.The sound quality and the construction of the unit are my two beefs.First, the headphones do hiss a bit. There is an audible background hiss just having them plugged in. This does go away pretty well when the noise cancelling is turned on however.I have had to create an equalizer setting for them because their range seems a little odd. The low range on them is about right, but the mids are weak and the highs are too strong. So its necessary to turn the highs down, turn the mids up, and the medium-low range down. This is easy enough if youre using a computer with an equalizer that supports presets. It might not be so easy with, say, a discman or something similar.Second, somebody reviewed this unit and said that they &quot;pinch&quot; a little and that the ear muffle is shaped incorrectly for human ears. This is mostly correct. Because the unit folds in half, there is a constant tension against your ears, which the pads on the phones do not really protect you from. I noticed that taking my glasses off eased this pain in my ear. However, not having my glasses on makes using the computer futile. They get real uncomfortable after about two hours of use.Would I buy them again? Well, maybe, if the price was dropped $20, and I had a chance to try out the Koss unit. Otherwise, I think the only real reason to purchase them is so you can wow your friends and tell them they have noise cancelling. Hardly worth $110 for that.", "overall": 3.0, "summary": "'Toy' factor not quite worth the price of admission.", "unixReviewTime": 983145600, "reviewTime": "02 26, 2001"}