{"reviewerID": "A1MWYPWY444AHF", "asin": "B00004U12J", "reviewerName": "Donald Kirson", "helpful": [27, 29], "reviewtext": "I wanted to add information to complement some of the other reviews.  I, like most of the other reviewers, am very impressed with the PC100.  Before buying I did a lot of research and read reviews from many websites, including this one.  Three issues have been mentioned that I have not found to be a problem.1.  Some people comment that the sound recorded by the built-in microphone picks up the hum from the camera motor.  I agree that there is a loud hum coming from the camera when the camera is operating, and you can hear it if you play the tape back in the camera using the on board speaker.  However, when I play my tapes back through a television, the sound is outstanding (and there is no hum).2.  The second reportedly unfortunate feature is the zoom control, which is supposedly placed awkwardly.  Now, I don't have very large hands, so that may be a difference, but if you hold the camera as illustrated in the manual (i.e., like a water pistol), with your third, fourth and little finger curled around the camera's base, your index finger sits directly on the telephoto button.  I have no trouble using it.  If you try to jam all your fingers vertically up through the strap and hold it like a regularly sized camcorder, it won't work well at all.3.  People also complain about the size and placement of the buttons.  The buttons seem fine to me.  I don't have to do anything extraordinary to press them.  I once hit the backlight button by mistake because of its position near the standby/record button.  It made a gathering I was filming look as if God had just walked in, but an icon appeared immediately in the viewfinder informing me of what had happened. I quickly turned it off and contined filming.  I have never made that mistake again, now that I know what to look out for.I would recommend this camcorder without reservation.", "overall": 5.0, "summary": "Sony DCR-PC100 is fantastic.", "unixReviewTime": 977097600, "reviewTime": "12 18, 2000"}