{"reviewerID": "A1WVMDRJU19AFD", "asin": "B00004U12J", "reviewerName": "ODB", "helpful": [19, 19], "reviewtext": "Ive had this camera for 9 months, and I have grown very attached to it. I've beat the crap out of it and it still works fine, a good sign.It fits in ones hand like a crazy optical-recepting hand gun.  After time and experimenting, one grows accustomed to its grip and it's small size makes the human subjects less nervous, almost as if no video camera is there, just a miniscule receptor of their realtime image.If you have a friend with one of these too (Scheeronious), you can firewire the 2 cameras together and do some improvisational editing and recording of footage, easily.infrared night-vison, with &quot;old movie&quot;  to make night shots mystical... overlap fading face-morphing,  Luminscennt effects. Manual exposure adjusting to tweak the lighting, in conjuction with slow-shutter surrealism.  &gt;&gt;&gt; The camera give you a lot of room to play.I use the memory stick all the time to capture stills off my prerecorded footage.  I like the small 640x480 jpegs, its easier to work with in photoshop, transfers quick, save-em-stright-to-floppy or email-em size.  If one really wants high quality pics one has to capture the live still straight to the stick. raltime capture even makes a simulated digital &quot;cli-click&quot; sound of an SLR camera when you hit the photo button.  Sony style at its best.This camera is great on an airplane, to watch all your old movies in-transit, and catch stills off of them.  If you really wanted to, you could easily record tv, movies etc.., and watch it on this camera on the plane almost like a MiniDVD player.Problems: 1. You can't use fader and digital effects at the same time. 2. You can't activate digital effects with the LCD closed. 3. The built-in microphone doesn't pick up low bass frequencies real well. 3. upgrade this camera with a wide angle lens, and extended life battery, and 32 meg stick.  Wide angle is a must, it creates a more immersive viewer experience.", "overall": 4.0, "summary": "Sony Style!", "unixReviewTime": 982195200, "reviewTime": "02 15, 2001"}