{"reviewerID": "ATOFTVML8LX4D", "asin": "B00004U3AW", "reviewerName": "A. Tubesing", "helpful": [63, 65], "reviewtext": "I have had this camera for about six months now.  As a serious ammateur photographer for 15 years, I swore that I would still use my film camera for some things, but I haven't touched it.  I take this Sony everywhere.  This camera is a great all-around digital camera.  It is compact, easy to use, the menus and controls are easily understood, and it takes great pictures.  I was thinking about getting the S30 without the video feature instead, but I am very glad I got the video.  I really like the video feature and I use it a lot.  Below are a few major points you should consider about this camera.First of all, no other digital camera brand I have seen comes anywhere close to the lens quality of the Sonys.  The marco (close-up) setting allows you to take a picture from literally a half inch away from the subject.  Most other digital cameras with macro settings let you get as close as a couple feet.  This means that when you can get, at closest, a full-frame picture of your whole hand with other digicams, the sony lets you zoom all the way in to just a fingernail.  Incidentally this camera also has a text-capture mode which I have used quite successfully for taking pictures of blueprints and other documents.  These kinds of images show up nicely on the computer screen.Secondly, This camera is fully mac-compatible.  It comes with a USB cable and software that actually does work on the Mac.  When you connect the camera to the cable, it shows up on the desktop just like a drive.  The only problem I have had is when reading files right off the disc - sometimes it thinks there's a problem with the drive.  If you first transfer them to your hard drive and then view them there's no problem.Some rules of thumb for file size:  A high resolution pic (1600x1200) typically takes about 900k, so I figure about one meg each.  The medium res (1024x768) is about 300k per pic, so I figure about three pics per meg.  These are still pretty high resolution pictures.  The lowest res (640x480) pics take about 100k each (a nice size for emailing).  That's about 10 per meg.  On video mode, the high res (320x240) takes about 100k per second, so about 10 sec of video per meg.  The low res video mode (160x112) does about 40 sec per meg.  So with the 4 mb memory stick that comes with the camera you can get about 4 or 5 high res pics, 15 med res pics, 40 low res pics, 40 sec high res video, or 160 sec low res video.  So in summary, get more memory.  I bought two 64 mb cards and they lasted a whole 4-day vacation, and I am pretty snap-happy.The one problem that I have to complain about is that there is about a one-second delay between pushing the shutter button and the actual capture of the image.  (And I am not talking about the  wait time for writing the file, I am talking about the actual moment of the photograph)  This means that if you are taking pictures of subjects in motion you will have to anticipate the moment and push the button a second early.  If you take a lot of action shots, this camera will proove frustrating.  Often a critical moment will have passed by the time the camera actually takes the picture.  Baby pics, wedding dance pictures, sports shots, all of these are very hard to do with this camera.  For regular static subjects this is not a problem, but for objects in motion this camera is difficult.All in all I highly reccommend this camera.  Happy shopping.", "overall": 4.0, "summary": "Great all around digicam, and it's truly Mac compatible!", "unixReviewTime": 975715200, "reviewTime": "12 2, 2000"}