{"reviewerID": "A204ETWOV23HO4", "asin": "B00004U3AW", "reviewerName": "David J. Huber \"Addicted to books!\"", "helpful": [48, 49], "reviewtext": "I bought one of these about 6 weeks ago as I write this, and have fired a couple hundred pictures, and a couple of short videos through it.  Wonderful! It takes great pictures, and the videos (with built-in  microphone) are pretty cool, too. While the controls seemed a little  unwieldy at first, once I pulled out the manual, I needed less than an hour  to go through the options and see how everything works, which isn't too bad  of a learning curve at all. The LCD viewer is great - I can edit and delete  images while shooting, thus saving some precious memory stick space.  I  have appreciated that the LCD viewscreen can also be swiveled around  laterally and vertically, even to point forward, so I can take a picture of  myself and, at the same time, see myself in the viewfinder.  Brilliant! The  flash does a great job of illuminating scenes.  The camera also offers  ability to adjust for white based on indoor, outdoor, or &quot;other&quot;  conditions (sounds dumb, I know, to have &quot;other&quot;, but trust me,  it makes sense).  This is my first USB peripheral, and I have to say I am  impressed - I can pull down a full 32MB memory stick pretty darn quick, and  it's really nice being able to plug the USB port in *while the computer is  on*, and immediately use it without any software hassles. I have to admit  to a certain awe at Microsoft for actually pulling it off with win98.  You  can use the software that comes with the camera, but I have not, since you  will find better image handling, organizing, and altering software as  freeware, shareware, or expensive (like photoshop) professional  stuff.Another super aspect of this camera is the battery - it is  removable, but it is rechargable, and the camera comes with a DC-in jack  and it's own external power supply, so you can plug the camera into the  wall, and recharge that battery for another 2.0-2.5 hours of use.  No more  buying scads and scads of Earth-killing AAs. This is such a simple built-in  to add, and such a highly useful extra, I really have to question why every  digitial camera doesn't do this.On the downside, the viewfinder is very,  very difficult to see when outside; sometimes impossible to see.  And, of  course, please realize that this camera is a point-and-shoot (albeit a  functional one), so changing lenses is *not* an option, nor is having much  control over f-stop or shutter speed - you will have some control, but the  f-stop and shutter speed ranges are not are not what you might be used to.  I also think that, overall, its senstivity to white is not as good as it  should be - my whites tend to end up a bit grey; not much, but a bit.  But  I have to admit I dont know if that's the camera, or a problem with the  really hazy NYC days we've had and/or from shooting inside in rooms with a  mix of flourescent and incandescent lighting.Overall, I am impressed  with this camera, I'm very glad I bought it (and not a different one), and  while it is not 3 megapixels, unless you plan to make large prints of your  images, the resolution on this camera is far higher than you need for  web-image making, and high enough for anything else. It's small, easy to  carry, easy to use, easy to download, and easy to recharge. For the money,  this is, in my opinion, your best deal for a non-professional 2 megapixel  digital camera.", "overall": 4.0, "summary": "Amazing little digital camera", "unixReviewTime": 965520000, "reviewTime": "08 6, 2000"}