{"reviewerID": "A1HH1DPK1ASVDN", "asin": "B00004U47J", "reviewerName": "Zolton \"Veni. Vidi. Reviewi.\"", "helpful": [4, 6], "reviewtext": "Valentine's Day is my one chance per year to make up for all the stupid, lazy, thoughtless, horny, arrogant and unromantic things my wife has put up with since the last V-Day. My only hope to get out of the doghouse and back in the bunkhouse is to pull off a Grand Romantic Gesture that makes her forget the Neanderthal she lives with for 364 days in between.Also, I don't want to spend too much money. Some of that stupid, lazy, thoughtless stuff can get pretty expensive. So it's a real challenge.What's more romantic than the image of John Cusack with his boombox in 'Say Anything', playing sweet Peter Gabriel nothings to his sweetie? This sturdy, durable throwback casette-and-CD combo player was perfect for me to recreate the scene. I downloaded a copy of 'In Your Eyes' on MP3, burned it to CD, dubbed it over to a blank tape, and I was all set.Of course, my wife and I live in the same house, so I couldn't very well serenade her from the street. Plus, it's cold outside, and the neighbors already give me funny looks. So I decided to stand outside our bathroom door after her shower one morning. Me romantic, her naked -- perfect.Unfortunately, holding this oversized bulky monster over my head for four-plus minutes wasn't the best idea I've had. And all that re-re-recording of the song made it come out all muffled and tinny through the detachable speakers. One of which detached during the chorus and bonked me in the head. By the time the song was over, I was collapsed under the boombox in a heap on the floor, and my wife -- wrapped demurely in a towel -- cracked the bathroom door to ask:\"Did you just say something? I had the blow dryer on.\"So I'm still in the doghouse, and may have suffered the first Lloyd Dobler-related hernia on medical record. Outstanding.", "overall": 4.0, "summary": "Now I Can 'Play Anything'!", "unixReviewTime": 1297728000, "reviewTime": "02 15, 2011"}