{"reviewerID": "A2Y870S7P44V4C", "asin": "B00004U4S7", "reviewerName": "R.S. \"highlandbob\"", "helpful": [11, 11], "reviewtext": "I just bought a Digital Rebel and a bunch of accessories... this bag takes it all without a sweat.  Yeah, it is large, but that's what you need if you're serious about your photography.Here's what mine holds:  Digital Rebel, 18-55mm lens, 55-200mm lens, 420EX Speedlite, filters (several in one case), extra batteries and small manuals.  I even carry my old Canon PowerShot for quick shots.  I had to play with it a bit to customize it -- as expected with a &quot;generic&quot; case -- but everything fits excellently.The interior dimensions are:  9 x 5 x 7 (to top of dividers - 9 to rim of bag) inches (LxWxH).  You get two adjustable dividers for the main compartment.  There is nice .5 in. padding on the walls.  There is a mesh holder on the inside of the lid.  There is a tough front pouch with filter pockets, another mesh holder and space for thin items.  And there are mesh side pockets with drawstrings.Finding a configuration was interesting, and I didn't follow their suggestion, but it works.  I have my flash, camera (body) and big lens standing vertically.  I keep the standard lens sitting on top in bubble wrap.  (It barely moves, really.)  My PowerShot fits perfectly on the other side.  (Their suggestion is to keep the lens attached and pointing downward in the center space, so you can just pull out the camera and shoot.)The materials are tough where they need to be... and gentle where you want them to be.  The whole outer shell is fine suitcase-quality.  It has a stiff bottom with plastic feet.  The top handle is very comfortable and soft.  It comes with a shoulder strap (sewn-on).Because of its size, I don't always want to carry it everywhere.  So I also bought a Tamrac Small Lens Case.  That'll carry my other lens, battery and CF card... the essentials.The only &quot;complaint&quot; I have about the Samsonite bag is that once you put enough stuff in the front pouch its center of gravity shifts forward and it falls on its face.  However, this is FAR from anything to be upset about.I expect this bag to last a long time -- it is &quot;guaranteed for life&quot;, after all -- and I am very happy I didn't settle for one of the default Canon bags.", "overall": 5.0, "summary": "Worth searching for!", "unixReviewTime": 1088294400, "reviewTime": "06 27, 2004"}