{"reviewerID": "A2J9NEE5C5D2AU", "asin": "B00004U8B8", "reviewerName": "+++", "helpful": [211, 213], "reviewtext": "I had experience with several cameras ranging from small point-and-shoot to SLRs, and I observed that zoom lenses have to be fairly expensive to provide decent image quality. Indeed, a zoom lens is usually more complicated than a lens with single focal length since it contains more elements, and it also requires accurate mechnics. This Canon seems to break this rule. The quality of pictures taken with this camera in daylight conditions is suprisingly good for the price. It is certainly on par with more expensive pocket cameras, and rivals low-end SLRs (i.e., priced below $500). The other advantages of this camera is that it is fairly light and small and the controls are extremely simple (off, auto-flash mode, red-eye reduction, fill-in flash, and no flash + two buttons to control zoom).The negative side of this camera is poor flash performance. It seems that the electronics built into it cannot properly determine how much energy should be send to the flash (or maybe it does not have variable flash power at all). The result is that a portrait taken in twighlights will be overexposed if the person is to close to the camera, and underexposed if he/she is too far. My daugher took quite a few pictures in the dark lately, and hardly any came out right. Further drawbacks are somewhat cheap look, sluggish zoom motor, and poor quality of paint on the program wheel (it started peeling off way too quickly). There is also no pre-programmed modes which more sophisticated cameras offer (such as portrait mode, night shooting, landscape, sports (quickly moving objects), etc.)The bottomline is that in terms of the feel of the camera and its electronics you get pretty much what you would expect to get for this kind of money; in terms of optics, you get a very good deal. If you are looking for a small camera with wide-range zoom that can take sharp pictures, and do not want to spend several hundred dollars for high-end models, this Canon is likely to be the best deal on the market. I rated it five stars for its price/value ratio.There is another version of the same camera available ..., with quartz date. My opinion that the price difference between the two is much more than that feature is worth.", "overall": 5.0, "summary": "very good optics for this price; average electronics", "unixReviewTime": 990662400, "reviewTime": "05 24, 2001"}