{"reviewerID": "A3VYKXHQDICC6", "asin": "B00004U8B8", "reviewerName": "philo_vance", "helpful": [18, 18], "reviewtext": "I bought this as a birthday gift for my daughter (age 21) about 8 months ago. She is actually a knowledgeable photographer having taken photography courses in school, but wanted a simple point-and-shoot that she could use without having to think about f-stops and shutter speeds. As I am also a photography fan since my mis-spent youth, its common ground for us, and I get to see all of her pictures.I have to say that the camera has far exceeded both our expectations. It does a very respectable job under a variety of conditions and produces sharp, well-focused, consistent photos. It is simple to use and the zoom lens is terrific. We have not seen the flash problems that some of the other reviewers have reported. The only difficulty she has had with it is the pause between pressing the shutter button and the camera actually shooting, but that is overcome by using \"real-time\" mode whenever red-eye reduction is not an issue.But I think perhaps the best feature of this camera is its portability. It is so small and light (and the lens retracts into the body and covers up when the power is turned off) that she is able to keep it in her pocketbook at all times. Whenever life presents her with one of those \"Gee I wish I had a camera\" moments, she does!If you're looking for something inexpensive and durable enough so that you can keep it with you, and that you can use without too much thinking, this is a good bet.***Update 10/02*** Just 3 weeks before the 1-year warranty would have expired, the camera developed a serious problem with it's autofocus. We called the Canon 800 number and were referred to a local authorized repair center to whom we brought it. They called after a week and told us that they would have to send it to Canon and that there would be a $10 service charge. That was about a week ago.Even though the situation is not yet resolved, I thought it was important to post this update, since I've seen exactly this same problem reported in several of the other reviews here. The camera was not heavily used nor was it abused in the year that my daughter owned it. I am reducing my rating to 4-stars because of this. I will update again when we get the camera back from Canon.", "overall": 4.0, "summary": "Great little camera...but", "unixReviewTime": 1025308800, "reviewTime": "06 29, 2002"}