{"reviewerID": "A19J4IR55H1NZI", "asin": "B00004U8K4", "reviewerName": "Frank LaRue", "helpful": [1, 1], "reviewtext": "Plantronics T20: 90% PERFECT, 10% DEADLYThis would be the perfect headset phone if not for a few deadly missteps that led me to return it.Perfect:--Quality build (solid), the right size, the right features (buttons for mute, hold, redial, conference, and flash, plus volume and tone controls). And the mute has a red indicator so you don't forget (although I'd prefer an indicator that flashed like on the Polycom conference phones).--Also, high quality sound in the headset - I could hear the other party perfectly, with only a faint background hiss.Deadly, starting with the most serious:--The people I talked with said that I sounded distant. It appears that the microphone doesn't come forward far enough to pick up my voice well.--The headset cord is not shielded and picks up noise from the computer. In particular, I had to be careful to route the cord so that it avoided the keyboard or it picked up a loud tone both parties heard.--The headset cord is very thin and I worried that a minor mistake (such as catching it in a closing a desk drawer) would seriously damage it.--There is no headset for the T20 that covers both ears (binaural). I called to verify this. Although the headset jack in the base is physically compatible with the binaural headset from my M12, the headset from the M12 does not work with the T20.It seems like they could make this the perfect phone just by making a few straightforward engineering changes. But until then...PS - There was always a low hiss in the headset. In looking into noise-canceling technology, I learned that these systems typically introduce a hiss of their own. In a noisy environment, you don't notice the hiss because the noise the circuitry takes out is much greater than the hiss it adds. But in a quiet environment like mine, there is no benefit to the noise-canceling feature and you hear the hiss. I can't guarantee that this was the source of the hiss I heard, but it seems likely. (There is no way to disable the noise-canceling circuitry.) I don't think the Amazon listing mentions the noise-canceling feature of this phone, but it's on the box.", "overall": 2.0, "summary": "Plantronics T20: 90% PERFECT, 10% DEADLY", "unixReviewTime": 1223424000, "reviewTime": "10 8, 2008"}